{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/5/25 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/",
  "target_date": "2025-12-05",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-05T01:59:14.570478+00:00",
  "comments": [
    {
      "created_utc": 1764895330.0,
      "author": "MrPunter500",
      "text": "**Record: 2-1**\n\n**Net Units: 0.5 units up**\n\n**ROI: 16.67%**\n\nLast Pick: Parks vs Dodin - Dodin Handicap +4 Games @ 1.93 ✅️\n\nIt was amazing how Dodin was able to keep this match close, with Parks producing 26 aces. The underdog was still able to hold a decent percentage on both first and second serve and she took this one to 3 sets. Great play here, especially against the number 1 seed in the tournament.\n\n**Tennis** | **Challenger Angers (Women)** | **12:30 PM (Eastern Time)**\n\n**Plays will always be shared as 1 unit for fair record purposes**\n\n**Pick:** **Parks vs Korpatsch - Parks ML @ 1.63**\n\nAlycia Parks, currently ranked 71st in the world, is the number 1 seed in this tournament and needs to defend her title points, since she also won in Angers last season. She's one of the tallest players on tour, which gives her a big advantage on this surface (Indoor Hard), with the ability to get free points on her first serve much more frequently than most of her opponents. She produced 26 aces in the last round, which might be a good indicator that she can use her best weapon once more to increase her chances of winning the tournament. Her game does have some problems, especially when playing outdoors, as she moves a bit slowly compared to the tour average, and she hits really flat. With this, she ends up making a lot of unforced errors when outdoor conditions nullify her serve power, but the same can't be said here in Angers, where she feels much more comfortable.\n\nKorpatsch is a veteran of the circuit now at 30, always seen as an average player with a decent rally tolerance and baseline game, but a weak serve, which has prevented her from standing out from the rest of the WTA tour. Last year, she was defeated specifically by Parks in this tournament in straight sets.\n\nWith this, Parks knows that most of her ranking points need to come from Indoor tournaments, and defending this title should be a major priority. With her powerful serve, she should be to simplify each point and win the match. Keep in mind that in order to win this tournament in the previous year, Parks had to defeat Belinda Bencic in the final, the current number 11 in the world.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nscd4ix/"
    },
    {
      "created_utc": 1764895316.0,
      "author": "dreamchasing1",
      "text": "Record: 232-221 Net Units: -30.09 51-54 on 1.5u plays, 38-40 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Serbia Super Liga] Crvena Zvezda (Red Star) vs Cukaricki\nLast pick: BTTS @ 1.80 - 1.5 units loss\n\n\nEvent: Soccer/Football, [Wales Premier League] Bala Town vs Haverfordwest County\n\n\nPick: Total corners over 8.5 @ 2.00 - 1.5 Units\n\n\nThe two sides already met in October in a game with 15 total corners. In home games this season, Bala Town average 4.40 for, close to 9 total, going over in 7/10 games. In away games, Haverfordwest average 5 for and a 11 total, covering this line in 8/9 games, which makes them arguably the best away matchup for corners in the league. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nscd336/"
    },
    {
      "created_utc": 1764895257.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsccwwf/"
    }
  ]
}