{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/29/25 (Monday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1py5uya/pick_of_the_day_122925_monday/",
  "target_date": "2025-12-29",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-28T23:42:20.519585+00:00",
  "comments": [
    {
      "created_utc": 1766964829.0,
      "author": "CMDVN",
      "text": "Last 5 > WWLLL // Profit: €1028.55\n\nCoventry City @ 2.34 - €100.00\n\nOne of Frank Lampard’s biggest hurdles this season. 1^(st) placed Coventry will take on Ipswich who are 3^(rd) themselves. There is a huge contrast between home and away form for both sides.\n\nAt home Coventry are yet to be beaten and are #1 ranked with a 9-2-0 record. They also tally for the best goal diff with a 27:7. Of their last 5 home games they have won all of them. Ipswich though are 12^(th) as away side with a 3-4-4 record, they have a 16:13 goal diff. Ipswich have only won 1 game from their last 5 road trips where they lost 2 and drawn 2.\n\nNow for H2H it does not look convincing for tonights’. Kieran is 2-0-0 against Lampard and in the last 10 games Ipswich are 6-2-2. Even with these stats, Coventry are heavily overperforming this season which makes me lean towards them for tonight.\n\n2-1 Coventry",
      "permalink": "https://reddit.com/r/sportsbook/comments/1py5uya/pick_of_the_day_122925_monday/nwg92ut/"
    },
    {
      "created_utc": 1766964299.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Monday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1py5uya/pick_of_the_day_122925_monday/nwg7fe2/"
    }
  ]
}