{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/15/26 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qd30gf/pick_of_the_day_11526_thursday/",
  "target_date": "2026-01-15",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-14T23:41:34.885448+00:00",
  "comments": [
    {
      "created_utc": 1768433203.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 38-22 (+12.17U)**\n\n**ROI: +16.34%**\n\nLast POTD: NCAAMB: UVA +9.5 ALT Spread vs. Louisville + ALT Total Under 162.5 -127 (0.50U TO WIN 0.33U) ✅\n\n**POTD: NBA: Magic vs Grizzlies U230.5 -110 (0.50U TO WIN 0.40U)**\n\nWrite up: 0.50U on this play - We are 8-2 in the L10, riding a 6-bet win-streak - unfortunately a smaller slate today, I hate betting on the NBA, college basketball is slim pickens, so rolling with another 0.50U bet here - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Under 230.5 at 54%\n\n• Model projects Magic covering -4.5 at 52% while it also projects the game's total ending at 224\n\n• EV better betting 100$ = 7-8$ for this play\n\n• Rolling with 0.50U here because the NBA is just not fun to bet, always some stupid things happening, but there is not a lot on the board - As always, I try to get a play out for you all each day, whether there are a lot of games or barely anything - First thing that stands out here is that they are playing overseas, so fatigue should play a very small factor, different atmosphere, long flights/travel, and just a weird situation in general playing overseas - Second thing, injuries - Grizzlies are still without Morant and Edy - Magic are without Suggs, with Franz expected to make his return - Low scoring affair here, with the Grizzlies averaging just 114 PPG, which is not even top 20 in the NBA - the last 4 games for them have also gone under, which is something to note - Last time these two teams played, both teams healthy, the final score ended at 209 - The over has only hit 39% in all of the Grizzlies games this year, while the Magic's overs have hit 51% of the season - some key injuries on both sides, recent games going under, and the game being across the pond, I like the under 230.5 here \n\nPOTD History: [https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn](https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn)\n\nBOL!\n\n**POTD: POTD: NBA: Magic vs Grizzlies U230.5 -110 (0.50U TO WIN 0.40U)**\n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qd30gf/pick_of_the_day_11526_thursday/nzmtcx1/"
    },
    {
      "created_utc": 1768433135.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qd30gf/pick_of_the_day_11526_thursday/nzmt53e/"
    }
  ]
}