{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/22/25 (Saturday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/",
  "target_date": "2025-11-22",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-22T15:46:48.707070+00:00",
  "comments": [
    {
      "created_utc": 1763821494.0,
      "author": "Laird87",
      "text": "POTD Record: 208-203, -69.43 Units\n\nParlay Record:  1-1, +0.48U\n\nCurrent streak: ✅\n\nLast 10: ✅❌❌✅❌❌✅❌❌✅\n\nLast Pick: Butler +3.5/Raptors -7.5 ✅✅\n\nNice dub to get a parlay win.  Going to keep it up with NBA teams that should get crushed.\n\nToday's Pick: 2 Pick Parlay: Chicago Bulls -6.5 (-290, 8:00 PM EST Start) and Denver Nuggets -5.5 (-291, 10:00 PM EST Start) -125 Odds, 1 Unit\n\nGoing back to the well with bad teams here, the Wizards are woeful and should lose by double digits every time they take the court.  The Nuggets had a really good win last night against a great Houston squad so I love them to win this one by double digits as well.\n\nBOL, tail or fade! Tip Jar: [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq71892/"
    },
    {
      "created_utc": 1763820253.0,
      "author": "ObamaCultMember",
      "text": "▫️RECORD 10-6-1 ✅✅❌✅✅✅❌❌✅✅✅✅✅❌🅿️❌ ❌(+2.94u)\n\n▫️LAST PICK: Unfortunately a sluggish scotland couldn't even deliver us a push. Bad call by me.\n\n▫️EVENT: English Premier League, Wolves Vs Crystal Palace\n\n▫️10:00 AM EST\n\n▫️PICK: Total team Goals over 1.5 - Crystal Palace \n\n▫️ODDS: 1.9 odds\n\n▫️Thoughts: Wolves defense is terrible and they've swapped managers recently. In their last 4 meetings Palace have scored at least 2 goals on Wolves. Mateta has looked great this season and w\\Wolves have conceded an average of 2.3 goals per match so far this season. \n\n(All picks are 1 unit)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq6xxx3/"
    },
    {
      "created_utc": 1763817895.0,
      "author": "YGWYD",
      "text": "**SEASON RECORD:** 28-4-16\n\nNet Units: (+2.41)\n\nPrevious Pick: Kosovo vs Switzerland- Switzerland DNB/ Scotland vs Denmark- Double Chance X2 @ 1.90 ❌️\n\n**Today's Pick:**  Newcastle vs Manchester City - Man City DNB @ 1.51\n\n**TIME:** 8:45 pm (BST)\n\n**Wager Amount**: 1.5 units\n\nLast 10 Matches (❌️❌️✅️❌️❌️✅️✅️❌️❌️❌️)\n\nThe international break was awful but at least were back to Club football amd today we head to the PL. I'm simply taking the value here I mean Man City DNB at these odds is quite decent here. Man City are 2nd in the league table only 4 points behind Arsenal.\n\nMan City are on a 4 game win streak only one loss in 10 matches, Haaland has 8 goals in his last 5 matches...insane stuff.\n\nIn H2H matches Man City are unbeaten in 4 matches against Newcastle, only suffering one loss in 10 matches against them.\n\nNewcastle themselves have 3 wins in 5 matches and losing to Brentford the last time. I'm sure Man City can at least not lose us money here. BOL if you're tailing.\n\n[TipJar (PayPal) If you want to I'd highly appreciate it](https://www.paypal.com/donate/?hosted_button_id=2RRPJ4DNAKEYW)\n\nhttps://preview.redd.it/wnsrb9q48t2g1.jpeg?width=1076&format=pjpg&auto=webp&s=38a29100be7b4394fa9b88d9c32f9170e4937564",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq6rxxy/"
    },
    {
      "created_utc": 1763816489.0,
      "author": "TemporaryDistinct448",
      "text": "Record: 0-0\n\nNet units: n/a\n\nroi: n/a\n\nbasketball/nba/11:40am/ adelaide\n\namerican football/cfb/7am/adelaide\n\npick: Detroit Pistons -8 & texas ML\n\ndetroit pistons have been going strong all season (12-2) vs the mid bucks (8-8) and with no giannis playing they should win easily. They have currently won 11 in a row and the bucks are 4-7 in there last 11. The pistons are currently 2nd in defensive rating compared to the bucks 20th and in offense they are 13 compared to 18.Texas to win well i mean what can i say they will win",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq6olmn/"
    },
    {
      "created_utc": 1763815368.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 22-12-1\n\nSoccer\n\nLast Pick: Northern Ireland/Draw + Cultural Leonesa-Malaga O1.5 goals @ 1.61 odds - LOSS\n\nLast Pick Write Up: Leonesa and Malaga were just spamming goals every game except when we bet on it.\n\nNow for today..\n\nPick: Newcastle vs Man City - Haaland to score @ 1.68\n\nWrite Up: International break punished me so I took a break. Now club football is back and I’m going with ol’ reliable. Haaland (almost) always scores. Every time Manchester City or Norway are playing, I just mindlessly bet Haaland to score while drooling and muttering “Haaland put ball in net” like a caveman and I usually win. So I’m going with that here.\n\nHaaland put ball in net.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq6m4og/"
    },
    {
      "created_utc": 1763812442.0,
      "author": "Certain-Challenge202",
      "text": "Record: 53-37\n\nLast Pick: Noppert -4.5 vs Wenig ✅\n\nToday’s Pick: Searle ML vs Rydz (starts in 2hrs)\n\nSport: Darts, Players Championship Finals\n\nReasoning: Ryan Searle has the statistical edge with a higher Order of Merit position and stronger 12-month numbers (95.67 average and 40.50% checkout vs Rydz’s 94.19 and 39.45%). He’s also taken two ProTour titles in the last year while Rydz hasn’t won an event, which leans the race-to-6 in Searle’s favour.\n\nOdds: 8/11\n\nUnits: 2-3\n\nEdit: 6-5 win 🙏",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq6ge1u/"
    },
    {
      "created_utc": 1763811265.0,
      "author": "Easy_Independence811",
      "text": "**POTD Record:** 5-21 (HIGH ODDS PLAYER HERE)\n\nFrom oldest to newest: ✅❌✅❌❌❌❌❌✅❌❌❌❌❌❌❌❌❌✅❌❌❌❌❌❌✅\n\n\\+5,75 units (translated all dollars to units).\n\nLast pick :  A **-2 handicap** for Aston Villa vs Bournemouth at **9,6** odds ✅\n\n**CET 17:30 Football Ekstraklasa**\n\nToday: A **-1 handicap** for Rakow vs Piast Gliwice at **3,6** odds\n\nWay too many picks to choose from and I had a hard time deciding between 3-4 picks. I chose a bit safer in the end. The thought process behind it all is: Rakow is back in their great form with 3 in a row wins in the Ekstraklasa. Winning away against Jagiellonia can be considered as really impressive, as well as their latest 4-1 victory vs Korona away. Today is a match vs Piast Gliwice, who haven't been impressive soo far. Bottom of the table with 1-2 games less played than the rest of the teams. They have a hard time getting good results so far. I felt -1 handicap was doable and also home advantage with recent results made me go for it. I also really liked the odds for it compared to my other choices. That's why I decided to stick with this one, but anything can happen in football. Good luck everyone.\n\nBookie: **Coolbet** and a **5 unit** bet. Gamble responsibly!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq6ead4/"
    },
    {
      "created_utc": 1763809424.0,
      "author": "Lyx97",
      "text": "A long time lurker, i want to start off & see how it goes\n\nRecord: 0-0\n\nNet Units: NA\n\nROI: NA\n\nFootball | EPL | Newcastle vs City | in \\~6.5hrs\n\nPick: Nic o'Reilly 1+ Shot @ 1.77  (1u)\n\nWrite Up: Has had least 1 shot in his last four PL apps + 11 shots across 10 PL apps this season\n\nHope this hits & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq6b6if/"
    },
    {
      "created_utc": 1763807992.0,
      "author": "OliveCritical5134",
      "text": "**Record: 25-14**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅✅✅✅❌❌✅✅❌✅✅\n\n**Sport:** ⚽ / English Premier League / Newcastle United v Manchester City\n\n**Net Units/ROI:** \\+28.78u / 28.78%\n\n**Previous Pick:** *Bodo/Glimt to win + over 1.5 goals @ 1.57 -- 3 units*✅\n\n**Summary:** Bodo with a late winner!! Should've cashed way earlier but the VAR denied lots of goals for Bodo..\n\n**Today's Pick:** *Manchester City most shots + Manchester City most shots on target @ 2.10 -- 3 units*\n\n**Write up:**\n\n**Newcastle United v Manchester City (17.30 GMT)**  \nIn the last 5 domestic games, Newcastle only managed to get more shots on target against Fulham, and only managed to get more shots in general against Brighton.  \nIn the last 5 domestic games, Man City managed to get more shots and more shots on target in every game, including in their 3-0 trashing of Liverpool previous matchweek. Man City have picked up great form recently and I see them being the more offensive side here which lets them create more chances and get more shots (on target).\n\n**Best of luck if tailing!** 🍀\n\nPS: If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq68tmi/"
    },
    {
      "created_utc": 1763807572.0,
      "author": "Vet100",
      "text": "Record: 18-10\n\nNet Units: +5.90\n\nROI: 21.1% \n\nPick: NBA Magic v Knicks\n\n1U Jalen Suggs O19.5 Points + Assists @ $1.90, B365 \n\nWrite-Up: Cleared this line 3/3 since Banchero missed games, with the game Banchero got injured in he got 17 (14 points, 3 assists). Since then his minute per game has gone up, his shots per game have gone up & he has averaged 7 assists in these last 3 games. This also probably coincides with him getting some miles into his legs a month into the season after he started with some fitness issues from injuries. Now getting regular starter minutes, his performance has lifted. \n\nHe did only clear this with 20 & 21 in the last 2 so it could be close. \n\nBrunson is a superior offensive player but is not a defensive star. Morant 26 PA, Russell 30, Davion Mitchell 22 & 23 in the last few against Brunson.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq685c8/"
    },
    {
      "created_utc": 1763805960.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 1-3-0 *I finally get on the board. As I said, always staying away from super high lines, and the blowout helped too. Let’s get a cheeky streak going!* ☘️\n\n**Event:** LaLiga Barcelona v Athletic Bilbao, 10:15 am EST\n\n**POTD:** Athletic Bilbao Win or Draw +176, 2 units\n\n**Write Up:** Oh man, where do I even start? Barça looks like a mere shadow of its former self, with Flick’s ridiculously **high line being all but figured out.** This means their **opponents keep getting several one on ones per game**, which is just bizarre for a club of this stature. Then we have the **selection crisis; Barça misses so many key players through injuries or suspensions,** i.e. Raphinha, Gavi, Pedri, de Jong, and we have a couple of players that are just coming back from an injury *(Lewa and Garcia).* There are also some tired-looking players, especially in the already vulnerable defence *(looking at you Kounde and Cubarsí).* When it comes to **big games, Barça has been very questionable this season** and I think Bilbao is there to spoil their party once more. **Bilbao’s fast attacking force should be able to get in behind** at least a couple times this game and hold on to a draw, if not better. They’re a bit of a **bogey team** for Barça after all. BOL if you do tail 🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq65j9z/"
    },
    {
      "created_utc": 1763803699.0,
      "author": "ShagRapt",
      "text": "RECORD: 2W-3L-0P (-0.51u)\nSTREAK: 3 LOSSES\n\nLast P.O.T.D. - NFL: K.C.@Denver: PJ HARVEY 9+ rush attempts + o2.5 receptions + to score anytime TD.\n\nRecap: Some losses hurt more than others, especially when it's one that still seems like a \"quality read\". With starting RB J.K. Dobbins out, Harvey easily carried the 9+ rush attempts & also grabbed 3 receptions on just 3 targets, however Denver's offensive line, or should I say the lack of any cohesive one, not only stymied two rushing attempts from Harvey behind the line of scrimmage while Denver was inside K.C.'s 10yd yard, but they also managed to hit Nix & block a pass which appeared to be intended for a wide-open Harvey sitting 2yds deep in the end zone. Alas, we'll never know, regardless we move on \n\nTODAY'S P.O.T.D. - (1PM EST) Wash. St.@James Madison University (NCAAF) -TAKING JAMES MADISON UNIVERSITY -13.5 (-130)\n\nWAGER AMOUNT: 2.6u (to win 2u)\n\nReasoning/Projected Analysis: Last week, the College Football Playoff Committee released their playoff selections & there were a few small surprises, however NONE OF THEM were anywhere near as big as their total snub of James Madison University, as the Dukes were left out despite owning a 9-1 record & being by far the best \"Group of 5\" team in the country, thus far. Instead, the committee opted to select a better known team from a slightly bigger conference, the 8-2 Tulane Green Wave, a team with two losses & both of which came in absolute blowouts. One is/was rather understandable having occured while playing against top-ranked Mississippi St., but the other loss.. well, let's just say for that one not nearly so much where in a game vs the UTSA Roadrunners (4-4 at the time & who now still hold a mediocre record of 5-5)  who went on to slaughter Tulane by almost 3 TD's. In comparison, JMU's sole defeat occurred against the undefeated Louisville Cardinals (2-0 at the time, currently 7-3 & technically still competing for an outside shot at the ACC title). Not to mention the game itself took place in Louisville, a notoriously tough place to play. To say that the Dukes are upset even since the release of the committee's projected playoff bracket would be the UNDERSTATEMENT OF THE YEAR!! That being said, let's move on to today's game specifically....\n      This week the Duke's are at home playing Washington State, a team that's 5-5, as well as one who was (until this year) a perennial \"major conference\" school & a member of the highly respected Pac 10. Besides, all of the stats & analytics being in the Dukes favor, as well as the cross-country trip Washington St. had to take before playing today's game at (what is normally) 10AM their time on the Pacific Coast, the Dukes have also had two weeks to prepare for this game, coming off of a bye from last week. Lastly, with just two games left in the season & JMU's next (& final) game being vs Coastal Carolina (a team in which a victory of any margin certainly will not garner them much more respect in the eyes of the committee), one thing that has become very clear to JMU is that THE TIME IS NOW!!! To be totally frank, James Madison is a two touchdown favorite for good reason, primarily because they are the better team, and significantly better than Washington St. However, one thing that you can be ABSOLUTELY CERTAIN of for this weekend is that James Madison WILL NOT take their foot off the gas regardless of what that scoreboard may be (& the coaches have already acknowledged this), as this is their one & final chance to not just impress the BCS playoff committee, but also for a victory against a former member of a major conference & thus, by doing so, they will also earn themselves a ranking somewhere inside of the AP & Coaches' \"Top 25\" polls making it much harder for them to be overlooked, especially when you consider that they're already currently sit as the first team just outside of those polls as it is. Mark my words, JMU makes history..TODAY!!\n\nBEST OF LUCK! Now, let's cash this shyte out!!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq61th5/"
    },
    {
      "created_utc": 1763802586.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 197-147\n\nUnits Won: +101.01u\n\nLast Pick: FireFlux Map 2 ML (-114) X\n\nToday's Pick: **Qw1nk1 O 8.5 Headshots Map 2 (-118)** 5u\n\nTeams: K27 vs. Leo  \nTime: 5;00 AM EST.\n\n**Writeup:** \n\n* Map 2 is Nuke, K27 map pick\n* K27 are 64% winrate on 11 maps of Nuke in the L3 months\n* Leo are 50% winrate on 4 maps of Nuke in the L3 months this is the map they normally perma ban\n* Qw1nk1 is averaging a .66 KPR L3 months with a 60.9% headshot percentage\n* Qw1nk1 is averaging a .68 KPR L3 months on Nuke with a 66.2% headshot percentage, with similar numbers in 2025 as well\n* This is a 5% increase in headshot percentage which is massive increase, since it is their map pick they will also start on T side which is even better for headshot overs\n* Expecting high round total and a good map for Qw1nk1, would need 12-13 kills on average to hit this line, Qw1nk1 has hit this line in 4/5 on Nuke, 8/10 on Nuke and has hit 12+ kills in 20/26 Nuke maps in 2025",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq60151/"
    },
    {
      "created_utc": 1763801872.0,
      "author": "medandfooty",
      "text": "Record: 0-1\n\nEngland: Southern League - Premier Division South\n\nGosport Borough ML + Walton & Hersham ML @ 1.95\n\nWrite-Up: 2 leg from England. Gosport are in the 6th position and tied in points with the 5th which leads to the playoffs. They have the third best attack with 34 goals in 16 games and have been in a great shape compared to their last campaign. On the other hand, their opponents Tiverton are dead last and have the worst attacking and defending stats in the league. Their form is abysmal and right now they would have been the underdog against anyone. Gosport should easily win\n\nWalton & Hersham have the best record and form in the league (13-1-1). Their only draw and loss came in the first three games in August so they have since won 12 games in a row. They continue their campaign just like last year where they missed out on promotion in the playoffs. Their opponents Hungerford have yet to win a game since September and are in a pretty bad shape, which isn’t really represented in the standings since they starting off pretty well by winning against the weaker teams of the league. Again I would be surprised if W&H don’t take an easy win\n\n\nThank you for anyone taking their time to read my post! BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5yulj/"
    },
    {
      "created_utc": 1763801497.0,
      "author": "herbobets",
      "text": "**Record:** 1-1-0\n\n\n\n**Net Units:** \\-2.56u\n\n\n\n**Last Pick:** L - Bayern Munich over 0.5 goals + FC Barcelona moneyline (-135) - 5u\n\n\n\n**Form (last 5):** LW\n\n\n\n**Streak:** 1L\n\n\n\n**Event(s):** Premier League: Liverpool vs Nottingham Forest (9:00 a.m. CST) + Newcastle United vs Manchester City (11:30 a.m. CST)\n\n\n\n**Pick:** Liverpool 5+ shots on target + Manchester City 5+ shots on target (+114) - 5u\n\n\n\n**Write-up:** I really like this play today. In the Premier League, these are two teams you can trust when it comes to generating attacking chances and shots on target.\n\nLiverpool at home have been very reliable this season, averaging 5.2 shots on target per Premier League home match. They’re facing a Nottingham Forest side that typically spends long stretches defending deep, especially away from home. With Liverpool’s attack at Anfield and the pressure they usually apply, I expect them to create enough chances to get to 5.\n\nManchester City have also been strong in this area, averaging 5.18 shots on target per Premier League match this season. They’ve been in good form lately too, beating Liverpool 3-0 in their last match. Even in tougher matchups, City usually find ways to generate attempts just through sheer possession and chance creation. Newcastle at home tend to play more open, which actually benefits City in terms of shot volume. City is the better side and I think they will show it and create at least 5 shots on target.\n\nBoth teams sit right around the number we need on season averages alone. 5 shots on target is very achievable given the offensive output from two of the most consistent attacking sides in the league. Getting this at +114 feels like great value considering how these games are expected to go.\n\n\n\nBOL and God bless.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5y7v8/"
    },
    {
      "created_utc": 1763801319.0,
      "author": "Ralphjinasseater",
      "text": "Record 7-6-2\n\nLast pick: Alperen Sengun O 16.5 RA (-105) ❌ ( this is gonna be stinging me for a while)\n\nCategory:🏀⛹️basketball NBA\n\nPick of the Day: Miles Bridges O 3.5 Assists (-104)\n\n• Bridges is over this line in 8/15 games this season averaging 3.8 assists on 6.5 potentials with 35.3 minutes per game, BUT key news here is Miller is back ACTIVE in the lineup after his injury - in 2/2 (100%) games this season with Miller active, Bridges averaged 5.5 assists on 8 potentials in BOTH games.\n\n• This line gets even better as Bridges gets a BEAUTIFUL matchup against the Clippers in a 2 point spread favoring the Clippers (competitive game) - The Clippers allow the 6th MOST assists (5) to opposing SFs per game, they’re also without Kawhi & DJJ leaking extra assist opportunities to Bridges position.\n\n• Bridges is over this line in 2/4 games against the Clippers averaging 4.3 assists on 6.4 potentials, BUT in both games he came short he finished with 3 assists total. Clippers also allow the 12th MOST PPG (117.1) & 3rd BEST O3PT% (39.2%) showing vulnerability to secondary creators like Bridges, especially with Hornets 8th ranked 3PT makes (14.5 per game) forcing easy kick-outs.\n\n• On top of all this, Both teams are on losing streaks, leading to higher possession games - easily expect 100+ possession in a somewhat shootout of a game bridges may be able to over here\n\nhttps://preview.redd.it/tonoov8tur2g1.jpeg?width=1170&format=pjpg&auto=webp&s=97eeb8147a44d76c5563f75ec3c803b88f07d3e8",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5xx4y/"
    },
    {
      "created_utc": 1763799915.0,
      "author": "365bettip",
      "text": "Fulham - Sunderland, 1X + Under 3.5 Goals Combo Bet @ 1.57 - Fulham plays well but not throughout the whole 90 minutes of the match, build-up play is ok, transition in attack and in defence is ok but they are missing a top-quality striker to finish their attempts. And most importantly, consistency. However, I think they won't lose the game agaisnt Sunderland and that there won't be many goals as well.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5vlw5/"
    },
    {
      "created_utc": 1763798404.0,
      "author": "Longjumping-Horse822",
      "text": "> **Record:** 16-14 ( 3 push ) \n\n>Last picks ( form most recent to oldest ) ❌ ❌ ❌ 🅿️❌ ✅ ✅ ✅ ❌ ❌ ✅ 🅿️ ❌ ✅ 🅿️ ✅ ❌ ✅ ✅ ✅ ❌ ✅ ❌ ✅ ✅ ❌ ✅ ✅ ✅ ❌ ✅ ❌ ❌ ✅ \n\n\n>In terms of units -5 , -5 , -5 , 0 , -5 , +3.39 , +0.73 ,  +8.15 , -5 , -5 , +1.86 , 0 , -1 , +9 , 0 , +3.45 , -2 , +1.09 ,+1.84 ,+4 , -2 , +3.1, -2 ,+1.8 ,+1.7 , -2 , +2.61 , +3.25 , +4.35 , -7 ,+5.65 , -10 , -2 , +2.65\n>\n>\n> **Net Units:**  +0.51 units \n>\n> **ROI:** \n\n\n>Previous pick : LAMINE Yamal over 1.5 Shots on target @1.99x or -102 ( 5 units play ) ❌ \n>\n> **Football** | **La liga** | **11:15 AM**|**Eastern time**\n>\n> **Pick:**  Barcelona -1.5 handicap vs Athletic Bilbao @2.06x or +106 ( 5 units play )\n\n\n\n>\n> **Write up** |   after 4 back to back losses of 5 units each.  I still gathered the courage to post again. \n\nBarcelona is back at camp nou although not at full capacity. Frenkie on a red and pedri is out but raphinha is back from what I heard.  Lewandowski, yamal will play and joan Garcia is also back. \n\nBarcelona win their last 5 at home in la liga and scored 16 goals. Although they covered -1.5 only 3 times in last 5 . \n\nWhereas athletic Bilbao away is so bad .   They don't score much. Lost 3 , draw 1 and 1 win in last 5 away matches in la liga.  Newcastle defeated them 2-0 away . Dortmund defeated them 4-1 away . But that's the only good teams I could find which Bilbao has faced away this season . In la liga Valencia defeated them 2-0 and Valencia is in bottom 5 of table.  \n\n\nFirst match at new camp nou . I see barcelona win this match 3-0 \n\n\n\nDo whatever you think is best. \n\n\nBUT\n\n\nAlways bet responsibly .\n\n\nBOL if tailing \n\nBOL if fading",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5t25t/"
    },
    {
      "created_utc": 1763797336.0,
      "author": "kab1218",
      "text": "POTD RECORD\n2-3\n\nNet: -1.5 units\n\nLast pick:\nNC State +6.5\n\nWrite-up: Like I said, NC state 4-1 at home and FSU winless away. NCST put belt to ass. We move on. \n\nToday:\nArizona -6.5 (v Baylor) + Fifita OVER 1.5 TD\n\n1U @ +145 odds\n\nReasoning:\nArizona is 5-1 at home, with their only loss being to BYU. Baylor is 2-2 away. Both teams love airing it out, but Arizona has the better D. This game could go over 70 points, but I don’t want to risk that. I also see Fifita passing for at least 2 TD, he’s 24 TD / 4 INT on the year. You could probably replace Fifita with Robertson who is 29 TD / 9 INT on the year for the same prop. Anyways, BOL if tailing ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5r92w/"
    },
    {
      "created_utc": 1763795798.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 9-3, +5.11u\n\n**Previous Pick:** Alperen Sengun to score 22 or more, 1.76, 1.5u ❌️, (last 5: ✅✅✅✅❌️)\n\n**Event:** NBA: Chicago - Washington, 02:00\n\n**POTD:** Chicago to win by 13 or more, 1.90, 1.5u\n\nBoth teams played last night, and both teams lost big, the bigger surprise being Chicago home loss from Miami 143-107, Miami crushed them in the second quarter and never stopped. You can't pinpoint any aspect of the game. They outperformed them in everything, more shots, assists, rebounds- 7 offensive rebounds more, 8 steals more, 14 made three throws more...\n\nNow, the good part is that only Giddey and Dosunmu played more than 30 minutes. They have another home game tonight, and Washington is a perfect opportunity to bounce back. Washington lost 14 games and 1 win back in October against Dallas. They did have some closer games, but the feeling is it always depends on the opponent. If they want to beat them big, they can.\n\nThe perfect example is the Toronto 30-point loss last night. They played 14 players, and 12 of those got 9 minutes or more. What is the plan of their back office for this, and for the next seasons, it remains unclear.\n\nKeeping it at 1.5u.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5oos9/"
    },
    {
      "created_utc": 1763792219.0,
      "author": "20k_rpm",
      "text": "Record **:** **17** W **- 14** L\n\nForm **:** ❌❌✅✅✅❌✅✅✅❌✅❌❌❌✅✅❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌\n\nEvent **:** Counter Strike **| Draculan | Nexus vs Passion UA**\n\nPick **:** **Passion UA to win 2-0 or Passion UA -1.5 map handicap** **|** 2 units **@ 1.65 odds**\n\nReasoning **:** Passion pick Nuke, Nexus pick Dust2. Passion is a whole tier and half above this nexus team. This current iteration of nexus is the worst Nexus team of the past 2 years.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5ichy/"
    },
    {
      "created_utc": 1763791398.0,
      "author": "darce-choke",
      "text": "**Record:** 10–3  \n**Net Units:** \\+7.14U\n\n**Previous Pick:**  \nMalcolm Wellmaker ML @ + Islam Makhachev wins by Submission or on Points  ❌\n\n**Sport:** MMA  \n**Event:** UFC Fight Night: Tsarukyan vs Hooker\n\n**Pick:**  \nFight Goes the Distance (Belal Muhammad vs Ian Garry) @ **1.36** \\+  \nArman Tsarukyan ML (vs Daniel Hooker) @ **1.17**\n\n**Parlay Odds:** 1.59  \n**Units:** 4U to win 2.36U\n\n**Write-up:**  \nIn the first leg we’re picking Belal vs Garry **to go the distance**. Both are not much of finishers and are known for their decisions. With both of them not having big finishing upside, I see this fight going the distance.\n\nFor the second leg, we’re taking **Arman** to beat Hooker. Arman is going to be too much for Hooker here. He’s the best second lightweight in the division right now , if not for Ilia or Islam he’d probably be the champ. He can do whatever he wants with Hooker here.\n\nBeen two rough losses, let's get back to the win column.  \n**Tail responsibly, thanks.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5gsom/"
    },
    {
      "created_utc": 1763791295.0,
      "author": "whiteiversonyeet",
      "text": "RECORD 2-1\n\nSTREAK: 2W\n\nNHL 9:00 CST DALLAS STARS VS. CALGARY FLAMES\n\nUNDER 5.5 GOALS\n\nWHY: CALGARY AND DALLAS SHAPE UP AS A STRONG UNDER SPOT BECAUSE BOTH TEAMS TEND TO PLAY LOWER-EVENT, DEFENSIVELY STRUCTURED HOCKEY. CALGARY HAS BEEN ONE OF THE LEAST DANGEROUS OFFENSIVE TEAMS IN THE LEAGUE, STRUGGLING TO GENERATE CONSISTENT SCORING CHANCES AND FINISHING ABILITY, WHICH OFTEN DRAGS THEIR GAMES INTO TIGHT, LOW-SCORING TERRITORY. DALLAS, ON THE OTHER HAND, PLAYS A DISCIPLINED, SYSTEMATIC STYLE THAT LIMITS ODD-MAN RUSHES AND KEEPS THE GAME CONTROLLED. WITH CALGARY’S OFFENSE HAVING TROUBLE FINISHING AND DALLAS’S DEFENSE BUILT TO FRUSTRATE, THE UNDER MAKES A LOT OF SENSE FOR THIS SPOT.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5glpq/"
    },
    {
      "created_utc": 1763790151.0,
      "author": "this_guy9",
      "text": "**POTD Record:** 9-4\n\n**Net Units:** \\+7.22\n\n**Previous Pick**: [✅ Bam Adebayo o0.5 Blocks -121](https://www.reddit.com/r/sportsbook/comments/1p2k7d2/comment/npzd22t/?context=3)\n\nWe're low key on a heater... 4 Ws in a row.  \nLoved the read with Bam.  \nGets his block in the first minute of the third and ends with 3. 2/2 on Blocks Props.  \nHopefully yall have been cashing as well.\n\n**EARLY GAME (10AM PST START)**\n\n**🏀 Kon Kneuppel o5.5 Rebounds -125** vs the Los Angeles Clippers\n\nI usually don't like double-dipping on props but the circumstances are too good and the line is too low.\n\nClippers are on the fifth game of their road trip and will be playing in Charlotte at 1PM Eastern but 10AM Pacific time. If they're at all groggy from the time away from home or the start time, expect the Hornets to out muscle them.\n\nHornets are pretty much at full strength, with Melo, Kalikbrenner, and Miller good to go. Even with all, Kon is still playing at 35-42 minutes per game. Amazing usage. I'm expecting Zubac to hog some boards but purely given minutes, Kon should see plenty of time on court without him.\n\nPure numbers look great. Kneuppel has cashed in L8/10. His average minutes played has been increasing from season to last 10 to last 5. Clippers have not been great at rebounding, ranked 22th, while Charlotte has been one of the top teams. \n\nClippers, the oldest team in the NBA playing in the morning on a multi-game road trip, vs Hornets, one of the youngest teams in the NBA, is a recipe for boards.\n\nFull Stats if you'd like to do additional research: [https://www.statpick.ai/33833588/kon-knueppel-rebounds](https://www.statpick.ai/33833588/kon-knueppel-rebounds)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5edj5/"
    },
    {
      "created_utc": 1763790146.0,
      "author": "jaysial",
      "text": "Cricket 🏏 Picks\n\nLast pick was a Win\n\nOverall: 45💰- 26 ❌\n\n+7.56\n\nLast 10: W W L W W L L L L W L\n\nTodays pick\n\nPakistan v Sri Lanka\n\nStarts in about 7 Hours\n\nPick: Pakistan win @ 1.55\n\n* Pakistan beat Sri Lanka 3-0 in one-day series few days ago\n* Sri Lanka were beaten by Zimbabwe in second match of tri series\n* Sri Lankan squad must be really low in confidence, their batting lineup is really weak too.\n* Regular Sri Lankan captain had to fly back home before this tri series, denting their chances to perform well",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5ed5k/"
    },
    {
      "created_utc": 1763789887.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Club Brugge - Charleroi, Over 3 goals Asian Handicap @ 2.02\n\nRecord: 76 - 72 Profit: +0.05 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅\n\nClub Brugge vs Charleroi, match that could lean toward goals, their recent meetings suggest some potential, three of the last four H2Hs have reached at least three goals. Brugge usually push the pace at home, but they’ve also had matches where things don’t quite click. Charleroi can be hit ormiss too. So the over 3goals Asian line has some appeal, but only with fairly modest confidence.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5dulp/"
    },
    {
      "created_utc": 1763789165.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 19-7 (+13.3U)\n\nLast Pick: Butler -1.5 (-110) (1U) ✅\n\n[Butler write up](https://www.reddit.com/r/sportsbook/s/Z4PiyzksvF)\n\nButler straight up out muscled those cocks! Controlled the pace the entirety of the game and absolutely dominated the boards… Thad matta brought some real physicality this year w them dawgs! I appreciate all the support! Means a lot guys.\n\nEvent: Missouri @ Oklahoma (11am central)\n\nPOTD: Standard 6.5 two team teaser (Oklahoma +1/ Under 49) (NCAAFB) (-120) (1U)\n\n-everything is bet to win unit amount-\n\nWrite up: \n\nOklahoma +1:\n\nThis game sets up perfectly for Oklahoma. Missouri’s identity is built on pounding the rock, but the Sooners’ front is one of the best in the nation against the run, allowing just 2.5 yards per carry. That forces Missouri into passing downs with a quarterback who’s still green. Sam Zollers already struggled badly against Texas A&M’s relentless pass rush (he was strip sacked twice and looked lost out there) — and if A&M is ranked first nationally in sack percentage, guess who’s number two? Oklahoma. That pressure, combined with a secondary that allows only 182 passing yards per game at 6.0 yards per attempt, is a recipe for stalled drives and mistakes.\n\nOklahoma’s defense is elite across the board: 14.1 points allowed per game, 264 total yards surrendered, and just 4.2 yards per play given up. Their offense is middle-of-the-pack at 374 yards per game and 5.5 yards per play, but Venables knows this team’s formula is defense-first. Coming off the Alabama upset, the Sooners cannot afford a slip-up with two losses already on the books. Motivation is sky-high, and Venables has proven he gets his team locked in after emotional wins.\n\nFrom a betting perspective, Oklahoma has been reliable at home. They’re 5-1 ATS in Norman this season, and Venables’ teams have consistently covered when favored by less than a touchdown. Missouri, meanwhile, has struggled against top-tier defenses, going 1-3 ATS against ranked opponents this year. Teasing Oklahoma down to +1 essentially asks them to win outright, and with their defense dictating the pace, that’s the sharp side of this teaser.\n\n Under 49:\n\nThe under is the natural complement here. Oklahoma’s offense moves the ball but doesn’t finish drives with consistency. While their overall red-zone scoring percentage is technically perfect (they’ve converted every trip into points), the issue is touchdowns versus field goals. the Sooners stall in the red zone, often settling for three instead of seven. That inefficiency is why they average just 28.3 points per game (64th nationally) despite being a playoff contender. Against Alabama, they managed only 23 points, and their season-long profile shows a lack of explosive scoring.\n\nMissouri’s defense is strong in its own right, allowing 16.1 points per game and 4.1 yards per play. Their run-heavy style naturally shortens games, but against Oklahoma’s front, those runs will be bottled up. That means long possessions that end in punts or field goals. Zollers isn’t equipped to bail them out with chunk plays through the air, and both teams average around 6.6 yards per pass attempt, which is pedestrian.\n\nThe ATS trends back the under: Oklahoma games have gone 8-2 to the under this season, and Missouri’s grind-it-out style reinforces that. With two elite defenses on the field, a quarterback under siege, and an Oklahoma offense that settles for field goals, this game profiles as a grind. Teasing the total up to 49 gives us a wide cushion, and the matchup screams low scoring. Not to mention the public is all on the over in this one and the line has stayed stagnant around 42 where it is now at 42.5 most books! As always, cheers 🍻\n\nUpdate: I’m sorry I wrote this write up earlier but I have since seen pribula is starting. This is still the play we are rocking with and nothing shall change there. Pribula also  doesn’t fare the best under pressure. He was sacked 3 times for a Loss of 17 yards in a double ot win over Auburn and threw 2 picks that game. Missouris offensive line is also shaky against top tier defensive lines such as Oklahoma. Plus this is his first game back off an ankle injury. Let’s roll",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5cdij/"
    },
    {
      "created_utc": 1763788161.0,
      "author": "Vander_chill",
      "text": "**POTD Record:** 95 – 61 - 9\n\n**Previous:** Texans vs Bills – Davis Mills Over 7.5 Rush Yards – LOSS\n\n**Recap:** The first 5 yards were easy.  Then Mills has a 12 yard run that would have won it for us, but it got called back by a penalty.  That was that.\n\n**New Event:**  Croatian HNL League – Rijeka vs Hajduk Split\n\n**Pick:**  Hajduk Split Double Chance & Over 1.5 Total Goals @ 2.15 (Usual 3 units)\n\nIt seems the more I write the less I win lately, so lazy-man writeup today.\n\nCroatian league leaders Hajduk Split visit 8^(th) placed Rijeka (out of 10 teams).  Rijeka are hoping to turn around a series of consecutive away defeats while Hadjuk travel with momentum after a series of wins.\n\n* Hajduk are in great form with 4 wins and a draw.\n* Hajduk has a +14 goal differential in 13 matches while Rijeka are at even 0.\n* Rijeka have a UEFA Conference League match midweek and may have some rotation.\n* Rijeka’s defense have conceded in 4 out of their last 5 league matches.\n* There have been over 2.5 goals in 5 of the last H2H matches.\n\nHajduk is simply by far the better team and I will back them to not lose in a match with more than 1 goal.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq5a8ay/"
    },
    {
      "created_utc": 1763787812.0,
      "author": "bigtime-operator",
      "text": "Record: 58-45\n\nMagdeburg - Wetzlar 🤾 Handball Germany Bundesliga UTC 18:00\n\nPick: Philipp Ahouansou Goals Over (4.5) @ 1.60\n\nAhouansou is Wetzlar's clear league goalscoring leader this season with 57 goals in 10 matches (5.7/match). Last match (Gummersbach): 10 goals. Against a tough opponent, Flensburg: 8 goals. Ahouansou's role in this match is even heavier than usual. Wetzlar playmaker Dominik Mappes has been \"reported out\" by the club doctors and is definitely out for the Magdeburg match. Naturally, Ahouansou is the main creator and scoring option in the back three. He also took the most responsibility in the Gummersbach match (even with Mappes still in the squad): 10 goals and the most shots. He has also historically averaged 6+ goals in matches against Magdeburg (different teams).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq59gzw/"
    },
    {
      "created_utc": 1763786115.0,
      "author": "PurpleDragonBets",
      "text": "Record: (112-71-11) \\[+17.39\\]\n\nPOTD⭐️:🏈Vanderbilt ML/Texas ML (-141) \\[BetMGM\\]\n\nStart Time & TV: 3:30pm EST (ABC & ESPN)\n\nUnits: 3.75 Units\n\nReasoning: For this college football Saturday were going with an SEC 2 legger for the pick of the day. To start of I really like Vanderbilt (8-2) at home in this one over Kentucky (5-5) as Vanderbilt has not dropped a game at home so far this year and they are coming off a weeks rest coming off the bye week. Vanderbilts two losses this year have came against ranked teams on the road in Alabama and Texas. This Vanderbilt offense ranks 9th in the nation in scoring averaging over 38 points per game with a balanced rushing and passing attack. Kentucky has struggled on the road this year with only one road win and they have failed to score over 14 points on the road this year. Kentucky also does not play well against good competition as they are 0-4 against ranked opponents and 0-5 against power 5 opponents at .500 or better. I think this Vandy defense matches up well against this Kentucky offense as the Wildcats lean into their run game and the Vandy defense is a good rush defense ranking 24th out of 136 so I think they will be able to minimize yards on first down runs and force the Wildcats into predictable passing situations. I also like Texas (7-3) over Arkansas (2-8) as I think the Longhorns bounce back at home after a tough road loss against Georgia. Texas also has not lost on their home field this year and this Arkansas team they face off against has not won a road game or have beaten a single power 5 opponent this year. Arkansas has the worst defense in the SEC this year ranking in the 100s in passing yards allowed, rush yards allowed and points allowed so I dont think the Longhorns will have a problem moving the ball in this one. But on the flip side this Texas defense is a very good one as they excel in stopping the run as they are 6th in the nation in rushing defense only allowing 80 rush yards per game and 18 points per game. Arkansas has also struggled in the pass game recently failing to record 200 passing yards in their past 2 games and throwing for 5 interceptions in the past 3 games. With all of this being said I think Vandy and Texas both cruise to home wins this Saturday afternoon.\n\nPrediction: 34-27 Vandy, 30-23 Texas\n\nhttps://preview.redd.it/vge8wy1olq2g1.jpeg?width=1099&format=pjpg&auto=webp&s=96cc4e5de7a81bd0a2f2fc1053fadeb1d1ac7d3f",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq55on5/"
    },
    {
      "created_utc": 1763785505.0,
      "author": "Supreme_Warzone",
      "text": "POTD Record: 1-0\n\nLast POTD: Draymond Green Over 1.5 Steals ✅\n\nBOOOOM! Cashed on our very first POTD! Completely sweat free as well. Draymond got a steal not even 2 minutes into the start of the game, and then cashed us out halfway through the 2nd quarter. Let’s hopefully go on a win streak.\n\nEvent: Detroit Pistons Vs. Milwaukee Bucks 8:00 PM EST\n\nToday's POTD: Jalen Duren Over 11.5 Rebounds\n\nOdds: -120\n\nWrite Up: Again, I consider mostly if not everything, and they will be listed in categories so it will be easier for you guys.\n\nMatchup:\nThe Detroit Pistons visit the Milwaukee Bucks—a game that projects a fast pace and lots of shot volume. Milwaukee takes the second-most threes per game in the NBA, creating long rebound chances for opposing bigs. They’re also top-10 in possessions per game, which means a higher total rebounding opportunity.\n\nPlayer/Position Analysis:\nJalen Duren is Detroit’s foundation at center, averaging 12.3 rebounds per game. He commands over 35% of all available rebounds while on the floor and ranks among the league leaders in both offensive and defensive rebounding rate.\n\nMilwaukee is allowing the third-most rebounds per game to centers, a weakness rooted in their “let-threes-fly, clear-out-the-paint” scheme. Brook Lopez spends time on the perimeter defensively, leaving the glass to opponents’ centers.\n\nDuren has hit 12+ boards in 5 of his last 6 starts—including games against teams with similar spacing (Indy, Atlanta, Denver).\n\nFull minutes are guaranteed; without a quality backup and no foul-prone matchup (Lopez and Giannis don’t draw many fouls from opposing bigs), Duren’s 32–35 minutes are secure barring something unforeseen.\n\nStatistical Profile:\nAdvanced models (RotoWire, DK) project Duren to 13.7–15.1 rebounds Saturday.\n\nBucks are fourth-worst in offensive board rate allowed to centers, and Duren specializes here (leads all centers in putback attempts per 100 possessions).\n\nIn 2 games vs. Milwaukee over the last calendar year, Duren posted 13 and 15 rebounds (outperformed league average by 18%).\n\nGame Script:\nVegas spread sits at Bucks -5.5: projects a competitive, likely full-fourth-quarter contest.\n\nBoth teams need every win—no load management or early bench risk.\n\nDetroit is highly unlikely to go small—even down double digits, Duren stays on the floor (he played 37 min in a 15-point loss last week).\n\nInjuries & Rotations:\nDetroit’s big rotation is thin: no Bagley, no Wiseman, and recent interview clips show the coaching staff specifically praising Duren’s rebounding focus.\n\nMilwaukee at full firepower means Duren’s size is necessary all game.\n\nHistorical Context:\nDuren averages 14.2 RPG in games with 30 minutes or more.\n\nMilwaukee gives up career-best rebounding nights to true centers; other bigs (Gobert, Capela, Allen) have shattered this line.\n\nSo why this pick? Milwaukee is an elite pace-up, three-point volume opponent with chronic struggle boxing out true centers. Duren is in elite recent form, projected for 13.7–15.1 boards by every respected simulation, faces a thin backup rotation (guaranteed full minutes), and has zero risk indicators (no foul issues, no blowout concern, no injuries). This is the top “insane value” rebound prop for Saturday. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq54b11/"
    },
    {
      "created_utc": 1763784950.0,
      "author": "livebreathefootball",
      "text": "**Record:** 25-32 (1 push)\n\n**Net Units:** \\-1.79 units\n\n**Soccer | Championship | Coventry City vs West Bromwich Albion**\n\n**Pick:** Coventry City -1 Asian Handicap @ 2.26 \\[1 unit\\]\n\n**Reason:** Coventry City are flying high at the top of the Championship and are the form team at the moment, with 7 wins and 1 loss in their past 8 league games. They have the best home record in the league (5 wins, 2 draws), and all 5 home wins have been by at least 2 goals.\n\nWest Brom have won just 1 of their past 5 league games (1 win, 1 draw, 3 losses), and have lost their last 4 away league games. 3 of those away losses have been by just 1 goal, hence I have gone for the -1 Asian Handicap instead of the -1.5 Asian Handicap.\n\n**Tips:** Always appreciated but not required\n\n[https://ko-fi.com/livebreathefootball](https://ko-fi.com/livebreathefootball)\n\nBTC: 339ArQdaeLeyGa19n85cW8q43W71qEkkZf  \nETH: 0xaB161e1555668D70fa2B3553e6A9DF07e7e7d465",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq530iz/"
    },
    {
      "created_utc": 1763784627.0,
      "author": "TheNebraskaJim",
      "text": "POTD record: 9-6 (+10.842u)\n\nLast POTD: Guardians ML @ Yankees (+155) ❌\n\nI made this bet August 2024. I’m back! Check my comment history for proof of previous bets\n\nNew POTD record: 0-0\n\n<<<POTD: Arkansas @ Texas -8.5 (-110) 1U\n\nTexas needs a bounce back game. Sark wants blood.\n\nIf you are feeling generous and want to pitch in for an EX university student’s loans then you can send tips to https://buymeacoffee.com/batrickbets !\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq529yo/"
    },
    {
      "created_utc": 1763783150.0,
      "author": "ChiliCheeseSandwich",
      "text": "Yessirrrr, let’s make that 2-0! We are on a roll! MPJ delivered the dagger three to deliver the Nets their 3rd win (sidenote, Claxton got a triple double which is pretty neat).\n\nPrevious Pick: Michael Porter Jr. O3.5 Threes @1.85, 1.5U. ✅\n\nRecord: 2-0\n\nPOTD: Detroit Pistons -8 @1.91, 3U.\n\nNBA: Milwaukee Bucks VS. Detroit Pistons.\n\nWrite Up: I’m having a hard time figuring out why the spread is this close. The Bucks, even with Giannis, have struggled all throughout the season. So without Giannis playing this match due to a groin injury, I don’t see how the 13-2 Pistons don’t blow out the 8-8 (fraud) Bucks here, even if Ivey and Harris aren’t present. But hey, if Myles Turner gets a 50 point triple-double to win the match, you can quote me on this. Still tho, I’m taking the Pistons covering the 8 point spread all day everyday.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4ytet/"
    },
    {
      "created_utc": 1763779119.0,
      "author": "InconsolableBrat",
      "text": "POTD Record: 157-103 | Profit: +116.33u | ROI: 15.4%\n\nSeason Record: 17-7 | Profit: +29.07u | ROI: 36.3%\n\n \n\nLast Pick: Simone Fontecchio (Heat) O10.5 Pts @ 1.93. 3U. ❌\n\nNothing to remind you that this is sports betting like a near 50% 3pt shooter literally going 1 from 10 beyond the arc. He still ends (at 9pts) just 1 FG shy, but that’s why we manage units. End of a nice streak, but we move on.\n\n \n\nNext Pick: **Atlanta Hawks -7.0 vs New Orleans Pelicans @ 1.93**. 3U play.\n\nThe Pelicans will be on the second half of a B2B here, and with Zion playing today, he might not play tomorrow and if he does could certainly be feeling the effects as he just returned from injury last game. The Hawks have a fully fit roster, and are just much better than the Pels on both the offensive and defensive ends. Even though it’s a big spread, I’ll gladly back the better team with extra rest against the Pelicans who have looked terrible all season.\n\n \n\n*If you’ve enjoyed these picks, tips are always appreciated:* [Coffee Link](https://www.buymeacoffee.com/TheBrat)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4ovlj/"
    },
    {
      "created_utc": 1763778857.0,
      "author": "talkerthewalk",
      "text": "**Record:** 7-4\n\n**Net units:** \\+ 3.42\n\n**Soccer | A-League Men | 1700 ADST** \n\n\\*\\*Pick: Western Sydney Wanderers win to nil \\*\\* v Central Coast Mariners **@ $3.30 (Updated on Sportsbet)**\n\nA-Liga Men is back after the international break, with three good games today and a big result from Adelaide over City last night. Today, I am tipping Wanderers to break their slump and get their first win of the season. Having lost a bunch of attacking threat over the offseason, they have been slow to get going with only two goals scored, but have been reasonably solid at the back despite conceding in each game. They are broadly conceding to low quality chances and not conceding many good ones, and the Mariners have struggled to create much of note most weeks - scoring only against Newcastle (worst defence in the league), Perth (second worst defence in the league, and Wellington (equal fourth worst). I think they will struggle to break Wanderers down here, while the hosts will at least grab one or two. Not gonna be a thrashing, but think it will be comfortable for Wanderers.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4o7vl/"
    },
    {
      "created_utc": 1763778816.0,
      "author": "wes2211",
      "text": ">**Record:** 113-94\n>**Net Units:** +25.45 units\n\n>**Curling** | **European Curling Championships** | **7:30AM EST**\n\n>**Pick:** Denmark ML @ 1.9\n\n>The European Championships start Saturday and the opening draw for the men has a couple bottom feeder teams facing off. Denmark takes on Poland and my power rankings have Denmark quite a bit higher. Denmark leads the career head-to-head 2-1, including a 8-5 win last year at this event. Schmidt likes to be aggressive without hammer and Stych gives up steals at a higher rate so I expect Denmark to get a couple steals in this one.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4o48y/"
    },
    {
      "created_utc": 1763778290.0,
      "author": "domadilla",
      "text": "POTD record 86-4-64 (W-P-L)\n\n**UFC Qatar: Ryan Loder ML, 2.5u** @ +120 (2.2) I am taking the wrestler in this match up, Loder was as high as +150 earlier in the week but I think there is still value at dog odds. His opponent, despite his Russian sounding name, is actually born and raised in Austria. Naurdiev is weak off his back and prone to being controlled. He has given up takedowns in all of his UFC losses and here he is coming up against an elite grappler in Loder, a former NCAA Div 1 All-American. Loder is always at risk of getting clipped on the feet but he's an intelligent fighter I expect him to work his takedowns asap and control Naurdiev on the mat. Give me Loder to win, probably through a control-based decision or an opportunistic sub if Naurdiev makes a mistake on the mat.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4msmu/"
    },
    {
      "created_utc": 1763777161.0,
      "author": "Best_Accountant_5471",
      "text": "Record: 50-31 (+37.4 units)\n\nLast 10 (most recent on right):  ✅✅✅❌✅✅✅❌❌❌\n\nLast Pick: Sport Recife +2.5 corner handicap (or +3 European handicap) vs Flamengo ❌\n\nEvent: Premier League ⚽️\n\nPick of the Day: Brentford +2 corner handicap vs Brighton (or +1.5 corner handicap) 3U @ 1.90 (Bet365)\n\nWrite-up: I will generally take full responsibility on my losses but this league is factually very dodgy without even being a conspiracist. Recife went 1-0 up early which set up a big shock and went 1-0 up in corners before a first red card was shown to the underdogs. Obviously at that point Flamengo piled pressure and equalised but nevertheless the count was 3-0 which 90% of the time would lead to the play winning. But ANOTHER red card was handed to Recife which made it mission impossible for this play to win despite them leading corners 4-3 at the half. I can’t explain how rare (and suspicious) a double red is in a first half and no surprises that Flamengo then took control of the game, winning 5-1 and 15 to 4 corners with 90% 2H possession. Can’t fault the maths despite the losing streak but I’ll make sure to avoid leagues with severe accusations of corruption which is my bad for tipping.\n\nI’ve been very impressed by Brentford this season - whom I’d expected to be in a relegation battle before the season started. They finished 10th last year but having sold their best players in Mbeumo, Wissa, Nørgaard, losing manager Tom Frank and not really replacing them I, just like many, was expecting a huge fall-off. I’ve got to commend set-piece coach Keith Andrews for his work at the Bees who may be 12th but have picked up some huge wins against Newcastle, Liverpool, United, Villa amongst other great results. Brighton have similarly had some really solid results currently sitting a spot above Brentford with wins over Newcastle, Chelsea and City. Hürzeler has done a really good job with the Seagulls since taking over last season, playing some nice direct football and I do expect them to be fighting for the European spots this season.\n\nBrighton has averaged 3.9 corners won and 4.6 conceded over their last 20 at the Amex whilst Brentford has won 4.9 and conceded 6.2 on the road in the same time period. Also using more recent stats to reflect the current forms of the teams I get an expected 4.6 corners for the Seagulls and 4.9 for the Bees. That gives this play a 72% chance of winning. I must warn though that this play lost by a corner in last year’s fixture but am not fussed about it considering it was 11 months ago. Brentford have covered the line in 12/15 away (+ L5) and Brighton’s opponents in 12/15 at home (+ L7) so I love this spot. BOL !\n\nI’m raising money for Movember, ALL proceeds will be going to a good cause. Donations aren’t expected but very much appreciated so if you have profited from my picks please do consider donating, a little goes a long way. [https://buymeacoffee.com/best\\_accountant\\_5471](https://buymeacoffee.com/best_accountant_5471)\n\nhttps://preview.redd.it/oqc8czc1vp2g1.jpeg?width=1179&format=pjpg&auto=webp&s=f7d45995c8a07d15ed73f00c23eb4f3c94d99355",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4jxuo/"
    },
    {
      "created_utc": 1763776788.0,
      "author": "Hercules-sonofZeus",
      "text": "Record: 45-30\n\nForm (most recent on right) : ✅✅✅✖️✅✅✖️✅✅✅✖️✅✅✖️✅✖️✅✖️✅✖️✖️✖️✖️✅✅✖️✅✅✖️✖️✅✅✅✅✅✅✅✖️✖️✅✅✖️✖️✖️✖️✅✖️✅✖️✅✖️✖️✖️✅✅✅✅✅✅✖️✅✅✅✖️✅✅✅✅✅✅✅✖️✖️✖️✖️\n\nNet Units : +8.98u, ROI : +3.54%\n\nLast Pick: Germany to Win + Total Under 4.5 Goals✖️\n\nEvent : England Premier League 🏴󠁧󠁢󠁥󠁮󠁧󠁿\n\nNewcastle United vs Manchester City\n\nPick : Manchester City to Win or Draw + Total Over 1.5 Goals @1.6 for 5u\n\nCity are second in the Premier League and in great form after beating Liverpool 3-0 and Bournemouth 3-1, showing their attack is dangerous and they can score multiple goals easily. They have dominated Newcastle recently, winning 4-0 in the last meeting, but Newcastle are fighting to avoid relegation so they will play hard at home, making the draw protection valuable just in case it ends 1-1 or 2-2. Last 11 games of Newcastle had over 1.5 goals while last 22 of 24 games there's been over 1.5 goals in City matches. With City's quality and Erling Haaland leading the line, they should score at least once or twice, and even if they don't win comfortably, a 1-1 draw or 2-1 win both cover this bet perfectly, making it a safer option than just backing City to win outright.\n\nIf you found these picks helpful, tips or donations are greatly appreciated as they support the time and effort I put into creating them: [buy me a beer🍻](https://buymeacoffee.com/hercules.son.of.zeus)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4izfl/"
    },
    {
      "created_utc": 1763776378.0,
      "author": "NVSBETS",
      "text": "POTD Record: 10-2\n\nNet Units: +7.78u ROI: 42.05%\n\nPrev POTD: Ivan Gakhov +1.5 sets -171✅ +1u\n\nSport: MMA League: UFC Time: 3pm EST \n\nPOTD: Arman Tsarukyan by kotko/sub -141 1u\n\nAnalysis: big skill gap between these two and Arman understands he needs a statement win here to solidify himself as a contender. Can’t see him playing with his food here, GNP or sub within 2 rounds. \n\n*if I’ve made you money and want to tip:* [BMAC☕️](https://buymeacoffee.com/nvsbets) | [BTC](https://pastebin.com/0Lf0mHqu) | [ETH](https://pastebin.com/D2QRi3Bx)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4hxkj/"
    },
    {
      "created_utc": 1763775931.0,
      "author": "dreamchasing1",
      "text": "Record: 226-214 Net Units: -27.89 47-50 on 1.5u plays, 37-39 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Netherlands Eerste Divisie] Cambuur vs Den Haag\nLast pick: BTTS + Over 2.5 goals @ 1.80 Loss\n\n\nEvent: Soccer/Football, [Saudi Professional League] Damac vs Al Najma\n\n\nPick: BTTS @ 1.90 - 1.5 Units\n\n\nThe two teams already met this season in a cup game ending 2-1 for Al Najma. Damac have hit btts in all 9 competitive games they've played this season, Al Najma have hit in 7/10 games with 2 of the misses being 0-1 losses vs Al Ahli and Al Ittihad, two of the top Saudi teams (Al Ittihad struggling currently but they're usually one of the best).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4gs9j/"
    },
    {
      "created_utc": 1763774681.0,
      "author": "nigerianPriince0",
      "text": "**Record: 91 W  - 78 L**\n\n**------------------------------------------------**\n\n**Today's Pick: Chelsea Over 2.5 Corners first half @ 1.80**\n\n**League - Premier League**\n\n**Game: Burnley Vs Chelsea**\n\n**Time: 7:30  am EST**\n\n**-----------------**\n\n**International break is finally done, so let’s get back to some good English footy**\n\n\n\nIn Burnley last 10 Premier League games, their opponents have had over 2.5 corners in the first half in 8/10 of those matches with the only misses coming against a struggling Wolverhampton side and Sunderland. \n\n\n\nChelsea are going to look to put pressure on the rest of the league with an early win tomorrow.\n\nChelsea have covered this line in their last 3 prem games and 4 times in their last 6 games. expecting them to start their best winger pairing and push for this well.\n\n\n\n**Anyway BOL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4dn9v/"
    },
    {
      "created_utc": 1763774295.0,
      "author": "Diamondhf",
      "text": "Net Lifetime Units: +17.72 15-10 Record\n\nLast Pick: [Minnesota +25.5] LOSS\nhttps://www.reddit.com/r/sportsbook/comments/1owk01v/comment/noqqvl8/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button\n\nPOTD: Iowa -16.5 -115 5u to win 4.5u\n\nIowa Hawkeyes vs Michigan State Spartans, Kinnick Stadium, Iowa City, IA 3:30pm\n\n\nEvery Iowa pick I’ve posted thus far has cashed. This is a great spot for the Hawkeyes playing their final home game of the season at Kinnick in what will turn into a night game on senior night. \n\nIowa is 8-1 this season ATTS against Division 1 opponents. They keep games extremely tight against top level competition, and blow the doors off of lesser opponents. This is the first time all season that they’ve been favored by double digits against a P4 opponent, and with an average win margin of 28 against non ranked opponents, this game will follow the same story against Michigan State.\n\nIowa has finally unlocked a bit of a passing game from Mark Gronowski, and their OC Tim Lester does an extremely good job horizontally attacking the field. This team has gotten better and better in every facet week by week. \n\nThe only way to beat Iowa is to be truly elite. USC has Lemon and Lane, and were just chucking up 50/50 balls to them, in which they went 8/10. Both receivers are likely to be first round picks in this years NFL draft, and they used them to barely squeak out a win against Iowa. Oregon used their #1 nationally rushing offense and elite heisman caliber QB to squeak out of Iowa City with a win. Indiana used their Heisman front runner QB to barely squeak out of Iowa City with a win. Iowa State threw the ball to their 6’8 tight ends and got a few really good bounces to win in a rivalry game.\n\nRutgers lost by 10 points to Iowa but was able to keep the game competitive by throwing to their elite WR’s who will be 1st or 2nd round draft picks.\n\nIn games where teams don’t truly have a nationally elite threat, Iowa steps on their neck like they did against Minnesota, winning 41-3, against Wisconsin winning 37-0. \n\nMichigan State’s offense ranks 65th in the country per PFF, and their defense ranks 115th in the country. Michigan State is They’re banged up at the QB position, potentially having to turn to their third string freshman QB if Chiles or Milijovic aren’t ready to go. The last place I want to be when making my first collegiate start is Iowa City in November against a Phil Parker defense. Michigan State is 0-7 in conference play, having gotten spanked by every team in the Big 10 by a minimum of 10 points, with the exception being Minnesota, where they only lost by 3.\n\nMichigan State has one of the most abysmal O-lines in the country, ranking 121st at pass blocking. Iowa has one of the best pass rushes in the country, ranking 9th. If Iowa can get them behind the sticks with a sack, there’s very little chance of Michigan State getting anything going to advance the drive.\n\nIowa has gone through a gauntlet of top ranked opponents in the past 3 weeks, and will look to enforce their will against a dog shit Michigan State team on senior night. This is one of the only times I’ve felt Iowa will come into a game explicitly looking to run up the score and excite the fans. Good luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4co97/"
    },
    {
      "created_utc": 1763773884.0,
      "author": "damagebabee",
      "text": "**POTD** Record 119-02-96\n\nAALBORG VS KOLDING\n\nDate: 22 NOVEMBER 2025 at 14:00\n\nBET ON: Over / Under- Over +2.50\n\nOdd: 1.65\n\nDENMARK\n\n\\- AaB come into this match with strong home momentum and a clear offensive edge, scoring freely in Aalborg with a 17:6 home goal difference and five straight league wins. Their recent match pattern is consistently high-scoring, and both their tactical pragmatism—dropping deeper to exploit transition speed—and their well-staffed attack with Hansen, Helenius, John and Ross point toward another open game. Kolding, meanwhile, have regressed defensively after major player sales, conceding 19 in 16 matches and suffering repeated back-line and goalkeeper errors, yet their more possession-oriented setup under Rudé and the emergence of Morozov also keep them dangerous going forward. With Kolding urgently needing points to re-enter the top six, and their away matches averaging 2.5 goals with a 10:10 scoreline, both the motivation and tactical profiles suggest a stretched matchup. Given AaB’s recent run of over-the-line games and Kolding’s unstable defense, over 2.5 goals is well supported by form, setup and motivation.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4bmpc/"
    },
    {
      "created_utc": 1763773503.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 5-3\n\n**Previous Pick:** John McGinn 1+ SOT (+110) ❌️\n\n**Today's Event:** English Premier League | Burnley vs Chelsea (4:30 AM PST)\n\n**Pick:** Enzo Fernandez 1+ SOT (+100) 1 unit to win 1 unit ✅️\n\n**Write Up:** Wellp you cant win them all. McGinn had two great chances, one shot bent literally inches over and outside the post and the 2nd was a rocket into the crowd that took an unlucky block by a defender. At least it was a super fun game to watch as expected. We move on. \n\nPremier League is back after the international break, and we've got a great slate this weekend! Today we're naturally back in England as 17th place Burnley hosts 3rd place Chelsea in the early early window. And we are running back our very first POTD and backing Enzo Fernandez for 1+ shot on target. Chelsea will want and expect a decisive win here to collect all 3 points and continue their promising start to the season, whereas Burnley are fighting to stay above the relegation zone. \n\nI was honestly shocked to see this line so high. Enzo has hit at least one SOT in his last 5/5 EPL matches and now 7 of 8 in all comps since Palmer has been out. Palmer is training again, but still out for this match per coach. Enzo did pick up an injury before the international break, but is fully recovered and available according to coach Maresca. There is a non-zero chance he does not start, but I still like thisnif he comes on as a sub. **You may want to wait for lineups an hour before gametime if you are worried about this.** I'll be asleep until kickoff, so I'm taking it now. \n\nThe same data still applies from my last post - Enzo is the team captain, the likely penalty taker, and loves to shoot (free kicks, outside the box, headers in the box, etc). Burnley hold more possession than you'd expect a bottom 5 team to, but they also give up a lot of shots - 15 (7 SOT) to Wolves, 12 (8) to Arsenal, and 15 (6) to West Ham over their last 3. \n\nWe cashed this at -110 a few weeks ago, hoping we can run it back for even money. BOL and have a great weekend!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4an2n/"
    },
    {
      "created_utc": 1763773391.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 6-5-1\n\nNet units: +0.11u All bets are 1 unit.\n\nLast POTD 11/20/25: Total Match Points U43.5 (-110 FanDuel) ✅\n\nWhat a performance for the Texans defense after halftime. They completely shut down the Bills offense and allowed only 3 points in the second half. This one came down to the wire and I loved watching this game!\n\nToday's POTD 11/22/25: Total match points U42.5 (-105 Bet365)\n\nEvent: Missouri @ Oklahoma 10:00MST\n\nWrite up: This week Missouri will be visiting Oklahoma in what I predict to be a close and low scoring affair between a lackluster Sooners offense and a run first Tiger's team. Missouri has been living and dying on the run this year and ranks top 15 in every major rushing category this season. However, they will be going up against a very tough and stingy Oklahoma rush defense. The Sooners defense has allowed only 82 yards per game and a very strict 2.5 yards per carry this season and I believe they will prove to be a very difficult obstacle for Missouri's fairly one dimensional offensive attack. Although Missouri has done very well vs. the under, out of their two away games this year, they both have hit the under. There's not much to be said about the Sooners on the other side of the ball. The offense has been a very lackluster part of the team and Mateer hasn't been playing well since his injuring his hand against Auburn earlier this season. Not to mention, Missouri's defense hasn't been great by any stretch of the word but they have been very competent against the run and pass and they tackle incredibly well with a 90% tackle success rate that's good enough to be ranked 4th in the nation. I don't trust Oklahoma to be able to keep the scoring consistent as they have hit the under in 4 of their last 5 games and I don't forsee much of a turn around moving into this game.\n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4acoo/"
    },
    {
      "created_utc": 1763773351.0,
      "author": "InternationalRest542",
      "text": "POTD Record: 9 - 2\n\n\nNet Profit : +12.3 Units\n\n\nPrevious Pick: Raptors -12.5  @1.80 3u to win 2.19u 💵💵\n\n\nEvent: NBA | Clippers @ Hornets\n\n\nPOTD:  Miles Bridges Over 19.5 P  @1.92 3u to win 2.76u\n\n\nWrite Up:  \n \n\n\n\n\nAnother day, another play we’re rolling with  Miles Bridges over his points.\n\n\nHe’s been solid against the Clippers for a while now. Over the last 3 years he’s putting up 22 PPG in 4 matchups, and if you zoom in even more, his last 5 vs LAC are at 21.2 PPG with some strong all-around numbers. So he’s already shown he can score on this team consistently.\n\n\nBridges is also that guy for Charlotte right now. When the offense stalls, the ball naturally finds him. He gets the volume, he gets the freedom, and when he’s aggressive early, he usually stays hot.\n\n\nAnd the matchup helps. The Clippers defense against wings hasn’t been great ,their D-rating vs SF is 116.5, which basically means they bleed points to that position. They guard PFs better, but SFs who can shoot, slash, and play from the perimeter give them problems… which is literally Bridges’ whole game.\n\n\nIf this turns into a faster-paced game or if Charlotte ends up leaning on Bridges for offense (which they usually do), he should have plenty of chances to get to 20+. This line feels very hittable.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq4a8wb/"
    },
    {
      "created_utc": 1763773168.0,
      "author": "Hsil18",
      "text": "\nPOTD RECORD: 29-10\nPOTD TOTAL RETURNS: +27.79 Units 🤑\n\nLAST PICK: Sydney Sixers ML @ 1.76 (2U)❌\n\nTODAY’S FIXTURE: Wales v New Zealand (Rugby) 15:10uk / 10:10EST\n\nPICK: New Zealand -28.5 @ 2.0 (3U)\n\nWRITE UP:\nBack in business with another big day of rugby internationals. All bet worthy but pick of the bunch is New Zealand -28.5 v Wales.\n\nNow worth noting New Zealand have rotated after defeat to England last week but their side still possesses quality wales can only dream of. That added to the fact wales have lost 2/3 of their best players , it isn’t looking good.\n\nThis line is fairly aggressive but it could get silly in Cardiff. Wales did scrape past Japan last week by 2 points , but that ended a 10 match home defeat record and was only their 2nd win in 20 games - the other of which also coming vs Japan.\n\nNew Zealand will want to round of their tour of the northern hemisphere in the only way they know how and that is in style. \n\nI won’t be suprised to see them put 50+ points on the board and crushing this developing Welsh side.\n\nLet’s hope I’m right as 3 units.\n\nBOL to those tailing — see you on the other side 🫡🫡🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq49rrf/"
    },
    {
      "created_utc": 1763772965.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Saturday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p3ft8j/pick_of_the_day_112225_saturday/nq498g0/"
    }
  ]
}