{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/4/25 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/",
  "target_date": "2025-12-04",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-04T19:37:52.808653+00:00",
  "comments": [
    {
      "created_utc": 1764874967.0,
      "author": "No-Cryptographer2490",
      "text": "Record: 7-4 ✅✅❌✅✅✅❌❌✅❌✅\n\nNet Units: +5.12U\n\nAll bets are 1U unless otherwise stated\n\nLast pick:  KPJ ov 8.5 anr ✅\n\nSport: Basketball League: NBA Event Time: 7pm CT\n\nPick:  Saddiq Bey Points over 15.5 (-120, 1.8x) 3u\n\nWrite Up: even after a stat adjustment KPJ hit LFG! Let’s try and go 1-0 today. With Zion out of the line up Bey is averaging 16.7 ppg. Last game vs the wolves (Tuesday) he hit 22 (18 before OT). Keeping it simple again and taking his points over \n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/nsal8x2/"
    },
    {
      "created_utc": 1764874109.0,
      "author": "ColdTub10",
      "text": "**Record: 2-1** *(+1.48 net units)*\n\n**Last Pick:** *Alabama O 89.5 points vs. Clemson (W) | 1.81u net |* Finished with 90 points on the dot\n\n**Event:** Utah State @ USF (CBB) | Start Time: 7pm ET\n\n**Pick:** ***Utah State -1.5 Spread*** **(2*****u to win 2u)*** | +100 odds on FD \n\n**Write Up:** Utah State currently sits at 35th in the KenPom rankings (7-0). USF reminds me a lot of the Alabama basketball playstyle with a very high tempo offense, but they are currently sitting at **4-4 overall averaging 91.4ppg** (how can that even be true)!? Well the **USF defense has allowed their opponents to shoot 52.6% from the field (effectively)** which has gave them some brutal losses. A couple teams they've played that scored at least 85pts against USF: George Washington (L 99-95), Kennesaw State (W 108-89), Oklahoma State (L 103-95), and WKU (W-97-91). \n\nUtah State on the other hand has played a very all around style of basketball averaging 85.3ppg with an **average score margin of +15.8 points.** They are rebounding well (36.7rpg), and shooting **58.3% from the field (effectively).** They are **allowing 69.5ppg** to their opponents. They are also coming off a very close game with Montana State. \n\nWhat I like about this line is that **both teams have a common opponent - VCU**. Both games were at neutral sites. USF lost 78-66 which was a complete opposite performance than what their stats say, and Utah State squeezed out an 80-77 W. KenPom also is giving Utah State a 5 point win margin. I assume the line is only this tight because it is at USF (Utah State is healthy). \n\nUSF can prove something tonight, but with their 4-4 record and ability to not maintain a lead even averaging 90+ppg which is absurd to any CBB fan. I think this game has the potential to be a shootout, and whether or not it is, Utah State (-1.5) is the clear pick here. ML is also sitting at -114 which could easily be played here as well to avoid a bad beat, but I think Utah State ultimately wins by at least 3 points. \n\nGood luck to all on the rest of your picks and best of luck if tailing.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/nsai937/"
    },
    {
      "created_utc": 1764873566.0,
      "author": "EzPickzz",
      "text": "Record: 15-7\n\nUnit record: +21u\n\nLast pick: Louisville -2.5❌\n\nPOTD💎: 2 leg parlay, (Jameson Williams 4 receptions & cowboys team total over 22.5) \n\nDraftKings: -120 (+2u)\n\nTime: 6:15pm @Lions",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/nsagc9g/"
    },
    {
      "created_utc": 1764871544.0,
      "author": "Accomplished-Gear879",
      "text": "**POTD Record: 0–0**\n\nHey, first time posting here. Let’s see how this goes.\n\nPOTD: Manchester United ML & Over 2.5 @ 1.83 - 1 Unit\n\nI don’t think this match needs much explanation. West Ham this season has been outright poor. They’re sitting 18th in the EPL and fighting for every point. Yes, they had a little spark recently with a 3-1 win against Newcastle at home, and they also beat 19th-placed Burnley. But overall, not impressive.\n\nOn the other hand, we have a solid Manchester United side sitting 9th with 21 points from 13 games. Chelsea in 4th place has only 24 points with one more match played, so the gap is fairly small.\n\nBoth teams have been involved in high-scoring matches this season, with a combined total of around 83 goals scored and conceded across 26 matches. That’s an average of about 3.2 goals per game.\n\nOne thing worth noting: Manchester United have conceded in all but two matches this season, which makes BTTS an interesting angle as well. But I’m sticking with the over 2.5 goals.\n\nGiven West Ham’s current form as essentially a “farm team” for the rest of the league, I’m confident United will score at least two, maybe three, and likely concede one as well.\n\nLet’s see how it goes.  \nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/nsa99f0/"
    },
    {
      "created_utc": 1764871489.0,
      "author": "dbpsooner",
      "text": "**Record:** 2-0 (+2 units)\n\n**Last:** Real Madrid – Another sweat free win which is always nice\n\n**POTD:** Javonte Williams under 65.5 rushing yards\n\n**Start Time:** 8:00 PM EST\n\n**Odds:** \\-118 (BetMGM)\n\n**Units:** 1.18 to win 1\n\n**Reasoning:** I try to be a bit contrarian in my approach and have found a play I like based on the type of game I expect to see tonight.  Williams has eclipsed this number in 8 of the Cowboys 12 games this year.  Aside from last week against KC, 2 of the other occurrences where he didn’t hit this mark happened in 2 of their last 3 road games.  In each of those 3 instances Dallas found themselves in shootouts with Carolina, Denver and KC…losing 2 of those 3 and only winning the home game against KC.  The other of the 3 road games was against Vegas who has been one of the worst teams in the league.\n\nTonight, Dallas hits the road again to face a desperate Detroit team with some key injuries to guys like St. Brown as well as in their secondary.  I mention this because I think Detroit will come out in this game and emphasize the run game and time of possession.  On the flip side, I look for Dallas to focus on the passing game versus the run.  The Dallas defense, although better since the bye week, is very vulnerable against the run ranking towards the bottom of the league in rushing yards against per game as well as rushing yards against per attempt.   I mention this because I think Detroit will be successful in running the ball and eating clock.  Because of the importance of this game, I think Dallas will counter by abandoning the run and becoming one dimensional in the passing game.  Detroit is 5^(th) in the league in rushing yards against per attempt.  Dallas should already have a pass heavy game plan coming into this matchup.  I do like a lot of the CD Lamb prop bets tonight, but I’m really focused on this play given how I see this game playing out.\n\nVegas thinks this will be a high scoring game in Detroit’s favor.  That typically does not bode well for an opposing team’s running backs. Good Luck",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/nsa92mn/"
    },
    {
      "created_utc": 1764870753.0,
      "author": "YGWYD",
      "text": "**SEASON RECORD:** 32-4-23\n\nNet Units: (-4.21)\n\nPrevious Pick:  Leeds vs Chelsea - Chelsea to win @ 1.90 ❌️\n\n**Today's Pick:**  FC Cartagena vs Valencia - Valencia to Qualify/Man Utd vs Valencia - Bryan Mbeumo over 0.5 shots on Target @ 1.72\n\n**TIME:** 8:45/9pm (BST)\n\n**Wager Amount**: 1.5 units\n\nLast 10 Matches (❌️❌️❌️✅️❌️✅️✅️✅️❌️❌️)\n\nTrap and I fell for it..ffs anyway today i'm going with a Parlay with the Copa Del Ray and PL.\n\nBryan Mbeumo has had a decent start to his Man Utd career, 5 goals so far in the league, won player of the month, has over 0.4 goals per game, over 2.5 shots per game, and over 1.3 shots on target per game with an xG of 3.76.\n\nAlthough Valencia are 15th in La liga, they are unbeaten in 3 games and are on a 4 game winning streak against Cartagena so they should be able to quality whether FT or ET. BOL if you're tailing or fading given my current form lol.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/nsa6ig4/"
    },
    {
      "created_utc": 1764867189.0,
      "author": "bigtime-operator",
      "text": "Record: 62-50\n\nÇorum FK - Alanyaspor ⚽ Türkiye Kupası UTC 17:30\n\nPick: HT/FT Winner Alanyaspor @ 1.60\n\nThe match is almost here, and I've been waiting for their lineups to be confirmed. There's a significant difference between the two teams' lineups. Çorum, the hosts, is missing a significant number of players, with three 18-year-olds in their starting eleven. They're not paying attention to this match. They'll be playing this weekend against Pendikspor with an all-reserve squad. Alanyaspor, on the other hand, is fielding a strong squad. Their focus is on the cup game. They'll start this match quickly and win 3-0 or 4-0.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns9ubmw/"
    },
    {
      "created_utc": 1764866268.0,
      "author": "CobyRich727",
      "text": "**POTD Record:** 0-0 (first time posting)\n\n**Events:** NCAAM Utah State @ USF (7pm EST) -- NBA Utah Jazz @ Brooklyn Nets (7:30pm EST)\n\n**POTD:** Utah State ML (-130 on DK) + Utah Jazz ML (-180 on DK), **+175 parlay** \\-- 2 units to profit 3.5 units\n\n**Write Up:** Long-time tailer for a lot of these guys, first-time poster. Thought it would be fun to share a pick for once and see how it goes, and I'm going with a parlay featuring the great state of Utah. There are slim pickings on the sports docket today, and I wanted to stay away from TNF because everyone seems convinced it will be a high-scoring affair with tons of overs, and I don't want to risk the Vegas rug-pull.\n\nStarting with Utah State, they are 7-0 to start the young NCAA season and are heading on the road to take on USF, who stand at 4-4. I really just like the price of this game, as I think Utah State is taking a hit from barely squeaking by Montana State in OT their last time out. Even with that close one though, they have a solid body of work thus far, taking out good mid-major teams in Davidson and Tulane. Meanwhile, USF has dropped games to Oklahoma State, Colorado State, and GW. These two actually share a common opponent in VCU, and Utah State took their matchup 80-77 while USF lost by 12. Utah State is simply a better team right now with solid play from MJ Collins (21.3 PPG) and Mason Falslev (13.7 PPG), and has been shutting down teams defensively in a way that I don't think USF will be able to overcome.\n\nNow going to the professional side of Utah basketball, I'm picking the Utah Jazz to beat the Nets in Brooklyn. The Nets are on a back-to-back, which is my favorite bet in sports. They also just flat-out stink, and to make matters worse they'll be without Cam Thomas for a good while. Even though Utah will be missing Walker Kessler, I think that Lauri Markkanen (28.0 PPG, 6.3 RPG) will be enough to power the Jazz to victory over the shorthanded and fatigued young Nets.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns9r534/"
    },
    {
      "created_utc": 1764864360.0,
      "author": "Elevate203",
      "text": "Record: 4-1\n\nLast POTD: Collin Sexton o14.5 pts ✖️\n\nToday’s Event: Boston Celtics @ Washington Wizards\n\nPOTD: Josh Minot o7.5 points (-122)\n\nReasoning: Looking to get back into the winning column tonight, and I’m going with my hometown team. Been a die hard Celtics fan since ‘98, and watch every game so feel confident about this pick. Jaylen Brown is likely out tonight(GTD) but even if he played(which I don’t think will happen, perfect game to rest him) I like this line for Why Not Minot. Josh brings energy off the bench and sometimes starts depending on the matchup. He’s been knocking down the Trey ball all season, and also is a threat on the offensive glass to get second chance points. Tonight we will see a lot of Minot, Baylor Scheierman, and Jordan Walsh. Even with Jb in the lineup he’s cleared this in 3/5 games, and coming off an excellent all around performance against the Knicks. Lot of value in this game, let’s get back to business here and hoping for another Celtics Win!!! \n\nBOL! ☘️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns9kkwe/"
    },
    {
      "created_utc": 1764863975.0,
      "author": "Hefty_Night1892",
      "text": "**Yesterday's POTD**: Arsenal first half ML (-115 Draftkings) [3u] 🤑 \n\nEasy does it, boys. Just like we expected, Arsenal found the back of the net midway through the first half and never let go of the lead. Controlled, professional, and exactly what we needed. Second win in the bag, we move. ⚽🔥 \n\n**Record**: 2W-0P-1L \n**Net Units**: +1.6u \n**Form**: ✅️❌️✅️ \n\n⚽️Soccer | 🏴󠁧󠁢󠁥󠁮󠁧󠁿EPL | Manchester Utd vs West Ham | 3:00pm EST \n\n**Today's POTD**: Man U vs West Ham BTTS Yes (-140 Draftkings) [3u] \n\nAlright boys, next pick is up as West Ham travel to Old Trafford to face Manchester United in the final mid-week matchup. I’m taking Both Teams To Score in this one. \n\nBoth defenses have been leaking goals  United with 20 conceded, West Ham with 27, the third most in the league. Neither side has shown they can keep things tight at the back. \n\nAt the same time, both teams have more than enough quality to score, and BTTS has hit for each club in 4 of their last 5. All signs point to it landing again tonight. Let’s cash, lads. ⚽🔥 \n\n*Tail responsibly. Bet only what you can afford to lose. DM to join my soccer only betting group on Draftkings.* **BOL** \n\n[Buy Me A Coffee](http://buymeacoffee.com/heftyknight)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns9j9ar/"
    },
    {
      "created_utc": 1764863777.0,
      "author": "Klutzy-Sherbet-3423",
      "text": "Record: 0-0  \nPOTD: **New Orleans Pelicans +12.5 -120**  \n\n\n**Intro**\n\nFirst pick I am posting here. I built an NBA projection model that looks for gaps between standardized team performance and the market. I will only post when the model shows real value, so it will not be an everyday thing.\n\n**Model Details**  \nThe model converts team statistics into z scores. A z score shows how far a team sits from the league average once the league wide standard deviation is applied. This places different metrics on the same scale. From there the model applies weights to each metric to account for how strongly they relate to expected scoring. The weighted values combine into a single team rating. The difference in team ratings is then converted into a projected spread using a K value, which is a scaling factor that maps rating differences onto expected point differentials. Home court is then added and a small rest adjustment is applied when a team is playing without a day off.\n\nWhen New Orleans and Minnesota are compared in standardized terms, the gap between them comes out smaller than the posted number.\n\n**1. Possession creation supports New Orleans**\n\nNew Orleans has a positive z score in offensive rebound rate. This indicates a steady ability to create second chance possessions. Minnesota sits slightly below average here. New Orleans also posts a slightly positive opponent turnover rate, which reflects a consistent level of defensive activity. These areas help prevent Minnesota from creating a large possession advantage and narrow the projected scoring difference.\n\n**2. Turnover control is neutral**\n\nBoth teams sit near league average in their own turnover rate. This keeps the possession balance stable and avoids widening the projection.\n\n**3. Efficiency gaps are real but do not reach the market number**\n\nMinnesota grades higher in standardized offensive and defensive efficiency. The model does register that Minnesota is the stronger team, but the difference in these categories does not translate to a twelve point expectation once the weighted values and scaling are applied.\n\n**4. Pace does not separate the teams**\n\nThe pace related z scores for both teams are very similar. Since neither team is likely to materially change the possession count, pace does not widen the expected margin.\n\n**5. Margin based metrics do not drive the projection**\n\nNew Orleans has negative margin related z scores, but these reflect outcomes rather than underlying predictive factors. Once the standardized performance metrics are applied, the projected difference is much smaller than their season long margins would suggest.\n\nAfter the model applies the weighted z scores, the K value, home court, and rest adjustments, the projected spread falls well below 12. The standardized matchup shows New Orleans as competitive enough in key areas to justify taking the points at this number. Good down to +10.5.\n\nBOL, everyone!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns9iked/"
    },
    {
      "created_utc": 1764860003.0,
      "author": "AMathTeacher",
      "text": "**Record:** 0-1 \n\n**Net Units:** -1.18U\n\n**Last Pick:** Indiana -8.5 (-118) ❌\n\n**Event:**  NHL: MN Wild at CGY Flames (7:00 PM MST)\n\n**POTD**: MN Wild ML (-113). Betting to Win 1U \n\n**DISCLAIMER:** I'm a *low* stakes gambler. Please tail accordingly. \n\n**Write Up:** The Wild have been on a tear recently, going 8-0-2 in the L10 and no one seems to notice that they are currently the number 4 team in the league in points. Their last 10 have also been against some great teams, like the Avalanche, Oilers, etc. Meanwhile the Flames are currently tied for last place in the league. Gustavsson is in net for the Wild and while he hasn't been as good as the Wild's other goaltender, he has been playing better the Flames' goaltender Wolf. I expect the Wild to win this game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns964cx/"
    },
    {
      "created_utc": 1764859891.0,
      "author": "oldpascas",
      "text": "**Record:** 1-0  \n**Last Pick:** Bayern - **M'Gladbach +2** @ -110 **W (4 years ago though, for transparency reasons lol)**  \n**Net Units:** \\+2,73\n\n**Soccer | Premier League | Dec 4, 2025 | 21:00 CET /**  **2:00 PM ET**  \n**Pick:** Manchester United vs West Ham UNDER 3.5 @ 1.62 (1 unit)\n\n**Write up**: This one feels solid. The Poisson model keeps spitting out 64% Under 3.5, and when you adjust for West Ham's creative central player missing (Paqueta red card in the last match), the expected total drops even further - well under our target.  \nWhat's really compelling is the H2H: Last five PL matchups have all been under 3.5 and averaging barely 2.2 goals per game. Man Utd might create chances at home (1.90 xG), but West Ham's offense is gutted right now. The broader Premier League trend backs us too: 72% of matches this season went Under. Even with the tight 1.62 odds, the model shows +8.58% value here. Low-risk play with historical precedent. I'm confident on this one.\n\n**BOL to all of you!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns95rry/"
    },
    {
      "created_utc": 1764858622.0,
      "author": "Flashy_Calendar3995",
      "text": "7-7\n\n➕️ 1 unit\n\nThe Pick: Merrimack Warriors (-8.5 to -9.5) vs. Rider Broncs\n\nTime: 7:00 PM ET\n\nLocation: Hammel Court, North Andover, MA\n\nThe Rationale:\n\nThis matchup presents a severe \"strength vs. weakness\" disparity that heavily favors the home team. Merrimack utilizes a unique, high-pressure 2-3 zone defense designed to force turnovers, a category where they consistently rank in the top tier nationally.1 Conversely, Rider possesses one of the least efficient offenses in Division I, ranking 364th out of 365 teams in offensive efficiency.2\n\nKey Tactical Advantages:\n\nTurnover Margin: Rider struggles significantly with ball security (ranking 310th in turnover percentage). Against Merrimack's havoc-inducing zone, which forces turnovers on nearly a quarter of opponent possessions, Rider is likely to lose shot volume, giving Merrimack easy transition points.2\n\nShooting Void: To beat Merrimack's zone, a team must hit perimeter shots. Rider averages only 4.2 made three-pointers per game, one of the lowest marks in the country.3 Without shooters to stretch the floor, Merrimack can pack the paint and suffocate Rider's offense.\n\nSystem Value: This game fits the \"Opening Home Favorite\" betting system. Historically, mid-major home favorites playing their first conference game of the season tend to outperform the spread, as the market undervalues their home-court advantage relative to their early-season record.1\n\nForecast: Expect a suffocating defensive performance from Merrimack that holds Rider under 60 points, allowing the Warriors to cover the spread comfortably with a double-digit victory.4",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns91x09/"
    },
    {
      "created_utc": 1764857960.0,
      "author": "BubbaCurran",
      "text": "Play of the day Record: 0-0\n\nRecord: 0-0\nNet Units: +0.00u\nROI: 0%\n\nColorado Avalanche -1.5 | DraftKings (1 unit)\n\nThe Colorado Avalanche come into tonight’s matchup against the Islanders looking every bit like a team in top form, riding the momentum of recent strong performances including a 7–2 blowout over Montreal and a solid 3–1 win over Vancouver. With Nathan MacKinnon driving the offense and the top line clicking, Colorado’s scoring upside gives them a real chance to control this game early and often. The Islanders can be pesky defensively, but Colorado’s depth, pace, and current confidence make the puck line appealing. I’m projecting a 4–1 Avalanche win, and while covering -1.5 always carries the risk of a tight, low-event game, Colorado’s firepower makes them well-positioned to win by multiple goals tonight.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns8zy7e/"
    },
    {
      "created_utc": 1764857403.0,
      "author": "AdAggressive6388",
      "text": "Record: 1-2\n\nSport | NHL \n\nPick: Boston Bruins ML +120\n\nWrite Up: well yesterday couldn’t have gone worse. Ducks looked bad the whole game and the mammoth crushed them. Onto the next one and full transparency I am a Bruins fan but… they are a better team then the blues especially with the home ice advantage and for plus money. The bruins pp both defensive and offensive is top ten in the league and should make the difference in this game l. Even without Pasta the Bs should be able to get a win here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns8ybh0/"
    },
    {
      "created_utc": 1764854974.0,
      "author": "Background-Hat2598",
      "text": "**American Football | NFL | Detroit Lions vs Dallas Cowboys - 20:15 ET (Dec 4, 2025)**  \n**Record:** 1-2-0  \n**Starting Units:** 100  \n**Remaining post last bet:** 97  \n**Net Units:** \\-3  \n**Previous Pick:** Nikola Jokic Over 54.5 Points + Rebounds + Assists (PRA) @ 1.83 (Decimal) / -120 (American) ❌\n\n**POTD: Jahmyr Gibbs Over 76.5 Rushing Yards @ 1.88 (Decimal) / -113 (American)**  \n**Units:** 2U\n\n**Reasoning:** Gibbs is straight-up cooking right now. He’s averaging 86+ rush yards per game this season and has cleared 76.5 in 7 of his last 10 when he’s the clear lead back. With David Montgomery still banged up (knee issue) - Detroit has no choice but to feed Gibbs heavy touches — we saw 27 touches for 154 yards vs the Bears and 23+ in recent games. Lions are top-3 in total rush yards and love pounding the rock, especially against a Dallas run defense that’s 27th in YPC allowed (4.7) and gets absolutely gashed up the middle.\n\n**Risk:** Only real worries are if Monty somehow suits up and steals 10-12 touches (doubt it), or if the game script goes full air-raid because Dallas can’t stop anyone through the air.\n\nIf you appreciate the analysis, feel free to support via [Paypal](https://paypal.me/SportsEdges) \\- [Buymecoffee](http://buymeacoffee.com/Saha708). Gamble responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns8rdrb/"
    },
    {
      "created_utc": 1764852102.0,
      "author": "Iloveyoutooeh",
      "text": "**15–14** Net Units: +6.35U Total Risked: 91U ROI: +6.97% \n\n[Last pick](https://old.reddit.com/r/sportsbook/comments/1onupzf/pick_of_the_day_11425_tuesday/nn3mopt/): Bayern DNB + Real Madrid or draw 🤡\n\nLast 5: ✅✅❌❌❌➡️\n\n⚽ | PL | [Time, 22:00 EET]\n\n**POTD:** Man United ML + over 3 corners for United⌛\n\nOdds: 1.6\n\nUnits: [5U to win 3U]\n\n**Write-Up:** United are the better team playing at home, Mbeumo is starting and he is likely scoring/assisting \n\n**Only** bet what you can afford to lose, good luck to everyone.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns8jyrz/"
    },
    {
      "created_utc": 1764850937.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Manchester United vs Westham\n\nTAKE MANCHESTER UNITED ML @ 1.6\n\nManchester United at Old Trafford, eh? I’ve seen this matchup since before remote controls existed, and United usually come out on top. Historically they’ve beaten West Ham far more times and hold a strong Premier League head-to-head advantage. United are averaging around two goals lately, while West Ham hover closer to one, and that difference shows when things get tense. West Ham always fight, but they love gifting one silly mistake, and United at home usually punish it. So take the Manchester United ML, kid. The stats point that way, the crowd helps, and my pp agrees too.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns8hb3j/"
    },
    {
      "created_utc": 1764843418.0,
      "author": "kicsimani",
      "text": "POTD RECORD ⏳\n\nUnits: 0\n\nLast Pick: -\n\nToday: Brooklyn Nets vs. Utah Jazz 231.5 over points @1.93\n\nBoth teams are capable of scoring a lot of points, especially Utah, who are attacking strongly and have a couple of mistakes on their defense that teams are used to using. Brooklyn might be starting to improve, but they need to lead a little stronger attack. They have already scored this many points in games against each other and a possible extension could be to our advantage.\n\nBol",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns82m2e/"
    },
    {
      "created_utc": 1764843283.0,
      "author": "Master-Difference951",
      "text": "POTD Record: 0-0\n\nEvent: NBA: Lakers vs Raptors\n\nPOTD: Austin Reaves 30+ points (+104)\n\nWrite Up: No Luka Doncic, Lakers are going to look to Austin reaves and he’s been killing it recently. Everytime Luka sits out he plays exceptionally and I don’t see this game being any different especially against a sub-par guard defence.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns82dp3/"
    },
    {
      "created_utc": 1764842929.0,
      "author": "san_solares",
      "text": "Net Units: +66.40  \nROI: 20.75%  \nRecord: 38-16-9 (W/L/P)\n\nLast POTD: BTTS NO Burnley v Crystal Palace(W)  \nThree shots from Palace and they did surprisingly score. Still we move. \n\nAs always, full transparency, tracker at the bottom.\n\nToday's POTD: EPL - Manchester United v West Ham - 14.30 PM EST - Manchester United -1.0 Asian Handicap (1.70) - 5U\n\nNever thought I'd say this but Man United is a good team. Probably wouldn't bet in favour of them versus a top 8 team, but we're talking about 18th place West Ham here. They basically have nothing going for them, if Man U wins, they enter top 5 places next to Chelsea.\n\nGame is played in Old Trafford to give us an extra sense of security. Remember the best is Asian Handicap. \n\nBOL, tail responsibly. \n\n[TRACKER](https://docs.google.com/spreadsheets/d/1-PHX-U7eiB5neVpbTJVkzwquGE1KyGVQA5nfejcDT_A/edit?usp=sharing)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns81rlp/"
    },
    {
      "created_utc": 1764841063.0,
      "author": "MrPunter500",
      "text": "**Record: 1-1** \n\n**Net Units: 0.43 units down**\n\nLast Pick: Sonmez 2-0 @ 1.81 ❌\n\nThe underdog took the first set by saving 6 break points but Sonmez dominated the rest of the match and covered the 4.5 game spread, which would have won if I went with that instead of the 2-0. We move on...\n\n**Tennis** | **Challenger Angers (Women)** | **8:30 AM (Eastern Time)**\n\n**Plays will always be shared as 1 unit for fair record purposes**\n\n**Pick:** **Parks vs Dodin - Dodin Handicap +4 Games @ 1.93**\n\nThe surface should benefit both players, who serve big and tend to go for early winners after setting their points with a solid first serve. Alycia Parks will likely have a better career than Dodin ever had and she's higher ranked but when the two are in form, they play similar tennis. \n\nDodin showed good signs during her first round match and I believe she can keep this one close against Parks. I love this +4 line since something a 6-4/6-4 scoreline is still a push but hopefully Dodin keeps it close or even wins this match, playing in front of her home crowd.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns7ym66/"
    },
    {
      "created_utc": 1764837018.0,
      "author": "this_guy9",
      "text": "POTD Record: 13-10\n\nNet Units: +3.23\n\nPrevious Pick: [❌ Jalen Brunson o2.5 Threes -115](https://www.reddit.com/r/sportsbook/comments/1pbu99d/comment/nrusvtt/?context=3)\n\nBrunson was atrocious on Tuesday. Took yesterday off to get refreshed and come with a banger pick today:\n\n**🏀 Jordan Walsh o5.5 Rebounds +104** vs the Washington Wizards\n\nWalsh's playing time has increased dramatically as of late both as a defensive force and as a putback rebounder. He's averaged 26 min over his L5 against 19.8 on the season.\n\nWith Alex Sarr out, I expect Walsh to be able to bully his way into the paint against a notoriously weak Wizards defense. Wizards rank 29th in the NBA in Rebounds allowed to SFs and 29th overall in rebounding even with Sarr.\n\nWalsh has cashed in L4/6 and his last game against the Wizards in November he got 7 rebounds in 24 min.\n\nJaylen Brown is doubtful for the game as well so expect more playing time / responsibility to go around for the rest of the Celtics.\n\nFull stats if you'd like to do additional research:  [https://www.statpick.ai/19630960/jordan-walsh-rebounds](https://www.statpick.ai/19630960/jordan-walsh-rebounds)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns7ryqe/"
    },
    {
      "created_utc": 1764836452.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 16-8, +7.03u, (ROI +23.8%)\n\n**Previous Pick:** Krka to win by 13 or more, 1.90, 1u ✅️, (last 5: ✅️✅️❌️✅️✅️)\n\n**Event:** Euroleague: Partizan - Bayern, 20:45\n\n**POTD:** under 164.5 points, 1.82, 1u\n\nCoach Obradovic left and gave his irrevocable letter of resignation, and he stayed in Athens after a loss to Pao. Then, later, he decided to come back to Belgrade and meet with the board; he was met at the airport by thousands of fans. Then the club president gave some statements and interviews, then finally Obradovic gave an interview. What became clear, the atmosphere between them was not good, and Obradovic didn't want all the players in the roster, and that he wanted some players the club didn't go for.\n\nAnyway, during this whole soap opera, it became clear that fans are 100% on the coach's side, and they are going to use tonight's game to cheer against the players - they blame them also, but mainly against the president Mijailovic, they already asked for his resignation.\n\nIt is still not clear what they are going to do, whether they leave the arena after the first quarter or something else, but I don't see that anyone is going to have an easy time playing in that atmosphere. Partizan can win or lose; they are a slight favorite, but for both teams to be that inspired despite the conditions that await them to reach the 165-point limit, it would take a miracle. I'm looking forward to seeing if my thinking was sound.\n\nTo add one rumor, there was a talk yesterday that Tyrique Jones refused to play against Asvel, in a one-point loss, since he found out shortly before, that Bruno Fernando* has a bigger salary than he does. That shows enough about the state of the club.\n\n*) edit",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns7r05i/"
    },
    {
      "created_utc": 1764832724.0,
      "author": "Jealous_Disaster4543",
      "text": "**Record:** 0-0\n\n**Event:** NBA 🏀 BOS Celtics @ WAS Wizards 7:00pm EST\n\n**POTD:** Neemias Queta O21.5 PR (-120), 1U\n\n**Write Up:** Jaylen Brown is Doubtful for this game, and Alex Sarr is Out. Both of these injuries open up more usage for Queta. He went for 15 PTS/12 REB about a month ago against this same team. Some more data that supports the pick: \n\n• Washington allows the most PR in the league.  \n• Washington allows the 3rd MOST points in the restricted area (83% of his scoring comes from there).  \n• Queta takes 99% of his shots inside 10 feet, and Washington ranks 28th at defending that zone.  \n• The Wizards play at the 4th-fastest pace, creating more possessions and increased PR opportunities.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns7khnu/"
    },
    {
      "created_utc": 1764832079.0,
      "author": "jaysial",
      "text": "Cricket 🏏 Picks\n \nLast pick was a Loss \n\nOverall: 49💰- 27 ❌\n\n+8.96\n\nLast 10: 💔🥇🥇🥇🥇🥇🥇💔🥇🥇\n\nTodays pick\n\nGulf Giants v MI Emirates \n\nStarts in about 7 Hours ⏳\n\nPick: Total run outs over 0.5 @ 1.73",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns7jame/"
    },
    {
      "created_utc": 1764827427.0,
      "author": "deforandom",
      "text": "**Record**: 17-18\n\n**Previous Pick**: Josh Allen Anytime Touchdown +120\n\n**Pick**: Detroit Lions ML (-160) vs Dallas Cowboys\n\n**Write-Up**: Going to keep it very short here... I know Amon Ra' is out, but the Cowboys' hot streak is due to lose... The Cowboys are frauds at heart, and they might make this an interesting game, but the Lions should win this game in the end. \n\nLet's bring this trash record back to neutral tomorrow with Lions ML! \n\nBest of luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns7aa4y/"
    },
    {
      "created_utc": 1764826563.0,
      "author": "NinjaSanta02",
      "text": "**POTD Record (2025-26 Season): 1-1**\n\n**History:** Been off for a while, but we back. Gonna be trying my luck at a $400-$10000 challenge (my unit size is $400), aiming for five straight wins to get to that magic $10k mark. Switching it up a bit this time - I'm a massive Pels fan (tough life trust me), and I know this team inside out, so for this run I’m only betting on Pelicans games. Hopefully we nail the five wins straight off the bat, but either way I’m grinding until we hit that $10k.\n\n**Win Streak**: ❌ ✅\n\nActually kinda sweaty, but we cashed regardless. Playing Twolves again, so feeling good about this read.\n\n**Wager:** $760 (Day 2)\n\n**Pick:** New Orleans Pelicans v Minnesota Timberwolves | Trey Murphy III O 29.5 PRA + Saddiq Bey 10+ Points @ 2.10\n\nWriteup coming, on the train will writeup once home\n\nIn his last five games he’s averaged 32.4 PRA, but the more relevant split is his 36 PRA across his last five without Zion, and Zion is out for at least a month. Still, this play is mainly about the matchup after watching last game with the Twolves.\n\nEven tho Saddiq Bey usually takes most of our boards, he ended up stuck on the perimeter with Randle, which left Trey to completely clean up inside. Last game he had 33 points, 15 rebounds, and 4 assists, and I'd expect a similar matchup here. Fears will likely take Ant, Bey will take Randle, and Trey will again be in the corners to crash the boards.\n\nOn the scoring side, he and DQ have started running a lot more pick n roll together. DQ sets the screen, Trey drives and has been working on a little throw line floater, which I saw him try at least five times last game. Expect more of those looks, plus increased three point volume as he settles into the primary option role without Zion.\n\nOverall, massive upside in this matchup and a clear path to another big stat line. Little bonus would be sprinkling a little on the double-double because why not.  \n\nFYI for Saddiq, he's averaging 20.2 ppg in his last 6 games and taking nearly 14 shots per game and 6 threes. Definitely taking 10+ points to boost the odds.\n\nBOL if tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns78hmq/"
    },
    {
      "created_utc": 1764824163.0,
      "author": "schleperr",
      "text": "Record: 0-3, -3u\n\nPrevious Pick: Louisville -4.5 Alt Line ❌\n\nToday’s Pick: NCAAB USF +1.5 -110 vs Utah State\n\n1U to win 0.91U\n\nWrite Up: Ok so I am sensing a pattern and I hope you guys are too. We may not be cashing these picks but we are HOT in a way. Do with this pick what you will/should do and I will see you again Friday with another POTD.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns738s6/"
    },
    {
      "created_utc": 1764823920.0,
      "author": "derfderf00",
      "text": "Previous Pick: Previous Pick: Patriots v NYG, under 46.5 🚫\n\nRecord: 1-1\n\nHonestly we almost had this despite 37 points in first half. If the giants dont get that 2 pt conversion it hits. But cant complain too much when we benefited from missed field goals \n\nOn to TNF.\n\nPick: COWBOYS V LIONS, under 54.5, 8:15 EASTERN.\n\n5 STAR PLAY, PLAY OF THE WEEK.\n\n2 great offenses with okay defenses going at it indoors? Yeah that's right im betting the under here. \n\nCowboys defense has been performing much better as of late.\n\nLions offense has too many injuries to deal with, but not to Gibbs. \n\nIf either of these teams gets up they are going to run run run. And the defenses aren't going to be able to stop them milking this clock. \n\nAnd honestly its just the number. Way too high and too much respect and every stupid bettor is gonna want a piece of that over in a standalone game. \n\nRecommend waiting till just before kickoff, could see this number hitting 56. \n\nAll picks about -110.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns72op3/"
    },
    {
      "created_utc": 1764823784.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 177-132\n\nSeason record: 14-9\n\nLast POTD: __Jalen Johnson O40.5 PRA @1.83 1U__ 🅿️\n\nToday’s POTD: __Payton Pritchard O20.5 P @1.76 1U (Bet365)__\n\nNBA | Celtics vs Wizards | 🏀  \n\nJalen Johnson got downgraded to questionable outta nowhere and later got ruled out. This bet voided\n\nJalen Brown is doubtful to play tomorrow, I’m expecting him to sit this one out against a bad Wizards side who they’ll manage without in this matchup. Pritchard feels like the move immediately as the main scorer imo, I don’t trust White enough and what I know with Pritchard is that he’ll get his shots up. \n\nSmall sample size but without Tatum and JB he’s avg 25.6 PPG and is over in 3/4 games as a starter dating back to last season.\n\n31, 38 (against the Wizards), 15 & 34 points.\n\nHad 18 points earlier this season against the Wizards WITH Jaylen Brown playing.\n\nWizards are ranked 22nd in spot ups, 24th against the PR ball handler & 30th in transition points all of which are Pritchards top 3 main play types. Wizards have allowed 2nd most points to PG’s this season aswell.\n\nFine with playing this up to 22.5, think Pritchard gets a great matchup and without JB he’ll need to step up.\n\n\n\n🫡 https://ko-fi.com/billycapezzi",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns72dci/"
    },
    {
      "created_utc": 1764823133.0,
      "author": "ParlayTeaserPleaser",
      "text": "Hmmmmm everyone on Pickens overs….",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns70uqq/"
    },
    {
      "created_utc": 1764821898.0,
      "author": "Pefkov",
      "text": "Record: 14-9\n\nNet Units: +4.34\n\nLast Pick: College Basketball:  UConn @ Kansas O142.5 Total Points Scored (-115 on DK) 1u to win 0.87u ❌\n\nTodays Event 🏈 NFL Thursday Night Football Cowboys @ Lions 7:15 PM CST 🏈\n\nTodays pick: Cowboys @ Lions o54.5 total points scored (-114 on DK) 1u to win 0.88u\n\nWriteup: Cowboys head off this Thursday to face the Lions in Detroit. Lions are favored with a -3 spread, no surprises as it's a home game. What's interesting is that this game is likely a fight for the wild card. Whichever team loses could very well be out of contention, which means both teams will be giving it their all. Not to mention it being a primetime game.\n\nCowboys have hit this line in 7/12 games while Lions have hit this line 6/12 games this season. Cowboys hold the number 1 rated offense and the 30th rated defense while lions are the 3rd rated offense and 14th rated defense. This is looking to be an offensive battle type game, While Lions may be without Amon-Ra, they also lost key cornerback Terrion Arnold which should allow the cowboys to light them up. Both teams average just over 29 points a game, and as mentioned with their rankings, these teams are top 5 in offensive yardage. In terms of defense, Cowboys give up 28.5 and lions give up 21.6. However lions defense has been inconsistent in their pass rush and coverage. Javonte Williams has been putting up good numbers.\n\nOverall this game is bound to see some high action from both sides barring any crazy offense related injuries. Both teams have something to fight for more than every. I could see this game going up into the 60s\n\nBOL everyone who tails!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns6xyio/"
    },
    {
      "created_utc": 1764821718.0,
      "author": "Ok-Actuary-4654",
      "text": "POTD Record: 5-0-0 (+23.40 units)\n\nStreak: 5W\n\nLast 10: WWWWW \\_ \\_ \\_ \\_ \\_ \\_ \\_ \\_\n\nLast Pick: Milwaukee Bucks Moneyline (+135) 5 units vs Detroit Pistons\n\nLast Pick Reflections: Great resolve after they got out to a slow start with 5 turnovers and trailed 19-4 7.5 minutes into the game. However, once they shook off the Giannis calf strain injury, they shifted to a zone defense that completely neutralized the Pistons offense. The only thing working for Detroit seemed to be Javonte Green 3's and aside from scoring 7 points on one possession, the Pistons offense felt like it was challenged each trip up the court. Really pleased and impressed with their resolve to come back from 18 down to win this game. Glad to have gotten the win on this underdog!\n\nEvent: Dallas Cowboys vs Detroit Lions NFL\n\nPOTD: Detroit Lions -3 (-105) 5 units\n\nI don't entirely trust the Cowboys recent surge after winning 3 straight against relatively struggling teams (Raiders, Eagles, Chiefs). Part of what I attribute their recent victories may in part be the recent passing of Kneeland (RIP) and fighting to play for him. However, I feel like their surge ends here as the Lions pose a different challenge in terms of their coaching expertise and offensive scheme. With Amon Ra injured last week, the lions quickly pivoted to an offense that prioritized crossers, namely by bringing Jameson Williams on a lot of cross-field routes. I anticipate a similar gameplan will be in store tomorrow and expect Gibbs to also have a monster game on the ground. The Cowboys IIRC under Eberflus play a very low % of man, almost <10% if I had to guess, and they get absolutely gashed in zone coverage. Yes, the lions are unlikely to have Amon Ra St. Brown tomorrow and yes the Lions have lost 2 out of their last 3, but I think this is a great bounce-back spot for them and to be honest when I watch them play, they rarely make mistakes in that they don't give you a lot of turnovers and capitalize on their red zone opportunities. The cowboys on the other hand strike me as a high risk high reward offense. Yes, lamb and pickens are very likely to get their fair share, but if 1 of them can be neutralized, which I trust Campbell to do, then the Cowboys quickly become a very lackluster offense in my opinion. \n\nJust to reiterate, in conjunction with my model, I use the eye test as well as my gut feeling to play what I believe is the most-valuable pick on the slate. Cheers to a great game, and please remember to gamble responsibly and to only wager what you can afford to lose.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns6xipa/"
    },
    {
      "created_utc": 1764820919.0,
      "author": "whidswhinners",
      "text": "**2025 NFL Record:** 20W - 9L  \n**2025 MLB Record:** 4W - 1L  \n**2025 NBA Record:** 4W - 4L  \n✅✅✅❌✅✅✅✅❌🩼✅✅✅✅  \n❌✅🪝✅✅✅❌✅✅✅❌✅❌✅  \n✅✅❌✅❌❌✅❌❌✅✅✅✅❌\n\n**Net Units:** \\+8.56 units (I only promote 1u wagers)\n\n**Last Pick:** Tyrone Tracy Jr - o2.5 Reception (-125 on BetMGM)❌\n\n**Event:** NFL: Cowboys vs Lions (8:15PM EST)\n\n**Today's Pick:** George Pickens - o25.5 Longest Receptions (-128 on Fanduel)\n\n*George Pickens is a true deep threat with a big target share, high average depth of target, and a long history of 20+ yard catches.*\n\n*Over in 7 of the last 9 games this year. Also over in 12 of 15 last year with a worse QB (80%).*\n\n*The Lions play aggressive, man-heavy coverage and are near the top of the league in explosive passes allowed – a look Pickens thrives against.*\n\n*• Detroit’s defense is allowing strong yards per catch and frequent chunk plays to wide receivers, especially off play action.*\n\n*Injuries (Kerby Joseph) and shuffling in the Lions’ secondary increase the odds of a blown coverage or lost 1-on-1 downfield.*\n\n*The game is projected to be high scoring with plenty of passing.*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns6vjr6/"
    },
    {
      "created_utc": 1764816291.0,
      "author": "ControlRoyal1768",
      "text": "Record: 27-18 (+25.39u)\n\nLast 10:💰✖️✖️💰✖️✖️💰💰✖️✖️\n\nLast POTD: 🏀 Tennessee -6.5 (-110).\n\nWriteup: So Michigan State was able to blow out their opponent, but Tennessee couldn’t even win. Really rough couple of weeks for us, hoping to turn this around\n\nToday’s POTD: 🏈 George Pickens longest reception over 25.5 yards (-115).\n\nGame starts at 8:15pm EST. Bet 2.25U\n\nWriteup: For Thursday Night Football, we have the Detroit Lions hosting the Dallas Cowboys. Both of these offenses are incredibly explosive, with the Cowboys offense being on fire recently thanks to being one of really only 3 teams in the NFL who have 2 star WRs on the same team. While CeeDee Lamb was the main beneficiary of this offensive success last week, George Pickens has actually been the one who I’ve found to be more impressive over the last month. Pickens has hit this number in his past 3 games, and Lamb has hit this number in 4 of his past 5 games. While it may feel like a coin flip as to who to select, the selection comes down to defensive matchup. The Lions have been playing a lot of man defense this year, and George Pickens is averaging twice as many yards per play as Lamb against man coverage. Additionally, the Lions have been one of the worst defenses in the league against explosive plays, and have given up a reception of this yardage every single game this season. While I do think the Cowboys can keep this game close, I think there is a good chance that the Lions have gotten a wake-up call and realize they need to play at an even higher level to make it into the playoffs. They could have a decent lead in this game, thus causing the Cowboys to throw even more and giving us more opportunities for Pickens to catch a reception of 26 or more yards.\n\nRemember to only bet what you can afford to lose, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns6j9v7/"
    },
    {
      "created_utc": 1764816093.0,
      "author": "silent-winger1012",
      "text": "Record: 0-0\n\nNet Units: n/a\n\nROI: n/a\n\nFootball | NFL | 8:15 pm / EST\n\nPick: Dallas Cowboys ML (+140) 3u\n\nWrite up: Take this with a grain of salt as I am a Lions fan so could potentially be over dramatic, but I feel pretty good about this pick. \n\nYes, the Lions are at home, and yes, Dan Campbell hasn’t lost two in a row in years. However, I feel pretty confident that this Lions defense won’t have many answers for this red hot Dallas offense and I don’t think the Lions currently have an offense that is at a level where it can bail them out against good teams. \n\nNo stats here, but I know from watching that the Lions play A LOT of man coverage and currently aren’t getting home at all with their pass rush. Couple those two features with the fact that they have to find a way to shut down Pickens AND Lamb AND all the other Cowboy weapons makes it hard to believe the Cowboys dont put up 30+ points. Also, the Lions number one cover corner just got placed on IR and their all pro safety has been out for a handful of weeks and won’t be returning tomorrow. \n\nOn offense, the Lions have an O line that is currently serviceable in run blocking, but not so much in pass blocking. They have a QB in Goff who has little to no ability to make anything happen without a clean pocket, are missing their top 3 tight ends, and might be missing a couple of O linemen AND Amonra. \n\nAgain, maybe I see more of a dumpster fire than a non-lions fan would, but really the only way I see the Lions pulling this one out would be behind another 250+ yard performance from Gibbs which I am not going to be putting money on. \n\nBOL to all bettors!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns6ipy2/"
    },
    {
      "created_utc": 1764815265.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 203-151\n\nUnits Won: +118.86u\n\nLast Pick: Grim>HexT Map 2 Kills + Snappi U 14.5 Kills Map 1 (+132)✅\n\nToday's Pick: **NOVAQ Map 2 ML (-122)** 5u vs. FORZE Reload ✅\n\nhttps://preview.redd.it/pwfrzymzk35g1.png?width=875&format=png&auto=webp&s=495c22d363a806596810210b377b784b9cd41715\n\nGame/League/Time: Counterstrike 2 (CS2) | NODWIN Clutch Series 3 | 7:00 AM EST.\n\n**Writeup:**\n\n\\-NOVAQ and FORZE Reload take each other on in the 1-0 game in Nodwin, FORZE Reload have been on fire are 8-1 in the last 9 and have finally hit stride with their new roster of Goody and youka, NOVAQ have been a bit less consistent but are still in great form relatively to where they were 3 months ago when most thought of them as a tier three team, they have won 4 of their last 5 matches as well including coming off a complete blowout yesterday in round 1 of Nodwin Series winning 13-1/13-8\n\n\\-NOVAQ have side selection in this game, in Nodwin Series 2, when they had side choice they elected to be team B in the veto in 3/3 matches, see no reason why this would change today, they should pick their map 2nd\n\n\\-FORZE Reload ban Inferno, NOVAQ ban Overpass\n\n\\-FORZE Reload pick Nuke, **NOVAQ pick Dust 2**\n\n**Dust 2 Stats:**\n\n* NOVAQ are 80% winrate on 20 maps of Dust 2 in the L3 months\n* NOVAQ ae on a 4W streak on Dust 2, in the last week they are 3-0 winning 13-6 against SPARTA, 13-4 against QWENTRYZ and 13-1 vs. Basement Boys\n* NOVAQ are 83% winrate (10-2 record) in the last month on Dust 2. They are averaging an absurd 64% winrate on T side of Dust 2\n* FORZE Reload are 55% winrate on 31 maps of Dust 2 in the L3 months\n* FORZE Reload are 47% winrate on 15 maps of Dust 2 in the last month (7-8), they are coming off a blowout loss against Partizan today which they lost 13-3, they also have lost to Flame Sharks 13-6\n\n**Head to Head:**\n\n* NOVAQ are 2-0 h2h against FORZE Reload, both matches happened in early November \\~1 month ago\n* NOVAQ won on 11/6 against FORZE Reload, they picked Dust 2 and won the map 13-4\n* NOVAQ won on 11/8 against FORZE Reload, they picked Dust 2 and won the map 13-3",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns6gdlc/"
    },
    {
      "created_utc": 1764811425.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 10-7-1 \n\nStreak: 1L ❌\n\nNet units: +1.56u All bets are 1 unit.\n\nLast POTD POTD 12/1/25: Brian Burns to record a sack (-120 Bet365) ❌\n\nToday's POTD 12/3/25: Javonte Williams O65.5 rushing yards (-110 Bet365)\n\nEvent: Cowboys @ Lions 6:15MST\n\nWrite Up: The playoff race is getting tight and these two teams are still searching for their spot into the NFC. One team is trending upwards and the other heading the other direction. I know a lot of people will be looking to pick up all of the wide receiver props this game which I believe will turn out to be good picks in what has the makings to be a high scoring offensive affair. But Javonte Williams has certainly found his stride in the Dallas backfield this season and I believe he has a big game upcoming this week. \n\nJavonte Williams is a true workhorse, he currently ranks 1st in the league in snap share with 52.2 snaps per game. He currently averages 16.5 carries per game with the highest YPC average in his career (4.8).\n\nAlthough the Lions have been a top ranked run defender throughout this season, they have been leaky in their last 3. Over that span they have been allowing 131 yards average per game and over 52% of their opponents offensive snaps were runs. \n\nWilliams has hit the over in rushing yards in 9/12 games this year and I predict with his usage alone he will clear this line.\n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns65mtr/"
    },
    {
      "created_utc": 1764811010.0,
      "author": "Square_Print_9822",
      "text": "**Pick Record: 36W - 25L    (Push: 1)**\n\n**Form: ✅ ✅ ✅✖️✅**\n\n**Previous Pick: Arsenal Over 5.5 Shots on target @ 1.72 ✅**\n\n**7 SOT!**\n\n**—**\n\n**Today's Pick: Manchester United over 4.5 Shots on target and Over 3.5 corners @ 1.70\\\\**\n\n**Manchester United vs West Ham**\n\n**Bounced back and time to keep things steady again.**\n\nGonna keep this one shorter. United are now in a position where a win can put them level on points with Chelsea, now, United aren't necessarily the team to take opportunities given to them, but i see them putting up more than just a fight tomorrow.\n\n**In United's last 5 games, they've covered this line in 3/5 of those games** \n\n**Crystal Palace: 6 SOT, 4 Corners**\n\n**Everton: 6 SOT, 9 Corners**\n\n**Tottenham: 2 SOT, 3 Corners**\n\n**Nottm Forest: 6 SOT, 5 corners**\n\n**Brighton: 9 SOT, 1 corner**\n\n**Expecting United to put the pressure on West Ham tomorrow and clear most of the line in the first half.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns64hqk/"
    },
    {
      "created_utc": 1764810740.0,
      "author": "dreamchasing1",
      "text": "Record: 232-220 Net Units: -28.59 51-53 on 1.5u plays, 38-40 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [England Premier League] Wolves vs Nottingham\nLast pick: BTTS @ 1.80 - 1.5 units loss\n\n\nEvent: Soccer/Football, [Serbia Super Liga] Crvena Zvezda (Red Star) vs Cukaricki\n\n\nPick: BTTS @ 1.80 - 1.5 Units\n\n\nBoth sides have seen overwhelming majority of their games hit this line this season. Zvezda do not usually focus on clean sheets especially in the Serbian League. The last 5/6 meetings between these two teams hit a BTTS. Currently, in 7 home games, Zvezda hit a btts in 5 of them. Cukaricki have played 6 away, hit btts in 5 of them. In general Cukaricki have covered this line in 12/15 games, also covering vs the other top team Partizan with a 4-1 win for Cukaricki.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns63r51/"
    },
    {
      "created_utc": 1764810122.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 3-1 (+2u)\n\nPrevious Pick - ✅ Utah Mammoth vs Anaheim Ducks o6.5 goals -115 (1.15u to win 1u)\n\nThursday’s Pick - George Pickens TD +125 (1u to win 1.25u)\n\nAre the Cowboys are good? We’re expecting a lot of points here in this one (Dak Prescott o1.5 passing TDs is -181). I like one of those to go to Pickens. The Lions play a lot of man defense, which you gotta like if you’ve been watching Pickens this year. \n\nA lot of other ways to get in on Pickens, but here is a way to do so with + money.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns621m7/"
    },
    {
      "created_utc": 1764809343.0,
      "author": "Agitated-Ad3361",
      "text": "Record: 1-1 (±0.00 units ROI)\n\nSoccer | Eerste Divisie 🇳🇱| Vitesse vs. De Graafschap\nPick: Over 3.5 Goals +100 (bet365) | 2 units\n\nWrite Up:\n\nWe’re back at it after Manchester City couldn’t get the job done, bringing the record to 1-1. For today’s pick I’m heading to the Netherlands again, where the numbers point strongly in one direction: goals.\n\nDe Graafschap’s last four away games have been absolute chaos, producing 19 goals in total. That’s an average of 4.75 goals per match, with over 3.5 goals cashing in three of those four and both teams scoring in all four. Their away matches are wide open, full of chances, and usually turn into end-to-end football.\n\nVitesse at home follow the same pattern. Three of their last four home games have also gone over 3.5 goals, and BTTS landed in three of them. They’ve been leaky defensively but dangerous going forward, exactly the type of matchup that fits perfectly with De Graafschap’s high-tempo away style.\n\nWith both teams consistently producing high-scoring games and both conceding regularly, this has all the ingredients for another goal-heavy affair.\n\nPick: Over 3.5 Goals\nStake: 2 units\n\nLet’s look for a bounce-back winner here",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns5zu0i/"
    },
    {
      "created_utc": 1764809136.0,
      "author": "Playful_Stretch5893",
      "text": "Record: 7-7\nLast Pick: finally partizan doesn't f me over, they got demolished by Fenerbahce and Zvezda kept it close losing only by 3 points which breaks our losing streak.\nForm(oldest->newest):❌✅✅✅❌✅✅❌✅❌❌❌❌✅\nToday's match: Partizan vs Bayern Munich (Euroleague)\nPick: Bayern +6.5 (1.53)\nUnits: 3\nWrite up: Saw this pick a while ago, and i feel it is a very good one, here's why.\nPartizan is currently facing a very tough time in it's history, Zeljko Obradovic resigned a few days ago (those who don't know a Partizan and Europe Basketball coach legend) after a disappointing set of results. Partizan have not yet found a new coach, and if i remember correctly the new interim coach will be Mirko Ocokoljic, one of the staff of Zeljko's time in Partizan.\n\nNow, Partizan is playing at home and shock therapy proved to be very effective in european basketball, i don't feel it is going to be as effective as always. Firstly, Partizan didn't get any new players, Carlik Jones is still injured, and the only one who can be a replacement for him is a 36yo Nick Calathes... \n\nSecond, Partizan fans are currently very hostile to both its club president, and their own players, one for getting rid of their best coaches in their history, and the players because of their non-commitment in their way of playing. Frankly i expect a very hostile arena, which will probably not be fully sold out, which will lessen the impact of home advantage.\n\nNow, i think this sits on the shoulders of Bayern to not be completely shit, and that's why i gave Bayern a sizeable 6 point lead because even if somehow Partizan starts playing better immediatly, which i don't feel like it will happen, i think Bayern can keep it close or to say Partizan will beat itself to death( note 25:0 series against Panathinaikos, 16:2 against ASVEL, and 20:0 against Monaco).\nBOL to everyone who tails🍀",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns5z8pm/"
    },
    {
      "created_utc": 1764807967.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 16-9 (+16.19$)**\n\nTexas kills our streak…\n\nLast POTD: CBB Texas Moneyline -148 vs. UVA (2.50$ TO WIN 1.68$) x\n\n**POTD: NFL Cowboys vs. Lions O45.5/Dak & Goff 500+ Passing Yards -135 (2.50$ TO WIN 1.85$) DRAFTKINGS ONLY\\***\n\n***FANDUEL USERS:*** *I do not use FanDuel, but I do know that FD does not offer the passing yards prop in my POTD – I looked on FanDuel and these are two good options to play:* \n\n*1. Dak & Goff 550+ for +120 (good value) - Found under Passing Game Specials on FanDuel*\n\n*2. Goff 250+ passing yards for -125*\n\nWrite up: My model says this is the top play for the day. I will always try to get odds that between +100 & -120 for you all. Model is having this is the best bet today. We are back with the 2-leg parlay.\n\n• ⁠Have been playing around with spreads and over/under with the model and we are 4-0 since parlaying both\n\n• ⁠Model is showing Cowboys has a 51% chance of winning – showing that it should be a close game\n\n• ⁠ Model says Texas has a 54% chance of covering the O54.5 total points\n\n• Model is projecting Cowboys with the points, and I believe Dak and the boys are going to have to sling it – I believe Goff will have to sling it as well\n\n• This game is going to come down to the wire, and I think whether it’s the Cowboys chasing the Lions or vice-versa, the last drive will help with the passing yard prop\n\nLet's stay hot.\n\nBOL!\n\n**POTD: NFL Cowboys vs. Lions O45.5/Dak & Goff 500+ Passing Yards -135 (2.50$ TO WIN 1.85$)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns5vulu/"
    },
    {
      "created_utc": 1764807959.0,
      "author": "DrRippples",
      "text": "**POTD Record:** 2–2\n\n**Net Units:** \\-0.92U\n\n**Last pick:** [Rashee Rice Longest Reception Over 23.5 ✅ (+2U)](https://www.reddit.com/r/sportsbook/comments/1p7mln0/comment/nr39tvb/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nNFL | Cowboys @ Lions | 8:15pm EST\n\n**POTD:** George Pickens Longest Reception Over 26.5 (-112) (2U)\n\nPickens profiles exactly like the WR2s who have burned Detroit deep this year: outside vertical guys such as Addison, Burks, and Slayton, who posted longs of **31, 37, and 30** against this defense. Pickens’ own game logs show repeated spike plays (longs of **37, 39, 43, 44, 45**) that come **almost entirely on boundary go balls and deep sideline throws, which is where Detroit has been most vulnerable.** After cashing Rashee Rice’s LR over for +2U, we’re going back to the same well: **a true vertical WR2 against a defense that has already shown it can give up 30+ yard shots to that exact archetype.** Pickens has gone over this line 7 out of the last 10.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns5vttp/"
    },
    {
      "created_utc": 1764807921.0,
      "author": "GeraltDuke",
      "text": "POTD Record: 1 - 0 \n\nPrev Pick : Knicks -8.5 @1.8 1u to win 0.8u ✅🔨\n\nNet Profit : +0.8 Units\n\nEvent: NFL |  Cowboys @ Lions | 8.15PM EST\n\nPOTD: Jared Goff O249.5 Pass Yds @1.8 1u to win 0.8u\n\nWrite Up:  \n \n\nListen, I’m not saying Jared Goff is suddenly turning into peak Marino, but the man’s been dealing this season like he’s trying to get a Christmas bonus early. He’s averaging around 252 yards per game, which means this 249.5 line is basically the sportsbook saying, “Yeah, let’s hope he has an off day.” Cute.\n\nAnd let’s talk matchup,  the Dallas Cowboys pass defense has been more generous than a grandma on thanksgiving , they’re giving up about 251.5 passing yards per game, which is literally above the line we need. So unless the Lions decide to turn into the 1985 Bears and run it 45 times, Goff is gonna have opportunities. Volume is there, matchup is there, and the man loves a clean pocket like he loves a good play action rollout.\n\nPlus Goff already cleared this number in 7 of 12 games this year. That’s 58% and now he gets a defense that lets opposing QBs move the ball like a morning traffic jam. One or two chunk plays to whoever’s healthy, and suddenly you’re staring at 260+ yards before you can say “Cash me out.”\n\nSo yeah, Goff over 249.5 isn’t just a bet. It’s a polite handshake between him and the over column. If he doesn’t hit it, I’m checking the Wi-Fi, because something glitchy had to happen.\n\nDrop the ticket. Let the yards fly. ✈️📈",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns5vptm/"
    },
    {
      "created_utc": 1764807741.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 58-28-1 (+66.95u) *4-Win Streak*\n\n__Previous Pick:__ [✅TreVeyon Henderson o63.5 rushing yards (-115), 3.45u](https://www.reddit.com/r/sportsbook/s/mlyldOGxu6)\n\n__Event:__ NFL: Cowboys @ Lions 8:15pm EST\n\n__POTD:__ *Same Game Parlay:* George Pickens 60+ receiving yards & Jameson Williams 60+ receiving yards (-120), __5u to win 4.17u__\n\n__Write Up:__ Couldn’t let 2025 end without a __5u MAX bet.__ The Dallas Cowboys (6-5-1) are traveling to Detroit to take on the Lions (7-5). The Lions are coming off a 24-31 loss to the Packers at home on Thanksgiving, their 3rd loss in their last 5. Dallas is coming off a 31-28 win over the Chiefs also on Thanksgiving, extending their 3 game win streak, with 2 straight wins vs last year's Super Bowl finalists. The Cowboys defense has been atrocious, but their offense has been one of the best in the NFL. __Dallas is averaging 29.3 points per game, 2nd best in the league.__ Against another high powered offense in Detroit, the Cowboys should put up more big numbers.\n\nThis Dallas offense is coming in hot, scoring 24+ in 3 straight games, including two 30+ point games. Their high scoring has come from the elite trio of QB Dak Prescott & WR’s George Pickens & CeeDee Lamb. __Dak has been slinging it, averaging 8.7 yards per pass (2nd in NFL). That’ll continue vs a Detroit defense that’s allowed the 3rd most yards per pass in their last 3 (7.9 yards) & have given up the 3rd most yards per pass (11.9) this year.__ But not only has Dallas been throwing the deep ball a ton, they’ve also been doing so efficiently. __The Cowboys lead the league in EPA as a passing offense (117.8). Detroit is last in the league in EPA as a pass d over the last 4 weeks (-37.1).__ Dak has thrown for 300+ yards in back to back weeks vs stout defenses in the Chiefs & Eagles. He has thrown multiple passing TD’s in 7 of his last 9 games. He’s avg the most passing yards per game in the NFL (271.8), while also being the only QB with over 300+ completions. His 75.3 QBRating leads the NFL. Their offense has ran the ball at low rates this season. The Cowboys rank 26th in run play % (40.5%). They’ve averaged just 1.62 yards before contact (7th worst), while Detroit has been decent allowing around the league avg at 1.76 ybc. When the Cowboys have had success on the ground it has come from Zone concepts with a 51.8% success rate (7th), compared to Gap runs that have a 44.3% success rate (28th). The bad news for Dallas is Detroit is the 3rd in the NFL at defending Zone runs, allowing just 3.47 YPC (3rd) & a 41.1% success rate (3rd). Dallas is going to air it out a ton this game, as the Lions have been getting burned by the deep ball lately. __Detroit gives up the 2nd most explosive passes (20+ yard passes) in the NFL (5.7%). They’ve allowed 41 catches of 20+ yards, & 6 of 40+ yards. Since Week 10, when defending passes of 20+ Air Yards, Detroit has allowed: 17.6 yards/attempt (31st), 137.1 passer rating (32nd), 52.0% completion % (31st), 3 pass TDs (32nd), & a -1.12 EPA/dropback (32nd).__ An even crazier stat I found myself going through every single Detroit Box Score in their last 20 games dating back to last season: __The Lions have allowed a 30+ yard reception to a receiver in TWENTY straight games dating back to Nov 2024 when the Jags failed to do so. Detroit has allowed 24 plays of 30+ yards, 2nd most. Dallas has 25 plays of 30+ yards, tied with Lions for most in NFL. The Lions gave up huge gains the last 2 weeks, allowing a league high 17.1 yards per completion to Winston & Love.__ They specifically got torched on passes down the sidelines. Love went 12/19, 165 yards (8.7 YPA), 4 TDs, 130.5 passer rating. Winston was 16/24, 364 yards (15.2 YPA), 2 TDs, 137.5 passer rating. Love’s 4 TDs are the most in a single game on sideline passes over the last 4 seasons. Winston’s 364 yards are the most in a single game on sideline passes over the same span. Cowboys WR George Pickens owns the sidelines. Pickens has had 78+ yards in 7 consecutive games. Since Week 4 he is averaging 108 receiving yards/game. He has the 2nd most receiving yards in the NFL with 1,142 yards. The Steelers traded Pickens this past offseason, their entire WR core has just 1,082 yards. Since Lamb came back from injury, he has tied Pickens in target share (27.8%) with 39.2% of the air yards (10th most) in that span. But where Pickens has excelled the most has been against man coverage. __The Lions are playing man coverage on a league high 40.8% of passing plays. Pickens has 14 receptions of 20+ yards vs man this season, most in NFL (next highest 9). He has 504 rec yds vs man, (next highest 321). Pickens has been targeted on 35.3% of his routes for 4.96 yards per route vs man. CeeDee Lamb averages just 2.44 YPR, as he’s more of the zone threat. When Detroit is out of man, they run single high safety 61.4% of plays, 3rd highest. Pickens has 27.7% of targets & 47.9% of the air yards vs single high coverage.__ Dak excels against man too, ranking 9th in completion rate (59.8%) & 6th in yards per pass (8.0 Y/A). Dak & Pickens are going to connect a ton, & Pickens could clear 100 yards for 3rd time in 4 games.\n\nI’m running out of room but Jameson Williams is now the #1 receiver in Detroit as the Lions will be without star WR Amon-Ra St Brown & TE Sam LaPorta. St. Brown left the game last week vs Green Bay after one drive with a sprained ankle. __Williams stepped up & had a career high 37% target share (4th in NFL), had a 1st Read % of 28.6%, & caught 7/10 targets for 144 yards & a TD.__ That is the highest target share in a single week of his career & something St. Brown has only had 4 times in his 5 year career. He led the NFL in receiving yards last week & had the 2nd highest PFF grade among WR’s (91.2), & that was against the 4th best pass defense in the league (GB allows 284 pass yds 4th). Now he gets one of the worst pass defenses in the NFL this week. __The Cowboys have given up the most passing yards in the NFL (3,234). They’ve allowed 168 receiving yards per game to receivers (4th most).__ Dallas has had a great run defense since acquiring Quinnen Williams on the DL. __Over the past 3 weeks they’ve allowed 3.3 YPC to RB’s (3rd) & allowing 0.33 yards before contact (4th). Detroit ranks 27th in rushing success rate (38.1%).__ Detroit is tied with Dallas in plays gaining 30+ yards on offense (25) & I expect them to air it out.\n\nThese offenses rank 2nd & 3rd in scoring, while each pass d is weak. Detroit had its best games following losses this year, scoring 52, 44, & 34 points. Dallas has scored 57.25 more points than their projected totals, 2nd in NFL. These defenses rank 27th & 30th in red zone TD conversion %. This will be a shootout. \n\nPickens has 68+ in 10/11 games. Williams has 66+ in 5/7 games & all 5 were with Amon-Ra on the field.\n\n__George Pickens 60+ receiving yards & Jameson Williams 60+ receiving yards__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial)  [PayPal](https://paypal.me/joeinglesofficial)  [Bitcoin](https://pastebin.com/raw/GEXAsA2S)  [Venmo](http://Venmo.com/mackenzie-botz-1)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns5v72e/"
    },
    {
      "created_utc": 1764807676.0,
      "author": "defiant_degen",
      "text": "\nOverall record 75W-47L\n\nUnits +59.1\n\nLast pick:\n\nPremier league\n\nPremier League \n\nNewcastle United Vs Tottenham Hotspur \n\nNewcastle win and over 1.5 goals \n\n(1.90) 3 units ✖️\n\nA disgusting bad beat. Newcastle the much better team creating plenty of chances and bossing possession. They took the lead twice , and in the 95th minute Tottenham CB Romero scored his 2nd with a bicycle kick, completely ridiculous, 2 shots on target both going in for Tottenham, what can you do.\n\n\n\nToday's pick:\n \nPremier League \n\nManchester United Vs West Ham \n\nManchester United win & Bryan Mbuemo to have a shot on target.\n\n(1.80) 2.5 units\n\nManchester United host West Ham, United much improved this season, particularly at home , winning 4 from 6 home games, dropping points to Arsenal on the opening weekend, and very unlucky not to get something against Everton.\n\nCunha is expected to return to the attack, he's been a great addition, great at carrying the ball forward and creating chances, taking some of the creative pressure off Fernandes.\n\nMbuemo has also had a great impact, **he's had a shot on target in his last 7 league games in a row** for United, and against a team like west ham he should get alot of shooting opportunities.\n\nWest ham are without their best midfielder in Paquetta, after his ridiculous red card against Liverpool, a big loss for them as they don't have alot of debth on the bench for that position.\n\nI expect United to bounce back at home here, Fernandes Chuna and Mbuemo should all start and they have too much attacking quality for West Ham imo.\n\n\n\nCoffee's always appreciated if you have found my write ups and bets useful ☕\n\nhttps://buymeacoffee.com/willo777\n\n\n**BOL and only bet what you can afford to lose!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns5v043/"
    },
    {
      "created_utc": 1764807392.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pdl7cq/pick_of_the_day_12425_thursday/ns5u68y/"
    }
  ]
}