{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/19/26 (Monday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/",
  "target_date": "2026-01-19",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-18T23:42:29.836138+00:00",
  "comments": [
    {
      "created_utc": 1768778925.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 42-22 (+15.10U)**\n\n**ROI: +19.36%**\n\nLast POTD: [Patriots -3 -118 ](https://www.reddit.com/r/sportsbook/s/YCRagTRPa8) ✅\n\n**POTD: NCAAFB: Indiana -4.5 First Half vs Miami -106 (1U TO WIN 0.94U)**\n\nWrite up: THAT’S 10 IN A ROW! PATRIOTS KEEP US ALIVE!!! - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Indiana 1H ML at 58%\n\n• Model projects Indiana 1H -4.5 at 54%\n\n• EV better betting 100$ = 12-13$ for this play\n\n• College Football National Championship. I want to start off by saying, I was stuck between Indiana’s 1H line and Indiana -7.5 Full Game - Gut told me to role with the 1H so here we are - Indiana averages 20 points in the 1H this year which is top 10 in college football while only allowing around 6 points in the 1H - Miami averages about 14 points in the 1H, which isn’t the best, but is still pretty good - considering how good Indiana’s defense has been, this line drops - The stats of how good Indiana’s defense is in the 1H, compared with Miami’s mediocre 1H offensive side, gives a small edge towards Indiana in this one. Indiana’s run game is one of, if not the best in the nation - Miami is susceptible to big plays on defense, while Indiana in ranked 3rd in 20+ yard rushes - Indiana should be able to control the tempo with their run game, limiting Miami possessions throughout the 1H - Indiana has been pretty dominant in their 1H’s and they seem to catch opponents off guard early - Indiana will come out with an awesome game plan, and I see them being damn near perfect in the 1H - Hoosiers cover -4.5 for us in a low scoring 1H \n\nPOTD History: https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn\n\nBOL!\n\n**POTD: NCAAFB: Indiana -4.5 First Half vs Miami -106 (1U TO WIN 0.94U)**\n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\nhttp://buymeacoffee.com/claysmiith\n\nhttps://venmo.com/u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0dozwz/"
    },
    {
      "created_utc": 1768778812.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Monday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0domwr/"
    }
  ]
}