{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/6/25 (Saturday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pf8gaq/pick_of_the_day_12625_saturday/",
  "target_date": "2025-12-06",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-05T23:40:41.664999+00:00",
  "comments": [
    {
      "created_utc": 1764977043.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 17-9 (+17.87$)**\n\nLast POTD: Pending: 2 Pick Parlay: NBA Nuggets ML vs Hawks / CFB Boise State vs UNLV o48.5 (2.50$ TO WIN 1.91$)\n\n**POTD: CBB St. Bonaventure ML vs. Buffalo / CFB Texas Tech ML vs. BYU (2.50$ TO WIN 1.85$)**\n\nWrite up: This is not a model play FYI - this is a personal bet.\n\n• ⁠Buffalo has put their name on the map this year because for the first time ever, they are 8-0 - they had two good wins, Depaul & Vermont\n\n• ⁠This is MID-MAJOR basketball; anything can happen of course. I believe St. Bonaventure is MILES better than UB, but because of the rivalry and them being on the road, I believe this is why the line is lower than it should be \n\n• Buffalo have 3 guys, Freitag being their #1, the Wisconsin transfer - if Bonaventure can hold him to less than 20 points, I believe they have a big chance of winning\n\n• Bonaventure is deep, playing around 8-10 per game - the bench guys have come up clutch for them when they needed too, and their bench is pretty darn good for being a mid-major program - between Buddy Simmons, Frank Mitchell, Lonati, Charles, Big Joe, and Marshall, Bonaventure have the weapons to beat up on Buffalo\n\n* I do not see anyone stopping Bonaventure's big, Frank Mitchell, and if they do, Bonaventure has enough fire power around him to win them the game - if Bonaventure can slow Buffalo's scorer's down just a touch, they will roll\n* The model is projecting Texas Tech to cover, so I added them as the ML 2nd leg - Bonaventure is only -4 favorites so their ML should be in the 200's something\n\nLet's keep rolling.\n\nBOL!\n\n**POTD: CBB St. Bonaventure ML vs. Buffalo / CFB Texas Tech ML vs. BYU (2.50$ TO WIN 1.85$)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pf8gaq/pick_of_the_day_12625_saturday/nsibtnv/"
    },
    {
      "created_utc": 1764976620.0,
      "author": "juanmeloncamp",
      "text": "Was there a potd thread for Friday? Can't find it",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pf8gaq/pick_of_the_day_12625_saturday/nsianp7/"
    },
    {
      "created_utc": 1764973059.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Saturday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pf8gaq/pick_of_the_day_12625_saturday/nsi0eoi/"
    }
  ]
}