{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/7/25 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/",
  "target_date": "2025-11-07",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-07T03:14:20.898335+00:00",
  "comments": [
    {
      "created_utc": 1762485017.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 188-141\n\nUnits Won: +96.70\n\nLast Pick: AMKAL Map 1 ML (-122) vs. JiJieHao ✅\n\nToday's Pick: **FURIA -2.5 Rounds Map 2 (-120)** vs. The MongolZ 5u\n\nhttps://preview.redd.it/bidbt8xkjqzf1.png?width=575&format=png&auto=webp&s=8ae5fc1fbb569775ab5d5d8c7596e6f57882943c\n\nTournament: IEM Chengdu  \nTime: 4:45 AM EST.\n\n**Writeup:**\n\n* FURIA are picking their map 2nd in this series, they have been on fire with their new roster, this team in my opinion is a dark horse for the upcoming major and they are in great form at the moment. Not only is their roster been great and hitting extremely hard but their map pool is also tremendous with all maps being above 50% winrate and not really having any \"weak\" maps in the pool that are exploitable as a punish pick against them like many teams do have\n* MongolZ are in a bit of a weird spot, they are coming off of benching their best player by far in Senzu, they have a 3-1 record at this tournament so far despite looking pretty shaky at some points throughout the tournament. New pickup Controlez has had a decent tournament so far for how fast he was thrust in to tier one and has had his moments of looking good. MongolZ map pool still seems relatively the same as before with a slightly higher priority on Inferno, but still strong on Ancient/Mirage\n* MongolZ have won the h2h overall against FURIA lifetime but in the last few months (Since FURIA picked up molodoy) the h2h has flipped in FURIA favor, MongolZ were 5-2 with a 9-3 map record against FURIA in early 2025, but in the last 3 months, FURIA are 2-0 in matches with a 5-2 overall game record against MongolZ. \n\n**Veto:**\n\n* MongolZ ban Train, FURIA ban Ancient\n* MongolZ pick Mirage/Inferno, FURIA pick Overpass\n\n**Overpass Stats:**\n\n* FURIA are 83% winrate on 12 maps of Overpass in the L3 months, they are the best Overpass team in the world in my opinion, they have been on an absolute rampage. They are on a 9 map winstreak on Overpass with huge wins over teams like MOUZ/Aurora/Vitality/G2 and more, who are some of the best teams in the world. So far at this tournament they are 2-0 on Overpass with wins against G2/MOUZ. Overpass is a historically very CT sided map which makes it a bit scary to bet on in the traditional sense since mongolZ would start CT side but FURIA have averaged a 58% T side winrate \n* MongolZ are 60% winrate on 5 maps played on Overpass in the L3 months, this is their least played map and despite them jumping out to some strong results with wins vs. TYLOO/GamerLegion/TYLOO, they have lost their last two maps on Overpass losing to HOTU 13-8 and losing at this tournament to HEROIC 13-10\n* FURIA are 3-0 on their own map picks so far this tournament \n* MongolZ are 1-3 on their opponents map pick so far this tournament",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjakc2/"
    },
    {
      "created_utc": 1762479777.0,
      "author": "Initial-Tank-9424",
      "text": "POTD RECORD 10-4 ( +11.6 Unit ) \n\nPrevious POTD : Football - UCL - Totenham Vs Copenhagen - Under 8.5 Shot On Target - Odds : 1.81 ( 4 Unit ) - Time 20:00 ❌\n\nToday's POTD : Football - Serie A - Pisa Vs Cremonese - Under 8.5 Shot on Target - Odds : 1.61 ( 2 Unit ) - 19.45 UK Time\n\nBoth Pisa and Cremonese are fairly average Serie B sides that tend to cancel each other out. Neither team creates a high number of clear chances, and their games are often cautious and tight. Betting on draw in this game might be good but to damn risky. Low odds so going for 2 unit only.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nniw5hw/"
    },
    {
      "created_utc": 1762478109.0,
      "author": "InconsolableBrat",
      "text": "POTD Record: 147-101 | Profit: +93.70u | ROI: 13.1%\n\nSeason Record: 7-5 | Profit: +6.44u | ROI: 15.3%\n\n \n\nLast Pick: Jamal Murray (Nuggets) O30.5 PRA @ 1.89. 3U. ❌\n\nMurray has been an excellent shooter all season but went just 1/8 on 3s, many of which were good looks. He still ended with 25 PRAs, so I don’t think it was a terrible read, just a bad shooting night.\n\n \n\nNext Pick: **Kristaps Porzingis (Hawks) O6.5 Rebs @ 1.84**. 4U play.\n\nReturning to a Porzingis prop for the 3^(rd) time this season because I still believe the Hawks are being careful with his minutes (<27 in each game) and he’s had poor shooting to start the season. Despite that he has put up decent numbers. With Trae out, and him adjusting to life as a Hawk, I expect him to take on more offensive responsibility and play bigger minutes. The Raptors will have Poeltl and Barnes so Porzingis will need to be more aggressive on the defensive glass, similar to the Cleveland game. Also, with Poeltl who operates entirely in the paint, he’ll be near the basket more than usual. He’s over this line in 4/L5 games against the Raptors. This is expected to be a close game, so with big minutes and a 3 day break, I will back Porzingis to cover this line.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnirlxl/"
    },
    {
      "created_utc": 1762477892.0,
      "author": "damagebabee",
      "text": "**POTD** Record 117-02-94\n\nWATFORD VS BRISTOL CITY\n\nDate: 07 NOVEMBER 2025 at 21:00\n\nBET ON: Match odds- WATFORD\n\nOdd: 2.16\n\n\n\n\\- Watford look well placed to win against Bristol City, with Javi Gracia’s return restoring structure and belief. The Hornets’ recent home form — including wins over West Brom (2–1) and Middlesbrough (3–0) — highlights their growing attacking cohesion and defensive solidity. Bristol City, on the other hand, arrive depleted, missing around ten players including both first-choice wing-backs Neto Borges and Mark Sykes. The visitors’ morale is low after consecutive defeats and a heavy 5–1 loss to Stoke. With Watford motivated to push into the top eight and tactically sharper under Gracia, they look primed to capitalise on City’s injury crisis and fragile confidence.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnir0jt/"
    },
    {
      "created_utc": 1762477795.0,
      "author": "dreamchasing1",
      "text": "Record: 221-207 Net Units: -21.89 46-50 on 1.5u plays, 36-38 on 2u plays, 1-2 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Conference League] Samsunspor vs Hamrun\nLast pick: Asian total corners over 9.0 @ 1.85 - 1.5 u lost\n\n\nEvent: Soccer/Football, [Denmark Superliga] Odense vs Silkeborg\n\n\nPick: BTTS + Over 2.5 goals @ 1.83 - 2 Units\n\n\nA great meeting for goals as both teams top the table in total goals per game. Odense have managed to cover this line so far in 11/14 games, at home in 6/7. Silkeborg have covered in 8/14, and in 5/5 away games. The two sides already met earlier in a 2-1 win for Silkeborg, they also met earlier this year in a 2-2 draw. Both sides have no struggle to score either as they've scored on all kinds of teams, even on the strongest ones in the league.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nniqr1n/"
    },
    {
      "created_utc": 1762477632.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nniqb6n/"
    }
  ]
}