{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/25/26 (Sunday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/",
  "target_date": "2026-01-25",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-24T23:42:24.818308+00:00",
  "comments": [
    {
      "created_utc": 1769298044.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 26-25 (+0.1u)\nJanuary Record 11-12 (-1.92u)\n\nSaturday’s Pick ❌ - Machac +3.5 game spread -118 (1.18u to win 1u)\n\nSunday’s Pick - Rashid Shaheed o4.5 rush yards -122 (1.22u to win 1u)\n\nReally interesting play here, but I absolutely love it. Since coming over from New Orleans, he has gotten a carry in 7 out of 10 games and last week in their first playoff game, he got 2 carries. He also returned a TD last week. Now, the Seahawks are out Zach Charbonet. It seems unlikely to me that he wouldn’t get any work in the run game, especially with how well he has played since coming over. In their week 16 shootout game, he got a carry and took it 31 yards\n\nGood Luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1iry5w/"
    },
    {
      "created_utc": 1769297883.0,
      "author": "NukDatJuke",
      "text": "**POTD: 3-0 (+4.72u)**\n\n**Event:** **League of Legends (LOL) - LCK Cup 2026 - T1 vs BNK FearX**\n\n**Pick: Map 1 - Over or Exactly 31:30 Map Duration 2-Way (1.83) 2u to win 1.66u**\n\n**Start Time:** 17:00 KST, \\~8 hours from posting\n\n**Writeup:** Last matches of LCK Week 2 and it starts with a good one!\n\nT1 have been tested on every series so far. They are still undefeated in matches but they have had to work for their victories. Domestically they have not been the strongest in the last few years and it's showing. T1 are very beatable.\n\nFearX on the other hand have been one of the biggest surprises of the first two weeks. They are punching way above their weight class, and are finding ways to win despite being behind. Their most recent test did end in an 0-2 defeat, but that match line does not paint the whole picture. They were competitive against Gen.G, the best team in the league, and they should've won at least one game.\n\nBoth teams have some of the slowest average map durations in the league. T1 average 33:02 per game, on Map 1 they average 32:20. FearX average 31:54 per game, on Map 1 they average \\~33:40. T1 are the favourites here but they have naturally slow tendencies; leaning on strong fundamentals and game management. FearX on the other hand try to push the agenda early, targetting botside to get Diable ahead. FearX have a relatively hard time converting early leads so they tend to slow it down until the midgame as well.\n\nThe key here will be the botside. FearX send a lot of attention that way, securing the early game and dragon count. T1 can be a bit psychotic at times, but when they are behind they let the opponents dictate the pace and force them to play perfectly to win the game. If they don't, they will snatch the victory away through sheer will. If FearX can get Diable ahead, and secure a few dragons, the over will be a breeze. Even if T1 get ahead early, FearX have shown they can stay and prolong games. I don't expect either team to get an insane lead early that snowballs out of control. Should be an exciting series.\n\n**Map 1 - Over or Exactly 31:30 Map Duration 2-Way (1.83) 2u to win 1.66u**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1irg1t/"
    },
    {
      "created_utc": 1769297528.0,
      "author": "Section1ne0h4our",
      "text": "Record: 23-14 (+8.79u)\n\n*Last 5:* ✅✅❌❌✅\n\n**NFL - Los Angeles @ Seattle, 6:30 PM ET, FOX**\n\n***Kyren Williams o65.5 APY (-120) 2.29u***\n\nWe go back to an old friend for championship Sunday in Seattle as the Seahawks host the Rams with a spot in the Super Bowl on the line... With all the talk about the Seahawks 2 headed running game being slashed down to one, **LA have shown their own two headed attack is leaning one way themselves**.\n\nWe are going to challenge the best run D in the NFL - again. We are going to keep our faith in Kyren - again. I have to say, I’m no expert on line balance, but this number is genuinely 5/6 yards lower than I anticipated it would open at, and it has creeped there. **Personally I will be playing this as high as 75**.\n\nThe seasons work speaks for itself: **65 all purpose yards in ALL BUT ONE game this season. He had 95 on 23 touches last season, 96 on only 13 touches in week 11, and 85 on 26 touches 5 weeks ago**.\n\n*His rushing floor has been 46 yards which is low for this range*, but as I’ve emphasized a few times over the last few weeks he’s naturally become a part of the receiving game. **He’s had over 15+ receiving yards per game & 21 total targets in the last 5 weeks**. If Seattle DO show their run D card, Kyren is still showing himself as an option in Staffords progressions\n\nIf the Rams are winning, they are going to have to run the ball… if the Rams are losing the game, they will need to keep Kyren an option to keep Seattle guessing… basically either way **I can see Kyren easily getting 20+ touches tonight**.\n\nWhich means - once again - We’re going to fade the Corum effect. **He only had 6 touches last week**, and has been shaky in his on ball output when he’s gotten them in recent weeks. Playoff time means teams will rely on what they have faith in - **Blake hasn’t hit the ground running now in a few weeks**, as it feels like his inclusion into the overall game plan depends on how he starts. **As a result has clearly shifted into RB2 territory**. He’s still a threat to us, but it doesn’t feel as direct anymore.\n\nI feel like I’m repeating myself as alot of these details and stats have remained the same as the weeks have gone by. **Kyren has been a huge winner for me this year away from Reddit, to the tune of 91%**, let’s hope we can get one more.\n\nLast play review:\n\n***Fulham/Brighton BTTS (-155) 1.5u*** ✅\n\n(Game went to script essentially, a touch late to get there but it really never was in doubt. Good to get back on track, and cheers to these guys for an entertaining, parlay smacking game on the side of things)\n\nBOL if you’re tailing, and if not BOL in general",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1iqc2w/"
    },
    {
      "created_utc": 1769296615.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 25-31-5 (Avg Odds +127)\n\n**Previous Pick:** Danny Ballard 1+ SOT (+100) ❌️\n\n**Today's Event:** English Premier League (Soccer) | Brentford vs Forest (6:00AM PST)\n\n**Pick:** Morgan Gibbs-White 1+ SOT (+110) 1 unit to win 1.1 units\n\n**Write Up:** Nothing is falling our way at present unfortunately, Ballard had a great chance early and just missed the target. West Ham finally started defending and kept him at bay the rest of the game. Great day in the Soccer thread, but we keep falling short on the POTD.\n\nI've taken Morgan Gibbs-White a few times with good success. He is the #10 for Forest and likes to take shots on. With Wood still out, he's the team's penalty taker and usually the captain. He had a tough game in Europa mid week, while I played his SOT there as well, which cashed in the first 10 minutes, he missed a penalty and wound up with 3 SOTs in a big 0-1 loss. I see him coming back for blood today and taking his shots to make up for the mid week match. \n\nI also like this because Igor Jesus is still questionable, and with limited other options there's a non-zero chance they throw MGW back up front as the striker. If they put on Big T or their new signing Lorenzo Lucca, I still expect MGW to take on plenty of shots as neither have had many EPL minutes. \n\nLets get back in the green, BOL and have a great Sunday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1inejd/"
    },
    {
      "created_utc": 1769296560.0,
      "author": "Aromatic_Put_9214",
      "text": "https://preview.redd.it/yhbnlzezqdfg1.jpeg?width=1170&format=pjpg&auto=webp&s=7d3e57df79a411dca39ed7b824168438ce0c13aa\n\nOne of favorite parlays I played",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1in8fd/"
    },
    {
      "created_utc": 1769296391.0,
      "author": "schroer22",
      "text": "2-0\n+3.64 units\nLast pick LaMelo over 6.5 assists\n\nRhamondre Stevenson over 73.5 rush and receding yards (-120 on Bet365)\nTwo units\nGame against the Broncos at 3:30\n\nDon't overthink this one. The Patriots are almost back to the Super Bowl. Stevenson has hit this in five straight, and I expect they'll rely on him heavily with Henderson struggling to be productive. The Broncos play a lot of man defense and blitz as much as anyone in the NFL (were leading the league late in the season with this). I expect quick throws and check downs from Maye. I look for the Patriots to capitalize on a mistake or two by the Broncos and jump to an early lead. They won't milk the clock early on, but slow meticulous drives to wear out the defense which favors more running back touches. Denver defense again the run (3.9 yards per carry for runbingbacks) is good, so I don't want to pick just the rushing prop as Stevenson has only gotten than three of the last five.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1imoxp/"
    },
    {
      "created_utc": 1769296092.0,
      "author": "CMDVN",
      "text": "Chelsea @ 2.02 - €550.00\n\nLast 5 > WWWLL // Profit: €3,019.61\n\nChelsea are CP's bogey team. Unbeaten since 2017 and 7-3-0 in their last 10 meetings. Although the last 3 draws were the most recent, I think today Chelsea will break this small draw streak.\n\nBoth teams come into this contest in bad form, but luckily for Chelsea Rosenior fixed this at the right time. Lost just 2-3 against Arsenal and have won his other 3 opening games they come in way better shape than CP who are winless in 10 games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1ilq48/"
    },
    {
      "created_utc": 1769296091.0,
      "author": "Jave3636",
      "text": "Record: 11-4\n\n\nLast pick:Lamelo Ball over 6.5 assists, easy win, no sweat \n\n\nEvent: Patriots @ Broncos \n\n\nPick: Treveyon Henderson over 8.5 carries (-130)\n\n\nWrite Up: If this looks familiar, it's because this was my pick a week ago on this exact same total. Same reasoning applies here, only moreso than last week because the Broncos are starting a backup QB. New England will most likely be playing with a lead, so they'll be running the ball at least as often as they usually do. \n\n\nHenderson averages 9.5 carries per game, but in the last 12 that average has jumped to 10.5. He's cleared the 8.5 total in 11 of his last 12!\n\n\nThere was clearly a preference for his counterpart Stevenson last week against Houston, but the Patriots like to run the ball, especially with a lead, so there are plenty of carries for both of them, as we saw last week. Henderson has been the preferred back this year (180 vs 130 carries), but even if those percentages reverse again like last week, NE should be running enough to get Henderson double digit carries again. \n\n\nDenver does have a great run defense, and they allow only the 9th most rushing attempts per game with 24.2. A big part of that is playing with the lead though. In their 3 losses, they allowed 29 carries per game, and I do expect this to be a loss for them. The Denver defense is good, but the Houston defense was better than Denver, and they didn't have any issues falling behind so much that they had to abandon the run. I'm picking carries instead of yards to account for the possibility that NE hands it off many times in a row just to bleed the clock. Those runs are usually for 1 or 2 yards. \n\n\nEven if Stevenson gets most of the carries again (though he's averaging 2.5 fewer carries this year than Henderson), I don't think Henderson has any problems hitting his total again.\n\n\nThe other thing to note is that despite 50 more carries than Stevenson, he has only 1 fumble all year compared to Stevenson's 3. So if it comes time to milk the clock, ball security isn't an issue for Henderson.\n\n\nPatriots most likely win, so they won't be below their run attempts average from playing from behind, and if Henderson gets even a third of those 29 carries, he hits his over. Most importantly of all, again, 11/12 over this line, so I'm comfortable going back to the well. If Houston at full strength couldn't hold back Henderson from getting his carries, neither can Denver with a backup QB. \n\n\n\n\nTreveyon Henderson over 8.5 rushing attempts",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1ilq2d/"
    },
    {
      "created_utc": 1769295633.0,
      "author": "Wekken",
      "text": "**Record: 10-10-2**\n\n**Football Record: 26-39-4**\n\n**Basketball Record: 1-6**\n\n**Darts Record: 1-1**\n\n**POTD Units: +7.03**\n\n**Total Units: -1.21**\n\n**Total Units(excl Basketball): +9.39U**\n\n**Last 5:** ✅️✅️❌️✅️✅️\n\n**Sport:** Football\n\n**Last Pick:** Ajax vs FC Volendam - Ajax -1.5 AH\n\n**Upcoming match:** Telstar vs AZ Alkmaar (12:15 CET)\n\n**Pick:** BTTS & o2.5 goals\n\n**Unit stake:** 3U\n\n**Odds:** 1.80\n\n**To win:** 2.40\n\n**Recap + overview(?):**\n\nAjax take care of Volendam 2-0 and another POTD is a winner. It was tight but we keep winning.\n\nIt feels good to be 10-10-2 after starting so abysmal to 2026. Never lost faith and hope you guys trust the process.\n\n2 winning days in a row too, this weekend is going extremely well. \n\nLet's keep riding this momentum.\n\n**Write Up:**\n\nFor today I am going back to the dutch league once again. It has been good to me so far and giving it some extra attention is the right thing to do and keep the streak alive.\n\nTelstar are 8-2 with o2.5 goals and BTTS at home. 9-1 in BTTS by itself.\n\nIn 10 games they have a record of 1-4-5, scoring 17 goals and conceding 22 times. They attract goals at home and this match will be the same.\n\nAZ Alkmaar away from home are 6-4 with BTTS and o2.5 goals. Only slightly favored for my pick.\n\nIn 10 games AZ Alkmaar has managed a 4-1-5 record. Scoring 14 and conceding 16 times.\n\nEarlier this season the game ended 2-1 in favor of AZ. I can see the same happening today. Chance of more goals is higher than less goals too.\n\nTelstar need every point to avoid relegation whilst AZ are in the race for top 3/4 and football in Europe next season.\n\nThis will be an open game and the streak will continue another day. It has been a very good weekend so far, time to end it on a high note too.\n\nFade or tail, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1ik8sv/"
    },
    {
      "created_utc": 1769295327.0,
      "author": "the1theycallsnake",
      "text": "Hello I'm a long time lurker but wanted to start giving out picks based on my model which is +34.7 units over 307 units bets this season. I realize I'm extremely late to the game but will be posting my picks more consistently next season. \n\nElijah Arroyo OVER 6.5 receiving yards - 3 units  -112\n\n• He’s shown he can get yardage when targeted and has made several plays with yards after the catch.\n• 6.5 yards is a very low bar basically one short catch plus YAC, totally reachable if he sees any target. He averages 11.9 yards per catch this season.\n\nGood luck everyone!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1ij8wt/"
    },
    {
      "created_utc": 1769295303.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 44-24 (+14.96U)**\n\n**ROI: +18.33%**\n\nLast POTD: [Florida ML + Alabama ML](https://www.reddit.com/r/sportsbook/s/dnYLCLePu8) x\n\n**POTD: NFL 2 Pick Alt Line Parlay: Seattle Seahawks +5.5 Alt Line + LA Rams +9.5 Alt Line -119 (1U TO WIN 0.81U)** \n\nWrite up: Okay so I am using FanDuel & wasn’t aware that Draftkings does not allow SGP Alt Lines - Hopefully other books allow this and not just FanDuel - For those who cannot make this bet, please check the first comment under this post for alternatives: Trying to accommodate everyone while still playing the best play - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Seattle -2.5 at 52%\n\n• Model says Seattle ML is at 55% \n\n• EV better betting 100$ = 8-11$ for this play\n\n• I have never done a bet like this before, but the main reason for doing this is because of the history between these two teams: When you look at the L10 matchups between the two, 2 games have been won by 10+ while 8/10 have been within 10 points - The last two matchups, this year, have ended with the two following scores: 38-37 & 21-19 - these two teams always play each other well and close, and I expect the same here tomorrow - On top of those H2H stats, this game is for all the marbles, NFC Championship - stakes will be a lot higher in this game than any other - I lean Seattle in this matchup. Any time Seattle is at Lumen, that gives them a small advantage, aka the 12th man - I feel like we don’t need to go into a lot of detail here about these two things: Seahawks defense & Rams offense - Seahawks have one of the best defenses in the league, while the Rams have one of the best offensives in the league - This Seahawks offense is ranked 3rd in PPG while the Rams give up an average of 20.2 PPG - Seahawks D is #1 in the NFL in PPG on defense, while the Rams are #1 on offense for PPG - Unlike the 49ers vs Seahawks game, I don’t think Seattle’s D will be able to perform as good as they did against the 49ers here, where they themselves won Seattle that game - Between Mcvay, Stafford, Puka, and Adams, I see the Rams getting there’s regardless - but Seattle slows them down just enough - The one downside to this bet, is our man Sam Darnold - part of sits here and thinks about his playoff performances and how you can’t trust him, and the other part of me is thinking, well you have to give him the flowers where they are due, he has had a good year - Even if Seattle turns the ball over 1-3 times, their defense should still be able to limit the Rams offensive output - The stats and data point to a close matchup here, my gut tells me this comes down to a FG - again, if you cannot place this bet, please check the comment section for 2 alternatives \n\nPOTD History: https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn\n\nBOL!\n\n**POTD: NFL 2 Pick Alt Line Parlay: Seattle Seahawks +5.5 Alt Line + LA Rams +9.5 Alt Line -119 (1U TO WIN 0.81U)**   \n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\nhttp://buymeacoffee.com/claysmiith\n\nhttps://venmo.com/u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1ij62b/"
    },
    {
      "created_utc": 1769295256.0,
      "author": "Global_Award_1110",
      "text": "Record 3-3 -4 U  \n\n(all picks 5U unless noted otherwise)\n\npotd guy please fix my units on the last play i listed all picks are 5 U unless noted otherwise previously \n\nEvent-NFL | Pick: Patriots -3.5 \nstart time: 1 PM\n\nrecap - huskers get a nice comeback win where they blow out minnesota in the second haif \n\n\nwriteup- keeping this one very simple, the broncos will be short handed with jarret stidham at qb playing white boy of the year drake maye and the new england patriots. i expect denver’s offense to struggle heavily and alls i think it’ll take is 17-20 points for the pats to cover this \n\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1ij0g9/"
    },
    {
      "created_utc": 1769295049.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Sunday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qm1kn8/pick_of_the_day_12526_sunday/o1iibu0/"
    }
  ]
}