{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 10/23/25 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/",
  "target_date": "2025-10-23",
  "timezone": "America/Chicago",
  "collected_utc": "2025-10-23T20:20:50.788012+00:00",
  "comments": [
    {
      "created_utc": 1761250522.0,
      "author": "macwell111",
      "text": "POTD Record 17-11 (+3.13u)\n\nLast POTD: Packers -6.5 (-115) (FD) 3U***❌\n\nToday: NFL / MIN @ LAC / 8:15PM EST\n\nPick: Over 44.5 (-110) (FD) 4U****\n\nI’m on the over tonight in Vikings vs Chargers. Both defenses have been falling apart, and this number feels a few points too low for how these teams are playing. \n\nMinnesota has gone over in five of six and is averaging 28 points per game with Carson Wentz starting. He’s been aggressive, spreading it around to Justin Jefferson and Jordan Addison, who’s seen 26 targets in his last three games. The Chargers defense has completely lost it lately, giving up seven rushing touchdowns in the past three weeks and ranking near the bottom of the league in success rate. They cannot stop the run, which should open things up for Minnesota’s offense all night.\n\nOn the other side, Justin Herbert should do his part. The Vikings blitz at one of the highest rates in the league, and Herbert has faced more blitzes than any quarterback this year. That means quick throws to Keenan Allen, who has been his usual target monster, and chances for big plays if the pressure does not get home.\n\nBoth teams have offensive line issues, but that can actually help an over like this with quick passes, broken plays, and big gains. Five of seven Thursday night games have cleared this number, and with two struggling defenses and capable quarterbacks, this one should too.\n\nGimmie da ovvvaaaa",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nl0nze8/"
    },
    {
      "created_utc": 1761246980.0,
      "author": "EzPickzz",
      "text": "Record: 9-3\n\nUnit record: +14\n\nLast pick: Lakers +4.5 ❌\n\nPOTD💎: Bruins ML \n\nBet365: -115 ( +2u)\n\nTime: 5:07 @boston",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nl0bxnf/"
    },
    {
      "created_utc": 1761246036.0,
      "author": "GamifiedAutism",
      "text": ">",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nl08q77/"
    },
    {
      "created_utc": 1761245768.0,
      "author": "ZekeNnajiOver",
      "text": "Record: 23-19-1\n\nForm: 🤡💵🤡🅿️💵💵💵🤡🤡🤡\n\nLast Pick: Hornets ML + Clippers ML🤦‍♂️\n\nRecap: My read on the Hornets was spot on, the Clippers should be embarrassed.\n\nSport | League | Event Time: NBA\n\nGame: DEN vs GSW\n\nPick: Jamal Murray o24.5 pts+assists\n\nOdds: -158 on Draftkings\n\nWrite Up: Going up against a backcourt of Curry, Podziemski and Hield, I think Jamal will be able to get his and score some points. I know they might switch Butler onto him at time but Butler has a lot of offensive responsibilities so he won’t be getting the second hardest defensive assignment on every possession. Less about the Warriors though, Murray is coming out of the summer looking more in shape and dialed in than he has in a while. This new coaching staff has challenged him to be the best version of himself. He often staggers with the bench and leads that unit which, last year, led to him being double teamed and blitzed as Denver had such a thin bench. With the additions of Bruce Brown, Hardaway, and Big Val, expect more pick and roll action and less pressure directly on Murray which will allow him the flourish.\n\nBOL everyone who is tailing!\n\nTips are always appreciated: https://buymeacoffee.com/zekennajiover",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nl07t08/"
    },
    {
      "created_utc": 1761245449.0,
      "author": "Flashy-Literature423",
      "text": "Record: 0-0  \nUnits: 0.00u\n\nOKC Thunder vs. IND Pacers | 7:30 PM EST\n\nPick: **Pascal Siakam Over 20.5 Pts**\n(-102 on DraftKings) Bet 2u to win 1.96u\n\nAfter months of lurking, I'm excited to share my first pick as we head into the NBA season. For context, I was profitable betting on NBA games the last two seasons, though I approached it more casually at the time. Now with a refined approach, I'm ready to see where this takes me.\n\n**Why I Like This Pick**\n\nPascal Siakam has established himself as the most consistent scorer for Indiana, particularly during the playoffs where he helped secure Conference Finals MVP honors. The absence of key playmakers Haliburton and McConnell makes Siakam the clear-cut #1 scoring option for this Pacers squad.\n\nThe numbers back this up: 8 of his last 11 games, Siakam scored at least 18 points. This type of consistency, paired with increased usage in a depleted backcourt, sets him up well for a strong outing.\n\nOpening night at home presents an ideal opportunity for a statement scoring performance. The Pacers will be looking to make an impact against OKC, and coming off a Game 7 Finals rivalry matchup, Siakam should see elevated touches and scoring chances. \n\nIf tailing Bol and only risk what you can afford to lose.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nl06pb3/"
    },
    {
      "created_utc": 1761244125.0,
      "author": "Laird87",
      "text": "POTD Record: 205-198, -61.37 Units\n\nCurrent streak: ❌\n\nLast 10: ❌✅❌✅✅❌❌✅✅✅\n\nLast Pick: Red Wings ML ❌\n\nTie game going into the third but Buffalo remains decent on home ice.  Maybe the Wings are going to cool off after a hot start.\n\nToday's Pick: NHL: Rangers vs. Sharks:  Rangers to Win AND Artemi Panarin to get 1+ Point, 2 Unit, -195, 7:10 PM EST\n\nThere isn't a ton that I love in the NHL today and while Rangers -1.5 is tempting I like this being a high-scoring game and Panarin to be involved in the scoring, so going with a parlay here for the first time to hopefully get a dub and going 2 Units this time.\n\nBOL, tail or fade! Tip Jar:  [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nl026uv/"
    },
    {
      "created_utc": 1761243840.0,
      "author": "Happy-Pop-7478",
      "text": "😅🤣",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nl017w4/"
    },
    {
      "created_utc": 1761242076.0,
      "author": "haloline",
      "text": "**🎯 Pick of the Day (Record: 1–2 ✅❌❌)**  \n**Event:** Nottingham Forest vs FC Porto — UEFA Europa League | 2:00 PM CST  \n**Pick:** FC Porto ML (+180)  \n**Wager:** 1u  \n**Previous Pick:** Ugo Humbert ML ✅\n\nOur last one hit thanks to one of our tennis guru analysts. Today we have one from our soccer wiz. Nottingham Forest are already on their **third permanent coach in just 43 days**, which says everything you need to know about the chaos surrounding the club right now. After a brutal start to both Premier League and European play, they sacked **Ange Postecoglou**, whose tactical decisions completely dismantled what **Nuno Espirito Santo** built.\n\nNow they’ve brought in **Sean Dyche**, who took the job just **two days ago** — not nearly enough time to turn things around. If it’s not broken, don’t fix it… and Nottingham did the opposite.\n\nMeanwhile, **FC Porto** are a solid, organized side with European experience and quality across the pitch. They should be able to capitalize on the mess Forest are in right now.\n\nTaking **FC Porto ML (+180)** as today’s play.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkzv5vu/"
    },
    {
      "created_utc": 1761241374.0,
      "author": "the-last-of-the-hens",
      "text": "**POTD Record:** 0-1\n\n**Last Pick:** O2.5 Total Goals + Real Madrid to Win (2U/-120)\n\n**Pick:** Keenan Allen O4.5 Receptions + O49.5 Rec Yards (2U/+102 on DK)\n\n**Write Up:** Tough start yesterday with Real's offense looking off for almost the entire game and Mbappe struggling to find the back of the net albeit a handful of good chances. Real's xG finished at 2.81 and Juve's just .59 but nonetheless we move on to (hopefully) greener days.\n\nToday's play is Keenan Allen against a Vikings defense that I believe is far more susceptible to getting gashed than early season metrics may show (as seen last week against the Eagles).\n\nThe Vikings play out of zone defense at one of the highest rates in the league at nearly 73% through 6 weeks and right around that mark when including the Eagles week 7 matchup (on my work laptop now but updated data last night and forgot to import). Along with this, the Vikings have opted to play from a 2-high safety look at a league high rate. While doing so, they've been effective at limiting explosive plays by allowing receivers to run free underneath and promoting a 73% completion percentage.\n\nKeenan Allen has done his best work against two high (1.556 YPRR against single high / 2.39 YPRR against two high) zone looks (1.782 YPRR against man / 2.083 YPRR vs zone) and I'm fully expecting the Vikings to continue their trend of allowing receivers to take easy gains tonight against a Chargers team trotting out Kamani Vidal and a banged up offensive line (hopefully Joe Alt makes his return). Brian Flores tossing crazy blitz packages out is always a worry, but with Quentin Johnston and Ladd McConkey taking the lions share of downfield targets, I think we'll see Herbert opting to go to his most trusted receiver on quick timing routes with the safeties sitting back.\n\nLadd running more underneath routes is my main concern for this play but with the running back room being what it is and the offensive line being banged up, I believe there will be more than enough targets to go around to get Allen to 5/50.\n\nTime to get back in the green, tail or fade, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkzsotg/"
    },
    {
      "created_utc": 1761240539.0,
      "author": "Certain-Challenge202",
      "text": "Record: 40-30\n\nLast Pick: Marseille double chance \n\nToday’s Pick: MVG ML vs Nijmans \n\nSport: Darts, European Championship \n\nReasoning: Van Gerwen’s scoring remains elite, consistently around the 97 mark, and his experience in closing out matches on big stages dwarfs Nijman’s. Even if his checkout rate dips, his relentless scoring pressure should carry him through comfortably.\n\nOdds: 3/4\n\nUnits: 1",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkzppxj/"
    },
    {
      "created_utc": 1761239184.0,
      "author": "SadDevelopment3049",
      "text": "Record: 1-0\n\nLast bet: Zach Lavine over 21.5 💥 cashed in first half\n\nToday’s pick: OKC ML + Rockets ML (this game is tomorrow) @ -125\n\nReason: OKC heads to Indiana to play a pacers team that is without Haliburton and who lost Myles Turner during the offseason. While the pacers match up well against OKC, they’re missing two players that were key in their ability to get wins against OKC last year. I’m parlaying this pick with Rockets ML, who play at home tomorrow against a Detroit team that just lost to the bulls. Detroit looked like an up and coming team last year, but had an abysmal showing last night in Chicago. The rockets, on the other hand, had an excellent showing against OKC in their first game of the season. I expect Houston to be a top team this year and I love them for their home night opener.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkzky83/"
    },
    {
      "created_utc": 1761238245.0,
      "author": "Weekly_Juice8992",
      "text": "Record: 6–8\nNet Units: −4.55u\nROI: −31.37%\nAvg Odds: −124\n\nSport | League | Time (ET): NBA | 10:00 PM\n\nLast Pick Recap: Devils ML (−135) — Win 4–1.\nNew Jersey drove the better five-on-five play and held on easily. The price stayed inside our band, so the model and result lined up the way they’re supposed to.\n\nPick: Nuggets ML (+110) — 1u\n\nWrite-Up:\nThis is strictly a number edge. My model makes this game close to a coin flip with Denver around 53 percent to win, which gives us value at a plus price. At +110 the break-even sits in the high-40s and the edge is real, even if it’s modest. The whole idea is catching a fair game at a dog price. That being said, early season variance on the model could wreck the pick entirely. \n\nSystem: +EV model comparing implied vs true win percent with no narrative stretch. CLV tracked to keep us honest.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkzhmwz/"
    },
    {
      "created_utc": 1761238127.0,
      "author": "nogynogg",
      "text": "Last pick: Wrexham ML @ 2.0 5U 💰💵\n\nRecord: 3-1\n\nPOtD:\n\nhttps://preview.redd.it/oi72b7tz4wwf1.png?width=404&format=png&auto=webp&s=ff023046157a4d04fa33a7601b0e542a3ee92557\n\n\n\nWrite up: Malmö is in awful form, and starting goalie Olsen is in the worst form of his life. Malmö also have loads of injuries. Zagreb on the other hand has a strong record, and looking solid. I belivie in an easy away win this night.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkzh837/"
    },
    {
      "created_utc": 1761237629.0,
      "author": "Still-Poem2464",
      "text": "Record: 6-3\n\nFootball | Europa League, Conference League | 17:45, 20:00 BST\n\nLast Pick: Real Madrid / Juventus o2.5, Bayern / Club Brugge o2.5 @ 1.92 ❌\n\nPick: Aston Villa AH -1, Crystal Palace AH -1  @ 2.07\n\nWrite Up: Villa are starting to pick up fire and it's hard to go against Emery in European cup games. Palace have become one of the toughest opponents in the PL this year, and at Selhurt Park, they should comfortably get the W.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkzfimu/"
    },
    {
      "created_utc": 1761235018.0,
      "author": "TheAwakening_",
      "text": "**Record:** 1-0\n>\n> **Net Units:** +4u\n>\n> **ROI:** 80%\n>\n> **Sport** | **Europa League** | ****17:45**GMT+0**\n>\n> **Pick:** Aston Villa -1.5 Handicap @ 2.10, 5u\n>\n> **Write Up:** So I am back to post after 28 days of not posting in here. My last pick was Aston Villa to win in the Europa League almost 1 month ago now. I am a Villa supporter so I knew our bad streak wasn't going to last, I watch us play every single time so could see the signs of improvement which is why I backed us to win with such good odds. Now we are playing alot better and are 5 unbeaten. Onto talking about the play for today though.\n>\n> Villa should win tonight. Simple as that, we have our strength back in depth. We have Onana/Kamara back which is so important to us being able to play out from the back and control possession and thus the game. I'm not going to write too much, I hope I can build up enough trust in my picks that people can see it and back it and we make money. I don't post every day, only when I am ultra confident because end of the day, I'm influencing what people do with there money and I want us to make money, not lose it so I am being extra careful :) which is why my two picks are Villa games lol. I am also on Villa -1.5 + BTTS no at 3.00 but let's play it safer in here. The value is the handicap not the BTTS. \n>\n> Like I said last time. If anyone has any questions on the pick or isn't 100% and wants to clarify something. Please reply and I'll give reasoning.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkz6k37/"
    },
    {
      "created_utc": 1761234994.0,
      "author": "Iloveyoutooeh",
      "text": "11–9 Net Units: +0.01U Total Risked: 61U ROI: +0.01%\n\n[Last pick](https://reddit.com/r/sportsbook/comments/1o9eizo/pick_of_the_day_101825_saturday/nk4d2tk/): Nottingham vs Chelsea, Nottingham over 9.5 goal kicks 🤡 this was the unlukiest thing ever, I needed 1 in like 30 mins and Chelsea had a RC late, and the other GK had ~ 16 goal kicks \"I was considering taking the total instead of one team\". I wish I did but moving on.\n\nLast 5: ✅✅❌❌❌➡️\n\n⚽ | Europa League | [Time, 19:45 EEST]\n\nPick: FCSB vs Bologna, Bologna ML and most corners\n\nOdds: [+160/2.6]\n\nUnits: [5U to win 8U]\n\nWrite-Up: Bologna is the better team, they should win, have the possession and have the corners.\n\nFade or follow, good luck to everyone.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkz6h0m/"
    },
    {
      "created_utc": 1761234913.0,
      "author": "LIVEACTIONSPORTSBETS",
      "text": "POTD Keenan Allen Over 49.5 RECEIVING Yard's 🔒\n\nhttps://preview.redd.it/0kx37r2nvvwf1.jpeg?width=1080&format=pjpg&auto=webp&s=e96ee5d897ce1e937d15d36dff9b7bcdd7db597c\n\n                             POTD RECORD 2-0  ✅️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkz671l/"
    },
    {
      "created_utc": 1761234544.0,
      "author": "MyProfileHasTheLink",
      "text": "POTD Record: 1-2 | Last Five:L L W - - | Net Units: -2u | \n\nTodays POTD Matchup: NFL Football | Vikings (3-3) @ Chargers (4-3) being played at 8:15PM ET at SoFi Stadium in Inglewood, CA.\n\nBetMGM has the Vikings +3.5 (-110)\n\nPOTD: Los Angeles Chargers -3.5 (-110) – 2 units\n\nHere’s Why I’m taking the Chargers to cover at home vs the Vikings:\n\n\t•\tThe Los Angeles Chargers are at home at SoFi Stadium and have the edge in familiarity and comfort in this spot.\n\n\t•\tThe Minnesota Vikings are dealing with quarterback issues — both J.J. McCarthy (ankle) and Carson Wentz (shoulder) had limited practice this week.  \n\n\t•\tThe Chargers’ pass-heavy offense, led by Justin Herbert, matches up nicely against a Vikings defense that’s allowed over 226 passing yards per game in recent weeks.  \n\n\t•\tWhile some analysts lean Vikings +3.5 based on Minnesota’s offense and Chargers’ OL issues, the home team’s momentum and situational advantages tilt the scale for LA.  \n\n\nI like the Chargers here to cover the 3.5. While the Vikings have some offensive upside, they’re in a vulnerable spot with questionable quarterback health and traveling on a short week. The Chargers need this win, and against a destabilized opponent, they’re in the right position to capitalize.\n\nBEST OF LUCK! \n\n☕️ Tips: https://buymeacoffee.com/pickwizard",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkz4xab/"
    },
    {
      "created_utc": 1761233330.0,
      "author": "899__",
      "text": "POTD Record: 0 - 0\n\nBeen hot lately on my bigger bets and decided i would give it a try by sharing my picks on here\n\n  \nBet - Vikings TT o20.5 (-113)\n\nWager - 2.26 units to win 2 unit\n\nUnderdogs have been winning outright this season in the last 6 standalone games, with 5 of those 6 clearing over the game total. I expect this game to be a close one here, likely decided by a single score game like every other standalone matchup so far. Keep riding this trend until it fails.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkz0qqn/"
    },
    {
      "created_utc": 1761233120.0,
      "author": "Real_League2972",
      "text": "Record: 24-16-3\n\nNet Units: +29,87 Units\n\nPrevious Pick: Galatasaray ML & Chelsea ML @2.00 5 UNITS ✅\n\n\nEvent: UEL, Fenerbahce vs Stuttgart\n\nPick: Fenerbahce win or draw & BTTS Yes @2.36 3 UNITS\n\nFenerbahce haven’t lost a single home game this season. They are coming to this game with a win against Nice at home. \n\nStuttgart on the other hand struggled against Basel and lost 2-0. They had %60 possession, 8 shots on goal but couldn’t score a goal but I believe they will score tonight against Fenerbahce. \n\nSorry for the short analysis. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkz00oe/"
    },
    {
      "created_utc": 1761232709.0,
      "author": "20k_rpm",
      "text": "Record **:** **12** W **- 11** L\n\nForm **:** ✅❌✅❌❌❌✅✅❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌\n\nEvent **: Counter Strike | CCT Closed Qualifier |** Ence Academy vs Nuclear Tigeres\n\nPick **:** **Nuclear Tigeres to win 2-0 -** 2 units **@ 2.2 / +120**\n\nReasoning **:** Tigeres are unbeaten on train. and a very high chance to take their opponents map pick being the stronger team. should be comfortable 2-0 for the tigeres.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkyyltn/"
    },
    {
      "created_utc": 1761232632.0,
      "author": "owenf10",
      "text": "Overall record: 0-0\n\nThis is my first time doing this, let’s get some dubs.\n\nTodays POTD: Porto double chance + Roma ML @1.96\n\nPorto Double Chance (Win or Draw vs Nottingham Forest)\nPorto are in top form, unbeaten in 11 games this season (10W, 1D), with Samu Omorodion banging in goals (8 in 9) and a sharp attack that’s scored in every match. Even away, they’ve won both Europa League games, showing resilience and quality. Nottingham Forest are struggling, winless in 10 across all competitions, conceding heavily (3+ goals in 3 of their last 4 home games) and barely scraping a point in Europe (1 from 2 games). Porto’s experience and firepower should at least secure a draw, if not a sneaky win, making the double chance at ~1.45 a strong pick for a tight game.\n\nRoma ML (vs Viktoria Plzeň)\nPlzeň are struggling this season, sitting mid-table in the Czech league and lacking consistency on the road. Roma, under Gasperini, are playing much better, with a strong home record and key players like Matias Soule and Artem Dovbyk firing. As the far superior team, Roma should secure a comfortable win at the Olimpico, making the moneyline at ~1.36 a solid bet.\n\nBest of luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkyycaw/"
    },
    {
      "created_utc": 1761232175.0,
      "author": "TwainTheMark",
      "text": "**Record: 4-1**\n\n**Last 5:** ❌✅✅✅✅\n\n**Net Units: +6.3 units**\n\n**NFL Football | 8:15 PM EST**\n\n**Event: Vikings @ Charger**\n\n**Pick: Jordan Addison o4.5 receptions +105**\n\n**Risk: 1.5u to win 1.6u**\n\n**Write Up:**\n\n**Last pick — Jaylen Warren o66.5 rushing + receiving yards -115**\n\nDoesn’t get much easier than last Thursday’s bet on Warren. In the bank by halftime. Here’s another I think could pop sooner than later…\n\n**Todays pick — Jordan Addison o4.5 receptions +105**\n\nCrazy to get plus odds on this line imo. In his first three games back from suspension, Addison has 18 receptions on 26 targets. This line could be low for a few reasons: 1. decent Chargers pass defense, 2. low completion totals vs. Chargers, 3. Carson Wentz.\n\nBut going into the game tonight, none of this throws me off Addison. \n\nJust four days ago, the Chargers got absolutely shredded by the Colts. Jonathan Taylor was the one doing most of the shredding, but Alec Pierce (5/98), Tyler Warren (4/69/1), and Michael Pittman Jr. (7/58/1) all finished with respectable lines in a game that was practically settled at halftime. On 34 pass attempts, Daniel Jones’ two main receivers went over the 5 rec line — Wentz attempts line is current 34, so if things just play out how Vegas has it capped, we should get there. The Vikings are similarly reliant on their top three pass catchers (JJ, Addison, Hockenson). I also expect this game to be more competitive than Chargers/Colts — unlike Sunday, the Chargers are -3.5 favorites at home. If the Vikings play from behind for a lot of this game, it’s not crazy to think that Addison will see 10-12 targets like he did last week against the Eagles (12).\n\nThe Chargers are middle of the pack in completions and yards allowed to WRs. They’ll sell out to stop JJ, as everyone does against the Vikings, which will open things up for Addison. They’ve also turned into one of the softest run defenses in the league, giving up huge days to Taylor, Achane, Bill, Dart, etc. in the last month. If I was taking a guess at Jesse Minter’s plan for tonight, it’d be that he wants to sell out to stop Jordan Mason and force KOC to dial up the perfect call for Wentz 40+ times, who can be serviceable as a first-read pocket passer, but is prone to mistakes when he needs to ad-lib or extend a play. I think that’s as good a guess as any for how things actually play out. I doubt this thing’s a shootout, but it could be a diet-shootout. \n\nLastly, let’s just take a look at what Carson Wentz said about Jordan Addison this week: \n\n\"The chemistry is easy when you're open by 5, 10 yards at the end of the day,\" Wentz said of Addison, who has the most receiving yards of any Viking not named Justin Jefferson despite playing in just three games. \"He's been making it easy and I've developed a ton of confidence in him and his ability to get in and out of breaks and put a lot of stress on those (defensive backs).\"\n\nI’d consider laddering this up to 7 (+309) and 8 (+575) receptions, and I think his yards are worth a look, too. BOL. Not sure if we’ll see ya at halftime, but if not, we’ll see ya another time.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkywrqr/"
    },
    {
      "created_utc": 1761231709.0,
      "author": "Big-Coat-6088",
      "text": "record: 0-0\n\ntoday’s pick: crystal palace - aek larnaca over 4.5 corners 1st half \n\nI believe that crystal palace will try to dominate since the first minute. AEK will look for counter attacks as they have good and fast players in the wings. Odds are good as well (2.07 as of now). \n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkyv6ah/"
    },
    {
      "created_utc": 1761231133.0,
      "author": "Elegant-Ad-4057",
      "text": "record: 2-1\n\nLast pick: atalanta ML&real madrid --> X \n\ntodays pick: NFL - Vikings +3.5\n\nthink this is a trappy game - both teams coming off a loss, chargers look banged up sticking with my gut on this one for vikings to cover the spread\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkyt6w4/"
    },
    {
      "created_utc": 1761230704.0,
      "author": "HappyMan18",
      "text": "Record: 0-0\n\nNet Units: +0\n\nROI: 0\n\nNFL | MIN VS LAC / 8:15 est\n\n\nPick: 1H total under 23.5 -138 1.5 U\n\n\nWrite Up: both teams average just 10.3 and 10.8 points in the first half, facing defenses allowing 11.1 and 10.0, respectively—among the league’s stingiest. Minnesota’s pass rush (4th in sacks, 3rd in hurries) disrupts Herbert’s rhythm on a short week, while the Chargers’ secondary has surrendered the 2nd-fewest passing TDs and just got Khalil Mack back to pressure Carson Wentz. Thursday night games on the road often feature sluggish starts; add cross-country travel, run-heavy scripts (Chargers 30th in rush play %, but committed under Harbaugh), and Minnesota’s three-game turnover drought, and drives stall in field-goal range. First-half trends show 4 of the Vikings’ last 5 and 3 of the Chargers’ last 4 staying under 23.5. Expect a grind-it-out game",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkyrptz/"
    },
    {
      "created_utc": 1761230355.0,
      "author": "Best_Accountant_5471",
      "text": "Record: 42-26 (+27.6 units)\n\nLast 10 (most recent on right):  ❌✅✅✅❌✅✅✅✅✅\n\nLast Pick: Jiři Lehečka 🇨🇿 vs Felix Auger-Aliassime 🇨🇦 O3.5 match total double faults ✅\n\nEvent: UEFA Europa League ⚽️\n\nPick of the Day: Celtic 🏴󠁧󠁢󠁳󠁣󠁴󠁿 O6.5 team corners vs Sturm Graz 🇦🇹 3U @ 1.83 (Bet365)\n\nWrite-up: Incredibly sweaty pick but we just about got the job done. Auger-Aliassime double faulted very early on which proved to be his only one of the match. Flash forward to the second TB of the match FAA had 2 MP’s with the count standing at 3 which he fortunately couldn’t convert. Down 5-2 (final game) in the third set, Lehecka sends a second serve into the fence for the 4th DF of the match. Great match between the two, very serve-oriented, and the Canadian deservedly won yet another indooor tournament to confirm his excellent form.\n\nCeltic have averaged 9.1 corners in their last 10 matches at home and have hit the over in their last 8 matches at Celtic Park. Meanwhile, Sturm Graz have conceded an average of 5.8 corners per away game in their last ten. Their game styles reflect this where the Scots will be pretty big favourites to win this match. Under Rodgers I expect the Bhoys to pin back Sturm for long stretches of the match. As a result, with the Austrians set up in a low block, there should be an increase in corners with more chances for deflections out for corners. Using all factors I get an estimated 7.8 corners for Celtic in their match.\n\nThat gives this play approximately a 68% chance of winning. BOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkyqj0z/"
    },
    {
      "created_utc": 1761230118.0,
      "author": "CeaselessAction",
      "text": "Taking Terry Rozier under 0.5 pts",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkyppzz/"
    },
    {
      "created_utc": 1761228835.0,
      "author": "Vander_chill",
      "text": "**POTD Record :** 88 – 55 - 7\n\n**Previous :** UCL - **:**  Atalanta ML & Real Madrid ML - LOSS\n\n**Recap:**  Real Madrid barely squeaked by against a feisty Juventus team that played better than anticipated, but gave us the first leg anyway.  Atalanta however, ended in a 0-0 draw and despite having 22 shots, more possession, corners and overall offenses than Slavia Prague, they could not put the ball in the net.  Fantastic defensive showing from the Czech side.  Did not help us cash.\n\n**New Event:** – Europa League – Malmo vs Dinamo Zagreb\n\n**Pick:**  Dinamo Zagreb ML @ 2.38 (Usual 3 units)\n\nGoing out on a limb here with a plus money pick.  I could go Tie-No-Bet for a safer 1.65 odds or even more aggressive at -1 Asian Handicap at 3.75 where we get a refund if they win by 1.  But I just can’t figure out the reason these odds are so generous for this match.\n\nSome data points:\n\n* Dinamo Zagreb (DZ) are at the top of the Europa League table with 2 wins and a +4 goal differential. \n* DZ beat Turkish side Fenerbhace 3-1 at home and Israel’s Maccabi Tel Aviv 3-1 away. \n* DZ are currently atop of their domestic league table as well.\n* DZ will be missing one player, Torrente who has been unavailable due to a torn knee ligament. \n* DZ have a couple of other players that are questionable but expected to be available and are travelling with the squad to Sweden.  Basically DZ has a complete squad.\n* Malmo are dead last at the bottom of the Europa League table with 2 consecutive losses and a -4 goal differential.\n* Malmo lost to Bulgaria’s Ludogorets 2-1 at home and then to Czech side Viktoria Plzen 3-1 away.\n* Malmo received 2 red cards in their loss to Viktoria Plzen.\n* Malmo currently sit 4^(th) in their domestic table.\n* Malmo’s midfielder and Captain Anders Christiansen, as well as midfielder Arnor Sigurdsson remain sidelined with thigh injuries. \n* Malmo’s midfielder Johnsen and striker Danel Gudjohnsen are both suspended following their red cards in the defeat to Viktoria Plzen. \n* Malmo’s striker Erik Botheim remains out with a long-term leg fracture suffered earlier this year.\n\nThese odds seem way too favorable for us to pass up on a healthy top team in good form against a bottom team in despair, with an interim coach, missing 3 starting midfielders and 2 forwards.  Yes, it’s in Sweden so what?  Ludogorets went there and won 2-1, had more shots, shots-on-target, corners and an XG of 3 vs Malmo’s .65.  DZ is a better team than Ludogorets and I see no reason they cannot do the same.\n\nIf I missed something, please do point it out in the comments.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkylfua/"
    },
    {
      "created_utc": 1761227395.0,
      "author": "imsosticky",
      "text": "Record: 0-1\n\nNet Units: -1\n\nSoccer | UEFA Europa League | 3:00 PM EST\n\nPick: Maccabi Tel Aviv v. FC Midtjylland - Midtjylland ML (+130 on Caesar’s) \n\nWrite Up: Not gonna lie, bit of a vibes pick here. BUT they’re giving plus odds on a top of the table vs bottom of the table match up. Midtjylland sits at 2nd in the Europa standings after 2 games with +3 GD and wins against Nottingham Forrest and SK Sturm Graz. They come into this match having not lost in 7 matches (6W-1D). M. Tel Aviv come into the game sitting at 30th out of 36 in Europa with a 3-1 loss to Croatian side GNK Dinamo Zagreb and a scoreless draw with Greek side PAOK. Their form has dropped off recently after winning 4 straight games in August/September they haven’t won in 4 matches (3D - 1L). If past Head to Head means anything to you, Midtjylland won the only previous matchup last year 2-0. I believe based on recent form Midtjylland come out and hit first and control the game from there. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkygppu/"
    },
    {
      "created_utc": 1761224436.0,
      "author": "FrozenStride",
      "text": "**Record:** 3-2 *(+1.8units)\n\n\n*Yesterday's pick was a push, Real Madrid dominated the game as expected but didnt manage the 2 goals I was hoping for* \n\n\n**Todays Pick:** Rapid Wien - Fiorentina **Fiorentina WIN** \n\n\n**Odds:** $2.15\n\n\n**Wager:** 1 unit \n\n\n**When:** 4 hours from post\n\n\n**Why:**\n\n\nAlright, let’s be honest, Fiorentina should be walking into Vienna without too much concern, maybe even whistling the Champions league anthem out of habit. Rapid Wien have been giving their opposition free goals, and their “home fortress” seems to be a thing of the past. Fiorentina, on the other hand, have that classy Italian blend of calm defending and sneaky counter-attacks the kind that has you thinking “how did they even score from that?”. They can definitely be a bit up and down away from home, but against a Rapid side struggling to find rhythm, this should be more of a controlled and clinical match rather then a chaotic/anyone's chance type of game. Unless the Italians some how all forget what offside means, expect them to handle business here, something like a clean sheet 0-2 seems a possibility on this on.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nky7oqx/"
    },
    {
      "created_utc": 1761222463.0,
      "author": "gamedaybets",
      "text": "**POTD Record:** 4-3 (+1.53 Units)\n\n**Previous Pick:** ✅  Bayern Munich TT 02.5 + Liverpool ML (+140) 1 unit\n\n**Event:** NFL\n\n**POTD:** Justin Jefferson ATTD (+140)\n\nJustin Jefferson, the Vikings' star wide receiver, hasn’t found the end zone in five games this season, despite his career average of 0.51 touchdowns per game. Leading the team in targets, he remains the focal point of Minnesota’s passing attack. With his current anytime touchdown odds offering excellent value, this is a bet worth considering. While the Chargers’ defense has been solid against the pass, Minnesota’s urgency for a win and Carson Wentz’s struggles could lead to a heavy dose of targets for Jefferson, especially in the red zone. Expect the Vikings to lean on their best playmaker to break his scoring drought in a critical game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nky27yq/"
    },
    {
      "created_utc": 1761221886.0,
      "author": "YGWYD",
      "text": "**SEASON RECORD:** 22-3-8\n\nNet Units: (+7.37)\n\nPrevious Pick:  Frankfurt vs Liverpool- Liverpool to Win @ 1.60 ✅️ \n\n**Today's Pick:** Genk vs Real Betis - Real Betis DNB @ 1.57 ♻️ **(PUSH)**\n\n**TIME:** 5:30 pm (BST)\n\n**Wager Amount**: 1.5 units\n\nLast 10 Matches (♻️✅️✅️❌️❌️❌️✅️✅️✅️✅️)\n\nVery early scare from Liverpool but they won the game very easily, now after a good UCL lets see what happens with Europa today.\n\nDecent value here, Betis are unbeaten in 7 consecutive matches, won 3/5 games, 2/5 away games and unbeaten in 6 away games and are also unbeaten in their last 2 Europa League fixtures.\n\nGenk have lost 1 game in 6 games, winning 3 and drawing twice however they lost to Ferencváros in their last Europa match amd are 8th in the Belgian league while Betis are 5th in Laliga.\n\nI'm giving Betis the edge here especially with their better squad including the GOAT Antony with 4 G/A contributions in 4 games🔥 and Betis have more experience in Europe. BOL if you're tailing.\n\n[TipJar (PayPal) If you want to I'd highly appreciate it](https://www.paypal.com/donate/?hosted_button_id=2RRPJ4DNAKEYW)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nky0pdy/"
    },
    {
      "created_utc": 1761221845.0,
      "author": "wes2211",
      "text": ">**Record:** 107-86\n>**Net Units:** +26.35 units\n\n>**Curling** | **Pan Continental Curling Championships** | **3:00PM EDT**\n\n>**Pick:** Canada men -5.5 @ 1.64 vs Australia\n\n>We are about halfway through the round robin at the Pan Continentals and Canada sits tied at the top of the leaderboard with the USA, both teams undefeated. Yesterday, Canada beat Korea 14-6 and New Zealand 7-1. Jacobs' shots have been very simple all tournament thanks to the stellar play of his team. Australia are coming off a 13-2 loss yesterday against the USA and a 9-3 loss against China and it is apparent that their hitting ability is far below the other teams here. Not only is Australia winless but they are not covering +5.5 against far worse teams than Canada while Canada is covering -5.5 against far better teams than Australia. Australia's back end is very weak and that spells trouble against an elite team like  Canada. This one is going to be a blowout.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nky0lol/"
    },
    {
      "created_utc": 1761221843.0,
      "author": "milldura",
      "text": "**Record**: 11-3  \n\n*Last 10:* W | W | W | W | L | W | L | W | W | L  \n\n*Units:* \\+7.63\n\n\\-\n\n**Previous POTD: F**ootball - UCL - Sporting Lisbon v Marseille - Double Chance Marseille (To Win or Draw) - $1.75 - 1.5 units ❌\n\nAnother brutal loss. After going up 1-0 and completely dominating the first half, we were awarded a late penalty to be sure to make it 2-0 and almost guarantee the bet.\n\nPenalty was waved off (rightly so) and then Emerson precedes to get his 2nd yellow card in the space of 7 minutes to be sent off before the half ended.\n\n2 goals subsequently followed for Sporting including an 86th minute winner. We were cruising and this one hurt a bit to be honest.\n\n\\-\n\n**Today's POTD:** Football - UEL - Feyenoord vs Panathanaikos - Feyenoord H2H (ML) - $1.55 - 2 Units\n\nSorry for the late one, I’ve been busy today and I’m hoping a few people will still see this. I’ve tried to find something as risk free as possible after a few harsh losses. The game starts 9pm local time. \n\nFeyenoord are currently sitting top of the Eridivisie and we’ve seen the form from that league is stretching into the champions league with PSV having some success as well. \n\nThey will be hungry to turn things around in their European campaign after suffering 2 defeats at the hands of Braga (tough to travel to) and Aston Villa (a quality EPL team), and I think their league form suggests they are good enough to do so.\n\nPanathanaikos have drawn 3 out of 6 games in their league and sit 7th behind some minnow teams. They have an effective defence with only 7 goals conceded in that time but Feyenoord’s immense goal scoring record suggests they will be able to get a few past them.\n\nFeyenoord have only conceded 6 goals all year in 9 games and with Pana’s somewhat poor goal scoring record, I really don’t see them conceding more than 1, and more than likely 0.\n\nI think we can honestly say the Eridivisie is a lot better than the Greek Super League, and with home advantage in sub par weather, I’m backing Feyenoord for the win here.\n\n\\-\n\n11 wins in 14 days, well done to any followers. No pressure whatsoever, but if you are willing, any help goes a long way.\n\nBuy me a coffee! - [https://www.paypal.com/ncp/payment/K4C6AK2VCT9EJ](https://www.paypal.com/ncp/payment/K4C6AK2VCT9EJ)\n\n**Thanks, GL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nky0lgj/"
    },
    {
      "created_utc": 1761221474.0,
      "author": "BrokenClock9",
      "text": "4-4-0\nDown .1 Units \n\nLast POTD: NHL, Red wings ML v Sabres +100 ❌\n\nOfficially a cold steak with 3 L’s in a row. Red Wings didn’t live up to the defense I was expecting. Backing off hockey until I have more data. \n\nToday’s POTD: Jordan Mason ATTD +110\nNFL Chargers v Vikings \n\nUnits:  3 to win 3.3 \n\nData \n\nChargers pass defense 8th \nCharges rush defense 19th \nChargers have allowed 10 rushing TDs this year, second most in the league \n\nMason has scored in 3 of his 4 starts \nMason has scored in both of his last 2 games\n\nThe Vikings will struggle to throw the ball here and have to rely on big plays to Jettas or a good run game with Mason. I think Mason will get to punch one in from close pretty early. \n\nChargers 27-20\n\nEDIT: Jones is playing so that hurts our chances. I still like this bet but not at 3 units. Trim it to 1 or 2. I’ll leave my pick as is though to keep it legit",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkxzmxj/"
    },
    {
      "created_utc": 1761221141.0,
      "author": "Romans828Believer",
      "text": "**POTD Record:** 6-2\n\n\n**Last Pick:** Cavs ML❌\n\n\n**Event:** NFL Vikings & Chargers\n\n\n**Pick:** Chargers ML + Jefferson 60+ Receiving +115\n\n\n**Writeup:**\n\n\nMy model has the chargers projected to win this game by 9 points. This truly is a nightmare of a matchup for the Vikings. The chargers rank 5th in defensive Pass success% and top 10 in both sack% and defensive EPA/pass att. The chargers also get back Joe Alt which is underestimated how big of a key he is to this offense. Jefferson has gone over this line in 5/6 games this season and every game with Wentz at the helm. As stated, I believe the Vikings will be playing from behind, forcing them to lean onto a pass heavy script\n\n\nBuy Me A 🍻\n https://buymeacoffee.com/romans828",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkxysch/"
    },
    {
      "created_utc": 1761220419.0,
      "author": "Icy-Proof7085",
      "text": "Where's the Montecarlo simulator guy?",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkxwz9r/"
    },
    {
      "created_utc": 1761217952.0,
      "author": "mvpeav",
      "text": "Record: 5-1\n\nWeek8: ✅️✅️✅️✅️\n\nWeek9:✅️❌️ (New Mexico State +2)\n\nProfit: +2.9u\n\nPick: Rashod Amos o30.5 rushing\n\nReasoning: South Alabama is allowing almost 200 yards rushing per game.  Neither team are very good (both 1-6) so I definitely think there is some potential for bad defense to play a role. Amos is the top rusher by attmpts. From simulator, Ive got Amos going over 30.5 in 59.3% of the 1000 simulations with a median (50% above and below) rushing yards value of 37",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkxravj/"
    },
    {
      "created_utc": 1761216812.0,
      "author": "DataHoops",
      "text": "Record: 0–0\n\nNet Units: 0.00\n\nROI: 0%\n\nSport: Basketball | League: NBA | Event Time: Oct 23, 2025 - 10:00 PM EST\n\nPick: 🏀 Bruce Brown - Over 2.5 Rebounds @ 1.74 (-135) | 2 Units\n\nWrite-Up:\n\nStarting my Reddit record fresh as I begin sharing some of my model-backed NBA plays publicly.\n\nI already post fully tracked results and detailed breakdowns on Twitter (@Data_Hoops) - all transparent and verified.\n\nMy model prices this line closer to 1.40, showing clear value at current odds. The market seems to be projecting Brown’s rebounds per 36 well below his numbers from last season, even though his expected minutes and pace environment remain favorable.\n\nThis matchup between the Golden State Warriors and Denver Nuggets should feature plenty of rebounding opportunities on both ends.\n\nLooking to start the Reddit record with a solid 2-unit winner 💰",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkxov2k/"
    },
    {
      "created_utc": 1761213967.0,
      "author": "yeahhhhhboiii",
      "text": "Record: 8-5, + 13.09u\n\nLast pick: Voloshchuk ML vs Zhabrailova (-300) + Matas Buzelis 2+ 3PM (-180) [+107] 4u ❌ -4u\n\nTerrible pick. Looked good on paper but that was dreadful. \n\n**POTD** Denver Nuggets ML vs Warriors (+108) 3u\n\nNuggets @ Warriors 10/23 8:00pm MST\n\nThe Nuggets roster has seen some significant changes this offseason, and for the better, to say the least.\n\nJokic has never had a competent backup center until now, and the bench has been awful throughout the entire Jokic era until now. This should be the best Nuggets team in franchise history, and I believe it will be.\n\nMurray usually comes into the season out of shape, but not this year—he’s looking really good and ready. That’s rare and could make a big difference here for their opener. \n\nChristian Braun is looking like he’s leveled up over the offseason, with his 3 point shooting looking dramatically improved. He just signed a big extension and should be feeling good and confident. Aaron Gordon also appears to have carried over his absolute renaissance behind the arc into this season. 3 pt shooting was a relative weakness for CB, so if the improvement is how it appears, it will makes this starting lineup very, very dangerous. \n\nI believe that Cam Johnson is an upgrade over MPJ. He hasn’t been fantastic through the preseason, but it doesn’t take long to acclimate to playing with Jokic and he should be good. The difference might not show up in game 1 here, but it won’t be a meaningfully negative difference either.\n\nPeyton Watson has improved over the offseason and is a very nice bench piece that can impact the game on defense. With THJ and Valanciunas on the team along with Bruce Brown back, the difference will be night and day from last year.\n\nThe Warriors are a good team, and they looked good in the win vs the Lakers, but the Lakers were missing LeBron. The Nuggets have the best player in the world and are the better team, improved from last year. They will want to start the season strong with a victory to set the tone. At plus odds, I like this spot.\n\nI’m a big Nuggets fan—I’ve watched almost every game in the past five years, so I know this team well. I try not to let my bias cloud my judgment and I bet against them when warranted, but at plus odds I like them to win here and make it 9/10 wins in their last ten vs Warriors.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkxjdfw/"
    },
    {
      "created_utc": 1761205403.0,
      "author": "Vet100",
      "text": "\nRecord: 2-0\n\nNet Units: +1.68U \n\nTotal Staked: 2U Total Returned: 3.68U \n\nNBA: Denver Nuggets v Golden State Warriors \n\nPick: 1U Green O2.5 turnovers $2.25 (+125 American odds) B365 \n\nWrite Up: While I did like the Jokic turnovers line & Payton steals line (which is nearly a lock I reckon but is at short odds), I have gone for a value pick here as my POTD. Green has cleared this line in 3 of his last 4 v Nuggets, cleared it in the season opener v Lakers, cleared it in 3 of 4 pre-season matches, and cleared it in 36/68 regular season games last year (52.9% clearance, odds of $2.25 mean we would only need him to clear this line in 45% of games to profit this season if the line, odds and unit stake stayed the same). \n\nThe risks for this pick include it being Draymond who loves foul trouble & even worse tech trouble, and Butler/Curry being primary ball handlers. However I think enough play goes through Green, who is an offensive foul risk, and additionally the Nuggets have added some neat defensive players who will be able to force a bad pass or even a steal. I would play this due to it being good odds but if you are someone who would prefer a small win rather than a value play, then maybe stay away and go Payton instead.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkx5717/"
    },
    {
      "created_utc": 1761204343.0,
      "author": "yeahicreatedsomethin",
      "text": "**Record: 8-4-1**\n\n**S**occer\n\n**Last Pick:** Real Madrid to win\n\n**Last Pick Write Up:** Real Madrid won, as expected.\n\nNow for today..\n\n**Pick:** Roma win + Crystal Palace win @ 1.61 - 1 unit\n\n**Write Up:** To be honest, I've been having the best luck when I just bet on the \"obvious\" soccer winners with the odds between 1.5 to 1.8. So I will be continue with this strategy here, although this is a parlay. Roma should win Plzen, and Crystal Palace should win AEK Larnace. Is there a possibility of either team losing or drawing? Of course, but 1.61 is a good price - and both these teams SHOULD win.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkx3hjh/"
    },
    {
      "created_utc": 1761204217.0,
      "author": "BLUNTS_AND_MMA",
      "text": "🍃🔥😤 **BluntsAndMMAlll**❗💪🏼😈\n\n>**Record:** 1-0-0 **Streak:** 1W\n>✅\n\n> **Sport:** Football **League:** NFL **Time:** 8:16 EST\n>\n> **Previous POTD:** Hornets -5.5 1 Unit -106\n>\n> **Recap:** Hornets made me horny the way they PEnalized Brooklyn tonight (😉). It turned out as I said, with these 2 low expectation teams the Hornets proved to be the better deeper team (pause). They started off on a great note and my previous statement stands. If they stay healthy they can clinch the playoffs. Also, Kon Knueppel had a very good debut. The game was carried by the 3 stars I mentioned in my breakdown though. In the end it was only Brooklyn (pew yew, they stink) that they beat. They will have to prove themselves against greater competition to actually start sparking conversations. None the less, great win for starting off my picks here 🔥\n>\n>**POTD:** Chargers -3.5 1 Unit -102\n>\n> **Write Up:** 4 day turn around game for both teams having just lost games Sunday. The first thing I'm liking about the Chargers is the home advantage especially in this situation. I know the Chargers have not looked the best out there but neither has the Vikings. Both teams RB depth is banged up. With the Viking being the more run heavy team I feel that it affects them much worse. The Vikings QB situation changes that a bit but still, I believe we can all agree Justin Herbert is a better QB than Carson Wents... Chargers pass defense has been good so we have a chance to see Wents throw a pick or 2 again (hopefully) if he isn't careful this game. If Vikings want to run they will have to basically rely on Jordan Mason to get things done. I don't mean to talk as if this will not be a competitive game as the Vikings have the much better WR depth. Justin Herbert himself has not been playing badly. As long a Charger's defense holds up i think they can easily win by 4+ points. Neither team is looking spectacular so between 2 teams with big downsides this Thursday, I'm going with the one who imo has less. Give me the Chargers to win at home with both teams having a short rest week and having less depth problems on the offensive end. Let's get this streak started with a 2nd win!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkx3a6n/"
    },
    {
      "created_utc": 1761203620.0,
      "author": "OliveCritical5134",
      "text": "**Record: 7-2**\n\n❌❌✅✅✅✅✅✅✅\n\n**Sport:** ⚽ / UEFA Europa League / FCSB v Bologna & Go Ahead Eagles v Aston Villa\n\n**Net Units/ROI:** \\+15,27u/52.66%\n\n**Previous Pick:** *Chelsea -1(1.66) & Bayern Munich over 2,5 goals(1.61) @ 2.69 -- 3 units✅*\n\n**Summary:** Bayern scored 3 before halftime, and Ajax messed themselves up with a red card. GG's to everyone tailing.\n\n**Today's Pick:** ***Bologna to win(1.70) & Aston villa to win(1.53) @ 2.60 -- 4 units***\n\n**Write up:**\n\nThere are 36 matches in both the Conference League & Europa League today, which is why I want to keep it simple and stay with Moneylines.\n\n**FCSB v Bologna:**  \nBologna to win is pure value. Bologna have only managed to scrape 1 point in the Europa League so far, but faced Aston Villa & Freiburg, and this is a must-win for them. Especially whilst they are in smoking hot form in Italy where they are in 5th at the moment.\n\nFCSB is a side that is simply lacking the quality to match Bologna here. They are struggling domestically, where they are 12th in the Romanian League. The Romanian league isn't even high quality either. FCSB is sitting higher in the UEL standings, but they have gotten 3 points against Go Ahead Eagles, and if you read just a bit further, you'll see that they aren't a good team either.\n\n**Go Ahead Eagles v Aston Villa:**\n\nGo Ahead Eagles is a side that has never played in any European league before, ever.\n\nThis team is 12th in the Dutch Eredivisie, they just don't have the same form this season in comparison to previous season, the season in which they qualified.  \nGo Ahead Eagles lost to FCSB, who aren't good at all. They won against Panathinaikos with 2 counters over the left side where they caught Panathinaikos off guard but were dominated that entire game. They're just going to come up short against Villa.  \nAston Villa have won the last 5 games, against sides like Spurs, Feyenoord, Bologna etc. My only worry is if they decide to field a reserve team. But even then they still will win.\n\n  \nBest of luck if tailing! 🍀\n\nPS: If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkx2api/"
    },
    {
      "created_utc": 1761202072.0,
      "author": "Icarus17_",
      "text": "✅\n\n**Last pick:** ✅ Bayern Munchen -2 asian handicap. This match went as expected. The difference in quality was just too high. Nice to start with a win!\n\n**Record:** 1-0-0\n\n**Net Units:** \\+0,64 units\n\nMovistar Koi vs Team Secret Whales - League of Legends World championship\n\n**Pick:** Movistar Koi | Kill handicap **Map 1** \\-7,5 kills | Odds 1,82 | 1 unit\n\n**Write Up:** Movistar Koi is the better team here. Team Secret Whales has a good early game, but so does Koi. Their laners are pretty strong, which imo counters the only win condition Team Secret Whales have. Jojo and Myrwin outlane their opponents.\n\nKoi also start blue side, which has 60% winrate in worlds. Ofcourse betting pre draft is riskier. But I think there is value here.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwznmb/"
    },
    {
      "created_utc": 1761201650.0,
      "author": "No_Leader_7866",
      "text": "Nice, time to lock in today’s pick. Thinking about going with Luka o8.5 assists vs Suns at -115. He’s cleared that in 4 of his last 5 against them and looks dialed in early this season. What’s everyone riding with today?",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwyxk1/"
    },
    {
      "created_utc": 1761200618.0,
      "author": "PFLPicks",
      "text": "# Record: 1 – 0\n\n# Net Units: +0.57 U\n\n# ROI: +57 %\n\n# Sport | League | Event Time / Time Zone:\n\nFootball | UEFA Europa League | October 23 – 18:45 CET\n\n# Pick:\n\n**Fenerbahçe – Stuttgart | Over 2.5 Goals @ 1.62 (1 Unit)**\n\n# Write Up:\n\nFenerbahçe’s home fixtures this season have a consistently high scoring environment. In Istanbul they’re averaging **\\~2.3 goals scored** with **\\~2.8 xG created per match**, and **\\~80%** of their recent home games have finished above 2.5. The approach is direct and width-oriented: early deliveries into the box, frequent second-ball attacks, and sustained pressure after turnovers — great for shot volume, but it also invites transition the other way.\n\nStuttgart’s away profile points to volatility rather than control. Their road games across domestic and European play combine to **\\~3.3 total goals per match**, with **high shots per 90** and above-average **big chances created**. Out of possession they push the line high, press aggressively, and accept risk in behind — a style that turns matches into end-to-end spells when the opponent attacks with width and pace.\n\nThe matchup fits an Over: Fenerbahçe should carry most of the ball and generate repeated box entries; Stuttgart’s vertical counters and early passing into space keep the game open. Both rank near the top of their leagues for **shots per 90** and **big-chance frequency**, and neither typically downshifts late when leading — late-game scoring stays live.\n\n**Price context:** 1.62 implies a break-even of **61.7%**. Given the attacking tempo, finishing volume, and historical goal counts for both sides in these contexts, the probability of **3+ goals** sits meaningfully higher. In other words, the number aligns with an open, chance-rich game state; the rare losing script would be an unusually controlled, low-event match.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwx5lp/"
    },
    {
      "created_utc": 1761199306.0,
      "author": "RichPickz1",
      "text": "Pick of the Day\n\nNBA 🏀 | 24/10/2025 📅\n\nRecord: 5-6-0\n\nNet Units: -0.50\n\nLast Pick: Celtics -2.0 ❌\n\nToday’s Pick: OKC Thunder -7.5 vs Pacers (1.90)\n\nLet’s keep the pre season record and build this back up one game at a time\n\nhttps://preview.redd.it/iwgcsrgrxswf1.jpeg?width=1206&format=pjpg&auto=webp&s=e6443165f6045b4953e62afc4ea2af8439700a2e",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwuttt/"
    },
    {
      "created_utc": 1761198964.0,
      "author": "RunCandid7567",
      "text": "Record: 1-2 😒\n\nEvent: Crystal Palace vs AEK Larnaca (3:00pm EST)\n\nPOTD: Crystal Palace -1.5 spread (3U to win 4.8U)\n\nOdds: -165\n\nWrite up: I’ll keep it simple. Crystal palace is supremely superior compared to AEK. Crystal Palace have a (lineup) market value of $354M vs AEK $4.5M. I think the quality in these teams is miles apart and a win for Crystal palace (by more than 2 goals) seems more than reasonable. \n\nOliver Glasner (Crystal Palace coach), and I quote, stated:\n\n“[We will pick] the best team, like always. We had five days between Bournemouth and Larnaca. The international [players] got two days off to recover, and we’ve prepared yesterday and today – short sessions, but the players look really sharp.\n\n“We will play the best team [against Larnaca]. That makes sense for us, and [then] prepare for Arsenal.\" \n\nThe only concern here is that AEK did upset AZ Alkmar and have shown quality in their play, but I think at Selhurst park, the eagles can lock down this win in a comfortable manner, especially considering they are starting their strongest team.\n\nIf you tail me BOL, if you fade me, I hope you lose;)\n\nLet’s win some money gentlemen🤞💰",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwu7pm/"
    },
    {
      "created_utc": 1761198963.0,
      "author": "Icy-Road6438",
      "text": "PICK OF THE DAY RECORD: 1-0\n\nRECORD ON YEAR: 1-0 (+2.5 units)\n\nPREVIOUS PICK: Taylor Hendricks NBA (UTA) over 8.5 points. \n\nSUMMARY: Well we start the season off strong. Hendricks was great in this game in only 19 minutes going 4-6 from the field and as I predicted launching up exactly 3 threes and knocking down 2 as the jazz dismantled the clippers who I thought would be the team blowing the jazz out. Just too low for a guy who had been crushing the pre-season. \n\nTHURSDAY OCT 23 PICK OF THE DAY\n\nBennedict Mathurin O 18.5  Points (-119 DK) 2.5 units \n\nIt’s obvious with Halliburton out scoring has to come from somewhere and look no where else but Mathurin. Looking at his last 8 games without haliburton on the floor he has hit this number in 7/8 and 4 in a row!!! His usage skyrocketed to 25.3% without him last year compared to 22.7% with him. He’s also one of the top three favorites for most improved player this season and I think we see that show in game number 1. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwu7m2/"
    },
    {
      "created_utc": 1761198762.0,
      "author": "solmer7",
      "text": "Record:** 44W-21L (+9.86 units)\n\n **Last 10 POTD: ✅ ❌ ❌ ✅ ❌ ✅ ✅ ❌ ✅ ✅\n\n \\*\\* Football \\\\ UEFA Europa League \\*\\* \n\n**\\*\\*POTD\\*\\*: Celtic vs Sturm - Sturm to score over 0.5 goals -@ 1.54 - 1 unit ( All my picks are 1 unit)\n\n **Writeup**: Hey folks, Sturm 22th place with 3 points. Against Rangers they managed to win 2-1 with 1.64 xG. Tonight I expect that they will get a point from Celtic, that is why I leading on atleast a goal from Sturm side. Kiteishvili in great form, lets start the 3 win streak with Sturm goal.Best of luck to who tails! I would be greatly appreciated, if you wish to tip.\n\nTFLCDLox65FoD7nNiZBnXmeuvJTQRvKnEn(TRC20)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwtu9m/"
    },
    {
      "created_utc": 1761197491.0,
      "author": "tokcliff",
      "text": "Event: French Open Men's Single\nPOTD Record: 126w 83l 2p \nDate: 23 Oct SGT\nNet Profit = +44.9075 units\n\nAnthony Sinisuka Ginting ML at 2.19 @ 1.75 units (vs Chi Yu Jen)\n\n1/1 H2H, honestly, Ginting shouldn't be such an underdog, should be equal odds at most, but Ginting was very good, top 10, but due to iniury he's faltering now. Ever since his return, he is a bit shaky, therefore only 1.75 units, and also Chi Yujen isn't particularly good either. Would've placed more, but mainly worried about Ginting's consistency after his return\n\nBTW if anyone wants to follow my blog where I do some reflection about badminton betting\nhttps://tokkidokkie.wordpress.com/",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwri52/"
    },
    {
      "created_utc": 1761196782.0,
      "author": "Enigmaticwinner",
      "text": "Joe??? Come on out!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwq61d/"
    },
    {
      "created_utc": 1761194689.0,
      "author": "keyboardwarrior425",
      "text": "Absolutely love this. We ride again 🤘🏼",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwm13o/"
    },
    {
      "created_utc": 1761194387.0,
      "author": "ihatereddithiveminds",
      "text": "can anyone else not bet on Jordan Mason yards anywhere? very strange",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwlek2/"
    },
    {
      "created_utc": 1761191818.0,
      "author": "ControlRoyal1768",
      "text": "Record: 16-8 (+19.45u)\n\nLast 10: ✖️💰💰💰✖️✖️💰💰💰✖️\n\nLast POTD: 🏈 Detroit Lions ML + Jaxon Smith-Njigba under 100 alt receiving yards (+108). ✖️\n\nWriteup: Detroit won easily. Actually felt good at halftime with JSN, he had 60 yards but game script was going to favor the run heavily and a lot of those yards came towards the end of the half on softer coverages. Texans unfortunately got their offense somewhat together in the second half, forcing Seattle to throw more. JSN is a superstar in this league, I’m happy for the kid.\n\nToday’s POTD: 🏈 Oronde Gasden II 25+ alt receiving yards + Under 52.5 alt total points (-139).\n\nGame starts at 8:15pm EST. Bet 2.75u\n\nWriteup: For Thursday Night Football, we have the LA Chargers hosting the Minnesota Vikings. Both teams are dealing with multiple injuries to key players, which factor heavily into both legs of this bet.\n\nFor the first leg, Chargers TE Oronde Gasden has been utilized more and more each week all season and has emerged as a breakout player over the last 2 weeks, putting up 68 yards and 164 yards in those weeks with 7 catches both weeks. With the Chargers having a less and less effective run game each week as well as having receiving inconsistencies, Gasden has become a focal point of the offense recently. There is a lot of variance in this pick, so we’ll bring this line down to 25 yards in a game that could be ugly. Even still, Gasden has looked off the charts and could easily pop for 60-100 yards or more no matter the game script.\n\nThis leads to the 2nd leg, where the under feels like a really solid bet. We’ve seen so much inconsistency and so many surprises in prime time games this season, so I am avoiding the spread and going after an under play that I like a lot. The Chargers have injuries to 2/3 of their RBs, their 2 top offensive lineman, along with others. The Vikings have been using backup QB Carson Wentz, who has not been impressive at all, especially in the redzone. I do not think there will be a ton of offensive success in this game, and worst case, our bet still cashes if 7 touchdowns and a field goal is scored, which I find incredibly unlikely for this game. I predict the total score will end up around 42, giving us some solid wiggle room.\n\nRemember to only bet what you can afford, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwftd6/"
    },
    {
      "created_utc": 1761189458.0,
      "author": "InconsolableBrat",
      "text": "POTD Record: 141-97 | Profit: +86.46u | ROI: 12.7%\n\nSeason Record: 1-1\n\n \n\nLast Pick: Kristaps Porzingis (Hawks) O24.5 PRA @ 1.80. 4U. ✅\n\nKP was up to 18 PRA at the half and ultimately covers comfortably despite the Raptors blowing out the Hawks. He ends with 29 PRA (20/7/2). The Ayton pick on opening night unfortunately lost, but let’s try and get 2 wins in a row!\n\n \n\nNext Pick: **Denver Nuggets vs Golden State Warriors U233.5 @ 1.91**. 3U play.\n\nThis total seems way too high, the 7/L10 between these teams have hit the unders, and this line is even higher than most of those games. The Warriors have Horford and Dray who did a good job defensively against the Lakers with their experience and smarts, and Butler looked locked into defense as well. With the Nuggets, they now have Braun starting who is a high-effort defender. I expect a good tactical contest between these teams, but not expecting a shootout. Let’s root for missed buckets and defensive boards!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkwabaq/"
    },
    {
      "created_utc": 1761188776.0,
      "author": "billycapezzi",
      "text": "\nPOTD RECORD: 164-123\n\nSeason record: 1-0\n\nLast POTD: __Austin Reaves O10.5 RA @2.0 1U__ ✅\n\nTodays POTD: __Aaron Gordon O4.5 Rebs @1.83__ 1U (Bet365)\n\nNBA | Nuggets vs GSW | 🏀  \n\nNice to get that first dub relatively sweat free, thanks for the warm welcome fellas meant a lot. We move \n\nStill targeting undersized GSW here and with MPJ out the picture for Nuggets I think Gordon’s rebound avg will go up significantly this season. Last year he averaged 4.8 rebounds per game, without MPJ he averaged 6.7 rebounds per game.\n\nSame thinking here that Jokic will get dragged out leaving rebounds for Gordon to grab, likely gets the Butler/Kuminga task regardless who it is both likes to drive to the rim and aren’t really 3 point shooters, should be close to the rim quite often and in good spots for weak side rebound opportunities here. He also likes to crash for the offensive boards and against this Golden State team he could find success in doing that.\n\nOver this line in 6/L7 games against GSW avg 7.6 RPG on 13.1 rebound chances per game, \n\n7.5 RA not bad either if it gets bumped but I prefer to go with just boards, hopefully he feasts like he can.\n\n_As much as I appreciate y’all I would also like to say that we manage the expectations and don’t let let the highs get to high and the lows to low, and gamble responsibly._\n\nEnough with the talk time to eat Gordon!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkw8oax/"
    },
    {
      "created_utc": 1761186432.0,
      "author": "hitesh012",
      "text": "**Record:**\n\n* 65 WIN | 59 LOSS | +30.27 unit of profit overall\n\n\n**Previous bets (last 3):**\n\n\n* Eagle Farm - 22 Oct 2025 - Win Bet - LOSS\n \n* Rockhampton -30 Jul 2025 - Place Bet - LOSS\n\n* Kempsey - 29 Jul 2025 - Place Bet - WIN\n\n\n\n**POTD:**\n\n* Horse Racing\n\n* Geelong R4 - Place Bet - #2 Berkeley Square to Place (i.e. finish top 3)\n\n* Track Rating - Soft\n\n* Nolen jumps on Berkeley Square on a wetish track in Geelong. Lately the horse has been running on dry and good tracks, but really needs a wet one to shine. Experienced at the distance (2 placings) and has seen the track before (1 win) I'm expecting a good showing for the cup, it might even win but the odds don't seem to suggest that\n\n\n**Odds - 1.65 on b365 (don't take anything less than 1.55, at that price doesn't make it worthwhile imo)**\n\n* 3.03 units to return 5 units\n\n**Race time:**\n\n* 3:10pm Thursday (Australian EST)\n\n* 12:10am Thursday (American ET)\n\n* 5:10am Thursday  (UK time)\n\nedit was formatting only",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkw2oce/"
    },
    {
      "created_utc": 1761185448.0,
      "author": "AbbreviationsNeat399",
      "text": "Record: 28-16 (+11.66) 14-5 this season\n\nHistory:❌✅❌✅✅❌✅✅✅✅❌✅❌✅✅⚫️✅⚫️✅❌❌✅✅❌❌✅✅✅✅✅✅✅✅❌✅❌✅✅❌✅❌✅✅❌ (⚫️=injury)\n\nEvent: chargers vs vikings\n\nPick: Oronde Gadsden II 5+ receptions +128 (1u to win 1.28u)\n\nWrite up: The vikings defense runs the most middle field open coverage in the NFL. Herbert has played two other defenses that are top 5 in middle field open and he threw to the tight end position more than 10% more often, including the dolphins game where gadsden excelled. That’s about 4 extra targets to the tight end position per game. The vikings also allow the fewest wide receiver receptions. They are targeted at the inline position at the 4th highest rate where Gadsden plays half his snaps. The other half he is in the slot position of which herbert throws to at the second highest rate in the NFL. Gadsden has run more routes than keenan allen the last couple of weeks. The Vikings are also first in cover 2 rate over the last three games at a 43%, and gadsden is first on the chargers in yards per route run vs cover 2 and 2nd in targets per route run. Keenan and Gadsden are far and away Herbert’s favorite targets versus this coverage; last week, there was 7 targets between them, and only one other to all other receivers combined.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkw00bf/"
    },
    {
      "created_utc": 1761185222.0,
      "author": "MikeDanTonyBrothers_",
      "text": "Record: 1-1\n\nUnits: +0\n\nAll bets are 1u\n\nPrevious POTD: Basketball - Sixers @ Celtics - Joel Embiid double-double (+122) ❌\n\nEmbiid was taken off the injury report they said he was good to go and then 30 min before game time announce a minutes restriction. Wouldn’t have mattered anyway dude played like dogshit. VJ Edgecombe looked awesome tho. \n\nToday's POTD: Basketball - Pacers v OKC - Andrew Nembhard o6.5A (+113)\n\nWrite up: Nembhard averaged 5 assists/game last year. He has averaged 7.2 in his last 10 games without Haliburton. TJ McConnell is also out. Expect Nembhard to take on the primary distributor role in the pacers offense with Siakam and Mathurin taking the bulk of the shots. OKC is coming off a double OT game to start the season. Both Pacers and Thunder are fast pace teams should have a lot of possessions.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvzduf/"
    },
    {
      "created_utc": 1761185208.0,
      "author": "whidswhinners",
      "text": "**2025 NFL Record:** 14W - 6L  \n**2025 MLB Record:** 4W - 1L  \n**2025 NBA Record:** 1W - 0L  \n✅✅✅❌✅✅✅✅❌🩼✅✅✅✅❌✅🪝✅✅✅❌✅✅✅❌✅\n\n**Net Units:** \\+8.61 units (I only promote 1u waigers)\n\n**Last Pick:**  Nikola Vucevic - o17.5 Points (-132 on DraftKings)✅\n\n**Today's Pick:** Will Reichard - o1.5 Field Goals Made (or Vikings Team Field Goals Made on Bet365) (-115 on Bet365)\n\n**Writeup:**\n\n*Reichard’s been a field-goal machine this season—top-8 in attempts and cashing this number in 5 of 6 (83%). His claws stay sharp.*\n\n*The Chargers have been generous to kickers, allowing the 5th-most FGs and letting 6 of the last 7 booters hit:*\n\n*Harrison Butker — 3 Field Goals Made*  \n*Daniel Carlson — 3 FGMs*  \n*Will Lutz — 2 FGMs*  \n*Jude McAtamney — 2 FGMs*  \n*Matt Gay — 2 FGMs*  \n*Riley Patterson — 2 FGMs*\n\n*Blame L.A.’s red-zone defense: sixth-highest defensive success rate. Teams march, then stall—perfect hunting ground for three.*\n\n*With a modest 45-point total and a defensive grinder on deck, expect Reichard to stay busy under the Thursday night lights.*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvzcle/"
    },
    {
      "created_utc": 1761184608.0,
      "author": "OneLegShort5",
      "text": "Record: 0-0 \n\nPick: LA CHARGERS ML \n\nEvent: NFL - TNF - Minnesota Vikings @ Los Angeles Chargers (-175) 7:15CST \n\n\nReason: The public will write the Chargers off after losing to the colts but the truth is that the Colts shouldn’t have been underdogs in that match and losing to the Colts does not make you a bad team. \n\nI expect the Chargers to bounce back in this one. Carson Wentz, the backup QB for the Vikings will continue to be the QB for the Vikings and I simply can’t see him pulling off a win against Justin Herbert and the Chargers. Chargers OL is healthy again, Vikings are the opposite. No Aaron Jones, their starting RB and possibly no Darrisaw tomorrow, their starting Center. \n\nChargers are currently in 2nd place in the AFC West and want to remain competitive if they want a chance at the division after a great start to their season. In my opinion they are a well coached football team and they’re at home. Their TE had a great breakout game last game against the colts and they looked good offensively last week. They have 3 great options at wide receiver. Give me the Chargers in TNF. \n\nThe only con is the trend of upsets in TNF this season but I think this game will break that pattern.\n\nEdit: Added Odds",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvxow8/"
    },
    {
      "created_utc": 1761183398.0,
      "author": "Initial-Tank-9424",
      "text": "**POTD RECORD 3-1 ( +5.6 Unit )**  \n**FORM :** ✅✅❌✅\n\nPrevious POTD : Football - Qarabag FK VS Athletic Bilbao- **Under 9.5 Shot On Target** \\- Odds : 1.75 - UK time 17.45 ✅  \n( 3.5 Unit )\n\nToday's POTD : Football - AS Roma VS Viktoria Plazen - **Under 3.5 Goals** \\- Odds : 1.59 - UK time 20.00 ( 5 Unit )\n\nReasoning : 10/10 of Roma’s recent games have finished under 4 goals, a low-scoring trend.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvucs9/"
    },
    {
      "created_utc": 1761180699.0,
      "author": "reptilia_remasterV2",
      "text": "**POTD Record**: 26-11 | Tennis POTD Record: 23-9 | Profit: +18.8u\n\nLast Pick: ATP Basel | Kecmanovic ML vs Wawrinka (-175) | 3u ❌\n\n**Today's Event**: ATP | Basel | FAA vs. Cilic\n\n**POTD**: FAA -2.5 games (-140) | 3u\n\nTough loss last pick. Wawrinka looked like his vintage self of all matches. Sometimes you take the L despite the analysis making perfect sense, but that's gambling for ya\n\nAnyways, back to Basel we have #12 FAA taking on #89 Cilic. Indoor hardcourt Felix is on another level. He's 9-1 and on a 5 match win streak, coming off a title in Brussels. He beat Diallo soundly in R1 in straight sets. In fact, he has covered this line in 8 of his 10 indoor hardcourt matches this season, which includes wins over Musetti and Lehecka. \n\nDespite the H2H being 3-2 in Cilic's favor, Felix has won the last 2 matches, most recently in 2025 Dubai where he covered this line. Cilic's last win over Felix was in 2021, which was back when he was a top 25 player, but father time catches up with us all and now he's 37 and not the player he used to be.\n\nCouldn't decide between this or Opelka ML as my POTD; hoping I made the right choice lol\n\n*Tail or fade, BOL!*\n\nEdit: You gotta be fucking kidding me",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvmvrt/"
    },
    {
      "created_utc": 1761180670.0,
      "author": "NoFilterD",
      "text": "**49-26**\n\n**4485.40 +44 units**\n\nlast pick Baker Mayfield over 230 pass yds…he finished with 228, nothing to talk about. Fell flat as flat could be first half and came alive in second half.\n\n**PICK TJ Hockenson over 3.5 receptions -140 4 units($400 to win 685.71)**\n\nWill make this short but sweet,Minnesota’s Justin Jefferson is going to garner all the attention from the chargers giving Hockenson plenty of looks from Wentz. Hockenson has become one of Wentz’s most reliable offensive weapons. Hockenson was targeted 9 times last game against Philly, getting 6 receptions. Before that he also had 6 receptions. In fact with Wentz and not jj throwing to him he has gone over 4 receptions every game. I also will be sprinkling a unit on him grabbing 5.5 receptions for +275 but that is out of what I can officially pick lol. BOL everybody let’s get a W!\n\nhttps://buymeacoffee.com/dieselreukv",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvmsv9/"
    },
    {
      "created_utc": 1761178615.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 182-135\n\nUnits Won: +98.36\n\nLast Pick: Inspired>SkewMond Map 1 Kills (+135) ✅\n\nToday's Pick: **Kiin U 3.5 Kills Map 1 (-114)** 5u\n\nhttps://preview.redd.it/qdz5a8wk8rwf1.png?width=218&format=png&auto=webp&s=925a50492d5e5c76bc084c0df8da9f5c253c90a8\n\nTeams: GenG vs. Top Esports\n\nGame/Time: League of Legends (LOL) | World Championships | 7:00 AM EST.\n\n**For those who need help finding the pick or betting esports can always reach out!**\n\nWriteup:\n\n* Kiin is averaging 2 kills per game so far at worlds, he has hit this line in 1/3 games so far despite his team's 2-1 record overall. Kiin averaged 3.1 kills per game in Summer 2025 while having a 75% winrate meaning even winning 3/4 games, was still below this kill line\n* The current top meta is not in favor of this line at all, we are seeing tanks/tankier bruisers being picked and top lane kill share across the tournament so far has been very low. So far at worlds we are only seeing 1 top laner average 4 kills (Zeus) and 2 between 3-3.5 (Flandre/Bwipo). That means 15/18 are averaging 2.7 kills per game or less with 14/18 averaging 2.5 or less kills per game at worlds.\n* Kiin himself is averaging 2 kills per game so far at worlds despite a 2-1 record overall. He has a 1/3 hitrate overall but his one game he hit was a hook over and was on a tank which isn't likely to repeat itself.\n* While GenG come in as -500 favorites and should take the series, TES on paper aren't as bad of a matchup as a lot of people seem to be saying. Historically the players on TES have actually matched up relatively well against GenG (Creme 4-4 vs. Chovy), (Jackeylove 9-7 vs. Ruler), (369 7-5 against Kiin).\n* Kiin specifically has struggled heavily in the h2h against 369 lifetime. In their 12 matchups lifetime, 369 leads in both the laning statistics and the overall stats by a significant margin. In their 12 games 369 is 37-33 kill/death while Kiin is 13-39 kill/death in these matchups.\n* Kiin overall hitrate h2h against 369 is 1/12 h2h with only 2/10 of those games being 2+ kills (6/2 kills) and the only time he hit being in 2023. In 2024, Kiin had a 0/8 hitrate against 369 h2h and averaged .75 kills per lane",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvh4kf/"
    },
    {
      "created_utc": 1761177858.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Hvidobre vs Køge\n\nOver 3 goals, Asian Handicap @ 2.34 \n\nRecord: 68 - 67 Profit: -3.53 u\n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅❌✅✅❌❌✅❌❌✅✅❌❌✅❌✅✅❌✅✅✅✅❌❌❌❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌\n\nHvidovre’s games average around 2.8 total goals, while Køge’s sit near 2.9, with both sides showing shaky defenses. Hvidovre score about 1.3 per game and concede just over one, while Køge let in around 1.8 each match. Recent meetings average 2.6 goals, but both teams have been more open lately, especially with Køge’s backline struggling and Hvidovre attacking more at home. If there’s an early goal, things could open up quickly. Over 3.5 goals isn’t a sure thing, but with both sides playing forward and leaving gaps, it feels like a realistic outcome.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvf1l7/"
    },
    {
      "created_utc": 1761177534.0,
      "author": "damagebabee",
      "text": "**POTD** Record 113-02-93\n\n\n\nFCSB VS BOLOGNA\n\nDate: 23 OCTOBER 2025 at 17:45\n\nBET ON: Match odds- BOLOGNA\n\nOdd: 1.63\n\n\n\n\\- Bologna travel to Bucharest highly motivated, knowing that only a win will keep their Europa League hopes alive after a slow group-stage start. The Italian side should line up in their usual 4-2-3-1 formation, built around solid defensive organization, patient ball control, and quick transitions through players like Orsolini and Ferguson. In contrast, FCSB are facing major defensive problems, with several key defenders such as Dawa, Crețu, Popescu, Graovac, and Chiricheș sidelined through injury. This leaves their back line fragile and vulnerable to Bologna’s structured attacking play. With FCSB’s defence in disarray and morale dented by recent domestic struggles, and Bologna’s tactical structure looking sharper and more stable, the visitors hold the edge to secure the win.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkve57x/"
    },
    {
      "created_utc": 1761177353.0,
      "author": "eddsters",
      "text": "Record 2-0 ✅️✅️\n\nPrevious :**Real Madrid v Juve: Mbappe o0.5 shots on target + Bellingham o0.5 shots on target @1.90** ✅️\n\nTodays POTD: **GA Eagles vs Aston Villa: Villa ML & o2.5goals  @1.90**\n\nAston Villa come into this match levels above Go Ahead Eagles in every measurable way. They have Premier League experience, world-class coaching, and a squad filled with technical and physical quality. The Dutch side, by contrast, are low on confidence and struggling domestically, hovering near the bottom of their league and conceding goals far too easily. They often look disorganized in defense and lack the structure or intensity to contain a side with Villa’s pace and movement.\n\nVilla’s attack has been fluid and clinical. Players like Watkins, Diaby, and McGinn are finding form, and their chemistry going forward has been outstanding. They create waves of pressure and have been averaging multiple goals per match in recent fixtures. Go Ahead Eagles, on the other hand, tend to push numbers forward at home, which leaves gaps behind gaps that a team like Villa can exploit ruthlessly.\n\nThe quality gap should translate directly to goals. Go Ahead Eagles’ defensive issues and Villa’s attacking intent make over 2.5 goals extremely likely. Even if the hosts manage to score through set pieces or a counterattack, Villa have more than enough firepower to respond and take control. Expect a dominant performance from Villa, who will dictate the tempo, create plenty of chances, and likely come away with a convincing win; a 3-1 or 4-1 scoreline feels realistic given the current form and difference in class.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvdn4w/"
    },
    {
      "created_utc": 1761177242.0,
      "author": "Geluksspook24",
      "text": "Record: 5-10 ✅✅❌✅️✅️❌❌❌❌✅️❌❌❌❌❌\n\nProfit: -4.96 units\n\nLast pick: (Galatasaray - Bodo/Glimt) Jens Hauge over 0.5 shots on target (2.25) ❌\n\nWell well well. In the first half he got a massive chance, facing the goalkeeper about 10 metres away from the goal, with no defenders in front of him... And he managed to shoot off target. His xG was 0.41. Extremely unlucky. The value in the bet was insane though as the closing line odds dropped to like 1.70 and we got it for 2.25. \n\nFair to say luck has not been on our side lately. 9 out of the last 10 bets lost. But we don't give up. Staying away from player props for a while and see if we can reverse the damage done over the last 10 bets.\n\n\\------------------------------------------------------------\n\nCompetition: UEFA Europa League\n\nMatch: Feyenoord - Panathinaikos\n\nStart time: 10.30pm EST / 16.30 CET\n\nPick: **Feyenoord to win (odds 1.60)**\n\nUnits: 2\n\nFeyenoord host Panathinaikos in the third round of the Europa League. Feyenoord are in excellent form, they are still unbeaten in their domestic league (W8, D1). However in the Europa League, they have 0 points from their opening 2 games.\n\nFeyenoord head coach Robin Van Persie has implemented a possession based style of play at Feyenoord, with his team showing a lot of creativity in attack. Striker Ayase Ueda is in top form and even scored a hattrick in the first half last weekend against Heracles. So far this season, the Dutch side have been highly efficient in front of goal, scoring an average of 2.78 goals per game from just 2.03 xG. \n\nPanathinaikos is 7th in their domestic league and overall have less quality players than Feyenoord.\n\nI expect Feyenoord to turn up today and beat Panathinaikos. The pressure is on after losing the first two matches and Feyenoord can not afford to drop even more points in the league phase.\n\nGood luck and bet responsibly 🍀\n\nI share all this research for free so everyone can benefit. If you want to leave a small tip for the time and effort I put in, I’d really appreciate it :) [https://buymeacoffee.com/xgenius\\_betting](https://buymeacoffee.com/xgenius_betting)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvdc0u/"
    },
    {
      "created_utc": 1761177032.0,
      "author": "dreamchasing1",
      "text": "Record: 214-200 Net Units: -16.94 46-48 on 1.5u plays, 36-36 on 2u plays, 1-1 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Champions League] Galatasaray vs Bodo Glimt\nLast pick: Galatasaray over 1.5 goals + BTTS @ 1.83 - 1.5 units won\n\n\nEvent: Soccer/Football, [Finland Veikkausliiga] TPS vs KTP\n\n\nPick: BTTS @ 1.90\n\n\nThe first leg of the relegation battle between two teams who hit btts in 3/3 meetings last season when they were playing in the 2nd division together. Leading up to this game, both sides have seen majority of their games hit a btts as 11/14 home league games for TPS hit btts, 9/14 away league games for KTP.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkvcqyt/"
    },
    {
      "created_utc": 1761174359.0,
      "author": "IWISHIWASASECRET",
      "text": "__POTD__: 0-0\n\nPlay: __Justin Jefferson Over 26.5 Longest Reception__\n\n3u to win 2.6u\n\n__Write Up:__ Jefferson’s been clearing this number all season. Through 7 games in 2025, he’s gone over 26.5 in 5 of 7 and is averaging about 33–34 yards on his longest catch. His deep target rate (balls thrown 20+ air yards) is top three in the league, and the Vikings are clearly using him to stretch the field again. Even in games where his total yardage isn’t huge, he’s getting at least one designed deep shot. The matchup makes perfect sense too. The Chargers play a lot of Cover 3 and quarters, and Jefferson eats that alive. He’s elite at finding the gaps between the corner and safety, and the Vikings’ O-line has been giving enough protection for those routes to develop. Derwin James isn’t the same deep presence he used to be, and the corners have struggled with physical route runners all year. Basically, Jefferson just needs one of those deep crossers or play-action posts to hit. He’s done it in five of seven games this season, and the Chargers have allowed a 30+ yard reception in three straight. The game script should favor the pass too. Both teams can score, and this one could easily turn into a shootout.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkv53zs/"
    },
    {
      "created_utc": 1761173745.0,
      "author": "CeaselessAction",
      "text": "Overall Record: 11-3\n\nUnits: +15.95 units\n\nForm: ✅✅✅❌✅✅✅✅✅❌✅❌✅✅\n\nLast Pick\n\n2 Leg Parlay // Galatasary v. Bodø/Glimt - BTTS-YES ✅& Real Madrid ML ✅\n\n(+104 on Fanduel) - 2.5u to win 2.6u\n\nWIN  // +2.6 units ✅\n\nSummary: \n\nWell, I will be the first one to say it… that was a bit of a sweaty day in the Champions League, but a fun day across the board nevertheless. Our first match between Galatasaray and Bodø/Glimt saw the Turkish side score in the first couple of minutes. For a BTTS-Yes bet, an early goal like that from either side is exactly what you want. The Norwegian side didn’t look very convincing and struggled across the board for the first part of the first half. While their defense continued to give the ball away in the front of goal, we were concerned with the offensive side. They ended up having a fair number of solid chances to net and finally found the net halfway through the second half.\n\nLos Blancos also gave us a little bit of a scare by giving Juventus a number of promising chances on goal, even though they dominated possession throughout the match. It was only a matter of time before Real Madrid found the net and after a ton of chances, they put one through in the 57th minute. They did give us a couple scares at the end of the game giving Juventus some additional opportunities to equalize, but Courtois played a really incredible match to keep a clean sheet. 1-0 Real Madrid.\n\nAnother great day across CL as I hit on Chelsea -1.5 straight bet, Chelsea ML + Bayern -1.5 parlay as well! The only loss from this CL round was my Marseille Draw No Bet straight bet, and that was largely in part due to the idiot flopping while already having a yellow. No worries though, can’t be mad at all about that performance over two days!\n\nBig congrats to all those who tailed or added these onto your own parlays, we did well again today lads!\n\nOn to the next💰\n\nThursday’s Pick\n\nNFL Football\n\nMinnesota Vikings @ Los Angeles Chargers (7:15 PM CT)\n\n2 Leg Parlay // Justin Jefferson 60+ Receiving Yards + Minnesota Vikings +10.5 (Alt Spread)\n\n(-135 on Bet365) - 3.5u to win 2.59u\n\nAfter a successful Champions League round over the last two days, we are headed back to the United States for some American Football. The Minnesota Vikings travel to Los Angeles to face the Chargers, and I have to say I do like the Vikings alot in this spot. Looking at their games with Wentz under center (J.J. McCarthy sucks in my opinion), they have looked like a pretty complete team. They lost by 3 to the Steelers and 6 to the defending Super Bowl Champion Eagles. They beat the Bengals (pre-Flacco) and the Browns in a weird game at Tottenham Hotspur Stadium. \n\nFor the first leg of the bet, we are going with Justin Jefferson 60+ Receiving Yards. Everyone knows that JJ is a dog. Since Wentz took over, his rec yards have been 75/126/123/79. He has had 10+ targets in the last 3 games and he is averaging 15.5 yards per catch over the course of the season (and that is including games with McCarthy at QB). The Chargers also play an alarming amount of zone coverage, where JJ has proven he is at his best (much better than man coverage).\n\nThey have a strong WR2 in Addison, solid TE in Hockenson, and decent run game with Jordan Mason. It will be very hard for the Chargers to double up JJ with their other weapons. The Chargers defense against WR1 has also been highly suspect this season, giving up the following yardage to other teams top receivers: 98/Pierce/IND, 95/Waddle/MIA, 96/Samuel/WAS, 44/Slayton/NYG, 118/Sutton/DEN, 68/Meyers/LV, and 99/Brown/KC. With numbers like these, we see consistently that they will give up yards to other teams' receivers. Give me JJ to have 60+ in this TNF matchup.\n\nThe second leg of the parlay is an alt line of +10.5 for Minnesota. There isn’t a ton to this other than the fact that I think Minnesota actually has a chance to win this game. They have played pretty well with Wentz under center and have a very competitive team (6 pt loss to Philly, 3 pt loss to Pit). I don’t see the Chargers as a better team than either Philly or Pit, so I like them in this game. Chargers don’t have shit for home field advantage in LA, and Minnesota fans travel extremely well. The Chargers defense is bad, and they have an unproven run game thus far. They only beat the Dolphins by 2, got throttled by the Colts (who are definitely good), lost to the Commanders and Giants. I may sprinkle some on Minnesota ML, but to me, this cushion gives plenty of room for the “unknown”.\n\nMinnesota to cover +10.5 and Justin Jefferson to have 60+ receiving yards. Book it.\n\nBest of Luck to those who tail, as well as those who don’t! Please make sure to bet responsibly and only bet what you can afford to lose.\n\nI generally spend a couple hours a day combing through as much action as possible from across the world, in order to find value. I do have my own bankroll behind all my picks, but if you are feeling generous, any tips will just go towards enjoying a cold, 22 oz lager at the bar down the street (they're only $4.50 each during happy hour).\n\n[Sponsor a cold, 22 oz 🍺](https://buymeacoffee.com/ceaselessaction)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkv3e58/"
    },
    {
      "created_utc": 1761173517.0,
      "author": "Hercules-sonofZeus",
      "text": "Record: 38-25\n\nForm (most recent on right) : ✅✅✅✖️✅✅✖️✅✅✅✖️✅✅✖️✅✖️✅✖️✅✖️✖️✖️✖️✅✅✖️✅✅✖️✖️✅✅✅✅✅✅✅✖️✖️✅✅✖️✖️✖️✖️✅✖️✅✖️✅✖️✖️✖️✅✅✅✅✅✅✖️✅✅✅\n\nNet Units : +6.11u, ROI : +2.95%\n\nLast Pick: Bayern Over 2.5 Goals ✅\n\nEvent : Uefa Europa League ⚽\n\nGo Ahead Eagles vs Aston Villa\n\nPick : Aston Villa to Win + Total Under 5.5 Goals @1.68 for 3u\n\nVilla have won both of their Europa League matches so far, beating Bologna 1-0 and Feyenoord 2-0 without conceding a single goal, showing how solid and well-organized they are under Unai Emery. They also come into this game on a five-match winning run across all competitions, including victories over Tottenham and Fulham, and have kept four clean sheets in that stretch. The quality gap between the two teams is huge, as Go Ahead Eagles are sitting in the bottom half of the Dutch league with only one win from their last six games and several defensive injuries affecting them. Villa play very controlled football in Europe, never rushing but managing matches with patience and quality, so it is very unlikely that this game sees six or more total goals. A calm and professional performance from Emery’s team should be more than enough for a routine away win, most likely by a scoreline such as 2-0 or 3-0.\n\nIf you found these picks helpful, tips or donations are greatly appreciated as they support the time and effort I put into creating them: [buy me a beer🍻](https://buymeacoffee.com/hercules.son.of.zeus)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkv2r3j/"
    },
    {
      "created_utc": 1761173274.0,
      "author": "Sisyphus3232",
      "text": "Record 2-0\nUnits: +1.47\n\nForm: ✅✅\n\nLast bet : Sporting CP : Marseille Btts + over 2.5✅\n\n\nGotta be honest. We got lucky with the red card. Not sure if Sporting scores without it, marseille looked like the much better side for the first 40-45 mins, but we take it.\n\nFor today I initially wanted to go with a Tennis pick but then found a bet that kinda looks like a trap.  \n\nTodays Pick: Uefa Europa League \n\nNottingham Forest vs  FC Porto : Porto draw no bet @ 2.0\n\nI just dont know how this line makes any sense. Forest are terrible this season and they just sacked their manager. Meanwhile porto are top of the table in Portugal with a goal record of 19:1 in 8 matches. Forest are 18th in England with a goal record of 5:15 in 8 matches. Porto won both of their games so far in the europa league, while forest have one draw and one loss.\n\nMaybe they hope for a new Manager bounce with Sean Dyche but i will try my luck at these odds.\n\nIf i didnt have the feelings that this might be a trap i would go with the full ML. \n\nGood luck with your bets",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkv22el/"
    },
    {
      "created_utc": 1761172935.0,
      "author": "Square-Johnson",
      "text": "Record: 7-2 +7.7U\n\nForm: 💰❌💰❌💰💰💰💰💰\n\nRecent pick: Danny “The Freeze” Noppert to WIN vs Luke “Soft” Woodhouse at -154 on FD for 2.5U to win 1.6U💰\n\nEvent: DAY 1 PDC European Championship match at 3:30pm est\n\nPick: Martin Schindler to WIN vs Dave Chisnell -148 for 2.3U to win 1.55U. 💰💰💰💰\n\nWriteup: Ok, I honestly couldn’t have predicted to be on a “heater” with 5 in a row with my Potd, but here we are. Since I’ve had some “good looks” at darts I’ll continue for the folks then enjoy it.\n\nTomorrow’s matchup honestly feels like it’s setting up nicely for Martin Schindler to nick it. He’s been quietly building some serious form this season…  his averages have been hovering mid-90s with a solid 52% deciding-leg win rate, and he’s posted a monster 110 average on TV before, so he’s clearly capable of turning it on when it counts. The short, best-of-11 format suits him too…he doesn’t need to drag it out over a long set play, just get off to a quick start, keep his scoring steady, and make Chizzy chase. Schindler’s been sharp under pressure lately, and that’s exactly what wins these shorter races.\n\nChisnall’s still a danger, obviously, but his recent stuff hasn’t been at full throttle…his averages are a touch down, and he’s been a bit patchy on the doubles. That matters when you’ve only got 11 legs max to get it done. If Schindler keeps his scoring tidy and pins a few key checkouts early, he can absolutely run away with this match. He’s just got that upward momentum right now, and in this format, that’s often all it takes.\n\nSo in short, Schindler’s has been solid on the jump, Chizzys form is down despite his recent like 2-3 performances where he couldn’t not hit the 180s. But if you’ve watched Schindlers matches he can slap 180s just as effective as Chizzy on a good day.\n\nI was deciding how many units to put and 2.3 seems like a good medium.\n\nAs always, BOL and bet what you’re okay with pissing in the wind.\n\n![gif](giphy|Affa7SH8wBqdfMf5ip|downsized)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkv13t4/"
    },
    {
      "created_utc": 1761172381.0,
      "author": "VAM89",
      "text": "Record: 11-5\n\nLast Five Predictions (Old - New): ✅✅❌✅✅ \n\nNet Units: +13\n\nYesterday's Pick:  Lillestrom (-1) over Odds BK 3u @ $2.10  ✅ \n\nHad to double-check the odds a couple of times just to see I was reading it right. And for good reason too... The game ended 7-1 to Lillestrom, and was 3-0 after the first 20 minutes. This team is insane. Only regret is not putting 5u on it. Literally, the only thing stopping me was if there was any team news I couldn't find/access.  \nAnyway, a sweat-free game for us.\n\nEDIT: Teams are actually Hvidovre and HB Koge. Blame dyslexia a and typing this on a new device with a tiny keyboard. 🤦\n\nToday's Pick: Hvidore to win vs HB Kolge. 3u @ $1.61\n\nPick: I expect the odds to dip on this. \n\n4th-placed Hvidore hosts 10th-place Kolge in this match (12-team league). Hvidore are so far undefeated at home, whereas Kolge haven't won away yet. Kolge have pulled out some good wins this season for a team on 13 points in 13 games; however, they've been at home for each of them. Away, Kolge has conceded 17 goals in 6 games, and there hasn't been an outlier like a 7-0 win or anything similar, which would bump up the rate. \n\nHvidore have the second-best defence in the league, and that's vastly improved at home, whereas Kolge are one of the worst-performing defences regarding goals conceded.  Similar to goals scored as well, with Hvidore and Kolge being at opposite ends of the table. \n\nOn top of this, the two teams have already played each other in the league about a month ago. In that game, Hvidore won 2-0 away from home, so I'd expect them to do at least the same at home. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkuzixs/"
    },
    {
      "created_utc": 1761171145.0,
      "author": "Vandy023",
      "text": "Record: 0-2\n\nNet Units: -2\n\nLast Pick: BOS Celtics -2.5 ❌\n\nBasketball | NBA | 10:10PM EST\n\nPick: DEN Nuggets -1.5 (115)\n\nWrite Up: I’m leaning toward the Denver Nuggets to cover the -1.5 spread against the Warriors tomorrow night. Jokić is a beast at home in Ball Arena, and with Murray backing him up, they’ve got the edge in both scoring and playmaking. The Warriors will probably rely on Curry, but their supporting cast hasn’t been as steady lately, and Denver’s defense could give them some trouble. With that small spread and how well the Nuggets played at home last season, I reckon they’ll pull off a win by a couple of points.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkuvy4p/"
    },
    {
      "created_utc": 1761170998.0,
      "author": "Pefkov",
      "text": "Record: 5-3\n\nNet Units: +1.51\n\nLast Pick:  Jason Myers 8+ Kicking Points (+112) 1U to win 1.12 Units ✔️\n\nTodays Event: 🏈 NFL Thursday Night Football Vikings @ Chargers 7:15 pm CST 🏈\n\nTodays Pick: Jordan Addison 60+ Receiving Yards (+114 on DK) 1U to win 1.14 Units\n\nWriteup: Chargers play zone coverage second highest in the league at a rate of 82.6% second only to the Cowboys. Addison has been feasting on zone coverage and this game should be no different. Chargers third down defense has been quite bad being ranked 21st in giving up third downs, despite their ranked 8th pass defense\n\nAddison just came off an 128 yard game and has been averaging 94.3 receiving yards this year, averaging 6 receptions a game with 15.7 Yards per Reception.\n\nTo add on more, Wentz has been averaging just under 36 attempts a game. and the Vikings tend to pass around 65% of their snaps. The chargers defensive line isn't the greatest, which is good for a vikings O-line which has been rather unspectacular and injury ridden recently. Should give Addison more time to get open and Wentz more time to find his guy.\n\nWith the chargers moneyline at -175, it doesn't seem like these passing numbers should change for the worst this game. Vikings should be looking to bridge the gap and Addison is a prime candidate alongside JJ. Could go safe with the 054.5 but im going 60+\n\n[http://buymeacoffee.com/Pefkov](http://buymeacoffee.com/Pefkov)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkuviht/"
    },
    {
      "created_utc": 1761170963.0,
      "author": "Moist-Conflict-7850",
      "text": "RodPicks ⚽️\n\nRecord: 32 - 23\n\n\nBet size: 5 units\n\n\nLast pick: Bayern vs Club Brugge & Chelsea vs Ajax (Bayern -1 Handicap & Chelsea to win @ 1.85)  ✅️\n\n\nToday's pick: Go Ahead Eagles vs Aston Villa & Lille vs PAOK (Villa to win @ 1.47 & Lille or Draw @ 1.18 = @ 1.73) 🍀 \n\n \n\nAnother day, another Moist Conflict! Nice comfortable win today, let's get on to tomorrow's Europe League!\n\n\n\nPick of the day for tomorrow is a Europe League combo at 1.73 \n\n\nAston Villa is finally back to clicking on all cylinders and this is exactly the kind of matchup where they showcase their quality. They've strung together five consecutive wins across both competitions, and more importantly, their Europa League form has been clinical. Two wins in the group stage including that 2-0 victory over Feyenoord speaks volumes about their ability to break down European opposition. Now they're sitting third with 6 points, one goal difference away from the top and facing Go Ahead Eagles who are frankly struggling. In their last five matches, the Eagles have managed just one win with three losses sandwiched between draws, which tells you everything you need to know about their current trajectory. Yes, home advantage in the Netherlands can be unpredictable, but Aston Villa just dismantled Feyenoord 2-0, a team that's in way better form than Eagles. Villa should be cruising through this one.\n\nOn the other side, Lille is operating at a different level entirely. They're top of the table with 6 points and their last win away speaks for itself, a 1-0 victory over Roma is the kind of statement that reminds you their quality. At home, they're historically hard to beat and we're seeing that translate into results with wins over Braan at home  for example. Three games unbeaten heading into this one against PAOK, and here's the thing, Lille usually doesn't lose momentum at home, especially not to Greek opposition. Even the draw option gives us insurance because Lille's only blemish in five matches was against Lyon in a different competition entirely.  \n\nThe combo holds genuine value here because both picks operate on sound logic. Aston Villa's proven they can dismantle quality European sides while Go Ahead Eagles are leaking wins, and Lille's pedigree combined with home advantage makes this a formality.\n\n\n\n\n\n\nPS: Glad to hear so many of you are enjoying the write-ups and making profits from the tips! If any of the picks have helped you out and you’d like to show some appreciation, feel free to drop me a small tip, it keeps the motivation and energy flowing for creating even better content. No pressure at all, the biggest win is seeing people benefit from the work I put in. We win together ❤️  \n\nhttps://www.paypal.me/RodPicks",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkuvetp/"
    },
    {
      "created_utc": 1761170611.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkuud7j/"
    }
  ]
}