{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/2/25 (Tuesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/",
  "target_date": "2025-12-02",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-02T11:27:03.126661+00:00",
  "comments": [
    {
      "created_utc": 1764671862.0,
      "author": "san_solares",
      "text": "Net Units: +58.8  \nROI: 18.97%   \nRecord: 36-16-9 (W/L/P)\n\nLast POTD: Bologna TT O 1.5 (L) \n\nRidiculous from Bologna. 29 shots, 8 SOT, only 1 goal. There is only so much we can do.   \nWe move. \n\nToday's POTD: EPL - Fulham vs Manchester City - 14.30 PM - Manchester City ML - (1.73) - 5U \n\nMan City has beat Fulham 18 straight times, the last draw came in the 2011-2012 season. Overall, I know the odds are juiced because the game is being played in Fulham's home grounds; but still, odds are ridiculous. \n\nCity is in the fight for the EPL (surprisingly) and they don't want Arsenal to keep chipping away. Squad is just overall better, and model makes this line closer to 1.40 (-255). \n\nBOL. As always, full transparency. \n\n[TRACKER](https://docs.google.com/spreadsheets/d/1-PHX-U7eiB5neVpbTJVkzwquGE1KyGVQA5nfejcDT_A/edit?usp=sharing)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrv5cws/"
    },
    {
      "created_utc": 1764670213.0,
      "author": "Lumpy-Dentist3891",
      "text": "POTD Record: 3-2-0\n\nLast POTD: **Cade Cunningham Double Double - Yes @ 1.8 2U (Bet365)** ❌\n\n2 losing streak.\n\nToday's Pick: Jakob Poelti O8.5 Rebound **@ 1.71 2.5U (Bet365)**\n\n**NBA | Blazers @ Raptors**\n\nPoelti is a big guy. He rebounds. Blazers are not good with the basket in these few games. Rebound opportunities. \n\nGL 🍀.\n\nMy bets are being tracked [here](https://www.potd.lol/handicapper/Lumpy-Dentist3891-T7Acgq). Thanks to the tracking team.\n\nhttps://preview.redd.it/ih3stdzflr4g1.png?width=450&format=png&auto=webp&s=9cb1c9f7db7debcee1dfae0178401c58cde55595",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrv2jjs/"
    },
    {
      "created_utc": 1764668043.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 14-8, +4.87u\n\n**Previous Pick:** Germany to win by 35 or more points, 1.92, 1u ❌️, (last 5: ✅️❌️✅️✅️❌️)\n\n**Event:** France Cup: Monaco - Paris, 19:30\n\n**POTD:** over 176.5 points, 1.84, 1.5u\n\nTwo of the best French teams are meeting not in the Euroleague, not in the national championship, but in the cup game, and the timing is interesting, 2 days before the 2 teams meet again in the Euroleague, in exactly 48 hours from the start of tonights game.\n\nThese played in the middle of October, Monaco won 99-94. They are to meet, probably at least 5-6 more times this season, so this game, at this point in the season, I don't see it as some really important, big stakes, let's tighten up our defense and slow down the tempo.\n\nI see it more as a shooting training for both teams, before the real battles begin.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nruyykw/"
    },
    {
      "created_utc": 1764665909.0,
      "author": "jaysial",
      "text": "Cricket 🏏 Picks\n \n7 wins in last 8 picks ✌️\n\nLast pick was a Win\n\nOverall: 48💰- 26 ❌\n\n+9.24\n\nLast 10: W W W W W L W W L L\n\nTodays pick\n\nDubai Capitals v Desert Vipers\n\nStarts in about 5 Hours\n\nPick: Desert Vipers win @ 1.72\n\n* I think they have better squad\n\n* First match of the league so nothing much to say",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nruvi9o/"
    },
    {
      "created_utc": 1764665904.0,
      "author": "jaysial",
      "text": "Cricket 🏏 Picks\n \n7 wins in last 8 picks ✌️\n\nLast pick was a Win\n\nOverall: 48💰- 26 ❌\n\n+9.24\n\nLast 10: W W W W W L W W L L\n\nTodays pick\n\nDubai Capitals v Desert Vipers\n\nStarts in about 5 Hours\n\nPick: Desert Vipers win @ 1.72\n\n* I think they have better squad\n\n* First match of the league so nothing much to say",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nruvhyy/"
    },
    {
      "created_utc": 1764665382.0,
      "author": "Bankroll_Builder",
      "text": "Record: 12-8\n\nLast Pick: Aston Villa ML + o1.5 goals in Brighton vs Forest (-110) **Kaching!**\n\nRecap: Wolves are showing more life but unlucky once again. The fade continues and we win on it once more. Screamer from Villa and game ends 1-0. Second game Brighton nicked their second goal near the end when Forest really looked the more likely to score. Good reads. We move.\n\nEvent: Atletico Madrid at Barcelona (LaLiga) 3:00pm EST\n\nPOTD: o2.5 Goals + BTTS\n\nRead: Barcelona have been all over the place defensively but are still the highest scoring team in the league and sitting on top of the table. On the other hand, Atletico have only lost one La Liga game all year. Which they lost back on Matchday 1. Personally, I lean Barcelona to win here, but I can’t help but think Simone and Atletico show up to fight in a big game against the league leaders.\n\nWhat I am seeing on the Barcelona side is positive. Seven wins in seven home games in La liga. Starboy Pedri will be likely to start after getting some minutes at the weekend for the first time back since el classico. Raphina will start only his second game since coming back from injury. He got an assist in his first start back on the weekend also. This makes me comfortable trusting the attack from Barca. Which is very important even for a team at this caliber when facing a team like Atletico who love to defend. We also will likely need Barca to score two.\n\nDeigo Simone is the founder of Haram Football. He will not make it easy. Barca will still break through. I imagine scoring multiple goals. At this point I would typically take Barca to win (still probably will) but I just can’t fade this sneaky hot hand. As haram as they can be, Atletico have scored in every game this season apart from away at Arsenal in the UCL. Combine that with Barca’s defensive struggles and I don’t see Barca stopping Atletico from getting at least one. From sheer desire. It just feels like they will not go down without a fight.  \n\nHoping for a shootout. Let’s see it. \n\nBOL.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nruumzk/"
    },
    {
      "created_utc": 1764665247.0,
      "author": "Dangerous-Ad4255",
      "text": "Record:  \nPlay of the Day: **11-4-1**  \nNet Units:  \nPlay of the Day: **+6.37**\n\nWrite-Up:\n\nYesterday’s Pistons pick was brutal. Game ends 99-98, and honestly, that was some disgusting basketball from Detroit. The read on Atlanta coming in flat was spot on — but the Pistons answered with turnovers, and shooting bricks, and decision-making I haven’t seen since the WNBA season ended. We take the L and move on.\n\n**Play of the Day**  \nNBA | Spurs vs. Grizzlies  \n**Pick: Keldon Johnson Over 19.5 P+R @ 1.85 (-118) | 1 Unit**\n\nI like Keldon Johnson point and rebounds. The Spurs are without Victor Wembanyama and Stephon Castle — their two biggest usage guys. That’s a huge amount of scoring, rebounding, and on-ball responsibility suddenly up for grabs, and Keldon is one of the first players who steps right into that void.\n\nWhen both Wemby and Castle sit, Johnson has a 100% hit rate on this exact P+R line. Every time he’s been put in this expanded role, he’s delivered. He’s also quietly been rebounding really well off the bench. That gives him two clean paths to the over: volume scoring and effort on the glass. Add in that this matchup with Memphis is usually fast and high-scoring, and the opportunities only increase. He already put up 18 points and 7 rebounds against them earlier this season.\n\nWith the Spurs lineup still thin, and a friendly pace, he should be heavily involved from start to finish,so i think he should get this done.\n\nhttps://preview.redd.it/6h54zdjz5r4g1.png?width=699&format=png&auto=webp&s=609a1d9697e3f5287128aa078d94118612825cd1\n\n,  \nLet’s see if we can bounce back. Good luck",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nruuf4l/"
    },
    {
      "created_utc": 1764664291.0,
      "author": "this_guy9",
      "text": "POTD Record: 13-9\n\nNet Units: +5.23\n\nPrevious Pick: [❌ Evan Mobley Double-Double -130](https://www.reddit.com/r/sportsbook/comments/1pawzk2/comment/nrodbkm/?context=3)\n\nUnfortunate variance, man. Mobley just couldn't stop fouling yesterday. Bummer loss, still have confidence:\n\n**🏀 Jalen Brunson o2.5 Threes -115** vs the Boston Celtics\n\nBrunson's role has changed since last season with Thibs. He's putting up an average of 7.5 Three attempts this season up from 6.1 last season.\n\nDominant against the Celtics. Cashed in L8/10 in their matchups, including 3 against them at the start of the season.\n\nCeltics have terrible 3FG defense. They rank 13th in Opponent FG% but 27th in Opponent 3FG%. In particular, vs PGs, they allow 3rd MOST Threes.\n\nBrunson's cashed in L3/5 and L6/10 but he's still averaging 7+ attempts in those timespans. Given Celtics weaker 3FG defense and Brunson's matchup history, expecting Brunson to cash for us here.\n\nFull stats if you'd like to do additional research:  [https://www.statpick.ai/55241063/jalen-brunson-threes](https://www.statpick.ai/55241063/jalen-brunson-threes)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrusvtt/"
    },
    {
      "created_utc": 1764663509.0,
      "author": "lordestros",
      "text": "POTD Record: 2-2 ❌️✅️✅️❌️\n\nOttawa Senators vs Montreal Canadiens (NHL/Hockey) at 7pm EST\n\nCole Caufield over 0.5 points (-190) \n\nWrite up:\nGoing back to Caufield since he's been on fire getting points in 7 games in a row. In these past games he seems to want to prove to Bill Guerin that he belongs on team USA for the Olympics even though his chances are slim (Guerin doesn't like small players). Hence why I believe he's trying even harder nowadays to force his hand.\n\nReason why i'm confident with this pick is because Caufield loves to play against the Senators. He has 14 points in his last 15 games versus them (10 of them came in the last 8 games which is even better for us). Another reason I like this pick is because of the new winger that now plays with him and Nick Suzuki on the first line. Ever since Zach Bolduc replaced Juraj Slafkovsky, that line has now 7 points in 3 games in 5v5. And that's only 5v5! Caufield also can get a point on the powerplay as he is on the first PP unit and usually either scores or makes a great pass to his teammates (8 primary assists out of 12). \n\nSenators this season allow 3.36 goals per game. Canadiens this season score 3.42 goals on average per game (top 4 NHL) so I expect Caufield to contribute to what will probably be a high scoring game.\n\nCanadiens should be well rested as they last played Saturday and they lost 7-2 to the Avalanches(Cup favorites vs up-and-coming team) so they should be fired up for a bounce back game at home vs a division rival!\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrurlr1/"
    },
    {
      "created_utc": 1764661051.0,
      "author": "Ok-Actuary-4654",
      "text": "POTD Record: 3-0-0 (+11.9 units)\n\nStreak: 3W\n\nLast 10: WWW \\_ \\_ \\_ \\_ \\_ \\_ \\_ \\_ \\_ \\_\n\nLast Pick: Washington Commanders +6 (-110) 5 units vs Denver Broncos\n\nLast Pick Reflections: Mariota as expected picked apart the Broncos defense and kept it close all the way through. Thought they'd win outright towards the end of the 4th, but got F'd with the non-tripping call, incorrect illegal shift call, and a few Ertz drops. Glad to have gotten the win on the spread but would've loved the ML payout as well. \n\nEvent: Boston Celtics vs New York Knicks NBA\n\nPOTD: Celtics moneyline (-105) 5 units\n\nReally feel like the Celtics are a lot better than their record indicates. Mazulla has his squad playing hard gritty basketball and I anticipate an electric performance from White and Pritch tomorrow. They're fresh off a win playing undermanned against the Cavs and return home to play the Knicks. The Knicks haven't played a solid NBA team aside from the Bucks in the past 3 weeks and didn't look all that impressive to me against Milwaukee in the NBA cup game. Expecting the Celtics to win as a dog as I feel like it is a great buy low spot for them. \n\nJust to reiterate, in conjunction with my model, I use the eye test as well as my gut feeling to play what I believe is the most-valuable pick on the slate. Cheers to a great game, and please remember to gamble responsibly and to only wager what you can afford to lose.\n\nI also want to apologize for my previous pick not being on a game that was on the day of the reddit thread. I will ensure to avoid making this mistake moving forward and thank everyone for their support as well.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrunf0h/"
    },
    {
      "created_utc": 1764660382.0,
      "author": "zMastroo",
      "text": "**POTD |** **Record of 83-88-1** **|** **ROI: -4.48 units** **|** **Average Odds:** **2.04**\n\nCurrent form (most recent from left to right): ❌️✅❌✅✅✅✅✅❌\n\n**Previous Pick: Major League Rugby - Utah Warriors vs. NOLA Gold - NOLA Gold  +5.5** ❌️\n\n**New Pick: Premier League - Bournemouth vs. Everton (11:30am PST)**\n\n**Over 10.5 Full-Time Total Corners  | 2.00 odds**\n\n**Betting 3U to win 3U**\n\nTook some time away....\n  \nDecided to get back into posting periodically. I like this game largely due to the history between these two sides with Over 10.5 hitting in the last 6 matches between the two 12, 12, 12, 15, 12, etc.\n\nShort write-up but I'm feeling that given that Everton were so suppressed in their last games, they may come out firing on this next one!\n  \n**Bournemouth vs. Everton | Over 10.5 Full-Time Total Corners | 2.00 odds**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrum9iz/"
    },
    {
      "created_utc": 1764660084.0,
      "author": "D0N_L0U1S",
      "text": "Record: 33-17 on YT \n\nPOTD Record: 3-1\n\nRecap: Giannis let us down and had a stinker of a performance but we move. I still had a winning day going 4-2 with my picks and now on a 17-7 streak on YT\n\nTodays POTD: VJ Edgecome Over 13.5 Points (-114):\n\nVJ has a Great matchup against this wizards team coming off a b2b and i expect him to have alot of FGA with embiid being out. Vj will be left open on alot of plays with players like Pg and Maxey drawing most of the defensive attention and it all comes down to if VJ will knock down the open looks or not, but i like him to be efficient at home on a bounce back after droppin a stinker in a tough loss against the Hawks.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrulqvm/"
    },
    {
      "created_utc": 1764658501.0,
      "author": "Ralphjinasseater",
      "text": "Record 11-11-2\n\nLast pick: Anthony Davis o 2.5 Assists (-120 DK)✅\n\n\nPick of the day : Chet Holmgren OVER 15.5 Points(-120 HR)\n\n\n\nReasoning :\n\nHart, Caruso and Dort are all out in this game!\n\nChet has been great once again this season and he’s taking a leap in development as well avergaing 18.2 PPG on 12.3 FGA per game compared to last season where he averaged just 15.2 PPG on just 11.3 FGA per game and he’s a lot more consistent this season clearing this line in 10/17 games this season and he’s over in 8/10 games when playing 30+ minutes.\n\nIn Chet’s last 2 games without Hart he’s over in both with 23 points and 19 points in those games on great usage seeing 13 and 15 FGA in those 2 games on 30+ minutes in both.\n\nWith Caruso and Dort also being out this is only going to add to Chets usage here, in 5 games without Caruso Chet is over in 4/5 games avergaing 21.8 PPG on 12.6 FGA, and in 2 games without Dort when playing just 22+ minutes he’s over in both with 21 and 23 points in those games with one of those being against the Warriors.\n\nChet has always cooked the Warriors, he’s over in 4/5 games with his only under coming in a game he recorded 13 points on just 27 minutes in his rookie season.\n\nChets gets a great matchup here versus the Warriors who allow the 7th most PPG to transition where Chet scores 16% of his points, when looking at scoring zones Chet scores a majority 45% of his points from the RA where the Warriors allow the 13th most PPG and the Warriors have no one with height that can stop Chet from scoring down low so I’m expecting him to bully the Warriors down low here.\n\nWe just saw Chet clear this line versus the Suns who are a way tougher matchup than the Warriors ranking 5th best against transition and 11th best versus the RA.\n\nWhen playing just 26 minutes Chet is over this line in 5/6 games versus teams that rank inside bottom 15  in RA points allowed avergaing 22.3 PPG.\n\nIm expecting Chet to take on a heavy load for the Thunder here with a lot of their key players being out, so I expect him to easily shoot 13+ times here. When seeing that kind of usage Chet has been amazing clearing this line in 7/8 games this season avergaing 21.8 PPG with his only under coming in a game he played just 27 minutes.\n\nWhen seeing 13+ shots Chet is over this line in 25/29 (86.2%) of games dating back to April of last season averaging 20.8 PPG, and  Chet should easily clear 13 FGA in this as he did In both games this season without Hart and is now without Dort and Caruso as well so I could see him shooting the ball 15 or more times here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nruixdg/"
    },
    {
      "created_utc": 1764658436.0,
      "author": "ptrckfrnndz",
      "text": "+10.32\n\n8 - 4\n\nSports: Tenni\n\nPrev: LINDA VS TIANTSOA +1.5SET@5UNITS @1.83 ✅️✅️\n\nPick: fulgenzi/ fulgenzi vs. Fouad /el sayed ml @ 1.83 5 units\n\nTime: 6hrs from posting\n\nReasoning: if im allowed to put 10 units, i will, write up later too busy\n\n\nYoull regret not tailing this one 😈😈😈",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nruit5l/"
    },
    {
      "created_utc": 1764656864.0,
      "author": "Sad-Appearance222",
      "text": "POTD Record : 3 - 0\n\nNet Units : +2.20\n\nLast pick : Vallecano vs Valencia Over 7.5 corners = 1.23 + Bologna vs Cremonese Over 7.5 corners = 1.42\nTotal odds 1.74 (1 Unit) ✅\n\nFeels good when bet wins within 60 minutes. Those match ended up at 21 and 15 corners. \n\nEvent : EPL, Fulham vs Man City + Newcastle vs Tottenham Hotspur.\n\nPick : Fulham vs Man City Over 1.5 goals = 1.19 + Newcastle vs Tottenham Over 8.5 corners = 1.28\n\nTotal odds 1.52 (1 Unit)\n\nWrite Up : \n\n* As the point table shows Man city is at number 2 and Fulham at 15. But Man city has shown vulnerability in their defense and weakness in away matches. They won only 2 away matches out of 6. They scored 27 and conceded 12 goals. Their attacking is good, but defense also not that strong.\nFulham have scored 15 goals and conceded 17 in the league. They won 4 matches, drew 1 and defeat in 1 home match. They have won four of their last matches in all competition. They're confident at this moment. Based on those analysis, this match must produce 2-4 goals.\n\n*  Pervious match stats shows that Newcastle likes to concede corners. Their games have an average of 11.08( won and awarded to the opponent). I'm going with Over 8.5 corners in this match.\n\nI always try to be at the safe side. But, in sports betting; anything can happen. \n\nSo, Bet responsibly. Good luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrufvus/"
    },
    {
      "created_utc": 1764656121.0,
      "author": "2thyKing",
      "text": "Record: 2-1 (W2)\n\nNet Units: +2.1u\n___\n￼Last pick: New York Giants @ New England Patriots \n\n2-leg parlay\nPatriots -6.5 alt line + TreVeon Henderson OVER 50 rush yards alt line ✅\n\nA nice win in spite of the near 50/50 running back timeshare with Stevenson/Henderson, got sweaty at the end but plus-money cash nonetheless! 💵🤑\n___\n￼Today’s pick:\n\nNBA Basketball 🏀 \n\nNY Knicks @ Boston Celtics | 8:00PM EST / GMT -5 (19 hours from time of comment)\n\n**Jaylen Brown OVER 38.5 P+R+A**\n\n(-121 DK) 1 unit\n\n￼Write Up: This line is too low for a guy who just got a triple double against the Cavs. If you’ve been watching Celtics games over the past two weeks you’ll know that he’s playing the very best ball of his career to date. He’s all over the boards, his midrange jumpers are hitting, he’s getting to the line, and he’s passing the ball and creating plays.\n\nHis average PRA Is 45.8 over the last 5 games and he is playing with amazing fire and clarity right now. It would be a shock to me if he didn’t hit this line given his recent play, even if the matchup isn’t super juicy. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrueghs/"
    },
    {
      "created_utc": 1764654771.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 202-151\n\nUnits Won: +112.26u\n\nLast Pick: HexT>SkullZ Map 1 Kills + Nota>Ewjerkz Map 1 Kills (+152) ✅\n\nToday's Pick: **Grim>HexT Map 2 Kills + Snappi U 14.5 Kills Map 1 (+132)** 5u\n\nTeams/Times: Passion UA vs. M80 (9:00 AM EST.) | Ninjas in Pyjamas vs. 3DMAX (2:00 PM EST.)\n\nhttps://preview.redd.it/m91e5gpn5q4g1.png?width=241&format=png&auto=webp&s=de90fd0e53d21943e159197de0629ff4b9361c2d\n\n**Grim>Hext Map 2 (-200)**\n\n* Projected Map: Overpass (Passion UA pick)\n* Grim is averaging a .77 KPR L3 months, Passion UA clear star player, HexT is the 4th best rated player on M80 overall behind Swisher/Lake/Slaxz- id rank him third personally and he has had a solid last month. His stats are slightly inflated from farming NA teams but he is averaging a .69 KPR\n* Grim is averaging a .80 KPR L3 months on Overpass with a .77 KPR on the map in 2025. Passion UA are 67% winrate on Overpass in the L3 months on 6 maps played, 1-0 so far this tournament beating fnatic today 13-11\n* HexT is averaging a .38 KPR L3 months on Overpass with a .63 KPR on the map in 2025, while L3 months is low sample size + 0% winrate, this is HexT's lowest winrate map by far, and if you factor down their farming north american competition, he should be \\~.10 KPR lower, he is the lowest rated M80 player on the map and in 2025 drops from a .72 KPR to a .63 KPR on the map, he is also the worst rated CT Overpass player on the team, and while Overpass normally has blowout risk, Passion UA have a 60% T side winrate on Ovp\n\n**Snappi U 14.5 Kills Map 1 (-182)**\n\n* Projected Map: Dust 2 (3DMAX pick)\n* NIP very likely ban Inferno, leaving their only weak map left as Dust 2, expecting 3DMAX to go for the punish pick here but can see alternatives like Nuke as an option\n* Snappi continiously drops in performance when he isn't playing online/tier two cs, his numbers have continiously dropped at these tournaments including stage 2 of the major so far. He is averaging a .53 KPR at this stage of the major and a .61 KPR normally, but again lowest rated on his team and inflated from playing tier two\n* Snappi has a 5/11 hitrate so far this tournament; however 3/11 were because of Overtimes that he hit his line, and the other 2/11 were on Train which I see 0 chance of 3DMAX picking\n* Dust 2 is Snappi worst map by far, he is averaging a .49 KPR in the L6 months on Dust 2, with a .54 KPR in 2025. He has a 2/11 hitrate in the L6 months on Dust 2 and a 3/20 hit rate on the over in the last 20 maps. In these 20 maps he is averaging 10.8 kills overall\n\nModel projects both lines have between 73-74% chance of hitting at +130 odds!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrubtmb/"
    },
    {
      "created_utc": 1764652849.0,
      "author": "Background-Hat2598",
      "text": "**Record:** 1-0-0 (W-L-Push)  \n**Net Units:** \\+1 Units  \n**Average Odds:** 1.95 (Decimal) / -105 (American) @ LowVig  \n**Units Won:** 1  \n**Last win:** George Kittle Over 44.5 Reception Yards (Browns vs 49ers) ✅\n\n**Sport | League | Event Time / Time Zone**  \nSoccer | Premier League | Fulham vs Manchester City - 20:30 GMT\n\n**Pick:** Manchester City -1 Spread @ 2.07 (Decimal) / +107 (American)   \n**Units:** 2U\n\n**Reasoning:** Man City has scored over 35 goals this season while Fulham's defence has been quite vulnerable. Also, key injuries to player like Antonee Robinson further make the defense vulnerable. Man City has been strong on the road this year. They have scored 2+ goals in the 8 of the last 10 matches. Also, Halaand has been a beast this season - expect him to exploit the weak Fulham defence. I see 70%+ chances for this bet to hit. \n\n**Risk:** Fulham has shown some capability at scoring at home (8/10 matches). This could affect the spread taken.\n\nIf you appreciate the analysis, feel free to support via [Paypal](https://paypal.me/SportsEdges) \\- [Buymecoffee](http://buymeacoffee.com/Saha708). Gamble responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nru7u2m/"
    },
    {
      "created_utc": 1764652772.0,
      "author": "Relevant-Act-1908",
      "text": "3 people with Tennessee -6.5 BEWARE",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nru7o6v/"
    },
    {
      "created_utc": 1764652432.0,
      "author": "Flashy-Season4183",
      "text": "\nRecord: 1-0 \n\nLast: (NCAAM) Iona -2 +100 (1u)\n\nResult: (Iona 89 Delaware 66) - Win\n\nNet Units: +1u\n\nROI: 100%\n\nUnit: 1.1u to win 1u\nSport: Basketball | League: NCAAM | Event Time: 7p / Time Zone: EST\n\nPick of the Day: William & Mary +7 @ Duquesne \n\nOdds: -110 (Fanatics) \n\nWrite Up: If you want an electric basketball game to watch that’s flying under the radar on a stacked Tuesday slate; this is the matchup for you. You guys will see very quickly a lot of my handicapping style involves diving into teams tempo styles, second chance opportunities (FGA, Rebounding +\\-, FTA/FTM and Assist to Turnover ratio). But of course I also look deeply into recent form and similar matchups against other teams played so far this season. \n\nBoth these teams head into this matchup as Top 30 tempo squads in the country on the offensive end. (W&MU 3rd, Duquesne 26th). If you look these two teams up and down metric wise these are probably two of the most similar teams in the country. It’s actually scary how close these teams are on the offensive end. But here’s the ticker and the difference in the game and why I believe William & Mary +7 is the play. \n\nWilliam & Mary on the defensive side is more disruptive and more effective. William & Mary according to KenPom (one of my favorite tools to use) ranks 65th in effective FG % Defense (Duquesne ranks 134th), 40th in Turnover % (Duquesne ranks 94th, 11th in the country in 3p Defense (Duquesne ranks 39th), the list goes on for defensive advantages pointing towards William & Mary. If William & Mary can keep up the defensive fortitude they have shown this season vs Duquesne and disrupt their rhythm this game slowly starts to become a pick em before our eyes. \n\nWilliam & Mary also makes on average 3 more Free Throws a game, they get 5 more rebounds a game, 2 more assists a game, and 2 more blocks a game than the Duquesne Dukes. All of these stats above = more scoring opportunities. Add in the data showing William & Mary as the better defensive team and I think laying 7 points here is extremely high. \n\nRecent Results\n\nWilliam & Mary (7-2 SU), (6-1 Against the Spread)\nNotable Wins: Norfolk State, Bowling Green, UTEP, Abilene Christian, Old Dominion. \nNotable Losses: Richmond by 4, St. John’s by 33\n\nDuquesne: (5-2 SU), (2-4 Against the Spread)\nNotable Wins: Niagara, Sacred Heart, Queens, Loyola MD.\nNotable Losses: Villanova, Northeastern\n\nDuquesne hasn’t beat anyone noteworthy. \n\nMeanwhile William & Mary beat teams all expected to finish at the top to middle of their respective conferences. Fun Fact Bowling Green just whooped Kansas State into oblivion earlier. \n\nI have this game handicapped at William & Mary +3.5 . I think we are getting 3.5 free points here. Don’t be surprised seeing William & Mary win outright. You’ll also really enjoy their style of ball. \n\nDo well and good luck. \n\nBC",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nru6xsw/"
    },
    {
      "created_utc": 1764651712.0,
      "author": "Hefty_Night1892",
      "text": "**Yesterday's POTD?**: Birmingham City Team Total Goals - 1st Half  o0.5 (-125) 🤑 \n\nLads! What a sweat that was, had us holding our breaths for a bit, but Birmingham came through for us! First goal smashed in the 31st minute, and St. Andrew’s absolutely erupted! 💥🔥 \nFirst pick is in the bag, boys. On to the next! ⚽💸\n\n\n**Record**: 1W-0P-0L | +1.6u | ✅️ \n\n**Today's POTD**: Vasco ML (+110) 3u\n\n⚽️ Soccer | 🇧🇷Brasileirão | 5:00pm EST \n\nAlright lads, next pick of the day and we’re keeping the momentum rolling! Vasco are coming into this one buzzing after an emphatic home win over Internacional, snapping that rough 5-game losing streak. With only two matches left, they know this is a golden chance to lock down three massive points before that crucial final-day showdown with Atlético-MG for those Sudamericana spots. \n\nMirassol, on the other hand, are sitting a bit too comfy in 4th, already booked for the 2026 Libertadores. Their form on the road’s been shaky, 3 losses in their last 5 away (W1, D1). Nothing to fear there, lads. \n\nWith everything on the line and the crowd behind them, I’m backing Vasco to push hard for the win in this late-season charge for Sudamericana football in 2026. \n\n*Tail responsibly. Bet only what you can afford to lose. Odds are from Draftkings. DM to join my soccer only betting group on Draftkings.* **BOL**\n\n[Buy Me A Coffee](http://buymeacoffee.com/heftyknight)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nru5bsi/"
    },
    {
      "created_utc": 1764650589.0,
      "author": "HeBeThatBoy",
      "text": "POTD Record: 4-1\n\nNet Units: +18.76\n\nLast Pick Thoughts: Odds for a Manchester win were fantastic, however, we need to mitigate a bit of risk. Happy to walk away with money won.\n\nSport: English Premier League - Newcastle vs. Tottenham @ 3:15pm EST\n\nPick: BTTS + Over 2 goals = +100 (5 units)\n\nWrite Up: I want to make a bet on the Atletico vs. Barcelona game as that’s the game I’ll be watching, however I think the odds in this match are better. Both Tottenham and Newcastle are inconsistent teams, they both pull out a win in a game seemingly stacked against them, and then they can lose any match. They both have offence potent enough to score and defence shaky enough to let a goal in. They are tied in the Premier League standings, both teams will see this as a must win, and I believe both teams think they’re better than the other, meaning they’ll be looking to attack instead of park the bus. Newcastles form as of late has been better, I do think they’ll win, however I also think Tottenham\nwill sneak in one goal.\n\nWill update based on lineup announcement.\n\nBOL!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nru2r57/"
    },
    {
      "created_utc": 1764649836.0,
      "author": "Ok_Understanding9607",
      "text": "Record: 1-0 (+2u)\n\nLast: (NFL) TreyVeyon Henderson over 60.5 Rushing ✅\n\nPOTD: Tennessee -6.5 vs Sryacuse \n\n2 Unit Play\n\nReasoning: \n\nThe Logic:\nI’m riding with the Vols to cover the number on the road, and honestly, this line feels short given the context. Here is the breakdown:\n\n1. The \"Angry Rick Barnes\" Spot\nTennessee is coming off a gut-wrenching 81-76 loss to Kansas in Vegas where they blew a double-digit lead. Rick Barnes teams historically bounce back hard after games like that. They aren't just looking to win; they are looking to re-establish their identity. Before that Kansas collapse, they beat #3 Houston physically. They are battle-tested; Syracuse is shell-shocked.\n\n2. Syracuse is Decimated (The Donnie Freeman Factor)\nThis is the biggest edge. Syracuse’s leading scorer and best player, Donnie Freeman (17.8 PPG), is OUT (foot). You cannot replace that production against a top-tier defense. They are also dealing with a banged-up JJ Starling, who has been battling leg issues. Even if Starling plays, he isn't 100%, and without Freeman, the Orange have zero interior presence to handle Tennessee’s physicality.\n\n3. The Defensive Mismatch\nTennessee enters this game with one of the most efficient defenses in the country (KenPom top-15 AdjD). Syracuse just gave up 95 points to Iowa State in their last outing. If Iowa State can hang 95 on them, Tennessee’s offense—which is averaging ~86 PPG—should feast. On the flip side, I don't see how a Freeman-less Syracuse offense scores enough to keep up.\n\n4. The \"Fraudulent\" Record\nSyracuse is 4-3, but look at the losses. When they step up in class, they get smoked.\n• Lost to Iowa State by 31.\n• Lost to Kansas by 11.\n• Lost to Houston (closer game, but Houston controls tempo).\nThey are 0-2 ATS in true road/neutral tough spots recently. Tennessee is a legitimate Final Four contender; Syracuse is struggling to find an identity.\nThe Prediction:\nTennessee suffocates them early. The Vols' physicality on the glass will be too much for a depleted Syracuse frontcourt. \n\n\nThis feels like a 15+ point blowout.\nScore Prediction: Tennessee 84, Syracuse 68.\nTL;DR: Tennessee is angry, Syracuse is injured (No Freeman), and the talent gap is massive. Lay the points",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nru107r/"
    },
    {
      "created_utc": 1764649119.0,
      "author": "No_Lack_505",
      "text": "Record: 1-0\n\nLast: (NFL) Patriots -6.5 (1u) - W\n\nPOTD: No. 5 UConn (-1.5) at Kansas\n\nStart Time: 9:00 PM EST\n\nReasoning: Another gut and stat based bet. Huskies are going off strong this season, but be aware that there is a slight chance Peterson will return tomorrow for Kansas which would tip the odds more for Kansas if so. Still love UConn, they look extremely promising this season and coaching is elite so far. Give me UConn to bring home the W",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrtzabr/"
    },
    {
      "created_utc": 1764645037.0,
      "author": "LookMaNoHandz",
      "text": "**(new to Reddit, let's make some money y'all)**\n\n**Record: 0-0** \n\n**Net Units: +0.00**\n\n**Event:** **NBA - Toronto Raptors vs. Portland Trailblazers**\n\n**Pick:** **Raptors -5.5 @ 1.91 (-110)**\n\n**Write Up:** Starting our POTD journey here on Reddit with the Raptors spread. Raptors are in a great spot here to get back on track after dropping two straight, after going on a 7 game heater that basically no one saw coming. Heading back to their home arena where they are 7-2 SU. Blazers and racked by injuries, Toronto is deep in role players. Have this modelled at around -9. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrtos49/"
    },
    {
      "created_utc": 1764643126.0,
      "author": "InternationalRest542",
      "text": "**POTD Record**: 8 - 3\n\n**Net Profit** : +6.4 Units\n\n**Previous Pick**: Miles Bridges Over 19.5 P  @ 1.90 3u to win 2.19u ❌ ( Brutal Loss he scored 19 with 8 minutes left he cant get another bucket )\n\n**Event:** NCAAB | Campbell @ Penn State\n\n**POTD**:  Penn State -12.5  @ 1.85 3u to win 2.55u\n\n**Write Up**:\n\nBro, Penn State –12.5 is basically the “I’m not saying it’s free, but it’s kinda free if nothing stupid happens” pick of the night.\n\nPenn State is coming in red-hot, dropping 90 pieces like they’re trying to open a chicken restaurant. Meanwhile Campbell shows up to road games like they accidentally got on the wrong bus. They’re 0–4 away from home, and half those losses weren’t even competitive as they were more like “hey, thanks for coming, here’s your participation ribbon.”\n\nPSU’s offense is clicking, the ball is moving, everyone’s smiling, and Kayden Mingo is out here hooping like he’s auditioning for a freshman All-American nod. Campbell? They’ve got one main scorer, D.J. Smith, and after that the offense turns into an improv show nobody asked for.\n\nThe biggest mismatch? Energy and tempo. Penn State runs like they had two espressos and a pep talk. Campbell plays like someone woke them up from a nap. That’s exactly how double-digit spreads get covered ,fast team vs sleepy team.\n\nAnd dEpth? PSU can go to the bench and still score. Campbell goes to the bench and immediately wishes they hadn't. This is how you avoid those nightmare backdoor covers when the starters sit, the lead doesn't die.\n\nIf Penn State starts with a 10–0 burst, don’t be shocked. They’ve got all the tools to stretch this one out until it looks like a CVS receipt.\n\nSo yeah PSUwill win by like 15, maybe 20 if they hit threes. Campbell might put up a fight early, but eventually the wheels come off, the vibes collapse, and PSU goes on that inevitable “welp, this is getting out of hand” run.\n\nTake –12.5, sip your coffee, and enjoy the show.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrtjf58/"
    },
    {
      "created_utc": 1764640577.0,
      "author": "ControlRoyal1768",
      "text": "Record: 27-16 (+29.89u)\n\nLast 10:💰✖️💰✖️✖️💰✖️✖️💰💰\n\nLast POTD: 🏈 Giants +7.5 (-115).\n\nBet is pending…\n\nToday’s POTD: 🏀 Tennessee -6.5 (-110).\n\nGame starts at 7pm EST. Bet 2.5U\n\nWriteup: Going back to college hoops for this one, and we’re taking the Tennessee Volunteers to cover the spread against Syracuse. Tennessee is currently 7-1 and the #13 team in the nation. They recently finished 2-1 in the Players Era tournament with a very impressive win over #3 Houston. Their senior guard Ja’Kobi Gillespie leads the Volunteers with 18.5 PPG along with star freshman Nate Ament having 18 PPG. With their offense averaging 86 PPG, it’s even more impressive that their defense is even better than their offense, conceding only 65.5 PPG.\n\nOn the other side, we have the Syracuse Orange at 4-3 this season, and recently lost all of their games in the Players Era tourney. Their top scorer Donnie Freeman is out for this game due to injury for an offense that was already inconsistent. They have also struggled keeping up pace of play against better opponents, as the Players Era tournament clearly showed. \n\nBoth teams are playing with a chip on their shoulder, but the better team should come out on top and do so in a decisive manner with a least a 7 point victory. \n\nRemember to only bet what you can afford to lose, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrtbzym/"
    },
    {
      "created_utc": 1764639754.0,
      "author": "MrPunter500",
      "text": "**Record: First Play**\n\n**Tennis** | **Challenger Angers (Women)** | **4 AM (Eastern Time)**\n\n**Plays will always be shared as 1 unit for fair record purposes**\n\n**Pick: Sonmez vs Jimenez Kasintseva - Sonmez ML @ 1.57**\n\nA lot of money is going into Sonmez with these odds opening at a higher price, but it's still worth taking her to win. She's a really nice player who had a fantastic 2024 season before dropping her form a bit in 2025. Kasintseva is a decent opponent but still needs to improve a lot of things in her game, and Sonmez has the advantage on this surface. If we look at these players' careers, we can see that most of the tournament success has come on hard courts for Sonmez, while Kasintseva won the majority of her titles on clay. Sonmez also had a great upset win against Eva Lys recently at the Billie Jean King Cup on this surface (Indoor Hard).\n\nI usually don't like to go with handicaps to increase the odds, and the majority of my sports betting plays are focused on extracting value from the ML in tennis.\n\nGood luck! I'll be posting daily when I spot good looks and especially at the start of the next tennis season!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrt9m2v/"
    },
    {
      "created_utc": 1764639455.0,
      "author": "dreamchasing1",
      "text": "Record: 231-219 Net Units: -28.32 50-52 on 1.5u plays, 38-40 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Turkey Super League] Samsunspor vs Alanyaspor\nLast pick: Samsunspor team corners over 4.5 @ 1.72 loss\n\n\nEvent: Soccer/Football, [England League One] Wigan vs Burton\n\n\nPick: Asian total corners over 9.5 @ 1.82 - 1.5 Units. This pick is the same as just total corners over 9.5.\n\n\nThe two sides have averaged some of the highest total corners in the league. At home, Wigan have covered in 6/8 games averaging 5 for and close to 11 total. In away games, Burton have covered in 6/8 as well, with 4.70 for and a 12 total per game. In general, in all games this season, both sides have covered this line in majority of games with 13/17 Wigan games covering, 10/17 Burton games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrt8qde/"
    },
    {
      "created_utc": 1764639190.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 11-5 (Avg Odds +131)\n\n**Previous Pick:** Enzo Fernandez 1+ SOT (+140) ✅️\n\n**Today's Event:** English Premier League | Fulham vs. Man City (11:30AM PST)\n\n**Pick:** Harry Wilson 1+ SOT (+105) 1 unit to win 1.05 units\n\n**Write Up:** Enzo comes through for us in the 31st minute! Our guy cashed us for the 4th time, all at plus money! Palmer did not start, as expected, and Enzo slotted into the #10 role which was perfect for our play. Gotta love a weekend sweep! \n\nUnfortunately I didn't post my pick for yesterday (Santi Castro 2+ SOT), as I was waiting for Bologna lineups and didn't catch them until 30 minutes before kick off. So we are back to mid-week EPL action after a day off as Fulham host Man City. Fulham play really tough at home, going 4-1-1, having only dropped points to Arsenal and Man U. If City want to make a title run again this year, these away matches against mid-table teams are must win games. I expect a close match here, but really can't read the goals.\n\nAs I was finishing my research here, I actually changed to a different pick than my initial pick of a City player. City seems a bit tired, they are struggling to rotate players for mid-week matches, and are conceding goals/possession more than typical - especially mid-week. \n\nHarry Wilson should get another start at right winger here, after a goal on two shots against Tottenham over the weekend. If you watched that match, you saw why I'm on Wilson - he's a guy who can shoot from anywhere with his left foot. Seriously, go watch his goal if you haven't seen it, I know the keeper was out of position, but it doesn't make the finish any less impressive. Wilson has only had 3 SOTs in his last 5 matches, but he's taken an average of 3 shots per match. This includes 4 against Arsenal at home and, honestly, it was unlucky that none of those hit the target. He also had 2 SOTs in this fixture at the end of last season in May (against a fairly similar City team that I expect to see tomorrow). Wilson also scored 3 goals for Wales during the international break 2 weeks back. The man is in form and I like him to take a few shots today and land at least one on target. \n\nBOL and have a great Tuesday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrt7zgv/"
    },
    {
      "created_utc": 1764638875.0,
      "author": "Substantial-Pay-4591",
      "text": "1-1 (0u) ❌✅\n\nLast pick- ✅ Darius Slayton longest reception o17.5 yards -115 (1.15u to win 1u)\n\nTuesday’s pick - Chicago Blackhawks +1.5 puck line -108 vs Vegas Golden Knights (1.08u to win 1u)\n\nVegas does not deserve to be this heavy of a favorite. I like the Blackhawks ML also, but the odds are too high for this thread. The Knights are 6-4-4 at home this season and it seems as though Carter Hart will be making his first start of the season after serving his suspension. \n\nChicago got a big win over Anaheim on Sunday and they have a respectable team for the first time in a while. Their season goal differential is actually better than the Knights. Simply put, these teams aren’t that far off from each other, but the betting lines make this seem like a long shot.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrt73tr/"
    },
    {
      "created_utc": 1764638567.0,
      "author": "Square_Print_9822",
      "text": "**Pick Record: 35W - 24L    (Push: 1)**\n\n**Form: ✅ ✅ ✅**\n\n**Previous Pick:  Bologna Over 5.5 Shots on Target @ 1.66 ✅**\n\n**7 Shots on target, as I say. ONTO THE NEXT!**\n\n**—**\n\n**Today's Pick: Bournemouth Over 4.5 Shots on Target and Over 3 Team Corners @ 1.75**\n\n**Bournemouth VS Everton - 2:30 PM EST**\n\n**—**\n\nI'm thrilled to see midweek Premier League games again; I truly missed that sense of pressure on a random Tuesday or Wednesday. Bournemouth started the season out so so well, but they've entered a 4-game slump and will look to get back on track tomorrow. Last home game they got 10 SOT and 9 corners (and drew), expecting less this round but considering they need a win even more… let's back it.\n\n**Shots on Target**\n\n**In Bournemouth's last 5 home games, they have covered Over 4.5 shots on target in 4/5 of those games, stats being:**\n\n**10, 5, 6, 2, 5**\n\n**Corners**\n\n**Bournemouth's Last 5 home games, they've covered over 3.5 corners in 5/5 of those games, stats being:**\n\n **9, 6, 5, 4, 5**\n\n**BOL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrt6961/"
    },
    {
      "created_utc": 1764637721.0,
      "author": "damagebabee",
      "text": "**POTD** Record 121-02-97\n\nGLADBACH VS ST PAULI\n\nDate: 02 DECEMBER 2025 at 18:00\n\nBET ON: Match odds- GLADBACH\n\nOdd: 1.81\n\n\n\n\\- Gladbach enter the cup tie with clear upward momentum and a strong sense of purpose, as Polanski has repeatedly stressed that the DFB-Pokal is a priority both for sporting continuity and the significant financial incentive of progressing. Despite missing Neuhaus and several squad players, the team’s 4-2-3-1 structure remains stable, reinforced by the returns of Hack and Kleindienst and the reliability of Tabakovic up front. Polanski warns against relying on the recent 4–0 league win over St. Pauli, calling this a “dangerous match,” but he underlines that his side’s defensive solidity and form give them control over the tie. St. Pauli, meanwhile, approach the match from a position of crisis, with Blessin viewing the cup primarily as a mental reset after a long run of Bundesliga defeats. Their squad is significantly weakened: key striker Hountondji is ruled out with a muscular injury, while multiple defenders remain unavailable, forcing a conservative 5-4-1 setup designed more for survival than proactive play. With limited attacking options, structural defensive problems, and confidence issues, St. Pauli’s priorities lie in stabilizing rather than competing on equal terms — giving Gladbach a clear motivational, tactical, and personnel advantage.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrt3w70/"
    },
    {
      "created_utc": 1764637586.0,
      "author": "defiant_degen",
      "text": "\nOverall record 75W-46L\n\nUnits +62.1\n\nLast pick:\n\nPremier league\n\nWest ham Vs Liverpool \n\nBoth teams to score and over 2.5 goals\n\n(1.83) 3 units ✖️\n\nJust a very disappointing West ham performance, 9 goals in their last 3 games but never really looked like scoring here, Paquetta with the most ridiculous red card I've ever seen just killing any chance of them scoring late on as we fall a goal short with Liverpool winning 2-0\n\nToday's pick:\n \nPremier League \n\nNewcastle United Vs Tottenham Hotspur \n\nNewcastle win and over 1.5 goals \n\n(1.90) 3 units\n\nTwo teams in completely contrasting forms here. Newcastle also have an exceptional home form with **6 home wins in a row, scoring at least 2 goals in all those wins** only losing at home narrowly to Arsenal before that. Not only just a great home form at the moment but long term it's been a very hard place to go for the past few years for teams.\n\nThis is also the middle of the very congested schedule for both sides, this is Tottenhams 4th game in 9 days, Newcastles 4th game in days 10 so a crucial extra recovery day for Newcastle also an edge for them.\n\nDefensively Tottenham have been awful the past few weeks, **they've conceded a ridiculous 13 goals in their last 4 games**\nVicario in goal in particular has really struggled but the whole defence as a unit has been very unorganized.\n\n\nNewcastle are without Pope in goal, however Ramsdale is a more than suitable replacement, pipe wasn't playing particularly well anyway, other than that they have no significant injury concerns, Tottenham have definitely been missing Madison in particular in midfield, and Solanke up top also.\n\nI think Newcastle have just far too much for Tottenham here, in particular they are just a much better midfield and they should win the key battles there and Voltemade and Barnes are both in excellent form in attack.\n\n\n\nCoffee's always appreciated if you have found my write ups and bets useful ☕\n\nhttps://buymeacoffee.com/willo777\n\n\n**BOL and only bet what you can afford to lose!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrt3iyo/"
    },
    {
      "created_utc": 1764637082.0,
      "author": "SP7988",
      "text": "**Record:** 30-15-1 (+13.53u) \n\n**Last:** (CBB) Florida -6.5 (1u) - L\n\n**POTD:** No. 13 Tennessee (-6.5) at Syracuse \n\n**Start Time:** 7:00 PM ET\n\n**Odds:** -110 (DraftKings)\n\n**Units:** 1U\n\n**Reasoning:** Sometimes, there’s nothing deadlier than a team playing with its back against the wall. Other times, that team is the 2025 Syracuse men’s basketball team.\n\nThe Orange (4-3) accepted an invite to last week’s Player’s Era Festival with one thing in mind: an opportunity to pick up a crucial non-conference Quad 1 victory. With matchups lined up against Iowa State (7th in NET ranking), Kansas (17th) and Houston (18th), the opportunity was there for the taking. However, what started with promise—a 78-74 overtime defeat to the Cougars—quickly ended in disaster with 11 and 31-point losses to the Jayhawks and Cyclones respectively. \n\nAnd while No. 13 Tennessee will provide Syracuse with one last chance on Tuesday night, don’t hold your breath.\n\nThe Vols (7-1) enter this matchup on the heels of a disappointing 81-76 loss to Kansas last Wednesday. It’s a defeat that will have the team kicking itself, as Tennessee led by 12 with 14 minutes to go before watching the wheels completely fall off. So while the Orange will be out looking for respect, the Vols will be looking for something to take out their frustrations on. \n\nOffensively, Tennessee comes in ranked 32nd in offensive efficiency (1.186), 50th in shooting (48.8%), 52nd in scoring (85.9 PPG) and 114th in three-point shooting (35.4%). While Syracuse’s defensive numbers might look respectable at first—20th in opponent shooting (37.8%), 27th in scoring defense (65.3 PPGA), 30th in defensive efficiency (0.908) and 99th in opponent three-point shooting (30.7%)—a closer look will reveal a chink in its armor. In three games against top-ranked opponents during last week’s aforementioned tournament, the team saw those numbers drop to 81.3 points per game allowed on 46.4% shooting (39.7% from the perimeter). Look for Maryland-transfer Ja’Kobi Gillespie (18.5 PPG) to take advantage of that.\n\nThe mismatch should continue on the other end of the floor as well. \n\nThrough eight games, the Vols rank 12th in opponent shooting (36.8%), 27th in defensive efficiency (0.903), 29th in scoring defense (65.4 PPGA) and 51st in opponent three-point shooting (28.7%). It all adds up to what should be a very long night for an Orange offense that only ranks 114th in shooting (46.2%), 171st in offensive efficiency (1.041), 177th in scoring (74.9 PPG) and 290th in three-point shooting (29.3%). That includes scoring just 66.0 points per game on 37.9% shooting over their last three showings. And did we mentioned that the team will be without its leading scorer in forward Donnie Freeman (17.8 PPG? Yikes. \n\nA strong advantage on the glass will be another X factor in the matchup. \n\nTennessee comes in ranked 10th in total rebounds (43.6 per game), 10th in offensive rebounds (13.0), 20th in opponent rebounds (30.0) and 199th in opponent offensive rebounds (9.4). Conversely, Syracuse ranks 152nd in total rebounding (36.3), 223rd in offensive rebounds (8.6), 293rd in opponent rebounds (38.7) and 304th in opponent offensive rebounds (10.9). \n\nTrust the Vols to make the Orange their punching bag. \n\nBOL if tailing, and as always, please do so respectively.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrt24y1/"
    },
    {
      "created_utc": 1764636326.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Tuesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pbu99d/pick_of_the_day_12225_tuesday/nrt003s/"
    }
  ]
}