{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/23/25 (Sunday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/",
  "target_date": "2025-11-23",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-23T12:16:57.043529+00:00",
  "comments": [
    {
      "created_utc": 1763900129.0,
      "author": "whiteiversonyeet",
      "text": "RECORD: 3-1\n\nSTREAK: 3W\n\nNFL 12 PM CST COLTS AT CHIEFS \n\nCHIES ML -180\n\nWHY: THE CHIEFS WILL WIN TODAY BECAUSE THEY’RE STILL THE MOST PROVEN “WHEN IT MATTERS” TEAM WITH MAHOMES AT THE HELM AND KELCE STEPPING UP WHEN IT COUNTS. WAGER-MARKETS KNOW THIS: EVEN IF THE SPREAD UNDERESTIMATES THEM, THEY’RE BUILT TO CLOSE GAMES. WITH THEIR ELITE OFFENSE, THEY CAN POUND OUT DRIVES AND CONVERT ON 3RD DOWNS UNDER PRESSURE, GIVING THEM A HUGE EDGE. PLUS, BOOKMAKERS ANTICIPATE THEM TO WIN BIG PICTURE (“OVER” WIN-TOTAL FUTURES BETS ARE POPULAR), WHICH REFLECTS CONFIDENCE IN KC’S SEASON LONG DOMINANCE. ￼ ADD TO THAT THEIR PROVEN ABILITY TO CONTROL GAMES AND YOU’VE GOT A SMART BET: TAKE THE CHIEFS.\n\nALSO, I AM A CHIEFS FAN.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqchsni/"
    },
    {
      "created_utc": 1763896275.0,
      "author": "Quirky-Echidna",
      "text": " POTD Record 0 win 1 loss \n\nlet’s bounce back after a loss \n\nNext bet ⚽️ Bolivia division professional \n\nAlways ready vs bolivar over 3.5 goals @2.30 odds \n\nAlways Ready and Bolivar consistently produce high-scoring matches, especially when they meet in El Alto, where the altitude creates a fast, open style of football. Both sides attack aggressively, press high, and commit numbers forward, which naturally leads to goals and defensive gaps.\nAlways Ready have been scoring heavily at home all season, and Bolivar are one of the strongest attacking teams in the league. Their head-to-head history is full of 4+ goal matches, and both teams have reliable goal scorers in form. With the pace, altitude advantage, and the way both sides play, this matchup suits an over 3.5 goals outcome and aligns perfectly with a goals-based strategy.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqcawa1/"
    },
    {
      "created_utc": 1763892011.0,
      "author": "OliveCritical5134",
      "text": "**Record: 25-15**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅✅✅✅❌❌✅✅❌❌✅✅✅✅❌\n\n**Sport:** ⚽ / Spanish La Liga & Scottish Premiership / Real Betis v Girona & Aberdeen v Hearts\n\n**Net Units/ROI:** \\+25.78u / 25.27 %\n\n**Previous Pick:** *Manchester City most shots + Manchester City most shots on target @ 2.10 -- 3 units*❌\n\n**Summary:** Man City did have the most shots, but couldn't get them on target to make our bet hit unfortunately.\n\n**Today's Pick:** *Real Betis to win (1.53) + Hearts to win (1.86) @ 2.85 -- 2 units*\n\n**Write up:**\n\n**Real Betis v Girona (15.15 GMT)**  \nGirona is in the relegation zone this season and are struggling against teams that are worse then Betis.\n\nBetis on the other hand are 5th and looking to continue their good start to the season against Girona here. They've not really picked up a ton of points against teams around their own level or higher, which means that they need to pick up points against teams lower in the league standings. This is a game that they must win and, in front of their own home crowd after an international break, I see them winning this one.\n\n**Aberdeen v Hearts (15.00 GMT)**  \nPeople that have been tailing me know I like the current streak Hearts is on. Against a struggling Aberdeen this season this is a train I'm hopping aboard on once again. They're already on 30 points after 12 matches and are looking to extend their lead.\n\nBesides last week's 0-0 draw against 6th place Motherwell, Aberdeen have not managed to gain any points against teams that are higher on the standings as them. And I do not see them starting to do that against a very confident and currently in first place sitting Hearts. Now as long as the Scottish Premiership isn't yet divided in their playoff groups, this is a competition where a top-4 team is looking to pick up as many points against the bottom teams as they can before the split happens.\n\n**Best of luck if tailing!** 🍀\n\n**PS:** If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqc3sh7/"
    },
    {
      "created_utc": 1763891541.0,
      "author": "whidswhinners",
      "text": "**2025 NFL Record:** 17W - 8L  \n**2025 MLB Record:** 4W - 1L  \n**2025 NBA Record:** 4W - 4L  \n✅✅✅❌✅✅✅✅❌🩼✅✅✅✅  \n❌✅🪝✅✅✅❌✅✅✅❌✅❌✅  \n✅✅❌✅❌❌✅❌❌✅\n\n**Net Units:** \\+6.81 units (I only promote 1u wagers)\n\n**Last Pick:** Cedric Coward - o14.5 Points (-134 on BetRivers)✅\n\n**Event:** NFL: Jets vs Ravens (1:00PM EST)\n\n**Today's Pick:** Breece Hall.- o17.5 Receiving Yards (-115 on BetMGM)\n\n*Ravens are allowing the 8th most targets and 9th most yards per route run to running backs this year.*   \n  \n*In the last game that Tyrod Taylor started, Hall saw a season high of 6 targets for 31 yards.*   \n  \n*Ravens primarily build their defense with cover 3 looks. Without Garrett Wilson, Hall has the most targets per route run vs cover 3 on the field tomorrow.*   \n  \n*With the Jets looking to trail from behind, expect Tyrod to check the ball down in the late game and feed the star running back the ball.*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqc2zo9/"
    },
    {
      "created_utc": 1763889885.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 9-4, +3.61u\n\n**Previous Pick:** Chicago to win by 13 or more, 1.90, 1.5u ❌️, (last 5: ✅✅✅❌️❌️)\n\n**Event:** ABA: Mega - Buducnost, 12:00\n\n**POTD:** Buducnost +1.5 handicap & over 164.5 points in the game, 1.80, 1.5u\n\nMega went over this limit in 5/6 games, Buducnost 4/7, as to h2h, Buducnost won 9 of their last 10 matchups.\n\nBuducnost is also in good form in Europe, have a big streak of wins, and in ABA, they want to keep the first place.\n\nMega is a developing team with no competition ambitions, and still, they can pull out some good games. Since the pressure is off, because of those factors, I chose this hopefully safer combination. Keeping 1.5u.\n\nThe game starts at 12, some 100 minutes from now.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqc092o/"
    },
    {
      "created_utc": 1763889531.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Chaves - Sporting CP II,  Over 3 goals Asian Handicap @ 2.75\n\nRecord: 76 - 73 Profit: -1.05 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqbzo6o/"
    },
    {
      "created_utc": 1763889238.0,
      "author": "darce-choke",
      "text": "**Record:** 11-3  \n**Net Units:** \\+10.30U\n\n**Previous Pick:**  \nFight Goes the Distance (Belal Muhammad vs Ian Garry) + Arman Tsarukyan ML  ✅(4u won 2.36u)\n\n**Sport:** MMA  \n**Event:** ACA 196\n\n**Time:** Starts in 6h 45m\n\n**Pick:** Josiel Silva wins in Round 4–5 or by Points (vs Oleg Borisov) @ 2.20  \n**Units:** 1U to win 1.20U\n\n**Write-up:**  \nOleg Borisov is good but he’s 40 years old in bantamweight, and it really showed in his last fight . Silva isn’t a  finisher, but he’s the younger guy and should be able to outpoint Oleg over the later rounds. I see him taking over as the fight goes long and winning by decision or in R4/R5.\n\nhttps://preview.redd.it/z9rmt58w3z2g1.png?width=464&format=png&auto=webp&s=3f40b9684032e2d61c8b825b36a572ed72444d4a\n\n Tail responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqbz6mg/"
    },
    {
      "created_utc": 1763888043.0,
      "author": "mouse_that_runs",
      "text": "POTD RECORD: 10-1-1\n\n✅️✅️✅️✅️✅️➖️✅️✖️✅️✅️✅️✅️\n\nLAST POTD: \n\nRugby\n\nIreland vs. South Africa (South Africa -2.5) @1.54 ✅️\n\nTODAY'S POTD:\n\nRugby\n\nScotland vs. Tonga (Tonga +42.5) @1.59\n\nScotland will win by a big score, but everything has to go perfectly as with every other large handicap. They are not in the right mental state after losses to New Zealand and Argentina, surrendering a 21-point lead in the latter. Furthermore, they are unhappy with their current management, and that presents the possibility that they do not go as strong as they can despite the fact they will still win.\nThere is not much to say about Tonga other than that they play proudly and will have a right go at it to put at many points on the board as they possibly can.\nThis pick is given mostly based on Scotland and their current mental state. The result will be a drubbing, but not by 43 points or more.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqbx6vl/"
    },
    {
      "created_utc": 1763881927.0,
      "author": "jaysial",
      "text": "Cricket 🏏 Picks\n \n5 wins in last 6 picks ✌️\n\nLast pick was a Win\n\nOverall: 46💰- 26 ❌\n\n+8.11\n\nLast 10: W W W L W W L L L L W\n\nTodays pick\n\nBangladesh A v Pakistan A (Shaheens)\n\nStarts in about 7 Hours\n\nPick: Pakistan A (Shaheens) win @ 1.5\n\n* Shaheens are unbeaten in the tournament\n\n* In the semi final v Sri Lanka A they were down and out but came back to win, this kind of game gives a lot of confidence.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqbmvkf/"
    },
    {
      "created_utc": 1763879845.0,
      "author": "ponke2billions",
      "text": "Second POTD\n\nRecord 1-0\n\nPrevious pick: evan mobley over 18.5 points -130 3U on 10/29/2025 WIN\n\nPOTD: Det Lions -12 vs NY Giants 1:00PM EST 4 Units\n\nNational Football League\n\nThe lions are often borderline unstoppable at home. They are coming off a loss against the eagles on the road where they looked terrible. This is the perfect bounce back game where regardless if its dart, winston or wilson i do not expect this to be a competitive game. The lions have too many weapons and the corners of the giants do not match up well and should get torched all game as long as the offensive line holds up. The lions defensive front should have a field day vs the giants o line. I have not even mentioned gibbs and david being the best one tow punch in the entire NFL. Lions will have over 400 total yards. the only way they dont is if the defense and special teams cause turnovers early in drives or score on their own. Havent made a pick in a while but this brought me back because i like it that much. BOL LFG",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqbj7bn/"
    },
    {
      "created_utc": 1763879786.0,
      "author": "ohtanis_interpreter",
      "text": "Record:0-2\n\nLast Pick: Leon Edwards ML\n\n\nAll pics that I make are one unit bets, as well as all pics of the day that I pick our right around even or underdog odds\n\nPick: Saints ML \n\nWrite Up: \nmy original pick would have been the Steelers Moneyline, but with the uncertainty of Aaron Rodgers starting, I am deciding to go with the New Orleans Saints.\n\nThe Saints have been real shaky all year as well as the Atlanta Falcons, but after an impressive one against the Panthers Tyler Shough looks like he is starting to get comfortable in Kellen Moore‘s offense. As well as a lave Camara and Johnson. \n\nThe Falcons have looked like shit in the past couple games, as well as with Kirk cousins being the starter and Drake London injured. I believe the Atlanta Falcons will try to rely on Bijan Robinson to heavily, and the Saints will sniff that out. I also believe that even without Kirk cousins Michael panics didn’t look good in Atlanta before his injury. The only thing that could keep Atlanta in this game is their defense.\n\nWhile I believe it is a lot, I think the Saints at the Superdome is always a tough team to beat and I think the Saints are showing that they are starting to play well together and are playing a bad team in the Atlanta Falcons who is injured quite a bit.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqbj3m8/"
    },
    {
      "created_utc": 1763879092.0,
      "author": "Longjumping-Horse822",
      "text": "> **Record:** 17-14 ( 3 push ) \n\n>Last picks ( form most recent to oldest ) ✅ ❌ ❌ ❌ 🅿️❌ ✅ ✅ ✅ ❌ ❌ ✅ 🅿️ ❌ ✅ 🅿️ ✅ ❌ ✅ ✅ ✅ ❌ ✅ ❌ ✅ ✅ ❌ ✅ ✅ ✅ ❌ ✅ ❌ ❌ ✅ \n\n\n>In terms of units +5.3 , -5 , -5 , -5 , 0 , -5 , +3.39 , +0.73 ,  +8.15 , -5 , -5 , +1.86 , 0 , -1 , +9 , 0 , +3.45 , -2 , +1.09 ,+1.84 ,+4 , -2 , +3.1, -2 ,+1.8 ,+1.7 , -2 , +2.61 , +3.25 , +4.35 , -7 ,+5.65 , -10 , -2 , +2.65\n>\n>\n> **Net Units:**  +5.81 units \n>\n> **ROI:** \n\n\n>Previous pick [here](https://www.reddit.com/r/sportsbook/s/k2Nsh6Dchq) : Barcelona -1.5 handicap vs Athletic Bilbao @2.06x or +106 ( 5 units play ) ✅ \n>\n> **Football** | **Premier league** | **12:30 AM**|**Eastern time**Nearly 10 hours from now.  \n>\n> **Pick:**  Arsenal vs Tottenham Both team to score @2.07x or +107 (3 unit play ) \n\n\n>\n> **Write up** |   That's what we love to see . Barcelona gave us a sweat free win . Yes athletic Bilbao made a few chances in the 1st half but with joan Garcia back it was never going to be easy . 4-0 barcelona win .\n\n\nFor today's POTD I am going with both teams to score in arsenal vs Tottenham. \n\nIn there last 5 matches in Prem league at home arsenal has only conceded 1 goal against city.  \n\nBut on the other hand Tottenham has scored in all of there last 5 away matches in Prem league. \n\nOdds on Tottenham to score are 1.82x . Which means bookies expect a arsenal win to nil.  \n\nBut in there last 10 visits to Emirates ( arsenal home ground) in Prem league. Tottenham has scored 9 times.  If you go through there H2H history Tottenham has scored more often away then at home.  \n\nIts Tottenham. They show up when noone expects them and lose when everyone expects them to win.  \n\nAt +107 i would take the btts anyday.  \n\nAlthough i thought about going with just Tottenham to score at 1.84x on the off chance Arsenal fk up like liverpool did yesterday. But i would take the risk.  Its a rivalry from what I heard.  So yellow cards might have been a good bet but prem league is more technical football then physical football. So fouls and tackles are rare that's why I didn't pick that. \n\n\n\n\n\nDo whatever you think is best. \n\n\nBUT\n\n\nAlways bet responsibly .\n\n\nBOL if tailing \n\nBOL if fading",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqbhuno/"
    },
    {
      "created_utc": 1763878723.0,
      "author": "Silly-Pumpkin3919",
      "text": "This is my first time posting, but i’ve been betting for a while now and luckily, i’m at a profit.\n\nHowever, i’m gonna start this journey with 2u as capital.\n\nToday’s pick: \n\nEagles -2.5 v Cowboys\n\nTo bet 1u and earn a profit of .78\n\nI believe the Eagles is severely underrated at this point because they were having trouble against PLAYOFF teams, but that’s supposed to happen. Just look at Rams v Seahawks, which struggled against each other. \n\nAt every position match-up, the eagles are better or close to equal (QB, WR). \n\nIf the Eagles can stop the top offensive teams, how much more to the Cowboys. Not mentioning, they were against top defensive teams, which is the total opposite of the Cowboys. \n\nThis is a divisional match-up which i trust that the Eagles prepare better than the Cowboys. \n\nThe spread is one kick away. It’s not a crazy spread. \n\nRams: Rams -6.5 v Bucs\n\nTo bet 1u and earn a profit of .74\n\nI’m a Rams fan ever since and just watching them, they’re really a well-coached team and the personnel on each position is great. \n\nI expect the Offense will bounce back after struggling against a really great defense + the Rams have one of the best pass rush in the NFL, which I truly value when betting.\n\nThis game means a lot to the Rams because the NFC West is tight af right now, you drop one game, you’re probably fighting for 3rd. \n\nThe Bucs really struggled against playoff teams. The once early-playoff favorites are losing their grip or probably getting exposed.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqbh6ps/"
    },
    {
      "created_utc": 1763878123.0,
      "author": "this_guy9",
      "text": "**POTD Record:** 9-5\n\n**Net Units:** \\+5.22\n\n**Previous Pick**: [❌ Kon Kneuppel o5.5 Rebounds -125](https://www.reddit.com/r/sportsbook/comments/1p3ft8j/comment/nq5edj5/?context=3)\n\nWell, not much to say here. Kon ends the day with his season low in rebounds and the Clippers make quick work of the Hornets. Apologies on that one. Making it back today\n\n**🏀 Tyrese Maxey o7.5 Assists +106** vs the Miami Heat\n\nThe Heat continue to be the fastest paced team in the league. Them alone push the over/under high to 240.5. Expect Maxey and the 76ers to match pace with their quick trigger on 3s.\n\nMaxey continues to lack his usual complements as well without Oubre and Embiid but gifting this assist line at plus money is a must take.\n\nHeat are ranked 25th in allowing assists to PGs. Guards in general do well in assists vs Bulls, Giddey had 9 assists vs them in 31 minutes despite a blowout. \n\nMaxey has cashed in L2/2 and L2/4 vs Heat. He's seeing an average of 13.1 Potential Assists / game. \n\nIt's a tight spread at 1.5 and hoping for a competitive game with Maxey playing his full minutes.\n\nFull stats if you'd like to do additional research: [https://www.statpick.ai/91498665/tyrese-maxey-assists](https://www.statpick.ai/91498665/tyrese-maxey-assists)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqbg2te/"
    },
    {
      "created_utc": 1763877519.0,
      "author": "Ralphjinasseater",
      "text": "Record 7-7-2\n\nLast pick: Miles Bridges O 3.5 Assists (-104) ❌ ( I am officially a professional capper , I don’t expect you guys to tail me anymore, but I do it for the love of the game)\n\nPick of the Day: Donovan clingan “U” 21.5 P+R+A\n\nReason: Matchup grade: F (OKC #1 defense in the league, Chet + Hartenstein gonna swallow him whole) Donovan never went over on OKC h2h , at most he got 21 but not the .5 and this was last when most of the starters weren’t playing and the game , this season against thunder  he only had 7 points , 8 rebounds and 0 assists = 15 Currently he’s on over streak in last 4 games but i think that is be stopped by hartenstein and chet  .\n\nhttps://preview.redd.it/2b0um0he5y2g1.jpeg?width=1170&format=pjpg&auto=webp&s=b720eb5d6b4de081a4d52dde58dfce9545660b7e",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqbex5e/"
    },
    {
      "created_utc": 1763873594.0,
      "author": "Lyx97",
      "text": "Record: 1-0\n\nNet Units: +0.77\n\n*Prev Pick : Nic o'Reilly 1+ Shot @ 1.77 (1u) --> Win*\n\nCricket | Womens BBL | Brisbane Heat (W) vs Melbourne Stars (W) | in \\~4.5hrs\n\nPick: Melbourne Stars (W) to win @ 1.65 (1u)\n\nWrite Up: Brisbane has had a pretty bad  start to this season, already 0-4. Melbourne on the other hand has 2W, 1L & a no result. Melbourne have the better players & are the clear favorites. (in Meg lanning we trust) \n\nHope this hits & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqb6nng/"
    },
    {
      "created_utc": 1763872510.0,
      "author": "wes2211",
      "text": ">**Record:** 113-95\n>**Net Units:** +24.45 units\n\n>**Curling** | **European Curling Championships** | **7:00AM EST**\n\n>**Pick:** Denmark ML @ 2.0\n\n>The women's teams played twice on the opening day of the Euros. Only two teams managed to complete the day with two wins, one of which was Denmark. Denmark beat Türkiye 6-4 in the late draw and beat Czechia 10-4 in their opener. Their opponent tomorrow is Scotland, who are still looking for their first win. Denmark looked like the best team at the event during the first day, while Morrison struggled big time for Scotland. I had Denmark slightly higher in my power rankings coming into this event and recent play makes me even more confident in this pick. On the season, Denmark are 36-10 to Scotland's 18-10. Against intermediate level teams, Denmark are 5-4 to Scotland's 7-8.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqb4aho/"
    },
    {
      "created_utc": 1763871757.0,
      "author": "NVSBETS",
      "text": "POTD Record: 11-2\n\nNet Units: +8.78u ROI: 44.1%\n\nPrev POTD: Tsarukyan ITD-141 ✅ +1u\n\nSport: Tennis Tournament: Colina 125k Challenger Time: 4pm EST\n\nPOTD: Oleksandra Oliynykova -3.5g -110 1u\n\nAnalysis: 2nd time backing our girl this tournament and you should remember how easy that cash was. Here’s another demolition of the scamming Jeanjean who played a 2h21m semifinal this morning AND played a doubles final this evening (and lost). Oleksandra is also just simply the better clay courter and has been way more dialed in Colina. 6,2-6,2 type beat down incoming.\n\nPs. Genuinely too much to write here for this kill spot and the support hasn’t come ANYWHERE close to my performance in here unfortunately. So until then… trust the picks and cash the ticks🌟\n\nIf I’ve made you money and you want to keep these free plays coming for the sub🍀: [BMAC☕️](https://buymeacoffee.com/nvsbets) | [BTC](https://pastebin.com/0Lf0mHqu) | [ETH](https://pastebin.com/D2QRi3Bx)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqb2ls0/"
    },
    {
      "created_utc": 1763871371.0,
      "author": "TheBookiesBasement",
      "text": "Record: 0-0 (Cincinnati football is still playing)\nNet Units: 0 units \n\nCollege Basketball🏀 | Clemson vs Georgia, Sun 1 pm ET\n\n❗️POTD: Clemson ML, -140 Odds (FanDuel), 2 Unit Wager\n\n🧠Reasoning: Clemson does a very good job controlling and beating teams with their decent tempo. Their rebounding abilities and very low turnover rate makes Clemson a hard team to beat. They are doing all the small things and details of the game right, and that’s the key to winning basketball. 🔑",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqb1qca/"
    },
    {
      "created_utc": 1763870635.0,
      "author": "ChiliCheeseSandwich",
      "text": "Another W as the Pistons cruise to victory with a 13 point victory which brings our record to 3-0. S/O to those who trusted me and tailed the whole 3 units! Onto the next pick.\n\nPrevious Pick: Detroit Pistons -8 @1.91, 3U. ✅  \n\nRecord: 3-0  \n\nPOTD: New England Patriots -7 @1.84, 2U  \n\nNFL: Cincinnati Bengals VS. New England Patriots.  \n\nWrite Up: Gonna change things up for today since it’s Monday Night Football. And as per usual, another day, another strange spread. From the few Bengals games I’ve actually watched, they have looked extremely volatile and lost. Joe Flacco has been really inconsistent, as demonstrated by his strong start to the season followed by a decline in quality, highlighted by his glaring performance last week against the Steelers. The only consistently good part about their offence would probably be their receivers, most notably Tee Higgins and Ja’Marr Chase, the latter sitting this game out due to a suspension for an incident with Jalen Ramsey against the Steelers. Now, time to address the elephant in the room, because the offence isn’t the worst part about the Bengals. Their defence is abysmal, ranking first in most defensive yards allowed and touchdowns allowed. And if things couldn’t get any worse, a portion of their defensive line is not playing this match due to injuries, somehow managing to dig a deeper hole for themselves (if it wasn’t deep enough already). On the other hand, the Patriots have been excellent this season, led by MVP candidate QB Drake ‘Drake Maye’ Maye and very solid offensive units like Stefon Diggs, Hunter Henry, and DeMario Douglas. They rank top 10 in both total yards made and passing yards made. Alongside their great offence, their defence has been nothing short of amazing, placing 7th in least amount of yards allowed. Not to mention, They have a perfect record on the road, going 5-0 in all their away games (Dolphins, Bills, Saints, Titans, Bucs). I expect them to exploit both the Bengals’ limited offence and garbage defence. Therefore, I’m taking the Patriots covering the 7 point margin.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqb01al/"
    },
    {
      "created_utc": 1763870006.0,
      "author": "DavidPutney",
      "text": "Record: 0-0\n\nNet Units: 0.00\n\nROI: 0.00\n\nAmerican Football NFL| Seatle Seahawks (7-3) vs. Tennessee Titans (1-9) | 12:00pm / CST\n\nPick: ***Jaxson Smith-Njigba Over 1.5 Receptions 1st Quarter***.\n\n\nWager: 1U to win .89U\n\n\n\nOdds: -115 on Fanatics. -138 on DraftKings.\n\nWrite Up: Seahawks just ran into a very tough division opponent, the LA Rams. This week they face the Tennessee Titans who are one of the worst teams in the league. Seatle has one of the most efficient offenses in the league, especially early in the game.\n\n\nSeahawks lead the NFL with an average of 8.0/points in the 1Q. Ahead of the Colts (7.0), Rams (6.9), and Lions (6.6). They've averaged 10.3 points in the 1Q in the last 3 games. For the non NFL fans, this means they usually get in two scoring drives in the first quarter.\n\n\nJSN has hit this line in 7/10 games this season (they've played 10 games). He's hit in the last 4/5, with the miss being against the Texans, who are one of, if not the best defense in the NFL. JSN is tied 2nd in the league with most catches in the 1Q with 19 in those 10 games.\n\n\nTitans do have a poor run defense, but they are middle of the pack against the pass (18/32 teams), so I still suspect the Seahawks to be throwing it early as usual to get the offense going\n\n\nPartially a degen wager as it's limited to the 1st Q, but what are we here for.\n\n\nFirst time poster, long time lurker. Best of luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqayjyd/"
    },
    {
      "created_utc": 1763866205.0,
      "author": "Fair-Asparagus-9264",
      "text": "**Record: 2-0 (+4.1u)**\n\n**POTD: Kenneth Walker III + Zach Charbonnet 100+ combined rushing yards (-130) 2U**\n\nNFL (SEA/TEN) 1pm EST\n\nWrite-up: Titans give up 109 yds/game on the ground to opposing running backs on 23 avg carries - 7th worst in the league. Seattle is favored by 12 and against weaker teams have gone up big and early on the backs of their stellar defense and JSN. This leads to a lot of rushes that are split between KWIII/Charbonnet. 2 weeks ago against arizona the duo had 14 carries each for a total of 28 carries and 150 yards. against Houston 29/115, TB 19/121, AZ 31/120, Pitts 28/120, etc. Issue is its hard to predict who between them will go off in any given week.\n\nRather than pick one, taking the chance of a bad day/minor injury/huge run by other - this pick picks both. We're basically asking them to clear 100 yards total against one of the worst run defenses in the league with very favorable game script.\n\nI was debating between this bet and Gibbs/Montgomery combined rush yards against the Giants - which is quite similar in many aspects. decided on this for the POTD since odds are much better (Gibbs/Montgomery is -170 for combined 125+ yards) and I think taking Gibbs' individual props are better in that situation.\n\nso Kenneth Walker III + Zach Charbonnet 100+ combined rushing yards (-130) on DK.  BOL if tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqap75b/"
    },
    {
      "created_utc": 1763864442.0,
      "author": "Certain-Challenge202",
      "text": "Record: 54-37\n\nLast Pick: Searle ML vs Rydz ✅\n\nToday’s Pick: Rock ML vs Aspinall \n\nSport: Darts, Players Championship Finals\n\nReasoning: Rock has the stronger long-term numbers (higher 12-month scoring/finishing and the 3–1 head-to-head), and this tournament has only widened that gap with a 98.4 average vs Aspinall’s 95.9 plus better checkout efficiency across their last three matches. He’s shown the higher ceiling and the heavier scoring in this event, so the statistical edge stays with him.\n\nOdds: 4/6\n\nUnits: 3-4",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqakqi8/"
    },
    {
      "created_utc": 1763863855.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 6-3\n\n**Previous Pick:** Enzo Fernandez 1+ SOT (+100) ✅️\n\n**Today's Event:** English Premier League | Arsenal vs Tottenham (8:30 AM PST)\n\n**Pick:** Declan Rice 1+ SOT (+135)\n\n**Write Up:** Enzo has come through for us twice now, this go around was a bit more sweaty than the 2 minute cash from the last go around, but his late 88' goal cashes us again to start off the weekend!\n\nToday we head down to London where 1st Place Arsenal host 8th place Tottenham in the North London Derby. These two teams do not like each other to say the least and their stadiums are 25 minutes apart. Arsenal is the heavy favorite here as they play tough at home, but I'm staying away from ML as my main pick (as usual). This matchup is always unpredictable and fun to watch, we could see a 4-4 slugfest or a 1-0 defensive battle. \n\nI have to be honest, I really don't like rooting for Arsenal. Most of their players have big egos, flop frequently, and complain with flailing arms when things don't go their way (sorry Arsenal fans). But Declan Rice does not fit that mold - as he's a great guy on and off the pitch. I like this play because Rice has really been in shooting form recently. He has had 1+ SOT in his last 3 EPL matches and 4 of his last 5. He also found himself in the box a ton for England during the break, with 3 potential SOTs (two called back for borderline offsides). He again fits my mold of hard working midfielders that I love to back. He takes free kicks more often than not (and scores from them!) and has been playing much further forward in the box attacking over the last 5 matches. Keep in mind he does take corners from the left side, so not a lot of corner shot attempts from him. \n\nI like Rice here to maintain his shooting form and land a shot on target here. BOL if tailing and have a great Sunday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqaj7vt/"
    },
    {
      "created_utc": 1763862937.0,
      "author": "Best_Accountant_5471",
      "text": "Record: 50-32 (+34.4 units)\n\nLast 10 (most recent on right):  ✅✅❌✅✅✅❌❌❌❌\n\nLast Pick: Brentford +2 corner handicap vs Brighton (or +1.5 corner handicap) ❌\n\nEvent: Norway Eliteserien ⚽️\n\nPick of the Day: Frederikstad O3.5 team corners vs Viking FK 3U @ 1.72 (Bet365)\n\nWrite-up: Four losses in a row… that’s the fourth time I’ve gone through this very same patch and it’s never reached five - always leading to a long win streak but it obviously sucks at the moment. Brentford with a disgraceful performance after scoring the opener through Igor’s penalty and were leading the corners 3-1 at that point. After that though they parked the bus. I will never understand why teams do that so early as it almost always leads to them losing their advantage with 60 minutes of pressure piled on. That pressure from Brighton paid off with Minteh especially wreaking havoc, getting an incredible assist for Welbeck before Hinshelwood sealed the deal not long after. The Seagulls had 80% 2H possession at that point (which is insane) and ended on 7 corners to the Bees 4. Igor missed a last minute penalty and Brighton got a very deserved win against a disorganised team.\n\nGoing to keep this short and sweet, Viking are neck-and-neck with Bodø/Glimt and a win today would take them top with a game remaining. Fredrikstad are a steady sixth, which is where they also finished last year. Viking has averaged 4.6 corners conceded over their last 20 away matches while Fredrikstad has won an average of 5 at home over the same time period. Using all the stats I have and including recent corner form I get an expected 4.9 corners for the home team. That gives me a 71% chance of the play winning. This same fixture produced 7 corners for them last season (and the reverse fixture saw 6 this year). Fredrikstad have covered the line in 15/20 and Viking’s opponents in 13/20 at home. Looking at opponent-specified data shows me 13/16 times the line covered when Viking faced top 10 opposition and 11/15 for their opponents so both are in line with my estimation. BOL !\n\nI’m raising money for Movember, ALL proceeds will be going to a good cause. Donations aren’t expected but very much appreciated so if you have profited from my picks please do consider donating, a little goes a long way. [https://buymeacoffee.com/best\\_accountant\\_5471](https://buymeacoffee.com/best_accountant_5471)\n\nhttps://preview.redd.it/4aaydle3yw2g1.jpeg?width=1179&format=pjpg&auto=webp&s=60e3af850fb2b3d986c47e507cdee9c4607b0cd1",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqagttp/"
    },
    {
      "created_utc": 1763862658.0,
      "author": "CashTheTicket",
      "text": "Record: 1-0\n\nUnits: + 4.0\n\nLast Pick: Australia +18.5 v France @ +100 (4U) ☑️ \n\nToday’s games: Scotland v Tonga + England v Argentina (Rugby)\n\nToday’s picks: Scotland -29.5 + England ML @ -122 (3 Units)\n\nWrite up:\n\nFirst pick in the thread last time, hopefully this format is correct. I am not sure many people followed it but it was a winner! \n\nSticking with the rugby theme for Sunday. \n\nScotland playing Tonga at home to finish the internationals. The line is actually set at -38.5 which I think can easily be covered but is also quite high. Therefore I am going for the alternative spread of -29.5\n\nThis game should be a walk in the park for Scotland and they will be looking to correct their failure last time out against Argentina where they blew a 21-0 lead. Despite playing a low ranking  opponent they have named a very strong side and can see them easily scoring 50+ points. However, these games can flow weirdly when it is 1-sided, hence me going for the alternate handicap.\n\nPart 2 is England to win ML. Again the spread is tempting at -9.5 but Argentina are a good side and I expect it to be close , even tho it should cover. Probs gonna take a piece of the spread at lower units. \n\nEngland have won 10 in a row and are in their best form for years - beating New Zealand last week. They will be looking to round off the perfect autumn series with another win against Argentina. \n\nArgentina on the other hand showed their frailty going 21-0 down to Scotland last week , and against a stronger more consistent side in England - it is hard to see this not ending with a home win.\n\nI was shocked when I saw the odds for this was -122 hence the 3unit stake. \n\n(I hope this write up format is ok and happy to take any tips for useful info to include going forward!) \n\nLet me know if you join me ! 😁",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqag3hj/"
    },
    {
      "created_utc": 1763861761.0,
      "author": "InconsolableBrat",
      "text": "POTD Record: 158-103 | Profit: +119.12u | ROI: 15.7%\n\nSeason Record: 18-7 | Profit: +31.86u | ROI: 38.4%\n\n \n\nLast Pick: Atlanta Hawks -7.0 vs New Orleans Pelicans @ 1.93. 3U. ✅\n\nThe Hawks win by 19 led by Porzingis and Jalen Johnson. Betting these away favorites has worked well for us so far. Got another one locked and loaded..\n\n \n\nNext Pick: **Los Angeles Lakers -8.5 vs Utah Jazz @ 1.91**. 3U play.\n\nThis Lakers team has been a really fun watch all season, led by a combination of Luka, Reaves and Domin-Ayton. Now Lebron is in the mix, and this team looks like an absolute powerhouse on offense and above average on defense. They play the tanking Jazz who are prone to getting blownout, including losing to the Lakers 4 days back by 14 pts. The Jazz can be a fun team with different guys popping off, and Lauri is still quality, but the gulf between these teams is too much. I’d play it to -10.\n\n \n\n*If you’ve enjoyed these picks, tips are always appreciated:* [Coffee Link](https://www.buymeacoffee.com/TheBrat)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqadsvv/"
    },
    {
      "created_utc": 1763861531.0,
      "author": "oneilmatt",
      "text": "**Record:** 3-0\n\n**Previous Pick:** Jakobi Meyers o7.5 1Q receiving yards ✅️ \n\n**Game:** NFL **-** Jaguars @ Cardinals, 3pm CDT\n\n**POTD:** Jacoby Brissett o243.5 passing yards (-127 on FD) ✅️\n\n**Rationale:**\n\nKeeping with the theme of targeting the Jaguars terrible pass defense on this one. I wouldn't let last week fool you. The Jaguars have been a bottom-5 unit against the pass this season, allowing an average of 237 passing yards per game, 253 per game if you remove last week's outlier. They are also going to be without Travon Walker this week, which will *severely* inhibit their ability to get pressure on the QB.\n\nJacoby Brissett has been **slinging** the ball in his starts this season, averaging 28 completions and 314 passing yards per game. He has thrown for *at least* 258 yards in every start this year, including his monster 452-yard performance last week. The Cardinals running attack has been poor most of this season due to injury, and this plays right into the Jaguars' top-5 running defense.\n\nThe Jags, of course, have also been famous for getting killed by backup QBs over the last few years (Jacoby may not *reallllly* be a backup, but he is technically). Jake Browning and Davis Mills had field days this season, and Brissett is the exact archetype of player that just shreds their pass defense.\n\nI really like this line and expect him to clear it, and it will not surprise me if the line continues to jump up by the time you read this post.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqad8an/"
    },
    {
      "created_utc": 1763861427.0,
      "author": "DrRippples",
      "text": "POTD Record: 0-1 (-1U)\n\nLast Pick: Nico Collins Over 74.5 yards ❌\n\n[Nico write up](https://www.reddit.com/r/sportsbook/comments/1p1p0r2/comment/nprkkza/?context=3)\n\nBad beat for Nico who was on pace in the first half, then gets no action in the second due to a stellar performance from Houston's defense stonewalling Allen and the Bills. Nico had 3 catches on 3 targets for 55 yards in the first half, then absolutely no looks in the second. One more catch (for his game average) would have been right at the 74 yard number. I should have known better to make my first pick on a Thursday night game, but I'm not gonna let it keep me down.\n\nEvent: Patriots @ Bengals 1:00 PM\n\nPOTD: **Hunter Henry over 39.5 yards receiving (-110) (2U)**\n\nHunter Henry is set to have a decent game because the Bengals are **literally the worst team in the league at defending tight ends**, giving up over 4 catches and almost 60 yards a game to TEs. Their linebackers and safeties keep losing underneath and over the middle, which is exactly where Henry eats. He’s efficient with the targets he does get, so it doesn't take much volume for him to put up solid yardage.\n\n(And as a bonus, he’s got a real shot to find the end zone too. He and Diggs basically split red-zone work evenly, and Cincinnati has been getting cooked by tight ends near the goal line all year. They have given up the most TDs to TEs as well. Henry ATTD is also a solid play at +180.)\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqacyzu/"
    },
    {
      "created_utc": 1763861231.0,
      "author": "nigerianPriince0",
      "text": "**Record: 92 W  - 78 L**\n\n**Form:  ✅✅✖️✖️✅**\n\n**Today's Pick: Chelsea Over 2.5 Corners first half @ 1.80 ✅**\n\n**5 corners first half!**\n\n**------------------------------------------------**\n\n**Today's Pick: Arsenal Over 4.5 Shots on target @ 1.65**\n\n**League - Premier League**\n\n**Game: NLD - Arsenal vs Tottenham**\n\n**Time: 11:30  am EST**\n\n**-----------------**\n\n**We're dipping our hands into arguably one of the biggest games this return.** \n\n**The North London derby!!**\n\n**In Arsenal's last 10 games, they've covered this line 10/10 (100%). Averaging 6.11 shots on target per game.**\n\nArsenal have been in stellar form even with the Sunderland draw. In their last 10 games, they've won 9 and drawn 1. A last-minute goal last gameweek against Sunderland saw them fall short of achieving a perfect 10-game record and they'll look to recoup those dropped points against their biggest rivals tomorrow.\n\nAfter both Liverpool and City lost today, I don't see a way where Arsenal get under 5 shots on target tomorrow, even if they have a slow start, enough players are returning to keep this attacking side rejuvenated. Expecting a similar game to the Atletico Madrid match last month.\n\nAnyway BOL.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqach69/"
    },
    {
      "created_utc": 1763860794.0,
      "author": "dreamchasing1",
      "text": "Record: 226-215 Net Units: -29.39 47-51 on 1.5u plays, 37-39 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Saudi Professional League] Damac vs Al Najma\nLast pick: BTTS @ 1.90 - 1.5 Units Loss\n\n\nEvent: Soccer/Football, [Poland Ekstraklasa] Lech Poznan vs Radomiak Radom\n\n\nPick: BTTS + Over 2.5 goals @ 1.95 - 1.5 Units\n\n\nThe two teams have among the highest scoring attack and most allowing defence in the league - 3.3 and 3.5 total averages per game for both with Lech Poznan clearing this line at home in 7/8 games. Radomiak clearing in 5/7 away games, not clearing vs Piast Gliwice and Arka Gdynia both teams that do not enjoy high scoring games. Recent coach change for Radomiak has not significantly impacted this stat as they continued with a 2-1 win away vs Lechia and a 3-0 win at home vs Cracovia. The last 3 games between the two sides covered this line too.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqabc78/"
    },
    {
      "created_utc": 1763860743.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 7-5-1 \n\nStreak: 5W ✅\n\nNet units: +1.01u All bets are 1 unit.\n\nLast POTD 11/22/25: Missouri @ Oklahoma Total match points U42.5 (-110 Bet365) ✅\n\nToday's POTD 11/23/25: George Pickens O65.5 receiving yards (-114 FanDuel)\n\nEvent: NFL Eagles @ Cowboys 2:25MST\n\nWrite up: I almost took this line last week for my POTD vs. the Raiders and it cleared by a mile. I like this line just as much this week at home in this divisional matchup vs. a middle of the pack Eagles pass defense. This season Pickens has cleared this yardage in 8/10 games and has hit this mark in his last 5. \n\nAt this point in the season Pickens has been a major contributor in the passing game and has become the greatest WR2 in the NFL. Pickens averages an impressive 8.3 targets average in games this year and ranks 7th in the league in yards average per catch (15.7).\n\nI believe Pickens will continue to have many opportunities to be involved in this high-powered and well orchestrated offense at home this week. The Cowboys have been very dominant in Jerry's world and average 282 yards per game through the air.\n\nEvery game moving forward will be a must win for Dallas. I believe they will be putting their best foot forward on offense this week and Pickens will continue his career year success in this high stakes clash.\n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqab7el/"
    },
    {
      "created_utc": 1763860598.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 20-7 (+14.3U)\n\nLast Pick: Standard 6.5 two team teaser (Oklahoma +1/ Under 49) (NCAAFB) (-120) (1U) ✅\n\n[Teaser write up](https://www.reddit.com/r/sportsbook/s/biOCloDgv3)\n\nThat game went exactly how we said it would, Oklahoma shut down Missouri’s entire run game and offense, they themselves struggled a bit offensively for stretches but they did enough to win the game like we thought and the total didn’t even come close to 49, thank y’all for the support once again it’s been a very fun last 10 days on POTD!\n\nEvent: Eagles @ Cowboys (NFL) (3:25pm central)/ South Carolina vs Northwestern (NCAAB) (4pm central)\n\nPOTD: Two team parlay (Eagles ML/Northwestern ML) (+110) (1U)\n\n-everything is bet to win unit amount-\n\n(Except here we are placing 1u to win 1.1u)\n\nWrite up: \n\nEagles:\n\nFor two weeks straight, the Eagles have been bombarded with criticism about their offense—questions about stagnation, lack of explosiveness, and whether Jalen Hurts can carry this team down the stretch. But the reality is that before their bye week, this offense was firing on all cylinders. In the two games leading into the break, Philadelphia averaged over 27 points per game, Hurts completed nearly 67% of his passes, and the rushing attack was balanced and efficient with Saquon Barkley pounding out chunk gains behind one of the league’s best offensive lines. The narrative of a “broken offense” simply doesn’t hold up when you look at the numbers in context.\n\nThe recent dip in production came against two of the NFL’s most suffocating defenses in brutal weather conditions. Detroit ranks 6th in the league in yards allowed per game, while Green Bay sits right behind them at 7th. Playing outdoors in freezing temperatures against those units is a completely different challenge than what awaits in Dallas. The Cowboys’ defense, despite a spirited showing against the Raiders, ranks near the bottom of the league in both points allowed and yards surrendered. That Raiders game was more about emotion than quality—the Raiders are bottom-tier in nearly every offensive and defensive metric, and Dallas fed off the atmosphere of a desperate opponent.\n\nNow the Cowboys return home on a short week, while the Eagles come in rested, healthier, and motivated to silence the noise. Playing inside the dome at AT&T Stadium eliminates the weather factor and sets up perfectly for Philadelphia’s offense to reassert itself. The Cowboys want this game to turn into a shootout, but that’s not how it will be decided. The Eagles dominate in the trenches, and that gives them multiple outs to win—whether it’s Barkley grinding down the defense, Hurts exploiting mismatches in the passing game, or their own defensive front collapsing Dak Prescott’s pocket. This is the perfect spot for the Eagles to prove the critics wrong and remind everyone why they remain one of the NFC’s most complete teams. Not to mention  the cowboys have given up the 9th highest rate of explosive plays and I wouldn’t be surprised to see saquon break one off to the house tomorrow. \n\nNorthwestern:\n\nAt the Greenbrier Tip-Off, both Northwestern and South Carolina are staring down the possibility of leaving 0-2. That desperation raises the stakes, but Northwestern has the clear edge. My power ratings make this game closer to -6.5, while the market sits at -5.5, giving us immediate value, however the pace by both teams might make this a little tighter in the end but I am not worried about northwestern, they will be getting the job done.\n\nThe Wildcats’ offense is built around Nick Martinelli, who has emerged as the best player on the floor in this matchup. His efficiency and ability to score at all three levels force defenses to collapse, opening opportunities for Arrinten Page and Jayden Reid. With Page providing a reliable interior presence and Reid distributing while scoring in double figures himself, Northwestern now has three legitimate scoring options. Their shooting splits reflect that balance: the Wildcats are hitting over 46% from the field and nearly 44% from deep, numbers that far outpace South Carolina’s streaky perimeter shooting. Carolina has meechie Johnson and really that’s about it, and they only shoot 45% from the field compared to northwesterns 51%. They simply don’t have as much continuity and fluid options in their offense to match martinelli and co and martinelli will be the best player on the court tomorrow, and he’s coming off a down game with just 8 points in a close loss to a solid Virginia team. \n\nRebounding has been Northwestern’s Achilles heel, highlighted by the lopsided 49-23 margin against Virginia. Yet even in that game, they led for stretches and lost by just five despite being +4.5 underdogs. That shows how dangerous their shooting can be when they’re clicking. Against South Carolina, the rebounding battle is far less intimidating. The Gamecocks average around 36 boards per game—similar to Northwestern—and were bullied on the glass by Butler. With Page and Martinelli anchoring the frontcourt, Northwestern actually holds a size advantage here, something they didn’t have against Virginia.\nSouth Carolina’s offense leans heavily on perimeter shooting, but they lack the efficiency and depth Northwestern brings. Combine that with the Wildcats’ superior shooting splits, their trio of scoring threats, and the fact that South Carolina has struggled to impose themselves physically, and the edge is clear. Northwestern has the tools to control this game, and with both teams desperate to avoid 0-2, the Wildcats’ balance and size should carry them to a win.\n\nIn summary:\n\nThe Eagles face a soft Dallas defense in ideal conditions after weeks of criticism, while Northwestern’s efficient offense and size give them the upper hand against South Carolina. At +110 odds, this is a plus-money play that I think puts us in excellent place to cash. As always, cheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqaau0i/"
    },
    {
      "created_utc": 1763860441.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Sunday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p49ox5/pick_of_the_day_112325_sunday/nqaafjj/"
    }
  ]
}