{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/21/26 (Wednesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/",
  "target_date": "2026-01-21",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-21T19:48:31.026476+00:00",
  "comments": [
    {
      "created_utc": 1769023478.0,
      "author": "zan12231",
      "text": "**POTD Record:** 9-10\n\nLast 5: ✅✅❌✅❌\n\n**Net Units:** \\-2,08 UNIT\n\n**Previous Pick:** Dillon Brooks O21.5 PRA (-112), 1 UNIT ❌\n\n**Today's Event:** NBA: Knicks vs. Nets\n\n**Today's Pick:** Terance Mann O10.5 PRA (-111), 1 UNIT\n\nWrite up:\n\nNothing special here. Knicks in bad momentum right now.\n\nMann's average is 15 PRA this season and he went over the line in 70% this season.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0wrzdd/"
    },
    {
      "created_utc": 1769022261.0,
      "author": "PickOfTheDayBro",
      "text": "POTD Record: 5-4 (-0.16 units)\n\nLast pick: 1/20 - ❌ Spurs/Rockets o221.5 (-108) - 1 unit\n\nAbsolutely sold out in the 2nd half especially by the spurs in the 4th quarter \n\nEvent: Cleveland Cavaliers @ Charlotte Hornets - 7:00 PM eastern time\n\nPOTD: Cavs -1.5 (-1.36) - 2 unit to win 1.47\n\nWrite Up: Cavs rematch against the hornets and they were embarrassed by OKC. I think they come out swinging. Garland is out and everyone is saying hornets got this in the bag, we can’t forget… the Hornets suck. I expect a big game from Mitchell with Mobley out",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0wngmv/"
    },
    {
      "created_utc": 1769021903.0,
      "author": "Next-Application-244",
      "text": "**POTD Record:** 10-6, Net Units +4.49\n\n**Previous Pick:** NCAAB - Oklahoma @ South Carolina - South Carolina ML = BANGGGG\n\n**Reaction:** South Carolina led pretty much the whole game, love cashing that plus money ML\n\n**Event:** NCAAB - Georgetown @ Villanova\n\n**POTD:**  Villanova -8.5\n\n**Odds: -120**\n\n**Write Up:** Villanova Wildcats have a 14-4 record this season and are in the 3rd place of the Big East Conference. They have an 8-2 home record and are coming off a 86-79 home loss against St. John’s. Their previous three games were a 88-82 away win against Providence, a 76-73 away win against Marquette and a 76-72 home loss against Creighton.  \n  \nOffensively, Villanova averages 78.6 points per game, while allowing 69.6 points per game defensively. The Wildcats shoot with 47% from the field and grab 35.6 rebounds per game, while dishing out 15.2 assists per game. They average 2.4 blocks per game and 7.0 steals per game defensively.  \n  \nBryce Lindsay leads Villanova in scoring, with an average of 14.9 points per game, while shooting with 43.6% from the field and 80% from the free throw line. Duke Brennan is the team’s leading rebounder with 10.6 per game. Acaden Lewis leads the team in assists with 5.3 per game.\n\nGeorgetown Hoyas have a 9-9 record this season and are in the 11th place of the Big East Conference. They have a 2-3 road record and are coming off a 64-62 home loss against Connecticut. Their previous three games were a 86-83 away loss against Creighton, a 76-67 home loss against Seton Hall and a 56-50 away loss against DePaul. Offensively, Georgetown averages 76.6 points per game, while allowing 74.1 points per game defensively. \n\nBOL if tailing, feel free to send a little love my way <3\n\n[buymeacoffee.com/nextapplication](http://buymeacoffee.com/nextapplication)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0wm3s7/"
    },
    {
      "created_utc": 1769020864.0,
      "author": "Certain-Challenge202",
      "text": "Record: 77-49(+29.568)\n\nLast Pick: Arsenal Double Chance v Inter Milan and Over 0.5 Goal Scored In The 2nd Half\n\n\nToday’s Pick: Bayern Munich First Half Goal And Over 5.5 Corners v Union SG\n\nCompetition: Champions League\n\nSport: Football\n\nOdds: 8/11\n\nReasoning: Bayern start fast and score heavily this season, so an early goal is more likely than not. Their possession dominance and sustained pressure also drive corner volume, especially at home. Corners are volatile, so this is a 1-unit only play.\n\nUnits: 1 (go light)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0wi54a/"
    },
    {
      "created_utc": 1769020732.0,
      "author": "Timely-Conclusion532",
      "text": "Record: 318-197\n\nForm: ❌❌✅✅✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅✅❌❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌❌❌❌✅✅❌✅✅✅❌✅✅✅✅❌✅✅❌ ❌❌❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌✅✅✅✅❌❌✅✅✅✅✅✅❌✅✅✅✅❌✅❌✅❌✅✅❌✅✅❌❌❌✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅✅✅❌✅✅❌✅✅❌✅✅❌❌✅❌✅✅❌❌❌❌❌✅✅✅✅✅❌✅✅✅❌✅❌✅❌❌✅❌✅❌✅❌✅✅✅✅✅✅❌✅❌✅❌✅✅✅❌❌✅❌✅❌❌❌✅✅✅✅❌❌✅❌❌✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅❌✅✅✅✅✅✅✅✅❌❌✅✅✅✅❌❌❌✅❌✅✅✅❌✅✅❌✅❌❌❌❌✅❌✅✅✅✅✅❌✅✅❌✅✅✅✅✅✅✅✅❌✅❌✅❌✅❌❌❌❌✅✅✅✅❌✅✅❌✅✅❌✅✅✅✅❌❌✅✅✅❌✅❌✅✅❌❌✅❌✅❌❌✅❌❌❌✅✅❌✅✅❌✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅❌✅✅✅✅✅❌❌✅✅✅❌❌❌❌❌❌✅❌✅✅✅✅✅✅✅✅❌✅❌❌❌✅❌✅✅❌✅❌❌✅❌✅✅✅❌✅✅❌✅❌✅ ✅❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅❌✅✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌✅❌✅✅✅❌✅❌❌❌✅✅❌❌✅✅✅❌❌✅❌✅❌✅❌❌✅❌❌❌❌✅✅✅✅✅✅❌✅✅❌❌❌❌✅✅❌❌❌❌✅✅✅✅❌✅✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅❌✅✅❌✅❌❌✅✅❌✅✅✅❌✅❌✅✅✅✅✅❌✅❌✅✅❌✅✅✅❌\n\nNet Units: +3.51 units (All plays 1 unit)\n\nYesterday’s Pick: (NHL) Minnesota Wild vs Montreal Canadiens under 6.5 goals (-115) ❌\n\n**POTD: (NBA) Indiana Pacers +15.5 vs Boston Celtics (-186) (7:40 PM EST)**\n\nReasoning: I’m on the Pacers to cover on the road vs the Boston Celtics tonight. These two teams played each other three times this season with the Pacers beating the Celtics 98-96 in their most recent meeting on January 12th. The other two games the Celtics won 103-95 and 140-122. The Celtics aren’t in great form coming off a 103-104 loss to the Detroit Pistons and have now lost 4 of their last 7 games. The Pacers have covered the spread in 5 of their last 8 and are 8-2 ATS vs Boston in their last 10 meetings which include back to back meetings in TD Garden. Line movement has moved in favor of Indiana as well. That said, I’m playing Pacers to cover with a 15 point cushion tonight.\n\n👇\n\nhttps://preview.redd.it/m49u8bgvyqeg1.jpeg?width=1170&format=pjpg&auto=webp&s=6f8a7e5792ec319ca1bd5e927e224939920c01e9",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0whmsc/"
    },
    {
      "created_utc": 1769019679.0,
      "author": "DerpVonGroove",
      "text": "**Record:** 1L\n\n**Net Units:** \\-3 units\n\n**ROI:** – 0%\n\n**Last pick:** Faroe Islands team goals over 33.5 @ 1.85 odds (3 units) – L\n\nDisappointing performance by Faroe Islands yesterday and a strange day for EHF Euro 2026 in general where most fixtures ended with the underdogs winning. Not a great start for my first POTD but todays pick will hopefully set the record straight.\n\n**Event:** Sweden v. Croatia | **League:** EHF Euro 2026 | **Time:** 08:30 PM GMT+1\n\n**Pick:** Felix Claar over 5.5 goals @ 2.10 odds (3 units)\n\n**Write Up:** Swedens most important game of the tournament so far. Both Sweden and Croatia have been doing alright so far but this should be the first fixture where both teams face a challenging opponent. On paper, it seems set up for total goals over 58.5 seeing as both teams have conceded \\~30 goals per game so far, but at least one of the teams are bound to step up their defense this time.\n\nHowever, this shouldn't be a problem for Swedens top scorer Felix Claar who's scored on all but one of his shots on target in the tournament so far, averaging 7 goals per game. Tail responsibly and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0wdm8b/"
    },
    {
      "created_utc": 1769016555.0,
      "author": "leagueisbetterlol",
      "text": "**Record:** 4-3-1 (+1.25u)\n\n**Last:** Edmonton Oilers 3ML and McDavid 1+ Point (2.10) ❌\n\nPOTD is **Capitals 3ML and Ovechkin 2+ Shots on Goal (2.35)**  \nTime: 10:00pm EST\n\nVery simple play, probably the most obvious line everyone is gonna be on tonight, Thompson a 2.50 GAA away up against Lankinen who has a 3.88 GAA at home. Canucks are Massively struggling and Ovechkin hits 2+ shots consistently being 11/12 in L12 games played. Canucks also traded away Kiefer Sherwood who was productive for the team so they are even weaker and are likely tanking for next years draft already. Lets get back on a winning train here tonight and not overthink things. \n\nBOL! All my picks are 1U bets!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0w1rn7/"
    },
    {
      "created_utc": 1769013643.0,
      "author": "Aggravating-End-9702",
      "text": "0-0\n\nmy first ever pick dropped , strap in \n\njodar vs mensik / JODAR to win +148\n\nmeet you at the bank 🏛️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0vqyh6/"
    },
    {
      "created_utc": 1769011053.0,
      "author": "stevienick8",
      "text": "**Record: 2-1**\n\n**Net Units: +0.8U**\n\n**Tennis** | **Australian Open** | **9:30 PM** / **Central Time Zone**\n\n**Pick:** Tomas Machac (-3.5 Games) Over Stefanos Tsitsipas  1.08U to win 1U\n\n**Last Pick**: Bublik (-5.5) over Fuscovics  WIN\n\n**Write Up:** Tonight we are granted the pleasure of fading one of my favorite players in tennis, Stefanos Tsitsipas. Machac may be unseeded, but has played at the level of a top 15 player in the last few years. Machac is also red hot, winning the title in Adelaide over Tommy Paul and beating Dimitrov in straight sets in R1. \n\nMachac should force the ball to Tsitsipas' shaky 1 handed backhand. I can envision Machac losing a set, but he should hold serve and grind out Tsitsipas' inconsistent game. I did not like how Tsitsipas looked in R1 against a lesser opponent, and I really think this should be an easy win for Machac.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0vhcuv/"
    },
    {
      "created_utc": 1769010132.0,
      "author": "Dear_Bug9194",
      "text": "Where's Joe Ingles?",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0vdx0g/"
    },
    {
      "created_utc": 1769008661.0,
      "author": "Both-Benefit3421",
      "text": "\n\n**Record:** 2-0, +2U\n\n**Last:** (NBA) **Ant Edwards Over 3.5 3s ✅**\n\n**POTD:** (NBA) **Karl Anthony-Towns Over 21.5 Points** vs. Nets\n\n**Start Time:** 7:30 PM ET\n\n**Odds:** \\-115 (DraftKings)\n\n**Units:** 1.0U\n\n**Reasoning:** Because **RotoBot Ai** Told me To\n\n2 and 0 start using this new Ai Bot. Let's Cash Again!\n\nThe singular best NBA bet tonight is Karl-Anthony Towns Over 21.5 Points (-115) in the Knicks vs. Nets game at 7:30 p.m. ET. Towns has scored 28 and 37 points against Brooklyn this season and consistently hits 20+ points in recent matchups. The Nets have been vulnerable to opposing big men lately. They are among the bottom 10 teams in points allowed to the position, often conceding over 20-25+ combined points from the opposing center position.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0v8mwd/"
    },
    {
      "created_utc": 1769008030.0,
      "author": "Asleep-Bookkeeper464",
      "text": "Any discords where bets are discussed before games",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0v6fni/"
    },
    {
      "created_utc": 1769007701.0,
      "author": "AdvanceEuphoric8939",
      "text": "7-3 Up 9.25 Units\n\nLast pick: 🐶NCAAB- 1U Highpoint ML v Winthrop +124❌\n\nTodays pick: NBA (2 pick parlay) 1U -114 \nJalen Johnson 7+ assists/ Celtics ML \n\nJohnson is averaging 8 assists per game and with this Memphis defense, ball movement will be the way to score. I see this game being close. May even get lucky with ot. \n\nPacers have been playing poorly and the Celtics seem to have hit a groove. Hope for this one to be a blowout. \n\nBOL! Happy New Year 🎈",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0v5asu/"
    },
    {
      "created_utc": 1769007562.0,
      "author": "jakedeltoro",
      "text": "**Overall Record**: 8-5\n\n**Form**: ❌✅✅✅✅✅❌❌✅❌✅✅❌\n\n**Net Units**: +9.66u\n\n**Last Pick**: Borussia Dortmund o1.5 Team Goals (LOSS ❌)\n\n**Today’s Pick**: FK Qarabag v. Eintracht Frankfurt - BTTS ✅ + o2.5 Total Goals ✅ \n\n**Wager**: 4u to win 2.67u (-150 on Bet365) (WIN ✅)\n\n**Match**: FK Qarabag v. Eintracht Frankfurt\n\n**League**: Champions League (Men’s Soccer)\n\n**Last Pick Summary**: That was a tough loss, because it was doomed from about 20 mins into the match. A questionable red card (I didn’t agree with it being a red), was given to Dortmund early in the 1st half and they lost all ability to attack. I’m not sure if they even got a single SOT during the remainder of the match. You could tell that their demeanor changed and they basically just folded. This was quite disappointing as we saw FC Copenhagen equalize against Napoli with only 10 men. Dortmund looked like they were playing with about 7 men. Onward lads.\n\n**Today's Write Up:** Today I am switching it up and going away from the more prominent matches, and focusing on FK Qarabag v. Eintracht Frankfurt. We saw yesterday how Bodø/Glimt came out firing and completely threw off Manchester City, as they traveled up to Northern Norway. I think we are going to see a similar response here from FKQ as they welcome their German opponents to Baku. FKQ has had BTTS hit in 4 of 6 CL matches, and o2.5 Total Goals in those same matches as well. The two matches that didn’t hit were a 2-0 win at home against FC Copenhagen, and a 2-0 loss away at Napoli. This is a critical match for them at home in terms of the Champions League future, and I believe they are going to come out ready to be the aggressor.\n\nWhile they will want to be the aggressor, we all know that Eintracht Frankfurt plays fast and loose. They score early and often, and they concede almost as early and almost as often. In their last 3 matches, Eintracht Frankfurt has conceded 9 times and scored 8 (almost 6 goals per match). EF has also dismissed their coach on Sunday, so their U-21’s coach will be leading the squad in Baku today.\n\nThis is very important match for both sides, so we are hoping for FKQ to dominate the ball with wide attacking, that will also allow EF to strike quickly on counters/breaks.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0v4tyy/"
    },
    {
      "created_utc": 1769007321.0,
      "author": "Beneficial-Bed-1151",
      "text": "\nRecord: 0-0 Net \nUnits: 2 units \nSoccer | Champions League | 3:00 P.M / Eastern Time \nToday’s POTD: Slavis Prague VS FC Barcelona - FC Barcelona -1.5 (-130)\n\nBarcelona make their 2026 Champions League return with a trip to face a lackluster Slavia Prague side on Wednesday night, obligated to go back to Catalonia with three points in the bag. Prediction: This has not been a particularly pleasant campaign for Slavia Prague, as they are still hunting for their first win in this competition and did not score a single goal in their last five UEFA Champions League games.\n\nOn the other hand, Barcelona won 11 of their last 12 games and have six clean sheets in their last eight matches. They should be able to secure a fairly comfortable victory. \nBarcelona 2-0 or 3-1",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0v40c2/"
    },
    {
      "created_utc": 1769007060.0,
      "author": "Short-Virus-5992",
      "text": "Record: 1-1\n\n\nNet Units: -0.94\n\n\nLast Pick: Manchester City ML + Real Madrid ML❌\n\n\nLast Pick Recap: City got thoroughly outplayed. No excuses, they lost to team that they should've beat on paper that had much more heart & hustle when it came to the actual game.\n\n\n\n\nSoccer | UEFA Champions League | Bayern v USG / 15:00 EST\n\n\nPick: Michael Olisé to Assist (+165 DK)\n\n\n1.4u to win 3.71u\n\n\n\n\nWrite up: Olisé is the assist leader for Europe's top 5 leagues. This is a game that Bayern should win handily and that means many goals will be scored for the German side. He has 5 assists over his last 5, 10 assists over his last 10, and at least 1 assist over his last 3. Wait to see the starting XI before you play this. I'll still probably bet this if he's coming off the bench but the odds will be better so I'll lower my units accordingly. Anyway, Bayern will score 3-5 goals today at a minimum and I expect Olisé to assist with one of those. I like this bet given his recent performances and the plus odds.\n\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0v34g8/"
    },
    {
      "created_utc": 1769003494.0,
      "author": "kicsimani",
      "text": "✅✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅❌✅❌✅❌\n\nRecord: 20W-7L\n\nUnit:+11.92\n\nLast: Livingston vs. St 2@2.50❌\n\nToday: galatasaray vs. Atletico 1@3.50\n\nThe new season started with several ups and downs in their performance, which had a negative impact on their results. After losing the Super Cup final to Fenerbahçe (2-0), they beat the “weak” Fethiyespor (a third division team) for the cup, however, in the last league match, they had another… misstep. They were held to a 1-1 draw against Gaziantep in a game in which they squandered several chances, but were also lucky. Their many defensive lapses cost them, as a result of which they fell behind in the score with Bayo’s close-range shot (73’), however, they found the equalizer with Yılmaz’s goal in the 84th minute. With the “X” they remain at the top of the standings, just +1 behind second-placed Fenerbahçe.\n\nIn the League Phase of the Champions League after six matches, they have collected nine points, with a record of 3-0-3 and still need a point or points to secure their place in the next phase of the institution. At -3, their opponent is from tonight and the match will certainly not be easy at all for Okan Buruk's team. Next European 90 minutes, on 28/01 in Manchester where they face Guardiola's City.\n\n\"We are ready to play an important and crucial match for us, in our attempt to advance to the next phase of the Champions League. We are facing a very strong team, which is in excellent form. We want to give our maximum potential and get the victory. I have confidence in my players\", commented the team's coach, Okan Buruk, on the sidelines of the press conference.\n\nFor the crucial match against Atletico Madrid, the suspended defender Baltazzi the valuable right-back Shingo and the young central defender Uniai are not counted, with the latter two being out due to injury. They returned from the African Cup of Nations and will be normally available, both the very important forward Osimhen and the remarkable left-back Jacobs The participation of the central midfielder Sarawill be decided at the last minute as he was suffering from a knee injury. I believe in the home team and the atmosphere there and the fans can drive the team to victory.\n\nBol",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0uroqw/"
    },
    {
      "created_utc": 1769001942.0,
      "author": "Cool_End9560",
      "text": "**Record:** 0-0 | Net Units: +0 | \n\n**Sport:** Soccer | League: UEFA Champions League | \n\n**Event Time:** 7 hours from tip.\n\n**Pick:** Chelsea -2.5 Asian Handicap vs. Pafos FC @ 1.98 \n\n**2 Unit bet**\n\n**Reasoning:**\n\nThe gap in quality here is just massive, especially with Pafos having to fly over 3,000km,They’ve looked completely out of their depth away from home in Europe, failing to even get on the scoresheet in their last three road trips. Now they’ve got to deal with a wet pitch in London and a Chelsea attack that’s been absolutely clinical lately. Plus, Pafos is missing their anchor Pedrao in defense and their main RB is suspended, so they're walking into a defensive nightmare. ⚽️🥅\n\nEven with some of the rotation under Rosenior, Chelsea's depth is light years ahead of anything Pafos has faced. They’ve been putting teams away by 3/4 goals at home fairly consistently. Delap is in the form of his life (5 goals in 4 starts!), and with guys like Estevao back in, they’re going to create way too many chances for a tired, travelled Pafos side to handle. It feels like a standard 3-0 or 4-0 night where Chelsea just keeps the ball and waits for the mistakes to happen. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0un16c/"
    },
    {
      "created_utc": 1769001731.0,
      "author": "HighlightSuperb3530",
      "text": "**Record:** 0-0  \n**Net Units:** 0.00u\n\n**Sport | League | Event Time / Time Zone:**  \nNHL | Avalanche vs Ducks | 9:00 PM ET\n\n**Pick:**  \nColorado Avalanche -1.5 (-125) \n\nNHL 33% Odds Boost Token Used (+106)\n\n**Units:** 2u\n\n**Write Up:**  \nThis is our first official Pick of the Day, so starting simple and disciplined. Colorado at home against Anaheim is a clear talent and depth mismatch. The Avalanche rank near the top of the league in offensive shot creation and finishing, while the Ducks continue to struggle defensively, especially on the road.\n\nAnaheim has had issues keeping games close against top-tier teams, and Colorado has shown they’re willing to push pace and extend leads rather than sit back. The Avs’ depth scoring and power play give them multiple paths to separate, which makes the puck line more attractive than laying heavy ML juice.\n\nAt -125 this was already playable, but the BetMGM boost provides added value and pushes this firmly into POTD territory. Expect Colorado to control possession early and force Anaheim into defensive mistakes.\n\n  \nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0umfg7/"
    },
    {
      "created_utc": 1768994760.0,
      "author": "lordestros",
      "text": "Last 5 POTD : ❌️✅️✅️❌️❌️\n\n**Previous pick**: Rangers vs Kings Under 6.5 goals ❌️ \n\n**POTD Record** : 17-14\n\n**Today's Pick:** Toronto Maple Leafs vs Detroit Red Wings at 7:00pm EST (NHL/Hockey)\n\nAuston Matthews over 3.5 shots (+100)\n\nAuston Matthews shoots a lot when he's facing the Red Wings. In his 3 games this season vs Detroit, he went over that line easily with 6, 8 and 5 shots. Just like Batherson vs the Canadiens, some players seems to play with an edge against certains teams playstyle. In his last 13 games vs the Red Wings, he went over that line 11 times. This looks like the perfect bounce back game for him and the Leafs as they had a dissapointing loss at home vs the Wild. He also hit that line 4 times in his last 5 home games with the only one being against the Wild.\n\nBOL if you like my pick if not fade me to oblivion!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0u5jth/"
    },
    {
      "created_utc": 1768993414.0,
      "author": "Global_Award_1110",
      "text": "Record 1-1 -0.6 U\n\nEvent-NHL\nPick: avs ML vs ducks + caps ml vs cancucks 5u +110\n\nstart time: 7 pm est\n\nrecap - pretty easy win last time not much too say definitely excited for the primer league to start back up again soon.\n\nwrite up- for today’s parlay we will be combing avs ML with caps ML. the avs are simply the best team in hockey but while at home they are a completely different animal having only lost once in regulation.I expect them to win pretty easily vs a meh ducks squad.For the caps they find themselves in a crucial road game direly looking to pick up pts to keep themselves in the playoff picture and this is a perfect spot to do so. they play the cancucks who are easily the worst team in hockey, even though the caps are on the road i still see them getting a relatively easy win.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0u2vop/"
    },
    {
      "created_utc": 1768989162.0,
      "author": "Eddy1877",
      "text": "First Pick\n\nEvent: Islanders vs. Kraken, 9:30pm\n\nPick: Adam Pelech over 1.5 blocked shots\n\nOdds: -118 BetMGM\n\nReasoning: The Kraken have been blocked the third most of any team in the league with 719, and they're tied for tenth in percent of shots that are blocked with 28.88%. Tonight, they face Adam Pelech, who's been a defensive force since mid-December. He's blocked two or more shots in 14 of the last 19 games, and is averaging 2.26 blocks per game during that time. Also, he's covered this line in seven of the last ten road games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0tv288/"
    },
    {
      "created_utc": 1768988750.0,
      "author": "donjavogosca",
      "text": "POTD Record: 43-27, +13.8u, (ROI +15.3%)\n\nPrevious Pick: Bakken Bears -36.5, 1.86, 1.5u ✅️ (last 5: ❌️✅️❌️✅️✅️)\n\nEvent: WABA: Partizan W - Buducnost W, 16:00h\n\nPOTD: Buducnost -10.5, 1.86, 1u ❌️\n\nBuducnost is a traditional powerhouse in this area, they beat Partizan 15 times in 15 games since 2014 since this league started. In only 2 of those Partizan covered today's spread, not important at all for today's game, but interesting.\n\nIf this was played 2 months ago I would hesitate, but since then, Partizan went down with their form, and Buducnost continues to crash.\n\nPartizan beat their last 2 opponents in Serbia league by 6 and 8 points, before that they lost to Cinkarna Celje as guests by 7.\n\nBuducnost won also as guests against Cinkarna by 18, granted in November but still, it is a good comparison.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0tubyn/"
    },
    {
      "created_utc": 1768986433.0,
      "author": "X_Underscore_X",
      "text": "**POTD Record:** 0-0-1 (-4u)\n\n**Previous Pick:** Glimt Over 8.5 Shots **LOSS**\n\n**Recap:** Glimt manages a massive upset winning 3-1! However, they end on just 8 shots... Especially frustrating when they sat on seven with 20 + added time left.\n\n**Today's Event:** Champion's League | Qarabag vs Eintracht Frankfurt (18:45 GMT+2)\n\n**Pick:** Qarabag or Draw + BTTS@2.45 (Coolbet) | **Stake: 2u**\n\n**Write Up:** \n\nQarabag currently 25th, just a point outside the top 24 teams that will progress to the next rounds with two games left. Their problem, the last game is against Liverpool in England and while the Scouse are not in the best shape at the moment, it’s still a team that will be very hard to take any points from. \n\nEintracht Frankfurt started the Champions League campaign with a 5-1 win over Galatasaray at home, but since then there have been no wins in their following five games, scoring only three and conceding 15…. The league form has also been horrible, winning only once in their last seven and their last three has seen them concede three goals in each of them. After this weekend's 3-3 draw against out-of-form Werder Bremen, Dino Toppmöller finally got the sack.  \n\nSo here Frankfurt comes to Azerbaijan without a manager, in poor form and they have a key game against Hoffenheim in just three days. So how much faith are we going to put in Frankfurt and their interim manager? At home Qarabag beat Copenhagen 2-0, then drew Chelsea 2-2 before losing 4-2 against Ajax despite taking the lead twice.\n\nI don’t feel this Frankfurt side at the moment and there is more than just sacking the manager that needs to change for them to be at the level they are supposed to bet at.This won’t be easy for the Azerbaijan side even with home advantage, but if they put some pressure on Frankfurt and don’t shrink back, they have every opportunity to win! ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0tqcqg/"
    },
    {
      "created_utc": 1768985280.0,
      "author": "dreadjab",
      "text": "**POTD Record:** 4-4\n\n**Last:** Anthony Edwards u9.5 reb + ast (-132) FanDuel 1.5u❌\n\n**Event:** NBA: Cavaliers @ Hornets 7:10 PM EST\n\n**Today’s POTD:** Kon Knueppel o17.5 pts (-109) DraftKings 2u\n\n**Write-up:** To start things off, Kon has hit this line in 14/21 games this season when LaMelo, Miller, and Bridges all play. I’m expecting a tight game here; the spread sits at 2.5. I’ve been watching the Hornets a lot recently. They are my team, and I know how well they’ve been playing. They are shooting the lights out with their big three: LaMelo, Kon, and Miller. Kon has reached 17.5 points in 11 straight games in his last 12 games playing at least 20 minutes. There was a game versus the Jazz in there; he only got to 14 points, but that was also when the Hornets blew them out by 55 points. In his last game versus the Nuggets, he only reached 14 points but still saw an insane amount of usage…one of his highest of the season actually, paired with one of his lowest field goal-attempted games as well. The main reason for that is that the Nuggets defend the three extremely well, ranking 4th in opponent three-point attempts. As well as 10th in opponent three-point %. \n\nH2H Kon has reached 29 and 20 points against the Cavaliers. The Cavs are struggling to defend the three, where Kon takes 61% of his shots. In the Cavaliers last 10 games they rank 27th in opponent three point shots attempted, as well as 29th in opponent three point %. Nasty work. If they are getting lit up by these other teams, then I really expect the Hornets to drill them here. The Thunder have also struggled to defend the three all season, and he lit them up from downtown in a blowout win. Kon excels in the catch and shoot. When he gets in rhythm, he is a microwave. The Cavs cannot contain catch-and-shoot players. They can, however, defend the pick and roll, especially the ball handler. The Hornets run pick and roll all the time. Seems like they do it every possession. I can see LaMelo running point with Diabate setting the screen, into a Kon three. Cavaliers are also the highest-paced team at the moment, and with the total set at a decently high 236.5, I think Kon can get 18 given the circumstances.\n\nFeeling a lot better about this POTD than recent ones. Going to 2u on this one. Basically broke even at this point. Let’s see if we can swing it around 10-4, that’s the goal. Good luck if tailing! Let’s go 🥃",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0tocnl/"
    },
    {
      "created_utc": 1768982672.0,
      "author": "cedarrapidsiaus",
      "text": "POTD record: 50-37\n\n\\+10.63 units\n\nLast Pick: NFL 🏈 Cleveland Browns vs Cincinnati Bengals 1 P.M. E.T. U.S.A. OVER 43.5 (-135) Draftkings ❌\n\nToday's Pick: College 🏀Northwestern vs USC 11 P.M. E.T. USA OVER 151.5 points scored (-125) Draft Kings\n\n1U\n\nArenas is back to play for USC to make his debut and he can add a lot of talent to the USC offense scoring and facilitating. They already could score well with Chad BM, their point guard and some good athletes and outside shooters. USC is coming off of an atrocious 15% 3 point shooting game. I like points in a bounce back game here at home. They don't have the best defense and Northwestern has the 2nd leading scorer in the nation. NW also has some others including their PG who creates offense well. and they don't have good defense. They also are coming off of a bad scoring night. \n\nAll in all both teams should have pinpointed that their offense need to be focused on to execute improvement for this game.\n\nIf we can get the averages from these teams or even slightly under i think that bodes well for this over to hit.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0tjs1n/"
    },
    {
      "created_utc": 1768982268.0,
      "author": "FloppyWeiner84",
      "text": "Record: 2-0\n\nEvent: Islanders vs. Kraken, 9:30pm\n\nPick: Adam Pelech over 1.5 blocked shots\n\nOdds: -118 BetMGM\n\nReasoning: The Kraken have been blocked the third most of any team in the league with 719, and they're tied for tenth in percent of shots that are blocked with 28.88%. Tonight, they face Adam Pelech, who's has been a defensive force since mid-December. He's blocked two or more shots in 14 of the last 19 games, and is averaging 2.26 blocks per game during that time. Also, he's covered this line in seven of the last ten road games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0tj23l/"
    },
    {
      "created_utc": 1768980320.0,
      "author": "PorpoiseLabs",
      "text": "**Record: 0-0-0**\n\n**POTD:** (NHL) Alex DeBrincat 3+ SOG ; Colorado Avalanche ML\n\n**Start Time:** DET @ TOR 7:00 PM ET ; ANA @ COL 9:00 PM ET\n\n**Odds:** \\+100 (Fanduel)\n\n**Units:** 1u\n\n**Write Up:** Making my POTD debut with a 2 leg parlay featuring the Detroit Red WIngs' Alex DeBrincat to record 3+ shots on goal (-198) and the Colorado Avalance moneyline (-300) vs the Anaheim Ducks.\n\nThe Red Wings are visiting Toronto for a matchup against the Maple Leafs, who lead the league in Shots Allowed (51.9 per game), nearly 4 more than the next team. They have also allowed the most SOG against Right Wingers, enter DeBrincat who has cleared this line in 78% of games on the year, 100% in his last 5 games, and 80% in his last 10. His recent form has him tied for 11th in SOG in the league, and should continue against a very favorable matchup.\n\nThe Avalanche have been dominant all year thanks to a high powered offense that ranks 2nd in the league for goals per game, and 1st in goal differential at +78. Their form of late has dipped some, winning only 6 of their last 10, however they've won their last 4 matchups against Anaheim, most receltly in November 4-1 at Ball Arena. Look for that to continue in a \"don't overthink it\" matchup.\n\nBOL to those tailing, remember entertainment porpoises only!\n\n  \n[buymeacoffee.com/porpoiselabs](http://buymeacoffee.com/porpoiselabs)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0tfitw/"
    },
    {
      "created_utc": 1768979515.0,
      "author": "Logical-Sail9738",
      "text": "Anyone using Australian markets? I can only find Bulldog map1 o3.5 kills at $1.72",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0te1nl/"
    },
    {
      "created_utc": 1768978824.0,
      "author": "Ashamed-Warthog6654",
      "text": "**Record: 2-0**\n\n**Last 5 POTD** : ✅️✅️\n\nLast Pick\\*\\*:\\*\\* ✅️LA Lakers Vs Denver Nuggets total 228.5 UNDER (1U to win 0.9U)\n\n**Net Units:** 101.8 Units\n\n**Pick:** OKC Thunder Vs Mil Bucks total 226.5 **UNDER (1U to win 0.9U)**\n\n**Write Up:** BEGINNER'S LUCK. Personal new trying with new sportsbook, just try to invest 1 unit/day for 1 game here, will try to do the demonstration for 2 weeks.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0tcqfn/"
    },
    {
      "created_utc": 1768977337.0,
      "author": "redwhiteandblue0702",
      "text": "Record: 2-0 (+3.42u)\n\nROI: 85.5%\n\nLast POTD: NBA: Scottie Barnes O20.5 points -114 (1U to win 0.88U)\n\nPOTD: NBA: Nets +11.5 -110 (1U to win 0.91U)\n\nWrite up:\n\nScottie Barnes managed to cover his points line in what ended up being a blow out. Glad the warriors kept it close enough where the raps left their starters in. \n\nToday we're taking the Nets plus the points in the battle of the two new York basketball teams. 11.5 is a massive spread for a Knicks team that's been playing some horrible basketball and has been looking extremely out of sync. The nets obviously are not a good team, but just like rivalry week in CFB, I expect New York's little brother team to come out with a chip on their shoulder.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0t9uz2/"
    },
    {
      "created_utc": 1768975803.0,
      "author": "NukDatJuke",
      "text": "POTD: 0-0\n\n**Event:** League of Legends (LOL) - LCK Cup 2026 - DPlus KIA vs Nongshim Redforce\n\n**Pick: Nongshim Redforce +1.5 Match Handicap (1.70) 2u to win 1.40u**\n\n**Start Time:** 17:00 KST, \\~2 hours from posting\n\n**Writeup:** League of Legends is back, and with it the world renowned LCK! Week 1 saw intense action that both confirmed preseason power rankings and added major surprises from the top dogs of the league.\n\nNongshim Redforce are coming into Week 2 with immense up and down, ending 1-1 in matches. After an unexpected 0-2 defeat from BNK FearX, they capped Week 1 with an unprecedented 2-0 against perennial LCK powerhouse Hanwha Life Esports. \n\nThat is to say, this team can beat anyone, but also lose to anyone. They play an aggressive feast or famine style, which is no surprise with the amount of time some of them has spent in the Chinese league (LPL). Their players comprise of youngsters and veterans, so there are some points of disconnect in their teamwork so far, but once they get going, they will snowball the game into a win.\n\nDPlus KIA on the other hand cruise into Week 2 sweeping the competition with ease, ending 2-0 in matches, with a whopping +4 in game difference, being undefeated the entire week and winning in dominating fashion.  \n  \nThis team looks strong, however they have not been tested thus far. Both of their series wins have been against teams that ended Week 1 0-2 in matches (DN SOOPers and HANJIN BRION). This is their first real test of the season and I do not expect another easy 2-0 performance this time around.\n\nThese teams have played each other in the preseason, with a score line 2-1 to DPlus Kia. I expect the same scoreline this time as well. Nongshim needs to take a game in this Best of 3 for the bet to hit. BOL!  \n\n\n**Nongshim Redforce +1.5 Match Handicap (1.70) 2u to win 1.40u**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0t6s1m/"
    },
    {
      "created_utc": 1768973616.0,
      "author": "Noobdian1",
      "text": "Record:103-88-6\n\n\n\nLast Pick: PISA vs atlanta BTTS-NO (L) terrible beat was 0-0 till the 82nd minute tuff but what can u do eh\n\n\n\nToday's Pick: Marseille win OR DRAW vs Liverpool @ 1.90 (3u)\n\n\n\nMore of a vibes pick cuz Liverpool has been so shit this year its an absolute joke but the value is crazy. I dont even wanna put stats on this one cuz as I said its a vibes pick and hey its my pick I can do whatever I want. \n\n\n\nJust wanna put this out there\n\n\n\nLiverpool last 5 league games\n\n 1-1 vs Burney (Home)\n\n 0-0 Arsenal (away)\n\n 2-2 Fulham (Away)\n\n 0-0 Leeds (home)\n\n 2-1 Wolves (Home)\n\n\n\nYeah fam they aint winning this lock it in boys and girls",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0t24n0/"
    },
    {
      "created_utc": 1768971930.0,
      "author": "20k_rpm",
      "text": "PotD Record **:** **29** W **- 18** L\n\nNet Profit **:** \\+9.46 units\n\nPrevious Pick **:** Faze -1.5 map handicap vs Eyeballers - **loss**\n\nForm **:** ❌✅✅✅✅✅✅✅✅❌✅✅✅❌✅❌❌❌✅✅✅❌✅✅✅❌✅❌❌❌✅✅❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌\n\nEvent **:** Counter Strike **|** IEM RIO Global closed Qualifier **| Nuclear Tigeres** vs **Gentle mates**\n\nPick **:** **Gentle Mates to win** **|** 4 units **@ 1.52 odds**\n\nReasoning **:** Gentlemates rank 30 strong tier2 team. Nuclear Tigeres rank 50 bottom of tier 2. Recently Tigeres made a roster change and has played very less games with the new player. Mates are very well established and way more experienced and tigeres havent faced this level of quality team ever.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0sya89/"
    },
    {
      "created_utc": 1768971865.0,
      "author": "kab1218",
      "text": "PoTD 18-23-1 \n\nLast 5:  ✅❌❌✅❌\n\nNet: -23.3\n\nPrevious: England | Championship | 3pm Eastern | Wrexham vs Leceister City | BTTS O2.5 total goals 2U @ +121\n\n1-1 draw here where Wrexham was definitely the better team, they just couldn’t put it away. \n\nToday: England | Champions League | 3pm Eastern | Newcastle vs PSV Eindhoven | PSV +1.5 2U @ -115\n\nPSV have been scoring a ton this year, they’ve already beaten Liverpool away 4-1 and Newcastle are not better than Liverpool. I see PSV competing well here, possibly even taking the win, but I am going to play it safe with +1.5 goal differential. BOL if tailing  ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0sy4n5/"
    },
    {
      "created_utc": 1768968850.0,
      "author": "ReceptionCreepy3293",
      "text": "First POTD!!\n\nRecord: 0-0\nNet Units & ROI: 0\n(All bets are 1 Unit unless stated otherwise)\n\nEvent: Colorado Avalanche vs Anaheim Ducks\nPick: \n\nColorado Avalanche -1.5 puck line   (-120) 🥱\n\n9 PM U.S. Eastern Time\n\nOr \n\nEvent: Washington Capitals @ Vancouver Canucks \nPicks: Washington Capitals -1.5 puck line   (+164)\n\n10:10 PM U.S. Eastern Time\n\nHockey / NHL \n\nWrite Up:\n\nRealistically if you know anything about hockey, or don’t, the Avs are the pick for tomorrow. Colorado is a devastating team, and really the litmus test for every other team in the entire league. Anaheim doesn’t know how to play defense….thats it, and they play a contender for greatest team of all time tomorrow. \n\nI think I could stop writing there and everyone would catch my drift, but honestly I’m embarrassed that’s my pick. I want to start off strong in this POTD series, so I’m going with the most obvious choice. Going with this choice makes me physically ill though, because I think it proves nothing but that you know how to read an NHL record (honestly a pet peeve of mine, the Avs are so good that when someone tells me to take Avs ML or Avs spread the only thing I think is ‘yeah obviously! This guy barely knows anything about hockey and probably just asked ChatGPT’). \n\nI basically wrote all of that so that if you’re still reading you’ll get the real pick. The one for the people really ready to gamble, for the people who aren’t just circling the heavy favorite, for the people who actually like to feel something in this world, Washington Capitals -1.5 puck line!!! We’re closing in on the high odds limits for POTD with this one at +165 ish depending on what book you’ve got. This pick is about two people really, Logan Thompson and Kevin Lankinen, the two starting goal tenders in this one. LT is the goal tender for Washington and has had a bit of rest coming into this one (by “bit of rest” I mean; Spencer carberry the caps head coach offered Charlie lindgren ((the caps backup)) up to the Colorado Aves gods last game as a sacrifice instead of LT). LT at the very least was in contention for the Vezna (best goalie in the league award) earlier this year, and may still be depending on who you ask. Lankinen on the other side is garbage, he’s awful, don’t even waste your breath. On top of this the Caps are expected to add their leading goal scorer Tom Wilson back into the line up which is a massive help against any team let alone one tied for worst in the nhl. One final thing on this pick, the caps got straight up embarrassed by Colorado in their last game. That isn’t a new thing for Colorado to do this year but you have to remember that these guys are pros, they get embarrassed, and pissed off. All Colorado did by crushing the caps last game was light a fire under them to destroy Vancouver. \n\nP.S. Vancouver also blows, and can’t score",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0sqqt3/"
    },
    {
      "created_utc": 1768966872.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 24-23 (+0.36u)\nJanuary Record 9-9 (-1.66u)\n\nTuesday’s Pick ❌ - Ben Shelton + Joao Fonseca +143 (1u to win 1.43u)\n\nWednesday’s Pick - Nuno Borges + Frances Tiafoe +104 (1u to win 1.04u)\n\nFYI, this match is Wednesday in Australia, but it’s Tuesday night in the U.S., so you’ll have to get in quick.\n\nBorges has a 2-0 ATP record against Jordan Thompson. He made it to the 4th round of the Australian Open in 2024 and the 3rd round last year, so he has been here before and has a good opportunity to match the points he earns here last year. I like this matchup and spot in the tournament for him.\n\nI’m pairing this with Tiafoe, who is going up agaisnt Comesama. He hasn’t had a ton of success at this tournament in the past and only had a 10-15 ATP record on hard court in his career.\n\nGood Luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0sliie/"
    },
    {
      "created_utc": 1768966469.0,
      "author": "LolPropKing1",
      "text": "POTD Record: 212-163\n\nUnits Won: +99.28u\n\nLast PickNoah>Ice Map 1 Kills + Yike>Velija Map 1 Kills (-108) X\n\nToday's Pick: **BullDoG>Tangyuan Map 1 Kills (-161)** 5u\n\n* Still very early in the LPL split so hard to go off specific stats about kills, this pick is 50% gut feeling/instincts about what I know about the players and 50% based on early indications I've seen from both teams matches both so far in LPL and at Demacia Cup 2025.\n* Bulldog to me is just a better mid liner then Tangyuan, despite his struggles in Korea, bulldog got to play against all of the best mid laners in the world, chovy, faker, showmaker, zeka etc. He was consistently a very high ranked and highly touted mid laner who was mostly set up to fail on his team in Korea. Since moving to LPL he has a nice roster with a very aggressive jungle in Croco. He has looked much better so far, still a bit passive in losses, but has looked much better with Croco and been playing very well in wins overall\n* Tangyuan on the other hand really hasn't impressed me from what I have seen, his tape isn't great, he hasn't looked great in lane across the board, he had decent showing at Demacia Cup but nothing that blew me away\n* LNG are coming into this match at -240 favorites, in most 90%+ of cases it feels like the winning team is going to have the mid lane with higher kills, so their already feels like some inherent value at -160 with them being -240 to win the match. On top of this, Bulldog has a decently higher DMG% and better laning stats overall as a player. \n* While small sample size, Bulldog is averaging 3.5 kills per map this split which is 5th most amongst mid laners while Tangyuan is averaging 2.5 kills per map the 3rd lowest of active mid laners\n* Think this meta fits Bulldog's champ pool extremely well, think LNG are going to take this one down, have felt really good about this LNG roster since it was announced and I think they are going to move to their 2nd win tonight",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0skeov/"
    },
    {
      "created_utc": 1768965408.0,
      "author": "Jave3636",
      "text": "Record:8-4\n\n\nLast pick: Anthony Edwards over 3.5 3PT (pending) \n\n\nEvent: Pacers at Celtics \n\n\nPick: Aaron Nesmith under 15.5 points. (-130)\n\n\nWrite Up: I had to double take on this one because the line seems bonkers. Nesmith has only covered this total in 2/L14 games. He's been missing some games, but in those last 14 games he's played, he's been getting mostly full minutes. \n\n\nHe did put up great numbers at the beginning of the year, but it's been a while since he's regularly been in double digits. Even if you factor in the earlier games though, his season average is only 13.5. I just don't see many players going over their averages AT Boston, ones of the top defenses in the league. His last game against Boston he only got 6 points in 32 minutes of action. And that was at home. \n\n\nIt seems crazy to me to say someone will go a full 2 points over their season average and a full 5 points over their last ten games average on the road against a top defense like Boston. \n\n\nMaybe Vegas knows something I don't, but I'm betting against him having one of his best games in months against Boston. \n\n\nAaron Nesmith under 15.5 points ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0shh84/"
    },
    {
      "created_utc": 1768962148.0,
      "author": "livebreathefootball",
      "text": "**Record:** 34-44 (6 push)\n\n**Net Units:** -1.53 units\n\n**Soccer | Champions League | Atalanta vs Athletic Bilbao**\n\n**Pick:** Atalanta -1 Asian Handicap @ 2.34 [1 unit]\n\n**Reason:** Since losing their opening game to PSG, Atalanta have won 4 and drawn 1 of their next 5 games in the champions league. They are also unbeaten in their past 4 games (3 wins, 1 draw) in all competitions.\n\nAthletic Bilbao have just 1 win in their past 5 games in all competitions (1 draw, 3 losses), and that came against a second division side after extra time. They have just 1 win in the champions league this season (2 draws, 3 losses), and have failed to score in 4 of their 6 games.\n\n**Tips:** Always appreciated but not required\n\nhttps://ko-fi.com/livebreathefootball",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0s82mw/"
    },
    {
      "created_utc": 1768961732.0,
      "author": "ThatOneCinaGuy",
      "text": "**Record: 128-93-9**\n\n**Units Won: +14.99 (All Picks are 1U)**\n\n**Form:  ❌✅❌✅❌✅❌✅❌🅿️❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅✅✅✅❌✅✅✅✅❌✅❌✅✅✅✅❌✅🅿️✅✅✅✅✅✅❌❌✅❌❌❌❌✅✅✅✅✅✅✅✅❌✅✅✅✅❌✅✅✅✅❌❌❌✅❌❌✅✅✅❌❌❌✅❌❌❌🅿️❌✅✅❌✅❌❌✅❌✅✅❌❌❌✅✅✅❌🅿️❌❌🅿️❌✅✅❌✅❌❌❌✅✅✅✅✅✅❌❌✅✅❌✅❌❌✅✅❌✅✅🅿️✅❌❌❌❌✅❌✅❌✅✅❌❌✅❌✅❌❌🅿️✅❌✅✅✅✅✅❌❌❌❌✅❌✅🅿️✅❌✅✅❌✅❌❌❌✅✅❌✅✅✅❌✅❌✅✅❌✅❌✅✅❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅✅✅🅿️✅❌**\n\n**Last POTD:** Tottenham Vs Dortmund - **Over 2.5 Total Goals @ 1.74 (Melbet) - LOST**\n\n**Football | UEFA Champions League | 04:00 AM (GMT+8)**\n\n**Pick:** Chelsea Vs Pafos - **Chelsea Win to Nil @ 1.85 (Melbet)**\n\n**Write Up:** Chelsea welcome Pafos to Stamford Bridge knowing that control and discipline should be enough to secure a positive result. They come into this match with strong attacking numbers in the competition, while also showing improved game management against lower-ranked opposition. Pafos arrive after mixed European performances that have exposed their limitations against elite sides. Although they can stay compact for periods, the step up in quality and tempo makes this a very tough assignment, especially away from home.\n\nChelsea’s Champions League campaign has been solid, with 3 wins, 1 draw and 2 losses, scoring 13 goals and conceding 8 (2.17 goals per game), leaving them 13th in the League Stage. Recent form across all competitions is mixed (2W, 2D, 2L), averaging 2.17 scored and 1.50 conceded, while at Stamford Bridge they’ve gone 1W, 1D, 1L in their last three with 57% possession. Historically, home advantage is a major strength as Chelsea have won 68% of their last 40 home matches, are unbeaten in 34 of those, and have kept 15 clean sheets in their last 31 home games in this competition.\n\nPafos’ recent Champions League matches show how tough this level has been for them. Away from home, they were beaten 2-0 by Juventus and suffered a 5-1 loss to Bayern Munich, games where their defence struggled once the pressure kept coming. Those results highlighted how vulnerable they can be when faced with fast, aggressive teams.\n\nTheir better performances came when they managed to slow the game down, like the 1-0 win over Villarreal and the 2-2 draw with Monaco. However, against high-intensity sides on the road, Pafos have found it hard to create chances consistently. When they don’t take the few opportunities they get, they often end up under pressure and exposed once they go behind.\n\nChelsea’s recent Champions League results show a team becoming more balanced. After a tight 2-1 away loss to Atalanta, they responded strongly at home with convincing wins, including 3-0 against Barcelona and 5-1 over Ajax. Even the narrow 1-0 win against Benfica highlighted their patience and control, rather than a need to rush attacks. Chelsea have scored in each of their last five matches and have kept clean sheets in two of their last three home games. While conceding on the road remains a concern, their defensive setup at Stamford Bridge has looked far more solid and dependable.\n\nChelsea should be well placed to claim a comfortable win here, especially at home where they have shown strong control and an ability to limit chances against less attacking sides. Pafos’ recent away defeats to Juventus and Bayern Munich highlight how difficult it has been for them to break down top-level opposition, which makes a Chelsea clean sheet a realistic outcome.\n\nWhile Pafos have competed well against respected European teams this season, a trip to Stamford Bridge looks a step too far. Even with rotation, Chelsea should have enough quality to exploit Pafos’ defensive issues and keep themselves firmly on track in the push for a top-eight finish.\n\n**NOTE: Please only stake what you can afford to lose; know that no picks are 100% guaranteed to hit. Stake Responsibly.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0s6u92/"
    },
    {
      "created_utc": 1768961640.0,
      "author": "Seventh__Place",
      "text": "POTD RECORD: 10-7\n\nNet units: +1.796\n\nLast 10 Form (4-6): ❌✅✅❌❌✅✅❌❌❌\n\nLast POTD: Derrick White O17.5 P -125 1U ❌\n\nToday’s POTD: **Mercer -9.5 (-120 FanDuel) 2U**\n\nEvent: CBB | Western Carolina @ Mercer (7 pm EST) | 🏀\n\n*Recap: Back-to-back-to-back shit picks. You should absolutely fade me at this point. Derrick White missed his first seven shots, then finishes the game 1-for-11 from the floor and 0-for-6 from 3. He even threw in a missed free throw for good measure. Talk about ice cold. He got nine boards and five dimes, but couldn't throw it in the ocean. Onward...*\n\nFirst, this is a two-unit play - my first since starting this POTD experiment. I feel like I gotta press a little with this terrible recent run. (Degenerate move, right? I'm just sayin', you should fade me) Second, this is 100 percent a trend bet.\n\nWhat if I told you the best NCAA team against the spread hails from Macon, Georgia? Know this: Mercer (12-7) is 14-2 against the spread. Vegas has been underestimating them all year. Mercer's opponent tonight, Western Carolina (6-11), is 5-10 ATS. This game marks just the third time in 10 years that Mercer is at least a 9.5-point favorite against the Catamounts. The other two times? The Bears covered. Mercer was a 10.5-point favorite on March 1, 2025 and eked out a cover (81-69). This season, WCU is 2-6 ATS when it's been an underdog of at 9.5 points. The Catamounts' only covers were Georgia (+32.5 - lost by 30) and Chattanooga (+16.5 - lost by 8). Furthermore, WCU is 2-8 ATS on the road. Meanwhile, Mercer is on a four-game win streak, and they've covered the spread in five straight games.\n\nEven better, Mercer is 5-0 ATS at home! Not only are they covering, but they are crushing expectations. On average, Mercer is clearing the home spread by 8.3 points. The Bears have averaged 104 points over their last three home games - a 38-point win over The Citadel (Mercer was a 15.5 favorite), a 12-point win over Wofford (Mercer was a 4.5 favorite), and a 10-point win over UNC Greensboro (Mercer was a 5.5-point favorite). Overall, Mercer is 8-0 at home. Meanwhile, WCU is 3-7 straight up over its last 10 games. Mercer ranks third in the Southern Conference in offensive efficiency. WCU is ninth out of 10 teams. KenPom has Mercer's adjusted tempo rated 71st - 58 spots ahead of WCU. The Bears simply have the pace, better shooting, and better passing numbers to get it done against WCU. They also rank 39th in the NCAA in steals. WCU already gives it up (249th in the NCAA in turnovers). Between the opportunistic defense and the faster run of play, I see Mercer getting enough extra possessions to cover.\n\nKenPom has this as an 81-71 win for Mercer, and an 81 percent chance of winning. KenPom also rates WCU's defense at 304th while Mercer's offense is 100th. Two units down. Give me the hot hand. Give me Mercer, at home, to cover yet again. Plus, there's a ton of incentive. The Bears are tied for second in the SoCon, just one game back of ETSU. Let's Macon this a good bet and snap a three-day losing streak.\n\nGood luck and Godspeed!\n\nIf I've made you a few bucks through fades, it's just gonna ask you a few questions: [https://buymeacoffee.com/seventh\\_\\_place](https://buymeacoffee.com/seventh__place)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0s6kgw/"
    },
    {
      "created_utc": 1768960382.0,
      "author": "Yew32",
      "text": "Record 6-2\n\n**POTD: SGA over 29.5 and New York Knicks Money Line.**\n\nI like this spot for SGA when Jalen Williams is out as he becomes the number 1 option and there is not going to be any hockey passes. For example I mean if someone is hounded maybe SGA will have to pass it off to Jalen and they make a play through that, for example SGA doubled passes to Jalen/Isiah Hartenstein who will hockey it off to Holmgreen or a shooter. With him out and potentially Caruso, the only real play maker is Ajay Mitchel who could definitely be doing this exact scenario. But it's more so when Ajay Mitchel is benched, I'm not sure who else would be able to make a play. \n\nThe Bucks currently are also one of the worst defensive teams and are bottom 3 in points allowed to PGs. I'm not too concerned about a blow out as OKC struggles on the boards and suck at guarding threes which is what all these Bucks players do besides Giannis. Obviously I could be wrong and it's a case of them hitting or missing all their shots etc but I give a blow out chance maybe a 30 percent chance. As when your NBA champions it usually makes all teams lock in when they have to play vs them. More so I think the effort will be a lot higher then OKC tbh however their defense scheme of swarming could lead to them turning it over a lot.\n\nAnalysis would be SGA has hit 30 Points in 17/20 games without Jalen Williams and his last 2 games in 2025 was 22 minutes 34 points and 34 minutes and 31 points. I think the main concerns are double teams but even then the Bucks have been fouling a lot it seems to me. And this man loves to get to the stripe.\n\nKnicks im taking as ML because currently they are so bad that they are literally talking about trading KAT and I really do not see them trading him when Brunson took a pay cut for him lmfao. Brunson was also pretty rusty and I'm fairly sure he rushed back when he was still injured.\n\nHonestly you could take SGA as a straight at 31.5 if you're not a big parlay kinda guy which I get as well. Or you could also change the Knicks ML as they have been pretty stinky.\n\n.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0s2w6f/"
    },
    {
      "created_utc": 1768959546.0,
      "author": "Lyx97",
      "text": "Record: 33-19-5\n\nNet Units: +6.99\n\n*Prev Pick : Dortmund Team Total Goals Over 1.5 @ 2.1 (1u) -> L \\[Unlucky, got shafted by a early red card. Breaks our winning streak & keeps me bound to this 7u winning\\]*\n\nFootball | UEFA Champions League | Marseille vs Liverpool | in \\~18hrs\n\nPierre-Emerick Aubameyang o1.5 Shots @ 1.7 (1u)\n\nWriteup: Aubameyang has registered seven goal contributions across his six appearances in the Champions League this term, including netting three goals. He’s achieved this tally from 17 shots in the competition, working out to an average of 2.89 shots per 90. Aubameyang has had 2+ shots in four of his last five Champions League appearances, managing eight shots in one of these games. Aubameyang scored twice from eight shots in Marseille’s most recent home game in the Champions League, as they claimed a 2-1 win over Newcastle\n\nThese odds need shopping, so if you dont find it, 1+ SoT is at around 1.5 to 1.6 odds, which i would say is still decent shout out\n\nHope we get the W & BoL\n\n*Note: My bookie considers it void, if the player doesnt start. So, please wait for the squads to place this bet, if your bookie doesnt do the same*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0s0gcm/"
    },
    {
      "created_utc": 1768959477.0,
      "author": "CMDVN",
      "text": "Halifax @ 2.16 - €300.00\n\nLast 5 >LLWWL // Profit: €2,188.01\n\nHalifax is 6th in the home rankings being 7-4-2, they are 4-0-1 in their last 5 games at their stadium. Moracambe are 20th in away standings and are 2-3-8. In their last 5 away games they are 1-1-3. They are currently in relegation zone and just 1 place from last.\n\nIn the H2H Halifax are 3-1-0.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0s09da/"
    },
    {
      "created_utc": 1768958206.0,
      "author": "222benz",
      "text": "Record: 5-7-1\n\nLast Pick: Japan U23 ML @ 1.79 ✅\n\nSport: Basketball | PBA\n\nEvent: TNT Tropang Giga vs.San Miguel Beermen | 6:30 AM EST\n\nPOTD: San Miguel Beermen -2.5 @ 1.80 (5u)\n\n\nWrite Up:\n\nThis spread feels too short for the most dominant team in the league. TNT is always dangerous with their guard play and pace, but they simply don't have an answer for June Mar Fajardo down low. When the game slows down in the 4th quarter, SMB’s ability to dump it into the post generates high-percentage shots, while TNT often lives and dies by the three. San Miguel has the deeper bench and the championship pedigree to handle big games. I expect them to control the rebounding battle and wear TNT down physically.\n\nBOL! \n\nhttps://buymeacoffee.com/222benz",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rwk5h/"
    },
    {
      "created_utc": 1768958081.0,
      "author": "nigerianPriince0",
      "text": "**Record: 105 W  - 89 L**\n\n **Form: ✅ ✅ ✅**\n\n**Last: Real Madrid Over 6.5 Total Corners @ 1.72  ✅**\n\n**10 corners, over 2.5 first half as well!**\n\n**---**\n\n**Today's Pick: Both Teams Over 4.5  Corners First Half @ 1.72**\n\n**Slavia Prague Vs Barcelona** \n\n**Champions League** \n\n**---**\n\nWe’re going full 180 on this one, backing Barcelona and Slavia here to cover the corner line. With Barça sitting in a dangerous 15th place and only two games left, they need to push from the opening whistle for all three points and goal difference.\n\nSlavia have enough pride to hold their own at home, but that likely means a low block and defensive doubling, which should naturally produce corners.\n\n**BOL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rw727/"
    },
    {
      "created_utc": 1768957646.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 24-28-5 (Avg Odds +128)\n\n**Previous Pick:** Haaland ATGS and Over 3.5 Goals (+116) ❌️\n\n**Today's Event:** Champion's League (Soccer) | Chelsea vs Pafos (12:00 PM PST)\n\n**Pick:** Moises Caicedo 1+ SOT (+105) 1 unit to win 1.05 units\n\n**Write Up:** Well we had half the pick right, over 3.5 goals hit. Haaland didn’t show up. He whiffed a few great chances where he normally finds the back of the net. The Rodri red card didn't help either. \n\nBack to my picking roots here as we take another Chelsea midfielder to land a shot on target. Chelsea host Pafos, the 2nd place team in the Cypriot First Division (Cyprus) in the UEFA Champion's League. This will be Chelsea's first UCL match under their new manager, and the club would love a win here to pull themselves into the top 8. Chelsea have all sorts of illnesses and injuries going on, so as always **please consider waiting for lineups if your book does not void for players not starting.** However, I do believe Caicedo will feature with Enzo questionable after reportedly playing their weekend match very ill and James reportedly nursing another injury. I also expect Palmer to be rested here for this heavily rotated team. \n\nMissing many key players, Caicedo will likely be asked to play further forward than normal. Coach Rosenior has also been pushing all of his midfielders to push forward. Caicedo is typically a more defensive midfielder, which gave Enzo room to roam. Again, I'm expecting this to change for this match much like the position we saw him play against Fulham after the early red card, where he had 2 SOTs playing 10v11. The other reason I like this play is that Caicedo has been known to pull the trigger on long shots from distance, usually pretty accurately. The fans also encourage this, and I expect him to take a bit more shooting risk against a team Chelsea should beat. \n\nPafos allow the 8th most SOTs in the UCL, averaging 6 per game. Interestingly enough they allow the most shots per game (21). An extreme example, Bayern Munich on the road at Pafos had 15 SOTs on 26 shots. Juventus at home took 25 shots. Pafos tend to run a low block and encourage shots from distance, this is where I expect Caicedo to find his shots. This should be teed up perfectly for Caicedo to land at least one SOT. \n\nBOL and happy Wednesday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0ruxsf/"
    },
    {
      "created_utc": 1768957523.0,
      "author": "Ecstatic-Dog-9873",
      "text": "\nRecord: 85 - 87 Profit: -4.03 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅❌❌️✅❌✅❌❌✅✅✅❌❌️❌️✅✅✅❌️\n\nAl Khor vs Al Rayyan, over 4.5 goals @ 2.95\n\nI’ve been around long enough to spot these games early. Al Khor always try to play, even when they shouldn’t, and that leaves space everywhere. Al Rayyan are ruthless when given room and won’t slow the game down once they start scoring. When one goal goes in, more usually follow quickly. This feels like a classic open contest where defending is optional. Over 4.5 goals.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rukn2/"
    },
    {
      "created_utc": 1768955995.0,
      "author": "Wekken",
      "text": "**Record: 7-9-2** \n\n**Football Record: 20-32-4** \n\n**Basketball Record: 0-5** \n\n**Darts Record: 1-1** \n\n**POTD Units: +1.67** \n\n**Total Units: -19.29** \n\n**Total Units(excl Basketball): -10.29U** \n\n**Last 5:** ✅✅️⬆️✅️✅️ \n\n**Sport:** Football \n\n**Last Pick:** Sporting CP - PSG - BTTS & o2.5 goals \n\n**Upcoming match:** FK Qarabag vs Eintracht Frankfurt (18:45 CET) \n\n**Pick:** BTTS & o2.5 goals \n\n**Unit stake:** 3U \n\n**Odds:** 1.72 \n\n**To win:** 2.16 \n\n**Recap + overview(?):** \n\nPOTD just keeps on hitting. From 1-8 to 7-9. We are on a roll and are officially in the green. I still have a ton of faith this year and am looking forward in sharing it with you fine ladies and gentlemen. \n\nAll 3 goals hit very late in the match but a win is a win. Nailbiter wins are as sweet as heartbreak losses are bittersweet. \n\nSadly I wasn't able to watch the game myself as I had date night but coming back to a win is always welcome. \n\n**Write Up:** \n\nA 3U play and we're going all the way to Azerbaijan for it. \n\nJust like yesterday I am of the opinion that both teams are playing for something here. \n\nQarabag is very decent at home in the Champions League this season. Scoring twice in all 3 home matches but going 1-1-1 overall with 6 goals scored and 6 against. \n\nThey will fancy their chances vs a \"weak\" Eintracht Frankfurt. \n\nEintracht Frankfurt has gone 0-1-2 away in the Champions League this season with 2 scored and 7 against. \n\nWith 4 points out of 6 games they may seem eliminated but here is why I think they will act like they still have a chance. \n\nTheir schedule so far has been a single win vs Galatasaray, a draw vs Napoli and losses vs Atletico Madrid, Liverpool, Atalanta and Barcelona. \n\nA lot of big dogs in Europe whilst their remaining 2 matches are against Qarabag today and Tottenham at home. \n\nThey require a win here to keep their CL dream alive. \n\nThe 2-7 goalscoring record might not look promising either but in the Bundesliga their 10 away games saw 50 goals with a 23-27 split. \n\nThere is insane potential in this match and I expect another success. \n\nFade or tail, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rq1dm/"
    },
    {
      "created_utc": 1768955432.0,
      "author": "jaysial",
      "text": "Cricket 🏏 Picks\n \nOverall: 51💰- 28 ❌\n\n+9.61\n\nLast 10: 🥇💔🥇💔🥇🥇🥇🥇🥇\n\nTodays pick\n\nIndia v New Zealand \n\nStarts in about 14 Hours ⏳\n\nPick: Total Run outs under 0.5 @ 2\n\n. Run outs are like coin toss but I think this match is going to be more about big hitting than close singles and doubles.\n. Only 3 matches had a runout of 9 these two teams played recently. (4 by India & 5 by New Zealand)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rob6l/"
    },
    {
      "created_utc": 1768955083.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 10-31-5 *The Barcelona curse is lifted at last and my 10th win is here! I even predicted the Oyarzabal masterclass. Truth be told, Barcelona should've walked all over Sociedad in that game but luck was finally on my side for once. I decided to take a breather after that madness and came back just in time because Barca and I still have some unfinished business left. Let's get to it*\n\n**Last Five:** 🅿️❌❌🅿️✅\n\n**Event:** Champions League, Slavia Prague v FC Barcelona, 3:00 pm EST\n\n**POTD:** Slavia Prague +1.5 Asian Handicap, +105, 4 units\n\n**Write Up:** We're coming right back to take another hit at Barcelona while they're vulnerable. They head into what promises to be a tough game against the Czech side, Slavia Prague, on the back of a **tough defeat** to a midtable Sociedad team, and without **Yamal, who's suspended** for the clash, as well as a questionable **Raphinha, just coming back from injury**. **Cancelo is also not registered** for the Champions League.\n\n*Slavia Prague might not be doing amazingly well in the Champions League this season,* but they're a team more than capable of causing an upset against a shaken up Barcelona that can't catch any rest. They're still **unbeaten in their domestic league,** which *admittedly isn't nearly as strong as the Spanish one,* but it still features very respectable teams that produce players that then go on to play in the big leagues for big money. They've **scored over 2 goals a game (41 in 19), while conceding at a rate of less than a goal per game (16 in 19),** proving just how stable they are on both ends of the pitch. The same absolutely cannot be said for **Barca, as their defence routinely lets them down** and this has been especially apparent in Champions League this season as they've already dropped **points in three games,** meaning they have a measly **win rate of just 50%.** On the Czech side, Provod has been Slavia's main man this season, notching up **15 G/A in 26 apps,** and he'll be looking to torment the shakey Barcelona defence. Remember the name.\n\nHaving said all that, I still think *Slavia need a bit of a helping hand* and that's where the AH comes into play. We're making sure the bet wins even in case of a narrow loss, and while I think Barcelona are definitely capable of beating Slavia today, I just can't see them winning by more than a goal away from home. Let me tell you, these Eastern European sides are on a different level when a big team shows up in the Champions League, being able to grind out results at home time and time again. A low scoring draw seems like the most likely outcome to me, so you can also experiment with that. It seems like last weekend was the weekend of underdogs and the start of the week seems to have followed this trend, with teams like Manchester City, PSG, Napoli, Bayer Leverkusen, Dortmund all being shocked by weaker teams on paper, and I think Barcelona are next to follow suit. The Dro drama really doesn't help them either. Confidence is high so I'm laying four whole units on this play. BOL and may the best team win ☘️🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rn8q0/"
    },
    {
      "created_utc": 1768954714.0,
      "author": "SP7988",
      "text": "**Record:** 40-18-1 (+23.82u) | L5: 5-0 (6W)\n\n**Last:** (CBB) Michigan State -10.5 (1.5u) - ✅\n\n**POTD:** (CBB) No. 7 Nebraska (-11.5) vs Washington \n\n**Start Time:** 9:00 PM ET (BTN)\n\n**Odds:** -110 (DraftKings)\n\n**Units:** 1.5U\n\n**Reasoning:** They say all good things come to an end. But as far as Nebraska’s unbeaten season is considered, that conclusion won’t be coming on Wednesday night. \n\nThe Huskers (18-0) have easily been the story of the season. Not only is the team’s 18-0 start the best in program history, its 21-game win streak is the longest active streak in the nation. Not to mention, this is already a battle-tested Nebraska squad that has captured five Quad 1 wins—tied for fourth nationally—and five Quad 2 victories. \n\nBut it’s not just that the team is winning games, it’s how it’s doing it. \n\nThe Cornhuskers are flat out dominating opponents. The team has seven victories by 19 points or more—including its last two against Oregon and Northwestern—and has now covered in each of its last four games by an average margin of +13.75 points. In fact, in games with a spread of -13.5 or less, Nebraska is 9-1-1 ATS. \n\nThe team can thank a suffocating defense for much of that success.\n\nThrough 18 games, the Cornhuskers rank 5th in opponent field-goal percentage (38.8%), 14th in scoring defense (65.3 PPGA), 15th in defensive efficiency (0.931) and 52nd in opponent three-point shooting (30.7%). Furthermore, the team has held 12 of its 18 opponents to under 1.0 points per possessions. But Nebraska really seems to get an additional spark when playing in front of the home fans, ranking 3rd in defensive efficiency (0.826), 3rd in opponent field-goal percentage (34.6%), 4th in scoring defense (57.8 PPGA) and 40th in opponent three-point shooting (28.2%) in 12 home games. That could prove devastating to a middle of the pack Washington offense that ranks 89th in scoring (80.1 PPG), 96th in offensive efficiency (1.102), 157th in field-goal percentage (45.1%) and 312th in three-point shooting (30.7%). Not to mention, the team averages just 75.5 points per game on 42.1% shooting (29.9% from beyond the arc) away from home. \n\nUnfortunately, the Huskies (10-8) might find themselves undermanned on the other end of the floor, as well. \n\nThus far, Washington ranks 87th in opponent three-point shooting (31.7%), 107th in defensive efficiency (1.018), 110th in opponent field-goal percentage (43.2%) and 149th in scoring defense (74.0 PPGA). That should provide a dangerous Cornhuskers offense—38th in offensive efficiency (1.160), 58th in field-goal percentage (47.4%), 65th in scoring (81.4 PPG) and 91st in three-point shooting (35.5%)—plenty of openings to pounce. Furthermore, this is an offense that seems to be gelling as of late, averaging 83.3 points on 50.9% shooting (43.8% from deep) over its last three games. Junior forward Pryce Sandfort (16.7 PPG) has been leading that charge, averaging 25 points on 57% shooting over the last two games. \n\nBut the X factor in this one will come down to turnovers. Or lack there of.\n\nOn the season, Nebraska has played some of the cleanest basketball in the country, ranking 4th in turnovers (9.1 per game), 8th in turnovers per possession (12.9%) and 8th in opponent steals (4.9). Believe it or not, over the team’s last three games, those numbers have free-fallen, dropping to 6.3, 9.8% and 2.7 respectively. Against a lesser-talented Huskies defense (272nd in turnovers forced) that will need to rely on creating turnovers to keep this close, that should prove to be the nail in the coffin. \n\nTrust the Huskers to keep on rolling.\n\nBOL if tailing, and as always, please do so responsibly. One bet should not have you crashing out all over Reddit.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rm3o5/"
    },
    {
      "created_utc": 1768954601.0,
      "author": "san_solares",
      "text": "Net Units: +66.65  \nROI: 17.09%  \nRecord: 45-20-12 (W/L/P)\n\nLast POTD: Espanyol ML (L)\n\nTracker on the bottom, as per.\n\nToday's POTD: Newcastle v PSV Eindhoven - UCL - 3.00 PM EST - BTTS YES + O 2.5 - (1.68) - 5U\n\nWe are talking about two teams that belong in both of the biggest offensive leagues in the world, both the EPL and the Eredivisie. Curiously enough, I found that in the last 5 games in UCL that both included an Eredivisie team and an EPL team, BTTS and O 2.5 has hit in all five games. I also believe this is a bet that revolves around if PSV can be competent enough vs a superior team from a superior league. They scored twice vs Atletico de Madrid, four times vs Liverpool, and a whopping six times vs Napoli. I consider all of those teams to be better than Newcastle nowadays. \n\nBOL and tail responsibly, as always.\n\n[TRACKER](https://docs.google.com/spreadsheets/d/1-PHX-U7eiB5neVpbTJVkzwquGE1KyGVQA5nfejcDT_A/edit?usp=sharing)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rlr3u/"
    },
    {
      "created_utc": 1768954035.0,
      "author": "dreamchasing1",
      "text": "Record: 257-242 Net Units: -28.75 62-64 on 1.5u plays, 44-44 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Champions League] Bodo/Glimt vs Man City\nLast pick: Bodo/Glimt over 9.5 shots @ 2.00 - 1.5 Units lost\n\n\nEvent: Soccer/Football, [Champions League] Chelsea vs Paphos\n\n\nPick: Asian total corners over 9.5 @ 1.92  - this pick is the same as just total corners over 9.5\n\n\nChelsea cleared this line in 2/3 games since the new manager took over, with 12, 12, 9 total. They are a pretty good corner generating side in the PL with 9/11 home games going over this line. Pafos don't need to go for a win here, as they face Slavia Prague in their final fixture, so them settling for defence should be expected. Pafos have covered this line in 4/6 games away in the CL, with 17, 10, 9, 17, 7, 12, considering they didn't face very strong sides, only Juve where there were 17.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rk0ok/"
    },
    {
      "created_utc": 1768953991.0,
      "author": "bstilled_",
      "text": "**Record:** 10-2      \n**Net Units:** +5.45                           \n**Last Pick:** IMMORTAL BLISS - Loss              \n**Australian Horse Racing, Sandown race 6 (6:30PM AEDT)** 7 hours from now    \n**Pick:**  2. ROYAL RENDEZVOUS $1.75 (Bet 3.5 units to win just over 6.1)                          \n**Write Up:** Back at it today with probably one of my most confident plays since I started posting POTD, hence the increase in units.    \n    \nThis horse ROYAL RENDEZVOUS is a star in the making and its first 2 starts have been huge. First up with no market expectation, it sat worse than midfield and unleashed a massive turn of foot to win softly on the line, beating a horse who came out and won its next start by almost 3 lengths.    \n    \nLast start was a horror watch. Forced back to last from a bad barrier, and had traffic problems in the straight until it was way too late. Still had the turn of foot to pick up really late and rattle off some seriously impressive sectionals to finish 4th, beaten just over a length. This race in particular was a strong Saturday class race containing some very good horses.    \n    \nWe now go from an on pace bias track of Geelong, to a wide open Sandown that heavily favours our racing style, plus we get an increase of 200m. Drawn perfectly in barrier 4, I imagine D Lane just sits midfield or even a touch worse, and with the long straight we have ample time to unleash our run down the middle and get over the top.    \n    \nI’m very big on sectionals/race splits and I can’t begin to describe how big this horse’s 400-200 and last 200m splits have been. To be running home this fast is the trait of a well above average horse, and I think up in distance + a more suitable track, RR is set to explode here. GL!    \n    \n\n[buymeacoffee.com/bstilled_](https://buymeacoffee.com/bstilled_)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rjvvj/"
    },
    {
      "created_utc": 1768953769.0,
      "author": "WeightShift",
      "text": "**POTD Record 146-1-75 | +97.38u**\n\n**Form:** WWLLWWWWWWWLWLWLWLWLLWWWWWWWW\n\n**Pick:** ATP: Aus Open - Tomas Martin Etcheverry H2H v Arthur Fery $1.68 3U 12:00PM AEDT\n\nWe backed Etcheverry in Round 1 against Kecmanovic and he now plays a less polished player in Arthur Fery.\n\nFery has had a pretty easy run into the Open only facing one top-100 opponent in Cobolli. Cobolli was pretty average at the United Cup and was suffering from diarrhoea apparently in the match. Wont read much into it.\n\nFery is known for his agressive baseline play but he lacks a serve that delivers punch. His 1st serve win %'s are only slightly higher than his second. The problem with that is, he now faces a guy that was already a dominant baseline player with a huge first serve that he wins on average 75%+ of the time.\n\nEtcheverry has played 5 top 100 players to start the year and his service game has been solid winning 74% of 1st service games and 57% of second service games over that span against opponents much better than Fery.\n\nIt's difficult to see where Fery has an advantage here given Etcheverry is a natural clay court player who has developed significantly on hard courts i.e. he knows how to construct a point in rallies and break down baseline players (again, Fery's biggest strength).\n\nOnly reason this isn't a 4U or 5U play is that Etcheverry has gone the distance in his last 3 games, including the 5 setter against Kecmanovic.\n\nAs always, bet this on a book that pays out the winner on retirement and voids bets on the retiring player.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rj762/"
    },
    {
      "created_utc": 1768953735.0,
      "author": "Best_Accountant_5471",
      "text": "2026 record: 6-7 (-2.1 units)\n\n2025 record: 55-41 (+26.5 units)\n\nLast 10 (most recent on right):  ❌✅✅❌✅❌❌✅✅❌\n\nLast Pick: Eva Lys 🇩🇪 ML vs Sorana Cirstea 🇷🇴 ❌\n\nEvent: Australian Open R1 🎾\n\nPick of the Day: Daniil Medvedev 🇷🇺 -6.5 games handicap vs Quentin Halys 🇫🇷 5 units to win 4.2U @1.83 (Bet365)\n\nYes I know I’m betting on Medvedev in a grand slam match. He went an atrocious 1-4 in slams last year and his only win was against some guy ranked outside the top 300. But as they say it’s new year new me for Daniil. The former word No. 1 and three time finalist at the Australian Open finally sacked his coach after eight years together after the US Open and both his results and performances have improved since then. He won Almaty at the end of last year and  comfortably won Brisbane to start off his 2026. I feel like he’s getting closer to his best in terms of his baseline skills and is FINALLY starting to come to the net and finish points early. Medvedev’s ability to turn defence into offence is a joke which makes it very difficult to break him down. To be honest his first round was fairly unconvincing despite the straight set victory but to me it seemed more like a mental barrier from last year’s nightmare and he really grew into the match as it went on, applying more pressure to De Jong and limiting unforced errors. I expect him to carry on playing looser and continue his good form now that he won that. So what’s the one problem with Medvedev? His second serve is really bad. I mean seriously bad (as good as his first serve is) which caused him to break down when serving for the match twice against De Jong.\n\nNot to worry though, I introduce Quentin Halys the third worst returner on the ATP tour (according to the return quality stats) just ahead of Mpetshi Perricard and Opelka so the main issue is out of the way. The No. 83 can produce some good tennis at time but his low margin big hitting game causes huge periods of inconsistency. One week he was taking Rune to a fifth set at the French Open and the other he was on a 9 match losing streak losing to Bellucci 4 and 2. To be fair he’s had a pretty good start to the season going 7-2 including qualifiers and crushed Tabilo in round 1. So you may wonder why the handicap, well the match-up is simply the worst possible for Halys. His game is primarily driven through his excellent first serve + one combo but Medvedev’s comically deep return position and quality nullify this. As soon as a rally starts to be imposed (far from his forte) the errors will start to leak against a human backboard and his lack of movement exposed by one of the best movers on tour. Halys struggles in the physical matches and when every point will start to feel more and more like a grind, Medvedev should start to easily pull away. The only way he can keep this match close is if his first serve percentage stays high (8th best 1st serve% won on tour, 70th 2nd serve% which shows the disparity) as he will be crucified on second serves by the Russian. It was only 56% in round one and against the 5th best 2nd serve% returner that is a death sentence. \n\nHalys easily lost in his two matches over top 40 opposition (4,2 in both) this year and lost by the same score last time he faced Daniil on hard courts. They also faced last year on grass where Medvedev won against 2,5. If you had asked me to pick the worst opponent for Halys in the ATP I toughest probably have said Medvedev which is why I like this play. BOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rj3hv/"
    },
    {
      "created_utc": 1768953619.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 43-22 (+16.04U)**\n\n**ROI: +20.30%**\n\nLast POTD: [Indiana 1H -4.5](https://www.reddit.com/r/sportsbook/s/7y5OMmq5PV) ✅\n\n**POTD: NCAAMB: Syracuse -2.5 vs Virginia Tech -110 (1U TO WIN 0.90U)**\n\nWrite up: 11 straight W’s in a row, just wow, this run has been so much fun, and I hope you all are enjoying it as much as I am - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Syracuse -2.5 at 55%\n\n• Model projects Syracuse ML at 58% \n\n• EV better betting 100$ = 10-11$ for this play\n\n• Before anyone says something, yes I’m aware, Syracuse just lost to Boston College - I believe Syracuse has a home edge in this one - they seem to play their best ball at home, and to be honest, they look a lot better at home, some games being night and day different - Syracuse is 9-2 at home this year, while VT is only 1-2 on the road, with their only road W being @ South Carolina (10-8) - In VT’s two road loses, SMU (buzzer beater) & Wake Forest, they played well & lost close games in both - While Virginia Tech’s offense is a high scoring one, I think Syracuses top 40 defense, top 30 at home, can slow them down a touch - Syracuse averages right around 80 PPG at home while holding away teams to just under 70 PPG - Syracuse covers at home at a nice percentage of 63%, which is important to note, regardless of their record - A fun statistic that stands out in this one is VT turns the ball over around 11 T/Os per game while Syracuse defense forces roughly 14 turnovers a game - VT shoots a whopping 48% from the field in the ACC, but when they are playing on their home court - this number drops down to 42% during road ACC games - Surprisingly, Syracuse averages almost the same amount of points scored in both halves as VT (38-40PPG per half) - I like the chances here with Syracuse’s home court advantage, them coming off a brutal ACC lose, and them playing their best ball in the dome.. Syracuse -2.5 to hopefully continue our win streak\n\nPOTD History: https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn\n\nBOL!\n\n**POTD: NCAAMB: Syracuse -2.5 vs Virginia Tech -110 (1U TO WIN 0.90U)**\n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\nhttp://buymeacoffee.com/claysmiith\n\nhttps://venmo.com/u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0riqqq/"
    },
    {
      "created_utc": 1768953576.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Wednesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qii1d1/pick_of_the_day_12126_wednesday/o0rim27/"
    }
  ]
}