{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/30/26 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/",
  "target_date": "2026-01-30",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-30T02:32:04.431950+00:00",
  "comments": [
    {
      "created_utc": 1769739806.0,
      "author": "bstilled_",
      "text": "**Record:** 13-7      \n**Net Units:** +3                           \n**Last Pick:** TOUGH ROMANCW - WIN                  \n**Australian Horse Racing, Cranbourne race 5 (8:15PM AEDT)** 7 hours from now    \n**Pick:**  9. EDUCATED - WIN - $1.70 (Betting 3 units)                           \n**Write Up:** Got another shorty today with EDUCATED resuming here at Cranbourne. In her only start she went straight to the front, and under a really strong hold just held them all off for a soft win of just over 1 length. Comes to the races here and draws barrier 2 in a race with no speed or pressure, so we should just bowl along at our own leisure.     \n      \nIt’s really hot and dry here in Melbourne presently, and with Cranbourne already being an “on pace” track, the conditions play into our favour even more; I’m expecting it to be very hard to make any ground tonight.     \n      \nCeline is a good jockey and we’re down on 55kg due to our low rating, but based on the recent trials and jump outs we’ve improved heaps over the break.    \n      \nFrom is good out of the debut also, with the 2nd and 3rd horse going on to win, and multiple other horses running 2nd. GL!      \n      \n[https://ko-fi.com/bstilled_](https://ko-fi.com/bstilled_)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2j24br/"
    },
    {
      "created_utc": 1769739554.0,
      "author": "Lyx97",
      "text": "Record: 37-23-6\n\nNet Units: +7.26\n\n*Prev Pick : Midtjylland vs Dinamo Zagreb - BTTS & o2.5 @ 2.0 (0.5u)  -> L*\n\nFootball | Australia Queensland Pro Series Cup | Eastern Suburbs vs Holland Park Hawks | in \\~7hrs\n\nFootball | Australia Queensland Pro Series Cup | Logan Lightning vs Magic United  | in \\~7hrs\n\nParlay : o3.5 goals in Eastern Suburbs vs Holland Park Hawks + o2.5 goals in Logan Lightning vs Magic United @ 2.13 (1u)\n\nWriteup: After Zagreb sold us yesterday, today im going back to Australia, where goals flow. The first leg is between 2 teams in different leagues, with eastern suburvs the favorites, being from a division above. In addition, the Hawks had lost their previous game in a 8 goal affair. \n\nThe 2nd leg is quite similar to the first one, where Magic united is from a division above. The issue is Magic has recently been promoted & Logan has recently been relegated, so i dont think there is any 1 clear favorite & my mind says it will be a close 3-4 goal affair. So, copping out and going with over 2.5 goals for this leg.\n\nHope we get the W & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2j1cu7/"
    },
    {
      "created_utc": 1769737210.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 26-35-5 (Avg Odds +126)\n\n**Previous Pick:** Nottingham Forest ML + Over 1.5 Goals (+102) ✅️\n\n**Today's Event:** German Bundesliga (Soccer) | Cologne vs Wolfburg (11:30PM PST)\n\n**Pick:** BTTS + O2.5 Goals (-120) 1.2 units to win 1 unit\n\n**Write Up:** Guys we did it, we broke the losing streak! Forest cruise to a 3-0 win as expected and we are back in the green. \n\nBack to Germany today as 10th place Cologne host 12th place Wolfsburg in a mid table match. This is a numbers play more than anything. BTTS and O2.5 goals has hit in the last 4 Cologne games and in the last 6/7 for Wolfsburg. Additiomally, BTTS has hit in each of the last 11 Wolfsburg match. Both of these teams are good offensively and not great defensively. Wolfsburg allow the 3rd most goals in the Bundesliga. \n\nThe numbers look great for this, both teams are in good goalscoring form. Let's see if we can start a little win streak here and end the week with another win, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2iuckm/"
    },
    {
      "created_utc": 1769736824.0,
      "author": "nigerianPriince0",
      "text": "**Record: 113 W  - 90 L**\n\n**Form: 11-1**\n\n **✅ ✅ ✅ ✅ ✅ ✅✖️✅ ✅ ✅ ✅ ✅** \n\n**---**\n\n**Today's Pick: FC Porto ML + VFB Stuttgart ML @ 1.71 ✅**\n\n**Confidence 87%**\n\n**---**\n\n**Today's Pick: Bristol City VS Derby County Over 4.5 Corners First half @ 1.83**\n\n**Details: EFL Championship- 3:00 PM EST**\n\n**Confidence: 85%**\n\n**---**\n\n**We're heading to the championship today and working with 2 sides that are only separated by 1 point, best part is if either wins they find themselves into the top 6 before the weekend games kickoff.** \n\n**The key here is Bristol City at home who aren't scared to bring the game to their opponent and don't mind leaving space in behind as long as they can move on the ball how they want. They prefer to push for early lead which leads to a less structured chaotic first 45'.**\n\n**When it comes to corners both teams rank top 6 out of 24 teams in average Total corners per game:**\n\n**Bristol city - Rank 4/24 - Average 10.00 PG**\n\nIn Bristol City's last 9 games this line has hit in 8/9 of those games.\n\nIn those 9 games the average corners first half was 6.2 per game.\n\nIn their Last 5 home games this line has hit 4/5.\n\n**--**\n\n**Derby County- Rank 6/24 - Average 10.72 PG**\n\nGiven the weight behind the game I don't expect either team to play pragmatic and quite frankly if one team leads the other should force field tilt and print corners so it works both ways for us. Derby will grab at the open space and i expect an end to end first half. They've played off the ball as of recent but Bristol home ground + 1 point difference will get us where we need to be.\n\n**--**\n\n**I see the first half being the play here as a home early lead could lead to a dwindle in output in the second half.**\n\n**Total corners Over 9 is playable, but i'm personally staying away. Model and I just both see more corners first half.**\n\n\\---\n\n**Nothing expected, everything appreciated!**\n\n[**https://paypal.me/PrinceAtonyo**](https://paypal.me/PrinceAtonyo)\n\n[**https://buymeacoffee.com/thenprince**](https://buymeacoffee.com/thenprince)\n\n**BOL!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2it7g4/"
    },
    {
      "created_utc": 1769736480.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 87 - 93 Profit: -7.26 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅❌❌️✅❌✅❌❌✅✅✅❌❌️❌️✅✅✅❌️❌️❌️✅❌️❌️❌️❌️❌️✅❌️\n\nNürnberg vs Preußen Münster, FIRST HALF OVER 1.5 GOALS @ 2.71\n\nlooks like a high-scoring first half candidate, especially for Over 1.5 goals in the opening 45. Historical data shows both clubs have been involved in matches with multiple goals, and past head-to-head clashes have featured early scoring action, including a 2-1 Münster win where both first-half goals came before halftime recently. League stats also indicate a strong trend for over 1.5 total goals overall and early goals. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2is751/"
    },
    {
      "created_utc": 1769734734.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 27-28 (-2.12u)\nJanuary Record 12-15 (-4.14u)\n\nPrevious Pick ✅ - Ben Shelton vs Jannik Sinner u34.5 games -115 (1.15u to win 1u)\n\nFriday’s Pick - Alcaraz to win AND both players to win a set +132 (1u to win 1.32u)\n\nAlcaraz is the stronger player here and is certainly motivated to win this tournament and complete the career slam. The question here is can Zverev keep up and grab a set. I think he can. Zverev has actually had a little bit of success historically against Alcaraz. Their H2H record is 6-6 and he has beaten him in a slam multiple times. The only time they played in a slam where Zverev didn’t win a set was the U.S. Open in 2023. Every other time, Zverev either won the match or won at least a set. Zverev has looked pretty good in this tournament and has a history of playing well here. I envision Zverev being able to nab the first or second set and then have Alcaraz pull away late.\n\nGood Luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2imxwz/"
    },
    {
      "created_utc": 1769734562.0,
      "author": "Maleficent-Coach4932",
      "text": "Record: 9-2 +15.5u\n\nLast Pick: LA Rams vs Seattle Seahawks/ Seahawks ML (-138) 3u ✅\n\nMove onto 6-0 in the NFL Playoffs. Laygo!!\n\nToday’s Pick: Michigan Vs Michigan State/ Michigan ML (-118) 2u Odds via FanDuel\n\nWrite up: I’m backing the wolverines here on this one. They’re coming off a win against Nebraska where they struggled early and got it done. Those types of games build character for games like these, especially against a rival. I understand Michigan has been iffy recently but let’s just look at the facts. They score the ball better than Michigan State in terms of PPG and FG%. They defend better than Michigan State in terms of steals and blocks per game. The only area they’re worse at is 3 point percentage and they’ve still made more. And to add to that, Michigan is allowing opponents to shoot only 30.4% from 3 which is a huge drop off for Michigan State, and allow only 68.8 PPG to opponents. The 2 games Michigan State has lost they’ve been held well below this mark. And every game they’ve won they’ve been above this mark besides 1, they scored 68 that game. The 68 range will be the magic number. Michigan’s defense can completely shut opponents out down the stretch, and there’s no one on Michigan State I’m fearful of going and completely taking over a game. Let me know if you’re tailing, best of luck everyone! \n\n\n\n\nIf you’d like to buy me a beer: [Venmo](https://venmo.com/u/Jay-Lawton-1) [CashApp](https://cash.app/$jaylaw930)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2imeqx/"
    },
    {
      "created_utc": 1769734106.0,
      "author": "RespectCalm4299",
      "text": "Sinner to win 3-0 (just locked in at -125 on Bet365) is a far superior version of this bet.\n\nI would actually hammer the hell outta that (and did lol), so thanks 🙏",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2ikzjf/"
    },
    {
      "created_utc": 1769733765.0,
      "author": "222benz",
      "text": "Record: 6-9-1\n\n​Net Units: -4.70u\n\n​ROI: -8.6%\n\n​Last Pick: Nemesis vs. PlayTime Over 2.5 ❌\n\n​Sport: eSports | Dota 2\n\n​Event: FISSURE Universe Episode 8 | Team Spirit vs. strongboys | Team Yandex vs. Aurora\n\nTime: 04:00 AM EST (Spirit) / 11:00 AM EST (Yandex)\n\n​POTD: Parlay: Team Spirit 2-0 + Team Yandex ML @ 1.91 (5u)\n\n​Write Up:\n\nHonestly this is just a massive talent gap. Spirit is the #2 team in the world playing against strongboys which is basically a random Tier 3 stack. The laning difference is gonna be too much for them to handle. Spirit usually speedruns these lower bracket games in like 30 mins. Don't see them dropping a map here and they haven't dropped a map to a qualifier team in months. Don't overthink it.\n\nPeople are still sleeping on Yandex for some reason even though they literally just won DreamLeague. They 3-1 Team Spirit in the finals and Watson is playing perfect Dota rn. I know Aurora looks scary on paper with Nightfall and Mikoto, but they haven't clicked yet. Yandex has the chemistry advantage and is playing championship Dota atm.\n\n​BOL.\n\nhttps://buymeacoffee.com/222benz",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2ijwu1/"
    },
    {
      "created_utc": 1769733661.0,
      "author": "LolPropKing1",
      "text": "POTD Record: 217-167\n\nUnits Won: +93.65u\n\nLast Pick: Cairne U 16.5 Kills Map 2 (-133) X\n\n**Today's Pick: Yxngstxr U 7.5 Headshots Map 1 (-109)** 5u\n\nhttps://preview.redd.it/gdhilmuvudgg1.png?width=918&format=png&auto=webp&s=59b7a3da972a1e67dea5c04995f62abf25d72511\n\n  \nGame/Tournament: Counterstrike 2 (CS2) | IEM Krakow\n\n\\-If anyone needs help finding the line or a place to bet esports feel free to reach out!\n\n* This line was a huge mistake during round 1, where they initially set him to 7.5, and then realized the mistake and changed his headshots to 4.5 for map 3, now they play their second series and the line is right back at 7.5\n* Yxngstxr is traditionally a rifler averaging a 56.7% headshot overall in 2025, but returned to the HEROIC starting lineup to fill in for Alkarenn the teams AWPer. Anyone AWPing has a much lower headshot percentage which we have seen with ynxgstxr as well, since filling in he is averaging a 39% headshot overall a -17.7% headshot overall.\n* With his kill line at 13.5 map 1, this means he would be projected \\~5 headshots with this current headshot percentage but this line is missing the fact that he is AWPing now and isn't accounting for the increase, and is instead based on his 2025 number of 56.7%.\n* Since rejoining HEROIC he has played 10 maps and has gone U 7.5 headshots in 9/10 of them, only hitting on a massive 19 kill performance. He only has 2/10 maps with 15+ kills dropped so far, he has been HEROIC's worst performing player so far at the tournament with a .59 KPR\n* Since it is HEROIC's map pick, they would start on CT side which is even better for U on headshots as the AWP is bought much more on CT side and we see a \\~2-2.5% decrease in headshot on this side of the map",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2ijkpg/"
    },
    {
      "created_utc": 1769733545.0,
      "author": "Vander_chill",
      "text": "**POTD Record:**  109 – 72 - 11\n\n**Previous:**  Arsenal Win to Nil + Atletico Madrid ML - LOSS\n\n**Recap:**  This bet lost as soon as it began.  Arsenal gave up a PK to the worst team in the table after only 6 minutes.  Then to add insult to injury, Atletico Madrid at home lose to Bodo.  Sorry folks, this was one of those that were the games to be played again, the chances of these outcomes would be de minimis.\n\n**New Event:**  Djokovic vs Sinner\n\n**Pick:**  Jannik Sinner to win 3-0 vs Novak Djokovic @ 1.80 (5 units)\n\nSo disgusted by the outcome of my last pick that I am not going into a long winded writeup for this one.  Djokovic looked slow and tired in the quarter finals vs Mussetti and gave up a 2-0 lead in the 1^(st) set only to lose the first 2 sets.  He was saved by Musetti’s injury who withdrew and now Djoker is in the semis.\n\nUnfortunately for him, he is facing Sinner who is playing lights out at the moment.  Unless Djoker can break Sinner early, it will be over quick.  Although Novak is the “Goat”, he has not been able to get past Sinner and Alcaraz in recent years and this will be no different.  Sinner has matured and is no longer playing Djokovic his idol, his hero, the legend… Sinner now plays Djokovic the opponent.  Once he overcame that fear straight-sets wins became the norm in majors. \n\nUnless Sinner gets injured, I can’t see Djokovic stealing a set.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2ij7o4/"
    },
    {
      "created_utc": 1769733521.0,
      "author": "GreedBoostedMachine",
      "text": "**Record:**  1-0  (+1 units)\n\n**ROI:** 100%\n\n**Previous POTD:**  [ManUtd +1.0 handicap vs Arsenal](https://www.reddit.com/r/sportsbook/comments/1qm1kn8/comment/o1mxnq2/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**,** 1 unit @ 2.0  ✅\n\n**Event:**  Australian Open 2026 (SF)  **Alcaraz - Zverev**  \n14:30 local time (AEDT, GMT+11)\n\n**Pick:**  **Zverev OVER 1.5 Breaks of Serve @ 2.25,  1 unit  (Bet365)**  \n(we are betting Zverev to break Alcaraz at least twice)\n\nhttps://preview.redd.it/7i6vo4ipodgg1.png?width=1122&format=png&auto=webp&s=72fe582aab15596aa4ab68d672158b2f26e9cbd9\n\n**Analysis:** \n\nZverev is in very solid form this year in Australia, hitting 1st serve at 70% or higher and also hitting winners off both wings in play.\n\nHistorically Zverev has shown he can push Carlos in the Grand Slam format and even win.  \nLet's quickly go through past H2H at majors and see how it looks for Zverev:\n\n* RG 2022:   Zverev  Won  3:1,  **broke Carlos 3 times from 8 breakpoints**\n* US 2023:   Zverev  Lost  3:0,  Breakpoints: 0/5\n* **AO 2024:  Zverev   Won  3:1,  Breakpoints: 7/10**\n* RG 2025:  Zverev   Lost  3:2, **Breakpoints:  6/23**\n\n**In 2024 Zverev defeated Alcaraz in Australian Open and broke him  7 times.** Clay is Carlos' best surface and still he cannot easily beat Zverev in Paris allowing 23 breakpoints in their last year encounter.\n\nOverall Alcaraz-Zverev H2H is tied at 6-6 and in Grand Slams it's 2-2.\n\nYou could say I'm building the case for Zverev to win or cover the handicap line (and that is indeed true) - so why focus on Breaks of Serve ?  \n**Because Bet365 is pricing Zverev OVER 1.5 Breaks of Serve @ 2.25 and other bookmakers are much lower, e.g. looking at 22bet I'm seeing odds 1.67 for this event. Other bookmakers offer 1.85 etc.**\n\nFurthermore I like this bet because it can easily cash even if Zverev loses the match.\n\nThere are some factors which could put me off such as Carlos improving his serve lately and also his own good form in the tournament, but I cannot pass on odds of 2.25.  I feel as Zverev breaking Carlos 2 times is 50-50 chance at absolute worst.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2ij50v/"
    },
    {
      "created_utc": 1769733031.0,
      "author": "micahpugh",
      "text": "POTD Record: 97 - 51\n\nLast POTD: Sinner v Shelton u3.5 sets - W\n\nPick: Jannik Sinner vs Novak Djokovic u3.5 sets (-152 odds via FD) 1U\n\nEvent: Australian Open Semifinals 2:30 A.M. CST\n\nSinner came through last round and I'll be backing this bet yet again. Joker went down two sets to Musetti and Sinner will be playing even more aggressive and consistent than Musetti did in the quarters. Jannik has won their last 4 competitive matches in straight sets and hard not to pick that again at these odds. Sinner has only dropped one set so far and the heat played a big factor. Sinner will pressure every Djokovic service game and will make Djokovic have to play a pretty aggressive game to end up even taking a set. Give me the back to back champ to take care of business yet again and possibly set up yet another Sincaraz final.\n\n[PayPal](https://www.paypal.me/micahpugh?locale.x=en_US)\n\n[Venmo](https://venmo.com/u/Micah-Pugh)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2ihm1e/"
    },
    {
      "created_utc": 1769732548.0,
      "author": "Best_Accountant_5471",
      "text": "2026 record: 11-9 (+8.2 units)\n\n2025 record: 55-41 (+26.5 units)\n\nLast 10 (most recent on right):  ✅✅❌✅❌✅❌✅✅✅\n\nLast Pick: Jannik Sinner 🇮🇹 3-0 vs Ben Shelton 🇺🇸 ✅\n\nEvent: Australian Open SF 🎾\n\nPick of the Day: Alexander Zverev 🇩🇪 to win a set vs Carlos Alcaraz 🇪🇸 5 units to win 3.1U @1.61 (Bet365)\n\nBetting on straight set victories has been too easy in this dross of an Australian Open so we’re spicing it up. O3.5 sets is also a good bet but looking at the prices is marginally worse than this. Fairer odds in my opinion would be around 1.44. \n\nZverev has been serving at an absurd level so far in Melbourne, topping it off with a serving clinic against Tien hitting 24 aces. He’s been averaging a 73% first serve rate so far this year (just behind Baez since last year) but it’s mostly his placement that has improved compared to 2025. Zverev has been serving a lot more clutch as well, Learner had 3 break points in their match which were all saved by virtually unreturnable winning serves. He also dismantled Cerundolo (a player against who he has struggled a lot against historically) in the fourth round to confirm his good form. The serving is obviously a huge reason alone to back Sasha to win a set at these prices but it’s also his game intentions that have improved this year. I haven’t found him all that great from the baseline compared to his usual standards and it was evident against last round that Tien was winning most of the baseline points. However his aggression has improved a lot in the past few months to make up for this to take time away from his opponent to force more errors. Zverev is going to be glad that it’s not Sinner on the other side of the net because against Alcaraz he can dominate the backhand to backhand rallies, unlike against the Italian. It’s the one tactic to truly be competitive against Carlos as it’s his slightly more erratic wing and Sasha has the first/second best backhand on tour. It’s no reason that their past matches have been close, with a 6-6 head to head. Sascha actually defeated Alcaraz here in 2024 in four sets. \n\nAlcaraz is understandably the heavy favourite going into this match but this is going to be a proper test for him. This is surprisingly his first time into the semis of the AO, compared to Sascha’s 3rd and being the defending finalist, and once again has been pretty flawless to reach this stage. He’s not dropped a set yet but I would be surprised if that trend were to continue today. Despite the comfortable win against De Minaur his first serve percentage was only at 58% and that could very well be punished by a good powerful returner such as Zverev. In general this match-up hasn’t been easy for the Spaniard as the German is a master at playing patiently and deep, better so than any other player at an elite level, and therefore the errors can start to creep in the No. 1’s game. If he can target the forehand though Zverev will be in for a long day. However, with how well Sascha has been serving especially on these faster courts I expect Alcaraz won’t be dictating many rallies on return which gives Zverev the upper hand on targeting the backhand and finishing points early. With Alcaraz’s occasional dips in focus Zverev can no doubt earn a break and hold for the rest of a set or come away with a tiebreak win. I predict Alcaraz to win 3-1 in some very contested sets but I wouldn’t necessarily be all that surprised if the German came away with the win especially on a good day. BOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2ig3m0/"
    },
    {
      "created_utc": 1769731822.0,
      "author": "NukDatJuke",
      "text": "**POTD: 6-0 (+9.32u)**\n\n**Event:** **League of Legends (LOL) - LCK Cup 2026 - Nongshim RedForce vs KT Rolster**\n\n**Pick: Match Totals - Over 6.5 Total Inhibitors (1.72) 2u to win 1.44u**\n\n**Start Time:** 17:00 KST, \\~8 hours from posting\n\n**Writeup:**\n\nNongshim RedForce (1-3) were a team I was quite high on at the start. Their roster looked promising and they were going against the typical slow League played in Korea. Since then, they've mostly been up and down, struggling to find consistent play. They can be good, really really good but team cohesion and decision making in the late game needs work.\n\nKT Rolster (2-2) are looking a bit washed to no one's surprise. I feel as if this is just the yearly \"KT goes through a slump then somehow bounces back, rinse and repeat\" that they are known for. I hardly doubt that a week would be enough to fix whatever issues they're dealing with so the match is quite close because of it.\n\nGoing in, KT are slight favourites on the eye test and on the books. This should be competitive, and I predict it'll likely go the distance. At least 4 games and a likely 5th in my opinion. As such, I am taking the over on 6.5 total inhibitors for the match. Now what is an inhibitor? Each team has 3 at the start of the game, and guaranteed, there will always be 1 inhibitor taken before the game can end. o6.5 entails 7 inhibitors be taken in best of five series.\n\nTherefore going the distance, in this case 4 or 5 games, increases the likelihood of hitting at least 7 because we are guaranteed more inhibitors. On all games played this season, Nongshim average 1.4 inhibitors/game both ways, KT average 2.2. Nongshim's numbers are a bit low because of the fashion in which they win games, but when they are behind, they are averaging 1.66 per game during losses. So in losses Nongshim are holding and forcing a second inhibitor from the enemy team and KT's tendencies lean toward taking multiple inhibitors to secure the game.\n\nKT should win the series, but Nongshim will be right behind them. KT as a team play slow, and I don't think they can get insanely ahead to the point where they're ending the game with just one inhibitor destroyed. On the flipside, Nongshim can snowball a lead, but with it comes risks. They either end the game prematurely or they go into a bloodbath that often times hurts them more than it helps. This feast or famine style can up the inhib count if they choke a lead. I expect another good match with plenty of back and forth between both. **Please gamble responsibly and only bet what you can lose, BOL!**\n\n**Match Totals - Over 6.5 Total Inhibitors (1.72) 2u to win 1.44u**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2idtux/"
    },
    {
      "created_utc": 1769731804.0,
      "author": "Careful_Remote_6242",
      "text": "**Record:** 1–2–1\n**Net Units:** −0.68\n\n❌🅿️✅❌\n\n**Last POTD:**\nUdinese win or draw (X2) & Under 3.5 goals @1.69 (1 unit) ❌\n**Result:** Verona 1–3 Udinese\n\n**Recap:**\nUdinese scored first in the 23rd minute and things looked good early, but Verona equalised just three minutes later and that changed the whole flow of the game. Instead of staying tight, both sides started pushing and the match opened up. Udinese took control after the break and scored twice more to seal it. The Udinese side was right, but the early back-and-forth killed the under.\n\n**Sport / League:** LaLiga\n**Match:** Espanyol vs Alavés\n\n**Pick:**\nEspanyol Double Chance (1X) & Over 1.5 Goals @1.80 (1 unit).\n\nEspanyol come into this sitting inside the top five and have been one of the more consistent sides in LaLiga this season. they average over a goal per game and usually find a way to score, especially in the second half where most of their goals come.\n\nAlavés are a completely different team away from home. They’ve lost seven straight on the road, taken just one win in ten away matches, and have failed to keep a clean sheet in almost all of them. They also fail to score in a lot of these games, which puts them under constant pressure.\n\nThese two met earlier in the season and Alavés won 2–1, so Espanyol should be well aware of the threat and motivated to get revenge here. With Alavés struggling badly away from home and Espanyol usually creating chances at their own ground, it’s hard to see the visitors going to Barcelona and winning this.\n\nThe double chance covers a draw, which is always possible in LaLiga, while the over 1.5 goals fits how both teams play. Espanyol tend to score, Alavés tend to concede, and once the first goal goes in this matchup usually opens up.\n\nAs long as Espanyol don’t lose, two goals in this game feels very realistic.\n\nGood luck if you’re riding.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2idru2/"
    },
    {
      "created_utc": 1769731190.0,
      "author": "NateTheGreat1004",
      "text": "Record: 29-20\n\nNet Units: +10.36\n\n**Last pick:** Sinner o11.5 aces vs Shelton (L)\n\nI tried a pick based on trends but didn't work, let's go back to the facts.\n\nPick: Tennis | **Sinner 3-0 vs Djokovic** | 3:30AM ET | (-135 on DK) (3 units)\n\n**Writeup:** Check for set betting, set spread and Djokovic to win a set No. Pick the one with best odds. On FD, you can parlay Sinner ml + under 3.5 sets for -140 odds.\n\nDjokovic just doesn't have what it takes anymore. In 2025, he lost twice to Sinner at Roland Garros and Wimbledon 3-0. And that was not on Sinner's best surface. Djokovic beat some very low ranked players in straight sets this tournament. But when he faced Musetti who really should have no business beating Djokovic, he lost the first 2 sets and only won the match because Musetti got injured and was forced to retire. Djokovic also has a blister on his foot which doesn't help. Meanwhile, Sinner has won his last three tournaments, only dropping one set to Zverev. The only issue I see is if Sinner gets cramps like he did against Spizzirri. He will be playing an evening match where the sun sets in an hour from start time so temperatures should be fine.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2ibx8y/"
    },
    {
      "created_utc": 1769730457.0,
      "author": "X_Underscore_X",
      "text": "**POTD Record:** 4W-0P-5L (+4.8u)\n\n**Previous Pick:**Parlay@2.99 (Coolbet) | **Stake: 2u LOSS**\n\n1. Celtic vs Utrecht (1st Half: Celtic To Win)@1.75\n2. Midtjylland vs Dinamo Zagreb (Over 2.5 Goals)@1.71\n\n**Recap:** Celtic easily wins ther first half, but it ends with two goals in Denmark\n\n**Today's Event:** Bundesliga  | Cologne vs Wolfsburg | 20:30 GMT +2\n\n**Pick:** Cologne -1.5 Corners@1.95 (Coolbet) | **Stake: 3.5u**\n\n**Write Up:** \n\n* Wolfsburg corners against away: 15, 6, 6, 14, 13, 11, 10, 9 | WTF!\n\nAnd it goes without saying that they have lost the corner battle in each of these games by two or more. The guests have also lost the 1st half by two or more corners in 7 of their last 8 on the road. Cologne aren't the biggest corner takers in the league, but they average 4.90 from their last eight home games vs Wolfsburg’s 2.70 on the road. Since they got back up into the Bundesliga, Cologne has hosted Wolfsburg three times and won the corner battle: 6-1, 10-1 and 9-2.\n\nSo no long write up today and kinda of a boring very stats based bet, BOL 🍀",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2i9ofh/"
    },
    {
      "created_utc": 1769730361.0,
      "author": "dreamchasing1",
      "text": "Record: 261-247 Net Units: -28.93 63-65 on 1.5u plays, 44-44 on 2u plays, 2-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Europa League] Ludogorets vs Nice\nLast pick: BTTS @ 1.80 loss\n\n\nEvent: Soccer/Football, [Peru Liga 1] Sport Huancayo vs Alianza Lima\n\n\nPick: BTTS @ 1.80\n\n\nSport Huancayo were the best btts hitting side in the league split that ended most recently - managing a btts hit in 8/8 home games. Alianza Lima hit in 5/8 away games. The same meeting ended 2-1 last season. Both sides have undergone manager changes, however they still look good for a btts here. Alianza Lima also played a couple of games already in January, hitting a btts in 3/4 games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2i9drh/"
    },
    {
      "created_utc": 1769729856.0,
      "author": "CMDVN",
      "text": "Nurnberg @ 1.93 - €300.00 // Bundesliga 2\n\nLast 5 > WLWWW // Profit: €3,808.04\n\n9^(th) placed Nurnberg vs 15^(th) placed Munster. At home Nurnberg are a good team ranking 6^(th) with a 5-3-2 record and a 14:12 goal diff. We are going to have the 6^(th) team at home against the last team on the road today, with Munster being 2-0-7 and having a negative goal diff of 9:17.\n\nWhat makes this pick even more interesting is that Munster have lost 2 key players for this match, due to a red card. Not to mention that Nurnberg are also 4-1-0 in their last 5 home games. H2H in advantage of Nurnberg, being 2-0-1.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2i7tit/"
    },
    {
      "created_utc": 1769729832.0,
      "author": "SP7988",
      "text": "**Record:** 43-21-1 (+23.37u)\n\n**Last:** (CBB) Illinois -12.5 (1.5u) - Pending\n\n**POTD:** (CBB) No. 7 Michigan State ML vs No. 3 Michigan\n\n**Start Time:** 8:00 PM ET (FOX)\n\n**Odds:** \\+104 (FanDuel)\n\n**Units:** 1.5U\n\n**Reasoning:** While there’s no love lost between Michigan and Michigan State, both schools can agree on one sentiment: defense is the name of the game.\n\nFor the Spartans (19-2), they enter among the nation’s elite defensively, ranking 5th in scoring defense (63.5 PPGA), 5th in opponent field-goal percentage (38.9%), 9th in defensive efficiency (0.919) and 31st in opponent three-point shooting (30.1%). The Wolverines (19-1) counter with a defensive unit that might be even better, 42nd in opponent three-point percentage (30.4%) and 48th in scoring defense (68.8 PPGA). So while defense may win championships, it might also go a long way in settling one of college basketball’s most heated rivalries on Friday night.\n\nSurprisingly, it’s been a rivalry that’s been awfully one-sided as of late.\n\nMichigan State has won four straight and five of the last six contests against its in-state rival dating back to 2023. In fact, not only has the team won 11 of the last 15 overall meetings against Michigan, it also holds an impressive 19-3 mark at home. That includes seven consecutive victories at the Breslin Center, with all but two coming by 12+ points. You’d have to go back 2,938 days and two Wolverines head coaches ago to find the last time the Spartans dropped one at East Lansing (Jan. 13, 2018).\n\nIt certainly doesn’t help Michigan that its level of play has been heading in the wrong direction.\n\nAfter two close calls against Wake Forest and TCU within their opening three games of the season, the Wolverines responded by winning each of their next 10 contests by 15 or more points, including all but two by 28+. Another deep run in March appeared all but assured with the team even being listed as high as +450 to cut down the nets.\n\nHowever, things have taken a turn for the worse over the last seven games.\n\n**MICHIGAN UNTIL JAN. 2 / SINCE JAN. 3**\n\n* **Record (ATS):** 13-0 (9-4) / 6-1 (0-7) \n* **Barthag:** 1st (.9909)/ 13th (.9436) \n* **Adjusted Offensive Efficiency:** 2nd (129.3) / 33rd (122.0)  \n* **Adjusted Defensive Efficiency:** 1st (86.0) / 15th (95.5)  \n* **Effective FG%:** 1st (61.8%) / 71st (54.5%)  \n* **Efective FGD%:** 1st (40.7%) 92nd (49.2%)  \n* **Turnover%:** 136th (16.7%) / 283rd (18.2%) \n* **2PT%:** 1st (65.1%) / 4th (62.2%)  \n* **2PTD%:** 1st (38.2%) / 103rd (49.1%)  \n* **3PT%:** 27th (38.3%) / 348th (28.2%)  \n* **3PTD%:** 36th (29.5%) / 140th (32.9%)\n\nNot only has Michigan failed to cover its each of the seven contests, but the team suffered its first loss of the season in rather embarrassing fashion—a 91-88 loss to Wisconsin at home as 19.5-point favorites. The statistical fall-off across the board defensively would be concerning on its own, but its especially worrisome against a Michigan State offense that enters averaging 82.3 points on 55.6% shooting (39.3% from beyond the arc) over its last three games. Look for Big Ten POTY candidate Jeremy Fears Jr. to continue his torrid run—20.4 points and 9.2 assists on 56.4% shooting over his last five outings—to lead the charge in taking advantage of these weak points.\n\nRebounding will play a pivotal role on Friday night.\n\nBoth of these teams have made a living dominating opponents on the glass this season, as the Wolverines rank 6th in total rebounding (42.0 per game) while the Spartans rank 12th in the category (41.4). However, what could break the stalemate is offensive rebounding, where Michigan State ranks 22nd with 11.5 offensive rebounds per game and 1st in limiting such opportunities for opponents (6.2) while Michigan ranks just 107th in offensive rebounding (9.9) and a troubling 209th in opponent offensive rebounding (9.3). This is where the Spartans can truly do some damage, as the team ranks 23rd in second-chance points (14.4 PPG; 94th percentile) and 1st in opponent second-chance points (6.4 PPG; 100th percentile). That’s concerning news for the Wolverines who find themselves among the worst in the country in the category, ranking 304th in opponent second-chance points (12.6; 17th percentile).\n\nNot surprisingly, turnovers will be the X factor in this one.\n\nNeither of these teams have been the model of clean handling of the basketball thus far. Through 20 games, Michigan ranks 161st in opponent steals (6.6), 172nd in turnovers per possession (16.5%) and 267th in turnovers (12.7) while Michigan State enters ranked 216th in turnovers (12.2), 243rd in turnovers per possession (17.6%) and 254th in opponent steals (7.2). However, things have been especially alarming for the Wolverines as of late, as the team has seen its averages balloon to 8.1 opponent steals and 15.3 turnovers over its last four contests while registering a 21.7% mark in turnovers per possession. It will be imperative for a Spartans team that doesn’t force too many turnovers—225th in turnovers forced per possession (15.9%), 245th in turnovers forced (11.0) and 288th in steals (5.6)—to find a way to change that.\n\nFinally, on a lighter note, Friday also marks the birthday of Michigan State head coach Tom Izzo.\n\nIf you love trends, consider this: The Spartans are 7-1 when playing on Izzo’s birthday, including 3-0 against Michigan. That includes an 81-62 throttling of the Wolverines back in 2024.\n\nIn what should be an early-candidate for Game of the Year, trust Sparty to emerge victorious.\n\nBOL if tailing, and as always, please do so responsibly. One bet should not have you crashing out all over Reddit.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2i7qtx/"
    },
    {
      "created_utc": 1769729654.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2i775g/"
    },
    {
      "created_utc": 1769729654.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 47-24 (+17.05U)**\n\n**ROI: +20.18%**\n\nLast POTD: [Wisconsin -3.5 + Houston ML](https://www.reddit.com/r/sportsbook/s/vxZwcsBDjy) ✅\n\n**POTD: NCAAMB: Michigan State +1.5 vs Michigan -108 (0.50U TO WIN 0.42U)** \n\nWrite up: 0.50U on this one because this will be a nail bitter - On another note, I cannot believe Wisconsin shot that bad in the 1H and still found a way to cover the -3.5 for us - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Michigan State ML at 52% \n\n• Model has Michigan State +1.5 at 53% \n\n• EV better betting 100$ = 7-9$ for this play\n\n• Michigan State opens up as underdog, at home, vs a Michigan team who has continued to show us that they deserve to be a top 3 team in the country - You guys know me, the first thing I’m going to say here is that this is a rivalry game, and the team that is at home, is an underdog, and I’m taking the bait, once again - Home court advantage is a real thing, and will always play a factor one way or another - Michigan leads in most metrics but man MSU has been rolling, they have been battled tested, and are on a 7 game win streak - They should come out flying high after their awesome comeback victory over Rutgers on the road earlier this week - Michigan State is 11-1 at home this year, with the lone loss being Duke and the Boozier brothers - I took Nebraska +11.5 earlier this week against Michigan and a big reason for that bet was due to the fact that, although Michigan has been rolling this season, they are 0-7 L7 ATS - On the flip side, and a big reason why I am only laying 0.50U on this one, because Michigan has that offensive threat that will score 90+ points, any day of the week - that is the risk we run betting against Michigan - Michigan has fallen off a bit in scoring in conference play, and when teams can stop them from going on their shooting hot streak, which they have been, the chance of winning and more of a chance of covering - I think the over under should be set at around 160.5, given these offenses, the line should be higher than 145.5 - this line tells me that defense will play a big factor, and also tells me that Vegas may not predict many big Michigan runs, which favors the Spartans - Both teams have a top 5 defense in the country, Michigan State has a small rebounding edge, Michigan plays at a high pace, but Michigan defense tends to control the pace of play more at home, than on the road - Tom Izzo will have a game-plan in this one, and if the players can execute, I believe they will pull this one out towards the end - Taking Michigan State +1.5 here due to them being at home, Michigan’s ATS record, Michigan State’s defensive edge at home,  and Tom Izzo \n\nPOTD History: [https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn](https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn)\n\nBOL!\n\n**POTD: NCAAMB: Michigan State +1.5 vs Michigan -108 (0.50U TO WIN 0.42U)**\n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qqov2x/pick_of_the_day_13026_friday/o2i7760/"
    }
  ]
}