{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/1/26 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/",
  "target_date": "2026-01-01",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-01T13:44:21.446361+00:00",
  "comments": [
    {
      "created_utc": 1767269963.0,
      "author": "Section1ne0h4our",
      "text": "**12-4, +7.22u**\n\n*Last 5:* ❌✅✅❌✅\n\n**NHL - Winnipeg @ Toronto, 7 PM EST**\n\n*Toronto ML (-150) 1.5u*\n\nHappy new year everyone, I hope everyone had a good one, I want to extend my love and gratitude to this entire community, I’m new here but I’m thoroughly enjoying the discussion and loving the commitment some folks here have to providing advice and just tracking plays. \n\nFor today we genuinely no need or reason to over think it - Had a million plays lined up, CFP lines and props, NBA props, trusty weapons in the soccer bank, but then I checked the NHL schedule:\n\n***“Oh shit, the Jets play again today”.***\n\nQuick math: the Jets have **lost 16 of 19, and 7 of their last 10 to the Leafs**\n\nEven though Leafs have struggled this season, they’re getting healthy and have **won 3 of their last 4**, the loss a 3-2 defeat to those red hot Red Wings who beat the Jets in our POTD last night\n\nNow, we don’t wanna go too in depth on back to backs, and travel and all that, because Detroit and Toronto are closer than some cities north and south ends, but with the slump Winnipeg are in, the New Year’s Eve/Day cross border travel (If you’ve done it, you know), after losing a tough one the night before that we benefitted from - follow the adage: ***“Fade The Jets”***\n\nLast play review:\n\nNHL - Winnipeg @ Detroit\n\nDetroit ML (-120) 1u ✅\n\n(Early start by the Wings was all we needed - it was a much more tense game than I anticipated in the end. The Toews/Kane reunion took centre stage, so it was only right it was geriatric at times - *Unpopular opinion: I’m all for pro leagues taking holiday breaks, just saying*)\n\n***BOL if you’re tailing, and if not BOL in general.***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx2j8br/"
    },
    {
      "created_utc": 1767269953.0,
      "author": "mouse_that_runs",
      "text": "POTD RECORD: 10-3-1\n\n✅️✅️✅️✅️✅️➖️✅️✖️✅️✅️✅️✅️✖️✖️✖️\n\nLAST POTD: \n\nChelsea vs. Barcelona (Barcelona over 1.5 goals) @1.87 ✖️\n\nTODAY'S POTD:\n\nBlackburn Rovers vs. Wrexham AFC (Wrexham AFC over 0.5 goals) @1.51\n\n12:30 GMT\n\nIt has been a long time since I gave a pick out.\nWrexham AFC is usually a good bet for at least a goal in most matches they play, and they are coming up against a Blackburn Rovers team who are weak going forward with two goals in their last five fixtures. Wrexham AFC has scored in four of their last five fixtures, and if there is a goal today, it will be from Wrexham.\n\nEdit: Hit in 11 minutes",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx2j7p6/"
    },
    {
      "created_utc": 1767269327.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 76 - 77 Profit: -5.05 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌\n\nLlanelli - Penybont, Over 3.5 goals @ 2.18\n\nLlanelli against Penybont has all the signs of a high-scoring match. **Over 3.5 goals at 2.18** offers solid value. Llanelli like to play open football and often struggle to keep things tight, while Penybont are direct and aggressive going forward. Matches between sides like this tend to open up quickly. Once the first goal goes in, the tempo lifts, spaces appear, and chances come regularly. Four goals looks a realistic expectation here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx2i40e/"
    },
    {
      "created_utc": 1767267481.0,
      "author": "CMDVN",
      "text": "Last 5 > LWWLL // Profit: €928.55\n\nWatford @ 2.30 - €160.96\n\nWatford are currently the 3rd best home team with a 7-4-1 record, into this match they are coming with a 3 game W streak and in their last 5 home games they have been unbeaten. On the other hand we have a struggling Birmingham who are winless in 6 and are amongst the bottom when it comes to travels. At the moment Birmingham are 2-2-8 on the road and have lost 4 out of their last 5 away games. \n\nOn the H2H side Watford are 7-1-2 in the last 10 games against Birmingham and at home Watford are on a 6 game winning streak against Birmingham. All odds against them and today should be a repeat.\n\nHappy new year guys. Let's start it with some bread",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx2ezie/"
    },
    {
      "created_utc": 1767266916.0,
      "author": "FerretInitial4182",
      "text": "https://preview.redd.it/uzkz5t1v3qag1.png?width=1365&format=png&auto=webp&s=80c2ab0e67cc5c86ef131dc5a684b3ce53f73c6a",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx2e2vo/"
    },
    {
      "created_utc": 1767265520.0,
      "author": "Jazzlike-Arugula-958",
      "text": "Record: 2W Net Units: +2.26u Previous Bet: Nigeria to win vs Uganda ✅\n\nGame: Charlton vs Coventry, 3pm GMT\n\nPick: Coventry to win (1u to win 1.86u on Stake)\n\nWriteup: Coventry are the league leaders, yet their win price is nearly evens. WHY? The market is likely reacting to their 2-0 home loss to Ipswich on Monday and the fact that they haven’t won an away game in December (draws at Preston and Southampton). However, Charlton are in the middle of a deeper crisis. They’ve only won one out of their last nine matches, and also just suffered a heartbreaking 97th minute loss to Portsmouth, which leaves a team mentally drained.\n\nHence, in my humble opinion, Coventry to win at 1.86u odds is a good value play",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx2bugm/"
    },
    {
      "created_utc": 1767264272.0,
      "author": "Lyx97",
      "text": "Record: 24-10-4\n\nNet Units: +8.07\n\n*Prev Pick : Kerala ML (1.66) + Mumbai ML (1.2) @ 1.99 (1u) --> Win*\n\nFootball | League One | Northampton Town vs Stockport County | in \\~4hrs\n\nFootball | EFL Championship | Watford vs Birmingham | in \\~4hrs\n\n**Parlay Stockport TTG over 1 (Asian line at 1.46 ) + Watford TTG over 1 (Asian line at 1.45) @ 2.12 (1u)**\n\nWriteup : Happy new year to everyone. Going to the lower leagues of England today.\n\nStockport match - They've scored in their last six games, scoring two or more in three of those. Northampton have managed just one clean sheet in their last 12 games\n\nWatford match - These sides met at the start of December, with Birmingham winning 2-1. Birmingham have now conceded in their last 10 consecutive league games, while Watford have scored in their last 14 games.\n\nThe odds for over 0.5 in both matches was a little low, so going for the over 1 asian line, which gives money back with 1 goal scored & profit for anything above\n\nHope we continue the wins & BoL\n\n*Note : To the team maintaining the potd tracker. Thanks for the work done to maintain the record, but my bet on 30th was a push, not loss, as Uganda did score a goal & my bet was Uganda over 1 TTG (asian line)*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx29uia/"
    },
    {
      "created_utc": 1767263341.0,
      "author": "bigtime-operator",
      "text": "Record: 65 - 58\n\nSichuan Blue Whales - Fujian 🏀 China CBA ⌛in 1 hour\n\nPick: **Fujia** \\-13.5 @ 1.70\n\nSichuan, the home team, is facing a financial crisis. They only have one foreign player (Gorjok Gak), who joined on December 27th. This forces younger players to play. Coach Han Shuo says they've only trained with the new foreign center \"once\" and are planning to bring in another younger player. They are currently the worst-performing team in the league, with a 0-8 record and a -214 average.\n\nFujian's defense is based on steals and pressure. They like to force their opponents into errors and score easy points in open court. When turnovers become chronic for Sichuan, the game quickly becomes unpredictable. Fujian's approach of relying on pressure and steals to score runs is easily converted into direct points. Looking at Sichuan's recent losses, double-digit margins have become standard (e.g., 51 points against Beijing, 36 points against Shanghai, 33 points against Ningbo). A -13.5 margin is even below Sichuan's average loss margin this season; meaning that even if Sichuan plays its \"standard poor game,\" this handicap can be easily overcome. Fujian has an elite guard at the helm in Travis Trice, who is both a scoring and assist threat and can organize the team. Sichuan, on the other hand, is forced to rely on its domestic rotation and inconsistent young players. It will be an easy game for Fujian.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx28ddq/"
    },
    {
      "created_utc": 1767255690.0,
      "author": "Miserable_Store_916",
      "text": "I don’t have any picks\n\n\nJust here to say happy new year 🥳",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx1wh1u/"
    },
    {
      "created_utc": 1767255453.0,
      "author": "zan12231",
      "text": "**POTD Record:** 1-3\n\n**Net Units:** \\-2.09 UNIT (-52,25% ROI)\n\n**Previous Pick:** Detroit vs Minnesota O43.5 (-122), 1 UNIT ❌\n\n**Today's Event:** NBA: Houston - Brooklyn \n\n**Today's Pick:** O223.5 (+104), 1 UNIT\n\nWrite up:\n\nHouston have average 120,5 and Brooklyn 109,7 in the season. In the last 3 games they have 120,7 and 114,7. In the last game in October we saw 246 points. Sengun is questionable for now, but even without him I think this will go easy over.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx1w3fn/"
    },
    {
      "created_utc": 1767253958.0,
      "author": "Reasonable-Quit-3177",
      "text": "Record: 1-0  \nNet Units: +0.81\n\nAll my picks are 1 unit.\n\nLast pick: [Al Shabab vs Al Qadsiah FC O2.5 ✅](https://www.reddit.com/r/sportsbook/comments/1pzwxev/comment/nww9ud2)\n\nToday's pick:\n\nFootball - England Football League Championship  \nDerby County vs Middlesbrough BTTS @1.91 1 unit\n\nBTTS hit at their last H2H on 11/29. Derby County scored in almost all of their matches since September. Middlesbrough didn't perform in their last 3 games so they will want to bounce back. They are the better team but I expect an open game with both teams pushing. Middlesbrough should win on paper but Derby County will be at home and as I said they are on an insane scoring run.  \nAlso it's the day after new year's eve so who knows how hangover everyone will be, anything can happen to be honest.\n\nKeep in my mind I'm a random nobody from reddit, so tail with caution. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx1tqtf/"
    },
    {
      "created_utc": 1767252427.0,
      "author": "MangoBeginning317",
      "text": "Record: 0-0 (1st public pick)\n\nSoccer | EPL | 2PM CST\n\nPick: Brentford vs Tottenham BTTS Yes + O2.5 Goals\n\nWrite Up: Trying something new in 2026. Hope it’s worthwhile.\n\nBrentford currently ranks among the highest in the league for BTTS at 66% with Tottenham being close behind at 61% while over 60% of both clubs’ matches have ended with over 2.5 goals scored.\n\nBrentford is at home in this matchup where they have scored two or more goals in 67% of their home games.\n\nIt’s also personal on New Year’s Day between these two as Tottenham’s Manager, Thomas Frank, once managed at Brentford. He knows the grounds and will look to get the offense rolling as he tries to knock off his former club.\n\nBest of luck. JLY. Have a good Dei!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx1r8ze/"
    },
    {
      "created_utc": 1767252032.0,
      "author": "Fit-Scientist-8391",
      "text": "Record: 0-0-0 \n\nEvent: A League Australian soccer / football /\nWestern Sydney wanderers vs MacArthur FC\n7PM AEST (AUS TIME) 40 MINS FROM POST !\n\n(All picks 1 UNIT for the sake of tracking)\n\nPOTD: Btts + Over 2.5 goals - 1.83\n\nWill keep it short and simple for my very first pick and to start the new year. \nAll 4 times these teams have versed this year have been BTTS and 3/4 of those games have had 3+ goals.\nWanderers last match ended 3-2 and Macarthurs last match ended 4-5. \n\nGAME IS ABOUT TO START !\n\nBest of luck if tailing my first POTD",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx1ql65/"
    },
    {
      "created_utc": 1767250211.0,
      "author": "brooklynschino",
      "text": "(01/01/2026)\n\nRecord: 0W-1L\n\nLast 10 POTD ***(old to most recent)*** : ❌\n\nPrevious Pick: **12/23/2025** ***(2-Pick Parlay) Callan Rydz MOST 180s + Danny Noppert MOST 180s ❌***\n\n\\- Rydz was absolutely dominant in this match-up with EIGHT 180s thrown and his opponent with only ONE 180 thrown.\n\n\\- As for the 2nd leg, Noppert and Hood combined for a total of NINETEEN 180s thrown, with Hood 11 and Noppert 8. Sadly, Noppert couldn't come through for us and killed the parlay.\n\n***Today's Pick: Gary Anderson vs Justin Hood (9:15am EST) YES First Leg 180 (-120 on DraftKings)***\n\n***PDC WORLD CHAMPIONSHIP***\n\n***(1u to win 1.83u)***\n\n***Gary Anderson:*** hits a 180 every 2.38 legs and averaging 0.42 180 per leg (Avg)  \n***Justin Hood:*** hits a 180 every 2.56 legs and averaging 0.39 180 per leg (Avg) <<< Hood's average shot up since the previous pick I had with him vs Danny Noppert\n\n***Justin Hood hit TEN 180s in 18 legs against Josh Rock, and Anderson is known for starting matches with high intensity. Enough said, give me a YES for a First Leg 180 to happen. HAPPY NEW YEARS TO YOU AND YOURS! Let's get the first win on the record and start the year off right. Cheers!***\n\nhttps://preview.redd.it/ngcqhezfpoag1.png?width=434&format=png&auto=webp&s=3867b9be7c3ccc86ad708f438c78c1b3b9cacbd8",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx1ngye/"
    },
    {
      "created_utc": 1767249381.0,
      "author": "Ralphjinasseater",
      "text": "Record : 24-19-2\n\nNet units:(+0.68 units)\n\nLast pick: Karl Anthony town under 12.5 rebounds (-120)HR✅\n\nPick of the day : Kevin Durant Over 4.5 Assists (-145)HR\n\nReason • :\nI was overthinking on this game for a under since both team have been defensive lately \nOver and under in team total point seems Like a toss up for me because i can only imagine these playing out \n1. “The  Shootout over game “ Nets fail to stop KD (30+ points again). Shit goes OVER ,Brooklyn plays with high intensity too . Game stays within 4-6 points; late fouling pushes the score over the 225.5 total.  \n\nNumber 2. The \"No-Big\" Scramble  aka Sengun & Adams stay out.  Houston loses its defensive anchor. Nic Claxton dominates the paint for Brooklyn, and Houston relies solely on KD and Reed Sheppard's shooting & playmaking and making amen to shoot the ball. 3.The Defensive Grind | Nets' #1 December defense holds firm. UNDER ( low scoring game ) Brooklyn successfully slows the pace to the bottom 5 in the league. Houston struggles to find rhythm without Sengun's post-playmaking. 4. The \"Blowout\" Cool-down ,Rockets lead by 20 in the 3rd. (UNDER because nets can’t keep up ) KD and the starters sit the 4th quarter. \"Garbage time\" with bench players usually results in poor shooting and a clock-drain, keeping it under the total. And i was doing my research ,expert bettors feels like Brooklyn nets may cover the spread since Nets in 7 of their last 10 game and 13 of their last 20 games.  \n\nI have to go with Kevin Durant for assists because from a defensive perspective you don’t want Kevin Durant shooting the rock \nSo the “Double-Team mindset” will come into play in the nets head cause that’s Kevin Durant \n“Y’all know who he is”. anyway the Nets have been the #1 defense in December. \nTheir primary strategy against elite scorers like KD is to force the ball out of their hands. KD is currently being doubled on 27% of his possessions. Being 6'11\", he easily passes over the trap to open teammates like Reed Sheppard or Alperen Sengun (if active). While everyone expects him to hunt for points (which he will), his veteran experience tells him to play the \"right way\" when the defense collapses. In his last 5 games, he has cleared this 4.5 line in 4 out of 5 instances, averaging 5.2 assists. \nAlperen Sengun is limited or out, the Rockets will use KD even more as a point-forward to facilitate the offense, rather than just a pure finisher. Houston goes Over 66% of the time on the road, and a close game (which the Nets usually provide lately) leads to late-game scoring bursts.  \nScenario solution 1. Brooklyn blitzes him to get the ball out of his hands, KD doesn't force shots ,he passes. With the floor spacers Houston has (Sheppard, Smith Jr.), those passes turn into easy assists. The \"Trap\" actually helps us here. \n\nScenario solution 2. If they don't double him, KD will score at will. However, that gravity still pulls defenders in. KD is a high-IQ player; even in single coverage, he averages about 4-5 assists just by playing within the flow of the offense.\n\nRisk factor If the Rockets are up by 25 in the 3rd quarter, KD might sit the entire 4th. He could get stuck at 3 or 4 assists simply because he didn't play enough minutes. However, even in a blowout, KD usually gets his numbers early.\n\nHAPPY NEW YEARS 🎉🎉 EVERYONE",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx1lzqc/"
    },
    {
      "created_utc": 1767243341.0,
      "author": "Vander_chill",
      "text": "**POTD Record:** 103 – 66 - 11\n\n**Previous:**  Utah Team Total Rushing Yards Over 207.5 (vs Nebraska) – WINNING!\n\n**Recap:**  It is so satisfying to find weird picks like this one based purely on math and have it come to fruition. Not much else to add.\n\n**New Event:** Championship – Preston North End vs Sheffield Wednesday\n\n**Pick:** Preston North End -1 Asian Handicap @ 1.80 (Usual 3 units)\n\nPreston North End (PNE) are currently 7^(th) in the table and a single point outside contention for a promotion playoff spot for the Premier League next year. This is a big deal and something the team is most definitely focused on and playing for in this match. A win will place them right in the fight for a top spot.\n\nTheir opponents, Sheffield Wednesday (SW), well, not sure where to start other than to say they are in last place in the league with -7 points (yes, less than 0) which is 28 points below the next team. SW are facing a major financial and ownership crisis that has thrown one of England’s oldest clubs into jeopardy. Let me enumerate the ways in bulletpoint fashion:\n\n* **Financial Mismanagement** \\-The club has struggled to pay players and staff multiple times throughout 2025 due to cash-flow problems. They missed salary deadlines 5 times which is a breach of English Football League regulations.\n* **Sanctions & Points Deductions** \\-Because of financial breaches, SW were placed into administration (a formal insolvency process), which resulted in an automatic 12-point deduction. They were also hit with a further 6-point deduction for ongoing breaches.\n* **Stadium Issues** \\-The North Stand at Hillsborough Stadium was closed after urgent safety work was not carried out, costing the club significant match-day revenue and inconvenience for fans.\n* **Transfer & Registration Embargoes** \\-Due to unpaid wages and tax debts, the club has been placed under transfer embargoes and registration restrictions, meaning they cannot sign new players freely.\n* **Ownership Controversy** \\-Thai owner Dejphon Chansiri’s decade in charge saw heavy criticism for overspending early on, then failing to fund the club properly in recent years. He was eventually banned from being involved with any EFL club for three years, and the club is now run by administrators who are trying to sell it.\n* **Fan Protests and Morale** \\-Fans have been protesting and even boycotting games in frustration over the mismanagement and financial instability under Chansiri’s rule.\n\nNeedless to say that PNE should win this match for so many reasons and SW should lose this match for many more reasons. If PNE wins by just one goal we get a refund.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx1agzo/"
    },
    {
      "created_utc": 1767243261.0,
      "author": "Cautious_Assist836",
      "text": "Record: 2-2 (+2.10U)\n\nLast Pick: Tasmania -3.5 ❌ **(Tasmania lost in overtime)**\n\nEvent: Australia Basketball - Brisbane Bullets vs Perth Wildcats, 3.30 AM EST\n\nPOTD: Mitch Norton (BRI) u8.5p, $1.80, to win 5.00U **✅ (6pts all in the 2H keeps him under!)**\n\nNorton is under this points line in 9/12 games this season, the line has been bumped due to him scoring 15p off 7 FGA and 6 FT. The reasons he managed to get 7 shots and to the foul line is because Brisbane's two imports were struggling bad shooting a combined 3/22 from the field, so he had to take over the offense. The poor shooting won't happen again, so we can expect his usage to drop, along with the fact that a new import guard is hoping to be active and should steal some minutes and FGA off him.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx1aaux/"
    },
    {
      "created_utc": 1767241056.0,
      "author": "UnusualYou6243",
      "text": "POTD Record: 2-1 / Net Units: +2.46 / ROI: 49.3%\n\nPrevious POTD: Miles McBride O7.5 Points @ -113 DraftKings / 2u ✔️\n\nToday’s POTD: P.J. Washington O6.5 Rebounds @ -111 DraftKings / 2.5u\n\nEvent: NBA / 76ers @ Mavericks 8:30 pm EST\n\nLove this pick as P.J. has been a cash cow with this line. This season, he has covered this line 75% of the time. When playing alongside AD, this jumps to 83%. The 76ers rank 23rd in rebounds to opposing teams and are **30th** in rebounds to opposing PFs. **P.J. is also ranked 19th in defensive rebounds,** and the 76ers give up the 22nd most defensive rebounds this season. When P.J. plays for 30 minutes, he cashes **89%** of the time, and with this being a close game (spread is -1.5), I see him getting 7 boards EASILY.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx15hxu/"
    },
    {
      "created_utc": 1767237335.0,
      "author": "Certain-Challenge202",
      "text": "Record: 67-44(+23.13)\n\nLast Pick: Ratajski ML v Woodhouse\n\nToday’s Pick: Liverpool ML and over 1.5 goals vs Leeds \n\nSport: Premier League \n\nReasoning: Liverpool are on a four-game winning streak at Anfield, while Leeds have one of the league’s worst away defensive records, conceding 20 goals and keeping no away clean sheets. With Leeds missing Joe Rodon and their last meeting ending 3–3, Liverpool’s attacking edge and home form point toward a likely home win by two or more goals.\n\nOdds: 3/4\n\nUnits: 1-3\n\nIf this pick helped you, [buy me a beer 🍺](https://www.paypal.com/ncp/payment/833MDWKA7GUVA)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx0wgvh/"
    },
    {
      "created_utc": 1767236974.0,
      "author": "Jave3636",
      "text": "Record: 0-0\n\nNet Units: 1u\n\nROI:\n\nSport | League | Event Time / Time Zone Oregon v TTU\n\nPick: Under 51 points, - 114 odds\n\nWrite Up: Looking forward to some good college football to end the year, and this game should be just that. These two teams are both in the top 10 for scoring defense. For Oregon, that's not too surprising, as the B10 isn't a high powered offense type league. But for TTU in the B12, that's pretty impressive where everyone scores a lot. I'm liking the under here because both these teams have solid defense. Neither is particularly elite in the red zone on offense either, so I'm expecting some of the long drives to end in field goals. \n\nFull disclosure, both these teams are both also in the top 10 in offense, so this isn't a slam dunk pick. TTU can easily score at will in the no defense league of the B12, so I don't think they'll find scoring as easy against good defenses like Oregon. Oregon has benefited from a somewhat easy schedule, and the few good defensive teams they've played, their offense wasn't as powerful. I think both these offenses will be facing the best defenses (or close to it) either have seen all year, and more than 50 points just seems unlikely to me. \n\nBOL to anyone who tails. Worst case is we lose and get to witness a spectacular shoot out! ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx0vkfy/"
    },
    {
      "created_utc": 1767236759.0,
      "author": "DegenerateDave17",
      "text": "**POTD Record:** 0-0-0\n\n**Previous Pick:** N/A\n\n**Today's Event:** NCAAMB: Tennessee Tech @ Little Rock (6PM EST)\n\n**Pick:** Tennessee Tech ML (+108) (1u to win 1.01u)\n\n**Write Up:** Been stalking this forum for a while and decided no better time than the new year to get started!\n\nNothing flashy for my first pick, but I'll be going with Tennessee Tech ML against a trash 4-9 Little Rock squad. Lines on FD seem off (+108 on FD vs -102 on DK and -105 on Bet365), and Tennessee Tech out ranks Little Rock in almost all trackable offensive and defensive categories.\n\nTennessee Tech's ability to get to the free throw line and maintain a 56.9 2PT FG% while holding opponents to 48.1% 2PT FG% should be enough to pull out a win here and maintain a comfortable lead for hopefully a sweat free W to start the year.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx0v17m/"
    },
    {
      "created_utc": 1767236241.0,
      "author": "dreamchasing1",
      "text": "Record: 248-231 Net Units: -23.63 58-58 on 1.5u plays, 41-41 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [AFCON] Mozambique vs Cameroon\nLast pick: Mozambique over 2.5 corners + Total shots (for both teams) over 18.5 @ 1.90 - 1.5 Units LOSS.\n\n\nEvent: Soccer/Football, [England Premier League] Liverpool vs Leeds\n\n\nPick: Leeds over 8.5 shots + Allison (Liverpool GK) 2+ Saves @ 2.25 - 1.5 Units\n\n\nLeeds have been insanely impressive in their latest run of games. This season, Liverpool have no league home game that allowed less than 9 shots (9 games played at home). Allison registering 2+ saves in 9/12 league games this season. Leeds have dominated the shots category recently with 17 vs Sunderland, 20 vs Palace, 18 vs Brentford, 17 vs Chelsea, 9 vs City. These two teams met very recently at Leeds' ground, where Leeds shot 12 times and Allison registered 2 saves. Liverpool's most recent game at home was vs Wolves who are in dire form, where they allowed 9 shots and Allison had 3 saves.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx0tst5/"
    },
    {
      "created_utc": 1767235577.0,
      "author": "CallimHiraeth",
      "text": "**POTD Record:** 1-0\n\n**Previous Pick:** **Leicester City vs Derby County - BTTS YES** (1.83) ✅\n\nCouldn't ask for a better start by hitting btts in just 10 minutes. Easy and stress free just how i like it :D\n\n**POTD**: Soccer/Football, EFL Championship, **QPR vs Norwich - BTTS YES** (1.72) 1u,  10:00 am EST\n\n**Reasoning**:\n\nQPR at home has seen btts in 9/11. (82%)\n\nNorwich away from home has seen btts in 10/12. (83%)\n\nin the last 8 games (home/away) QPR has seen btts in 7/8. (88%)\n\nin the last 8 games (home/away) Norwich has seen btts in 6/8. (75%)\n\nBoth teams have lower than 20% on clean sheets and failed to score stats.\n\nOnce again, just like last time, seeing this stats i'm expecting both teams to be able to concede and score a goal. 1-1 could be the result but could perfectly go over 2.5 goals if QPR feel like it but will see. Good luck to anyone that joins me on this bet, lets get it once again!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx0s6vg/"
    },
    {
      "created_utc": 1767231361.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 6-19-3 *Happy New Year to those who celebrate today!! Turns out I couldn't catch a break even on the final day of 2025, footballing gods just had one more sucker punch in store. The Mariners had a positive result in the bag but once again, I guess I'm just not allowed to win POTDs as they ended up falling short to a last minute goal. No clue how this keeps happening, but if there's anything I'm sure of, is that I'm leaving this horrid trend behind. 2026 is the year of wins, starting today*\n\n**Last Five:** ❌❌❌❌❌\n\n**Event:** EFL Championship, Bristol City v Portsmouth, 10:00 am EST\n\n**POTD:** Portsmouth Win or Draw +110, 4 units\n\n**Write Up:** Bristol City are currently eighth in the Championship with 10 wins, six draws and eight defeats in the opening 24 matches. They enjoyed a strong festive period, claiming a 2-0 home victory over Middlesbrough before following it up with a 2-1 away win at WBA on Boxing Day. However, they were unable to extend that run in their final game of 2025, suffering a 2-1 defeat to Millwall. Langstaff’s late strike condemned them to a fourth loss in their last seven away matches, showing **they're prone to collapsing late** when under pressure. They now return to Ashton Gate, where they have *lost just once in their previous four home games (W2, D1).* Fear not, though. Portsmouth have gained serious **momentum in their survival push** by taking **eight points from their last four matches.** After beating Blackburn Rovers, they drew with Derby County and QPR before **edging Charlton Athletic in dramatic fashion, with Min-hyeok scoring a 97th-minute winner** (the opposite of what Bristol City tend to do). Despite that positivity, *Pompey remain without an away victory in nine attempts and share the league’s worst away record, scoring just seven goals on the road* and **this is why the line is so inflated,** but all that is needlessly reactionary imho.\n\nDespite Bristol City’s strong league position and home advantage, I still think backing **Portsmouth to win or draw** is the only right thing to do. While City sit inside the top half, their recent performances suggest vulnerability rather than dominance. They failed to build momentum after the festive wins and even at home, they've not been ruthless, **winning two and drawing one of their last four at Ashton Gate, but rarely putting opponents away early.**\n\nNow, let's take a look at the teams' profiles. Crucially, **Portsmouth’s defensive organisation and counter-attacking approach match up well against a Bristol City side** that prefers control and patience in possession. With **Bristol City missing several key options through injuries** (Mayulu, Vitek, McNally, Bird, Sykes and Williams), their ability to break down compact opponents may be limited. That opens the door for Portsmouth to frustrate, slow the tempo, and **exploit transitions or set pieces** (areas where they have been increasingly effective).\n\nTaking into account Portsmouth’s improving form, fighting mentality, and Bristol City’s inconsistency against disciplined sides, this one feels far closer than the odds suggest. A gritty away performance could easily yield a point, and if the game opens up late, Portsmouth are capable of seizing it. For that reason, I'm going with a cheeky **Portsmouth win or draw**. Feeling a disruptive type of game, not too high scoring, but not super low either, so sprinkling an Under 3.5 match goals sounds good to me, as does a BTTS Yes, but let's not make this any more complicated than it needs to be. I went in big on the final day of 2025 so it's only appropriate to start the year off with a bang too - dropping 4 units on this banger. BOL and let's watch some hungover Englishmen stumble across the field ☘️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx0hkc0/"
    },
    {
      "created_utc": 1767231096.0,
      "author": "domadilla",
      "text": "POTD record 88-5-65 (W-P-L)\n\nLast pick: Chelsea vs Aston Villa BTTS=yes, 2u @ -143 ✅\n\n**EPL: Liverpool to win against Leeds (Asian Handicap -1.0), 1u @ -110**\n\nWe need Liverpool to win by 2 goals or more for this bet to hit, if they win by a margin of one goal then the bet is refunded (void).\n\nI like Liverpool for a number of reasons here, I think they are going to win this game and could make it comfortable:\n\n\\- Liverpool have had one more rest day than Leeds: they last played at home against Wolves on Dec 27th and won 2-1 whilst Leeds last played away to Sunderland and drew 1-1 on Dec 28th \n\n\\- These two teams played on 6th Dec at Elland Road (Leeds' stadium) in a game that Liverpool were leading 2-0 and they dropped the ball to let Leeds back into the game which ended 3-3\n\n\\- Key personnel for Liverpool are starting to click as Liverpool find themselves on a 3W streak in the premier league and 4W streak in all competitions: In particular right back Frimpong has returned to the starting line up and got an assist in the last game against Wolves and Florian Wirtz scored his first goal from attacking midfield\n\n\\- Leeds are missing key defender Joe Rodon who has been one of the three central defenders who has played in every single premier league game for Leeds this season so Leeds will have to make defensive adjustments\n\nOverall Leeds, despite finding themselves in 16th place, are not in bad form right now (unbeaten in 5 PL games with 3 draws and 2 wins) but they are playing with a shorter turnaround time for their second successive away game. Liverpool are on a nice run at the moment, they are building momentum and have the talent and firepower to win this game 2-0 or greater and that's what we are betting on. As always please bet responsibly!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx0gvwo/"
    },
    {
      "created_utc": 1767229043.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 27-20 (+4.13U)**\n\nROI: +6.77% \n\nLast POTD: NCAAF: Ohio State ML + Total Game Under 47.5 -124 -118 (1U TO WIN 0.76U) x\n\n**POTD: NCAAF: NCAAF: Indiana -7 vs. Alabama -112 (1U TO WIN 0.88U)**\n\nWrite up: *First things first, Happy New Year! I have appreciated this community and everyone who has showed some love and support. This is a pretty fun thing to do on the side, and I enjoy sparking some conversations about sports with each of you. Shoutout to Reddit for building a community like this for all of us win some money and encourage conversation about sports.*\n\nNow on to the good stuff, can we start 2026 off with a win? Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Indiana winning this game by 10+ (this came as a surprise to me)\n\n• Model projects slow offense from Alabama, showing Indiana's strong run defense\n\n• EV better betting 100$ = 9-11$ for this play\n\n• The Hoosiers huh? Let's start with Alabama's run game, it is just NOT THAT GOOD - they are averaging 3.2ypc, and one of the worst teams in the FBS when it comes to rushing - Look at the rush yards when they played Georgia, (Yes I am comparing Indiana and Georgia in terms of defense) - Indiana has one of the best redzone defenses in the country - they allow touchdowns in the redzone at just a whopping 26% - I really like Indiana, a fun and great QB, can run and throw - they average a very good amount of rushing yards per game - I believe their defensive front is going to eat up Alabama's OL - ROLL HOOSIERS BABY\n\nPOTD History: [https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn](https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn)\n\nBOL!\n\n**POTD: NCAAF: NCAAF: Indiana -7 vs. Alabama -112 (1U TO WIN 0.88U)**\n\nTips are greatly appreciated, PayPal link in bio. Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx0bjjw/"
    },
    {
      "created_utc": 1767227764.0,
      "author": "donjavogosca",
      "text": "POTD Record: 34-17, +15.69u, (ROI +24.9%)\n\nPrevious Pick: Townsville W - Bendigo W, under 156.5 points, 1.85, 1u ✅️ (last 5: ✅️✅️✅️❌️✅️)\n\nEvent: NBL: Brisbane - Perth, 09:30h\n\nPOTD: Perth to win the first half -3.5 handicap, 1.85, 1u ❌️\n\nPerth is a favorite and a better team here, and it also has a better record away than at home this season. \n\nBrisbane is bad both ways, with 6-16 record, slightly worse at home.\n\nBesides that, these 2 played 2 times this year, Brisbane won the first one as a guest in October, and Perth won on 14.12 62-86.\n\nWhy halftime, because Perth seems to start strong in all of their games, and the second half tends to vary. In their last 8/10 games, they were better in the first half. In 3 of those 8, they lost the game after they had a halftime lead.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx082ox/"
    },
    {
      "created_utc": 1767227666.0,
      "author": "StoneKoldPlaya",
      "text": "POTD: UC Santa Barbara -4.5 vs Cal State Fullerton\n\nLast Pick: Wake Forest +9.5 vs NC State ❌😭\n\nRecord: 1–2 | Units: 1u | Sport: NCAAB\n\nI’m loving UC Santa Barbara -4.5 today.\n\nThis is a strong Big West spot where the favorite can actually separate, which matters a lot in this league. UCSB has the edge in guard play, ball security, and half-court execution. When Fullerton can’t speed teams up, their offense stalls which leads to long empty possessions and poor late-clock shots.\n\nThis projects as a controlled game where UCSB dictates tempo and consistently wins possessions. Not asking for a blowout, just clean execution over 40 minutes, which Santa Barbara is built to do here.\n\nPick: UC Santa Barbara -4.5\n\nBOL if you’re riding.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx07ssg/"
    },
    {
      "created_utc": 1767227114.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 17-15-5 (Avg Odds +127)\n\n**Previous Pick:** Antoine Semenyo -1 SOTs (+160) 🅿️\n\n**Today's Event:** English Premier League (Soccer) | Brentford vs Tottenham (12:00 PM PST)\n\n**Pick:** Richarlison ATGS (+175) 1 unit to win 1.75 units\n\n**Write Up:** Happy Thursday everyone and I hope you all are enjoying New Years festivities. After a day off, we're back with EPL action as 9th place Brentford host 13th place Tottenham. All signs point towards this being a high scoring match, and we're here for it. \n\nRicharlison has come into great form over the last few weeks. With 2 goals and 2 assist in his last 4 games. He also had two goals disallowed over the weekend due to offsides, so he has definitely been finding the back of the net. One of these matches was against Brentford a few weeks ago in the reverse fixture that ended 2-0 Tottenham. Richarlison has Tottenhams most goals on the year with 7, their 2nd place Goalscorer is their center back Van de Ven. Goals for Tottenham almost exclusively go through Richarlison. He has looked sharp and the stat sheet has been showing it. Much like our Calvert-Lewin play, this is a play to back an in form striker with great odds. \n\nBrentford have conceded the 9th most goals this season in the EPL with 24. They've only kept three clean sheets this season, and those were against Wolves, West Ham, and a very early match vs Bournemouth. Put in other words, they've kept one clean sheet in their last 11 matches, and that was against Wolves the worst team in the EPL. I do not expect Brentford to keep Tottenham out, and considering Richarlison's form and the fact that he is the team's leading scorer, I'm backing him to find the back of the net in this one.\n\nAs always, BOL and have a great first day of the year!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx06ahd/"
    },
    {
      "created_utc": 1767226570.0,
      "author": "rataataaa",
      "text": "POTD RECORD: 0-0 (debut)\n\nLast POTD: N/A\n\nPOTD: 🎾 Jessica Bouzas Maneiro ML @ -193                       \nTennis | United Cup \n\nTime: 10:30PM (i live in Germany so i have to guess American Time and may be a little off) \n\nWrite Up:\nBouzas is the more complete and consistent player in this matchup. She has a clear baseline advantage, better rally tolerance, and more reliable shot selection, which is especially important on hard courts.\n\nIn United Cup matches, motivation is high and we usually see fewer “let-down” performances from favorites compared to regular tour events. Bouzas’ ability to control tempo and limit unforced errors should be the deciding factor here against Sierra, who tends to struggle when pushed into longer exchanges.\n\nBOL to all who tail and happy new year 🎊🎆",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx04srv/"
    },
    {
      "created_utc": 1767226556.0,
      "author": "OneStopProp",
      "text": "POTD Record: 13-6 (+23.28 Units)\n\nE-Sports 9-1 | Darts 2-2 | NBA 2-1 | NFL 0-2\n\nPrevious Pick: Hood vs. Rock over 13.5 180’s ❌\n\nEvent: Pro Dart World Championship @ 9:10 AM EST\n\nPick: Justin Hood vs. Gary Anderson to combine for over 19.5 180's @ 1.75 (5 units)\n\nRecap:\n\nBad beat where it appears we were on the right side of the bet but Hood was even better than anyone could have expected. \n\nReasoning:\n\n- Odds found at Bodog / Bovada\n- Call me crazy but I’m going back. Hood proved in his game that he is capable of racking up these 180’s and in a longer game he will have well over double digits. \n- This is the quarters and with that this is a best of 9 so many more opportunities for either guy to comeback through 180 throws. \n- Gary Anderson has been throwing 180’s EVEN BETTER than Hood has so I’m expecting a ton out of him which should have this game going deep into the sets. \n\nBOL to anyone who tails.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx04re8/"
    },
    {
      "created_utc": 1767226087.0,
      "author": "wekillsports",
      "text": "POTD record (12-2)\n\nPrevious play - IND +6.5 1Q spread -430 Bovada + CLE +4.5 1H spread -430 Bovada = (-192)✔️✔️✔️\n\nEvent - Oregon@Texas Tech 11am\n\nPlay -  Oregon ml -135\n\nWrite up -  I want to fade the public bad and go with Texas tech but I just can’t do it broo so lock it in we ride with Oregon at 11am tomorrow #wekillsports\n\nShow me you guys want me to keep this streak alive and leave a tip if you wanna I’m goin to try to get the parlay out early tm before 12pm\n\nps if I get guys paid im gonna drop a 2 leg parlay for over +130 odds tm in the comments if I get 30+ upvotes im on a heater.\n\nVenmo - @Tyler-Scott-90325\n\nCashApp - $Tylerscott321\n\nBTC address - bc1qf7xgmjefcdw63qd7upawdze70j7p5s6c36alft",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx03hpt/"
    },
    {
      "created_utc": 1767224869.0,
      "author": "Mean_Duty2303",
      "text": "**Last Pick: -** Arsenal VS Aston Villa Over 2.5 Goals @ -117 (Win)\n\n**Record:** – 1-0-1 (W-L-P)\n\n**Net Units:** – +1 unit\n\n**Sport | League | Event Time / Time Zone Pick:** Soccer | English Premier League | 3:00 pm EST\n\n**Today’s Pick:** Sunderland vs Manchester City - BTTS @ -115 | **1.15 units to win 1 unit** (Draftkings)\n\nAfter analyzing recent performances, stats, and attacking trends, **Both Teams to Score (BTTS)** is the strongest pick for this fixture.\n\n**Write UP:**\n\n**Sunderland** has been a consistent goal-scoring team at home this season. In **9 matches so far**, they have scored in **all but one game**, totaling **16 goals** (an average of **1.78 goals per match**). Their most recent home games include:\n\n* **3-0 win vs West Ham** – 10 shots, 5 on target, 36.8% possession\n* **2-1 win vs Brentford** – 12 shots, 3 on target, 54.4% possession\n* **3-2 win vs Bournemouth** – 12 shots, 6 on target, 42.8% possession\n\nEven in draws (Aston Villa 1-1, Everton 1-1, Arsenal 2-2, Leeds 1-1), Sunderland consistently found the net, showing strong offensive consistency despite conceding goals in 4 out of 9 matches.\n\n**Manchester City's** away stats also support BTTS. They have scored in **8 of their last 9 away matches**, netting **18 goals** (average **2 goals per match**) and maintaining an attacking presence:\n\n* **5-4 win vs Fulham** – 11 shots, 4 on target, 43% possession\n* **3-0 win vs Crystal Palace** – 7 shots, 6 on target, 61.8% possession\n* **2-1 win vs Nottingham Forest** – 16 shots, 5 on target, 65.9% possession\n\nCity has conceded in **5 of their 9 away matches**, showing vulnerability in defense, especially against high-pressing or counter-attacking teams. Sunderland’s attacking consistency, combined with City’s defensive lapses away, increases the likelihood of both teams scoring.\n\n📊 **Key Numbers:**\n\n* Sunderland: 16 goals in 9 matches, scored in 8 of the last 9\n* Manchester City (away): 18 goals in 9 games, scored in 8 of last 9, conceded in 5 of 9\n* Sunderland scored in all draws (4/4), City conceded in 5/9 away games\n\nThis bet combines Sunderland’s home scoring form and Manchester City’s away attacking efficiency with a higher statistical probability of both teams finding the net.\n\n🍺 **If this one cashes, a beer is always appreciated:** [buymeacoffee.com/willjack](http://buymeacoffee.com/willjack)\n\n**BOL!! Comment down if you are tailing.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx006a0/"
    },
    {
      "created_utc": 1767224843.0,
      "author": "nigerianPriince0",
      "text": "**Record: 100 W  - 85L**\n\n**✅ ✅✖️✅✅**\n\n**Last Pick: Neom SC VS Al-Ittihad: Both Teams to Score - Over 2.5 Goals @ 1.72  ✅**\n\n**-----------------**\n\n**Today's Pick: Leeds Over 2.5 Total Team Shots On Target @ 1.80**\n\n**League - Premier League**\n\n**Game: Liverpool VS Leeds FC**\n\n**Time: 12:30 PM EST**\n\n**---**\n\n**HAPPY NEW YEAR!!!**\n\nHoping to start 2026 off strong with some new year prem games. Loving the value on this line considering the form Leeds have managed to pick up coupled with the fact they played 3 weeks ago in a match that ended 3-3 with Leeds 5 SOT. Now we're in the reverse fixture and I'm expecting a similar performance. Also, with a terrible Wolves side putting up 4 SOT against Liverpool on the Weekend, I find it hard to believe Leeds won't follow suit.\n\nEver since rumour came out that Daniele Farke's job was under threat, Leeds haven't lost a game. They're unbeaten in 5 games (2 W, 3 D) and put up a great late performance against Mancity in a 3-2 Loss. \n\n**---**\n\n**Leeds' SOT last 10 games: 6, 8, 4, 5, 5, 4, 5, 3, 2, 5**\n\n* Leeds have hit over 2.5 SOT in 9/10 of their last games. \n* Line has hit for 8 games straight.\n* Averaging 4.7 SOT per game (very good considering this includes 3 big 6 teams)\n* Dominic Calvert-Lewin has scored for 6 games straight now (our best friend for this pick)\n\n**---**\n\n**Liverpool SOT faced last 10 games: 4, 4, 1, 5, 6, 0, 7, 6, 3, 8**\n\n* Line has hit in 8/10 of their last games\n* Averaging 4.4 SOT against per game\n* In Liverpool's last 5 Home games, this line has hit 4/5.\n\n**---**\n\n**After the 3-3 game between these sides a couple of weeks ago I see Liverpool looking to set things straight but with key players being unavailable, I see a similar story we've seen at Anfield this season. Dominate a section of play - the crowd gets anxious - the opponent gets a run of play - recycle. Liverpool heavy favourites but Leeds wont go down easy.**\n\n**BOL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nx003rn/"
    },
    {
      "created_utc": 1767224294.0,
      "author": "BL_ATS",
      "text": "POTD record: 12-14-1\n\nDarts, 2026 World Championship 🎯\n\nPOTD: Ryan Searle ML vs Johnny Clayton @ 1.73\n\nRyan Searle has been playing phenomenal darts and hasn’t lost a set yet during this tournament. That’s 14 sets won, 0 lost. Obviously, he played against worst opponents, but he’s been overclassing all of them so far. Expecting he’ll outclass Clayton again today.\n\nHis opponent Clayton has been feeling a little off during this tournament and could be called lucky to even win against Harrysson in his last match. He hasn’t shown the level, form, or consistency of Searle yet. I’m happy we're getting good odds and confident in taking Searle ML @ 1.73\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nwzylbw/"
    },
    {
      "created_utc": 1767223571.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 15-13 (+2.02u)\n\nWednesday’s Pick ❌ - Tampa Bay Lightning 3 way line +115 (1u to win 1.15u)\n\nThursday’s Pick - Washington Capitals ML +126 (1u to win 1.26u)\n\nWe don’t have any news on Ullmark yet. He was granted a leave of absence starting on Sunday and that’s the last we’ve heard. If he remains on his leave, then it will probably be Leevi Merilainen in goal. He has been abysmal for the Senators. I don’t see a world where the Senators can be favored if he starts.\n\nRegardless of who the Senators goalie is, neither are on the level of Logan Thompson this year and the Capitals are the better team. The Capitals are in a little bit of a slump and they’re on the second half of a back to back, but they are the better team here and I like them at + money, even if we find out Ullmark is back.\n\nGood Luck and Happy New Year",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nwzwkvg/"
    },
    {
      "created_utc": 1767223383.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q0q5v6/pick_of_the_day_1126_thursday/nwzw2jj/"
    }
  ]
}