{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/13/25 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/",
  "target_date": "2025-11-13",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-12T23:41:14.952838+00:00",
  "comments": [
    {
      "created_utc": 1762990283.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 2-0\n\n**Previous Pick:** Morgan Gibbs White 1+ SOT (-110) ✅️\n\n**Today's Event:** UEFA World Cup Quals | England vs Serbia (11:45 AM PST)\n\n**Pick:** Elliot Anderson 1+ SOT (+110), 1 unit to win 1.1 units\n\n**Write Up:** Hello again friends! We're back after a few days break with some world cup qualifier action where we're into the last two games of the group stage. In case you can't tell by now, I love SOT plays. They're quite fun to root for while watching a match. Our first two plays both hit within the first 3 minutes of their respective games, great start to POTD! I was waffling here between this pick and England 3+ goals, but landed here because this one could be a slog. England have qualified for the world cup, so this is technically a meaningless game for them. But England boss Thomas Tuchel wants his side to continue to gel and build momentum. He also loves himself some Elliot Anderson. Anderson has played nearly every minute for England since his first cap with the senior squad in September. Anderson also fits the mold for my favorite kind of player to back, scrappy hard working midfielders who like to take long shots. We're getting good odds here because Anderson has only recorded a SOT for England in 1 of 4 matches. But in his last match against Latvia, he took 5 shots. While none of those found the target, the uptick in shot attempts are promising as his confidence builds and he cements himself in England's midfield. \n\nNow to Serbia. They currently sit 3rd in the group, 1 point behind Albania. Serbia needs a point here to stay alive in qualifiers. I expect them to park the bus and invite shots from a distance, as they won't win a high goal shootout with England. This is Anderson's shooting range and I fully expect him to find the target here, if not the back of the net. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojkh4s/"
    },
    {
      "created_utc": 1762989811.0,
      "author": "dreamchasing1",
      "text": "Record: 223-210 Net Units: -22.64 47-50 on 1.5u plays, 37-39 on 2u plays, 1-2 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Scotland Challenge Cup] East Kilbride vs Celtic B\nLast pick: BTTS + OVER 2.5 GOALS @ 2.05 L\n\n\nEvent: Soccer/Football, [World Cup QUALS] Moldova Vs Italy\n\n\nPick: Moldova over 1.5 corners @ 1.72 - 3 Units\n\n\nBoth sides arguably with not much at stake here as Italy have a slim to none chance of overtaking Norway, whereas Moldova cannot advance anymore. Moldova at home though to get just 2 corners, when they got 6 in the reverse matchup seems great, so far with 6 games played Moldova covered this in all but 1 game away vs Norway. At home, Moldova got 6 vs Norway. Moldova have also previously gotten at least 2 vs Romania in a friendly very recently and vs Poland. Italy have given up 2 or more corners in 5/6 games during the group stage. Simply expect the home side to show a respectable performance and get at least 2 corners here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojj4r2/"
    },
    {
      "created_utc": 1762989618.0,
      "author": "InternationalRest542",
      "text": "POTD Record: 1 - 0\n\n\nNet Profit : +3 Units\n\n\nPrevious Pick: Karl-Anthony Towns Over 13.5 Rebound+Assist  @1.81 3u to win 2.43u ( Pending )\n\n\nEvent: NFL | Jets @ Patriots ( Divisional Matchup )\n\n\nPOTD: Hunter Henry Over 33.5 Rec Yards @1.83 2u to win 1.66u\n\n\nWrite Up:  \n\n\nHunter Henry will see an increased role in the Patriots passing offense because Kayshon Boutte (hamstring) will not playing and Austin Hooper (concussion) are on limited minuts vs the Jets . Maye has been leaning on short and middle reads, especially to his TE which Henry already averages about 3.8 receptions and 44.9 yards per game with him.\n\n\nAustin Hooper’s absence removes the team’s TE2 and a reliable underneath target. That means Henry should get nearly all tight end snaps.\n\n\nKayshon Boutte missing will hurt their WR core, so the Patriots may funnel more targets toward Henry . Also The Jets this season allow tight ends to average about 42.6 receiving yards per game when being targeted. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojikvn/"
    },
    {
      "created_utc": 1762987245.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojbitc/"
    }
  ]
}