{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/28/25 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/",
  "target_date": "2025-11-28",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-28T19:11:36.634308+00:00",
  "comments": [
    {
      "created_utc": 1764356371.0,
      "author": "Aggravating-Quit-528",
      "text": "Record: 0-0\nNet Units: 0\n\nNFL | 3PM ET\nPick: Colston Loveland o30.5\n\nWrite Up: Loveland has turned into a trusted option for Caleb Williams, clearing 38 yards in five straight games and averaging around 60 in that span. The Eagles are tough on outside receivers which often funnels targets inside to tight ends and backs, and Chicago should lean pass heavy as road underdogs. With Loveland running a strong share of routes and getting schemed shots up the seam, he can get over 30.5 on just a couple of catches.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr9ckfj/"
    },
    {
      "created_utc": 1764355273.0,
      "author": "tokcliff",
      "text": "Event: Syed Modi International Mixed Double\n\nPOTD Record: 140w 94l 2p \n\nDate: 29 Nov SGT\n\nNet Profit = +48.14 units\n\n\n\nTeeraratsakul/Taerattanachai -6.5 points at 1.83 @ 1.25 units (vs Pranata/Faza)\n\n\n\nThey have been pretty decent, especially Sapsiree, this new pairing is good as seen from how they ran deep in the Arctic Open. While Indonesia pair is good, they haven't really been tested against good opponents yet, 1.25 units only.\n\n\n\nBTW if anyone wants to follow my blog where I do some reflection about badminton betting\n\n[https://tokkidokkie.wordpress.com/](https://tokkidokkie.wordpress.com/)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr994xz/"
    },
    {
      "created_utc": 1764353894.0,
      "author": "RetiredBookie",
      "text": "Record (1-1-1) +0.54 units\n\nPrevious Pick: Villa -1 AH (PUSH) + Betis 1-3 goal range ✅\n\nRecap: Push at the last second!!! But we move on\n\n\nToday’s Pick: Como to score a goal and double chance + BTTS Leipzig vs Borussia Monchengladbach (-134 bet 365) \n\nWager: 1.34 units to win 1\n\nReasoning: \n-Monchengladbach have scored 3+ goals in each of their last four competitive wins.\n-RB Leipzig have found the net at least twice in all but one of their last seven competitive matches.\n-Six of RB Leipzig’s last eight competitive games have seen goals at both ends.\n\n-Como haven't lost at home in eight matches\n-Como won five out of eight home games\n-Sassuolo won just twice in the last six games\n\nLet’s gooo!! Bollllll",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr94r8x/"
    },
    {
      "created_utc": 1764352719.0,
      "author": "Full-Boysenberry-483",
      "text": "The Brat where have you been? Hope you’re doing OK? Appreciate all the picks looking forward for more you’ve been hot!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr911ai/"
    },
    {
      "created_utc": 1764352316.0,
      "author": "Living-Progress1425",
      "text": "Record: 0-3; Brock Purdy caught the Justin Fields and couldn’t connect with Ricky. Fear not, we are turning this around in epic fashion just in time for the Holiday Season.\n\nNet Units: -6\n\nW/L%: 0%\n\nEvent: NFL Black Friday Bears @ Eagles 3:00EST\n\nTonight's Pick: 3 leg parlay (+132 on DK); 2 Units to win 2.64\n- AJ Brown 4 receptions\n- DJ Moore 3 receptions\n- DJ Moore 25+ yards\n\nWrite Up: \nLeg 1: AJ Brown is back in form as Jalen Hurt’s primary option, garnering double digit targets in each of the last two weeks. He’s caught 61.3% of his targets this season.  The Bears defense has been in plug-and-play territory, and are still without cornerback Tyrique Stevenson with Jaylon Johnson questionable.\n\nLeg 2: As Odunze has emerged as Chicago’s WR1, DJ Moore remains on the field just about as much. He played for one less snap than Odunze last week and 4 more snaps than Odunze in week 11. Moore has covered these lines in 9 of 12 games this season.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr8zrcq/"
    },
    {
      "created_utc": 1764350574.0,
      "author": "whidswhinners",
      "text": "**2025 NFL Record:** 19W - 8L  \n**2025 MLB Record:** 4W - 1L  \n**2025 NBA Record:** 4W - 4L  \n✅✅✅❌✅✅✅✅❌🩼✅✅✅✅  \n❌✅🪝✅✅✅❌✅✅✅❌✅❌✅  \n✅✅❌✅❌❌✅❌❌✅✅✅\n\n**Net Units:** \\+8.81 units (I only promote 1u wagers)\n\n**Last Pick:** Christian Watson - o49.5 Receiving Yards (-140 on Bet365)✅\n\n**Event:** NFL: Eagles vs Bears (1:00PM EST)\n\n**Today's Pick:** D'Andre Swift - o9.5 Receiving Yards (-112 on Fanduel)\n\n*Seriously, 9.5 yards is 1–2 routine catches for Swift, who is over this line in 80% of games this season with an average of 22.4 receiving yards a game.*  \n  \n*Philly’s pressure invites RB screens/hot throws, which are baked into most game plans vs the Eagles. In fact, their allowing the 4th most receiving yards to RBs on the year.*  \n  \n*This has allowed most RBs in recent games to cover their receiving lines (Josh Jacobs, Jahmyr Gibbs, David Montgomery, Tyrone Tracy, ect)*  \n  \n*Oh yeah, and Swift played for the Eagles, being shipped off relatively quickly after being under utilized by them. He very well could have a chip on his shoulder for this game.*  \n  \n*With the Eagles favored by 7 points, expect Caleb Williams and Ben Johnson to utilize their pass catching running back in late half situations.*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr8ue41/"
    },
    {
      "created_utc": 1764348932.0,
      "author": "nigerianPriince0",
      "text": "**Record: 94 W  - 80L**\n\n**Form:  ✅✅✖️✖️✅✅✅✖️✖️**\n\n**------------------------------------------------**\n\n**Today's Pick: Rennes Over 2.5 Corners first half @ 2.10**\n\n**League - Ligue 1**\n\n**Game: Metz VS Rennes**\n\n**Time: 2:45 pm EST**\n\n**-----------------**\n\n**Rennes are in good form, and the value attainable here is more than worth the shot.**\n\n\n\nRennes are really keeping the pressure this season, they're 6th in the league on a 3-game win streak and a game against 17th-place Metz is one they need to put early pressure on not to give too much hope to the home base.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr8pdeu/"
    },
    {
      "created_utc": 1764348774.0,
      "author": "YGWYD",
      "text": "**SEASON RECORD:** 29-4-21\n\nNet Units: (-3.74)\n\nPrevious Pick:  Ludogorets vs Celta de Vigo- Celta De Vigo to win @ 1.65 ❌️\n\n**Today's Pick:**  Metz vs Rennes - Rennes to score 1st @ 1.60\n\n**TIME:** 8:45pm (BST)\n\n**Wager Amount**: 1.5 units\n\nLast 10 Matches (✅️❌️❌️❌️❌️❌️❌️❌️✅️❌️)\n\nShocking performance from Celta Vigo, lets move on to France. Gonna keep it short.\n\nRannes are 6th in Ligue 1, unbeaten in 4 matches and on a 3 game winning run and have scored 1st in 4/5 matches.\n\nWhile Metz have won 3/5 games, they are 17th and have conceeded 1st in 5/7 games. Also in H2H matches Rennes are on a 7 game winning streak and scored 1st in 7/8 matches. BOL if you're tailing or fading given my current form lol.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr8ovv6/"
    },
    {
      "created_utc": 1764348632.0,
      "author": "JoeInglesOfficial",
      "text": "\n__POTD Record:__ 54-28-1 (+53.75u)\n\n__Previous Pick:__ [❌ Nico Collins o5.5 receptions (-120), 3.6u](https://www.reddit.com/r/sportsbook/s/3GVH350O7d\n\n__Event:__ NFL: Bears @ Eagles 3pm EST\n\n__POTD:__ Caleb Williams over 31.5 pass attempts (-125 Fanatics), 3.75u to win 3u\n\n__Write Up:__ Happy Holidays fellow degens. I’ll be back soon, busy week. But I wanted to share what I’m on today.\n\nBears QB Caleb Williams is averaging 35 pass attempts over his last 5 games, hitting over 31.5 in every game. The Eagles rank 23rd in pass attempts allowed this season, allowing 34.3 pass attempts per game. The last 6 QB’s they faced not named Jaxon Dart all had over 36+ pass attempts, averaging 38.3 pass attempts per game, starting with most recent:\n\nDak- 36\n\nGoff- 37\n\nLove- 36\n\nWentz- 42\n\nNix- 39\n\nBaker- 40\n\nThe Eagles have a stout run defense & Bears won’t be able to do much on the ground. Over their past 5 games, the Eagles have allowed 3.8 yards per carry to RB’s (7th) & 73.0 rushing yards per game (8th). The Bears have had an extremely weak schedule & on the defensive side they rank 30th in defensive success rate (53.8%), allowing a league high 2.76 points per drive on the road. The Phili offensive has played consistently well, as they are the only remaining team that has converted 100% of their goal to go trips into TD’s (15). They also turn the ball over at the lowest rate in the league, on just 4.3% of their possessions. The Eagles run game has been horrible lately, especially after star Offensive Lineman Lane Johnson going down. Last week vs the Cowboys, Eagles RB Saquon Barkley Barkley ran 10 times for just 22 yards, forcing the Eagles to completely abandon the run even having 21-0 lead. The Eagles dropped back on 75% of their plays, 2nd most this year. The Bears have a had a solid run game & haven’t allowed a 100 yard rusher since their week 5 bye. The Eagles passing means more offensive plays & possession for the Bears. Eagles are favored 7 points & the Bears are likely to trail throughout this game, which will likely lead to more pass attempts for Williams.\n\nI like over 32.5 as well if your book has that line.\n\n__Caleb Williams over 31.5 pass attempts__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial) - [PayPal](https://paypal.me/joeinglesofficial) - [Bitcoin](https://pastebin.com/raw/GEXAsA2S)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr8og0g/"
    },
    {
      "created_utc": 1764347527.0,
      "author": "herbobets",
      "text": "**Record:** 2-2-0\n\n\n\n**Net Units:** \\-3.93u\n\n\n\n**Last Pick:** W - Trabzonspor over 0.5 goals + Como over 0.5 goals (-138) - 5u\n\n\n\n**Form (last 5):** WLLW\n\n\n\n**Streak:** 1W\n\n\n\n**Event(s):** NFL: Chicago Bears vs Philadelphia Eagles (2:00 p.m. CST) + CFB: Texas A&M vs Texas (6:30 p.m. CST)\n\n\n\n**Pick:** Saquon Barkley to have the most rushing yards in the game + Marcel Reed 200+ passing yards (+110) - 5u\n\n\n\n**Write-up:** I really like the plus odds on this 2-leg bet today. Not much needs to happen for these bets to hit, as long as nothing outrageous happens.\n\nFor Saquon, I really like him to lead all rushers because the only way I see someone else beating his yards is if they really stop Saquon and Jalen has to start running or if the Eagles get behind and D’Andre Swift gets a bunch of carries but I really don’t see that happening. I expect Saquon and the Eagles to have a big game at home. I was also looking at Barkley’s longest rush over 16.5 yards because I think he should break at least one big one today. Putting that instead of him to be the leading rusher pays out more, but I wanted to be a little safer and just have him to lead all rushers.  \n\nI think the Texas A&M vs Texas game will be high scoring and competitive. A&M are the better team and even though they are playing away, they have been incredible offensively this season. Marcel Reed has hit 200+ passing yards every game but 2 this year and that is because those two were blowouts against Mississippi State and Samford. Marcel Reed should be able to hit 200+ passing yards with ease today.\n\nI think putting these two bets together makes for a great payout and I think Barkley and Reed have great matchups today and are set up for big games.\n\n\n\nBOL and God bless.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr8kz0x/"
    },
    {
      "created_utc": 1764344514.0,
      "author": "DrizzyRakeJr",
      "text": "**Record: 0-0**\n\n**Net Units: -**\n\n**Sport: Football**\n\n**my first post here, and yeah hopefully we all can cash! have been following this page for a good time tailing lots of picks, so now its my time to share.**\n\n**My pick of the day is Como and Ado Den Haag to win. 2.67 on bet365, 1 unit.**\n\nComo have been in great form for weeks now. They haven’t lost in their last eleven matches, and earlier in the season they already beat Sassuolo 3–0 in the Coppa Italia. After two 0–0 draws they came back in the best way possible by smashing Torino 5–1, so the confidence and the goals are definitely back. With the way they’ve been playing, especially at home, I really expect them to keep that run going.\n\nVenlo on the other hand have only managed one win this month and they just haven’t looked convincing at all. ADO look like the strongest team in the KKD right now. They create more danger, they look sharper, and they’ve been far more consistent. This is the type of matchup where ADO usually steps up and gets the job done.\n\nBOL and lets start with a W!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr8bjq8/"
    },
    {
      "created_utc": 1764343360.0,
      "author": "jcrew1392",
      "text": "POTD Record: 3-1\n\nPrevious Pick: Jakob Chychrun 1+ Point✅\n\nHope everyone had a great thanksgiving! Chychrun gets it done in the 1st period by scoring a goal and gives us a sweat free cash! Today we head to the NBA!\n\nToday’s Pick:\n\nNBA | 10:00pm EST | Mavs @ Lakers\n\nPick: Luka Doncic o41.5 PR (-125) 1u\n\nWrite Up: I am fully buying in to the revenge narrative here. Luka has been on a tear to start the season and can hit this line on points alone. \n\nIt’s no secret how he feels about this matchup. He’s going to look to be aggressive. Since LeBron’s return from injury, Luka has averaged 46 PR.\n\nMavs allow the most rebounds to the PG position so the rebound upside is there for Luka. Plus we all know Luka will be off ball on defense so he’ll be able to roam and grab boards on the weak side. As long as Luka gets the minutes and doesn’t shoot inefficiently he should cash this number for us. \n\nGood luck to everyone tailing!\n\nIf I helped you make some money and you want to show appreciation/support, you can do so here 👉🏼 [CashApp](https://cash.app/$JCruz1392)  Thank you! Let’s keep on winning!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr88299/"
    },
    {
      "created_utc": 1764341892.0,
      "author": "Flashy_Calendar3995",
      "text": "7-6\nPlus 3 units\n\n\n### The Pick: Texas A&M Aggies (Money Line -130) Bet 2 units\n\n\n**Game:** #3 Texas A&M (11-0) vs. #16 Texas (8-3)\n**When:** Today (Friday) at 4:30 PM PST\n**Where:** DKR-Texas Memorial Stadium (Austin, TX)\n**TV:** ABC\n\n\nHere is the breakdown of why the Aggies are the smart play to ruin Texas's night in Austin.\n\n\n### 1. The Mismatch in the Trenches\nThe biggest reason A&M stays undefeated tonight is their defensive front. The Aggies rank **2nd in the nation in sacks and tackles for loss**. They wreak havoc in the backfield.\n* **Texas's Weakness:** The Longhorns' offensive line has been \"leaky\" and inconsistent all season.\n* **The Result:** Texas QB Arch Manning has struggled when pressured, making decision errors and taking sacks. A&M’s pass rush will force him off his spot early and often, killing drives before they start.\n\n\n### 2. Quarterback Dynamics: Reed vs. Manning\n* **Texas A&M (Marcel Reed):** Reed has been a revelation. He is a dynamic dual-threat who extends plays with his legs. In rivalry games where emotions run high and plays break down, a QB who can scramble for a first down is the ultimate equalizer. He adds a rushing dimension that the Texas defense has historically struggled to contain.\n* **Texas (Arch Manning):** While talented, Manning is still young and prone to \"rookie\" mistakes, especially against elite defenses. He has thrown 7 interceptions this year, and A&M’s defense is designed to bait inexperienced QBs into bad throws.\n\n\n### 3. Momentum and \"The Spread\"\n* **Texas A&M** is a wagon right now. They are **11-0** and playing with the confidence of a team destined for the College Football Playoff. They have learned how to win close games (like the comeback against South Carolina).\n* **Texas** is 8-3 and just **3-8 Against The Spread (ATS)** this season. They are consistently overvalued by Vegas because of the brand name \"Texas.\" They have failed to cover in their last 3 games as underdogs.\n\n\n### 4. The Stakes\nTexas A&M is playing for a guaranteed spot in the SEC Championship and a potential #1 overall seed. Texas is effectively playing for pride. While \"spoiler\" motivation is real, the Aggies have everything to lose, which usually translates to a sharper, more disciplined performance from a Mike Elko-coached team.\n\n\n**Bottom Line:** You are getting an **11-0** team at nearly even money against an **8-3** team just because the game is on the road. Don't overthink it. Back the better defense and the better record.\n\n\n**Prediction:** Texas A&M 31, Texas 24.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr83uco/"
    },
    {
      "created_utc": 1764336986.0,
      "author": "EthicalGambler",
      "text": "#*I am tracking cappers who post in these threads and will continue to do so for the foreseeable future. [Here is the new document which started tracking 09/01/25](https://www.potd.lol/today?utm_source=redditpost).*\n\n**My Record:** 69-61-3 (-2.00u)\n\n**Today’s Pick:** Jonas Valanciunas o7.5 points (Spurs vs Nuggets)\n\n**Odds:** -110\n\n**Units:** 2.4u\n\nTip off is 6:10pm PST. I am staying with my Valanciunas points system today as planned. The line for this match is 237.5 with Spurs center Victor Wembanyama sidelined due to injury (calf). Its the forth match for these teams in the NBA Cup and both the Nuggets and Spurs are sitting at 2-1 in the same group, with the Nuggets at a +3 point differential. So a lot of parity if the Spurs had a healthy Wemby. \n\nEven without Wemby this should be a night with a lot of buckets. Valanciunas has hit this line 2 out of the 3 NBA Cup matches this season. Should this game become lopsided in favour of the Nuggets I could see Jokic's minutes reduced like it happened NBA Cup match on 11/07. A match where Warriors star Steph Curry was inactive. The spread is currently -8.5 and in that 11/07 match the spread was -9.5. \n\n**Previous Pick**: Jonas Valanciunas o7.5 points (Nuggets vs Grizzlies) ❌\n\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/EthicalGambler-U6cnjV?utm_source=mdembed&utm_campaign=EthicalGambler) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr7qrtr/"
    },
    {
      "created_utc": 1764334874.0,
      "author": "Professional_Elk8286",
      "text": "Took a short break for a while , lets get back to it :)  \n  \n**Record: 1-4**\n\n**Net Units: 0.0U**\n\n**Balance : -42.66$ ( 1Unit = 12.50$ )**\n\n**Last Pick : FunPlus Phoenix vs ThunderTalk Gaming** | **Esports -** ✅ \n\n**Finally we get the much needed win , no chance Thundertalk gaming had any.**\n\n**Today's Pick:** [CS2](https://stake.com/sports/counter-strike) | [CCT Season 3 European Series #12 Play-In](http://stake.com/?c=stalcagey)\n\nEternal Fire **vs** Sparta | **Esports | ( in 5 hours )**\n\n**Pick:**  **Eternal Fire ML 2.10 odds** 12.50$ for 26.25$ ...\n\n# ✅ Why I favor Eternal Fire\n\n* Historically when EF and SPARTA met in recent months, EF has had the edge: in earlier 2025 encounters (e.g. in Series #7), EF beat SPARTA 2-0. [Strafe Esports+2Tips.gg+2](https://www.strafe.com/match/sparta-esports-vs-eternal-fire-swiss-2025-cct-season-3-european-series-7-9736f4/?utm_source=chatgpt.com)\n* According to pre-match analytics, EF has strong statistics on certain maps — e.g. “Mirage specialty: 61% win-rate across 31 maps,” which suggests if the veto and map picks fall their way they can leverage that strength. [Bo3.gg+1](https://bo3.gg/matches/eternal-fire-vs-sparta-28-11-2025?utm_source=chatgpt.com)\n* The general prediction sentiment (e.g. some community polls/odds) still heavily favor EF. [Strafe Esports+2GosuGamers+2](https://www.strafe.com/match/eternal-fire-vs-sparta-esports-group-d-2025-cct-season-3-european-series-12-250ab5/?utm_source=chatgpt.com)\n* In their most recent head-to-head (Nov 9, 2025), SPARTA defeated EF 2-0 in the last meeting — showing they know how to handle EF’s strategies. [Strafe Esports+1](https://www.strafe.com/match/eternal-fire-vs-sparta-esports-group-d-2025-cct-season-3-european-series-11-5779b8/?utm_source=chatgpt.com)\n* SPARTA also have map-specific strengths: e.g. a decent win-rate on Nuke, which could be a deciding factor depending on map veto. [Bo3.gg+1](https://bo3.gg/matches/eternal-fire-vs-sparta-28-11-2025?utm_source=chatgpt.com)\n\n**Best of luck!**\n\nIf you are feeling generous - bc1q2vnsueytju6yueffykdx0detswz7dfffvw5v75 ( BTC )",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr7ll28/"
    },
    {
      "created_utc": 1764334865.0,
      "author": "Uneasiestwig",
      "text": "Record: 6-12\nNet units: -11.85\nLast pick: Porto to win and BTTS @3 ❌️\n\nToday's pick:\n\nWDF world darts championship 🎯\n\nAlex Williams vs romeo grbavac 19:00 GMT\n\nWilliams to win @ 2.1 (betmgm) 2u\n\nthis is the closest game in the round, I'm picking Williams as grbavac can be inconsistent on his finishing.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr7lkac/"
    },
    {
      "created_utc": 1764329932.0,
      "author": "lordestros",
      "text": "POTD Record: 2-1\n\n2 wins in a row!\n\nVegas Golden Knights vs Montreal Canadiens (Hockey/NHL) at 4pm EST\n\nOver 5.5 goals (-135)\n\nWrite-up:\n\nCanadiens average 3.43 goals per game this season\n\nGolden Knights average 3.09 goals per game this season\n\n\nCanadiens have hit that line 10 times in their last 10 games. The team either score a lot or give up a lot of goals. Vegas has also hit that line in their last 3 games and 5 in their last 10 but all their other games finished with 5 goals and never less. Reason why I'm confident in this pick is because Montembeault is in net for the Canadiens and he's been atrocious. Both teams have back to back the next day so I expect Vegas to play their backup goalie. Carl Lindbom should be starting for Vegas with a .872(not good for an NHL goalie) save percentage and he gives up 3.16 goals on average this season. Even if it's Akira Schmidt starting I would go for over 5.5 because of Montembeault who gives up a lot of goals. Montembeault is supposed to be Montreal's #1 but he's been playing pretty bad this season and is quickly losing his spot as #1. He has a .852(very bad for an NHL goalie) save percentage and gives up 3.71 goals on average this season. Mark Stone is also back for Vegas so more firepower for them and he is also a Canadiens killer (23 points in 27 games played vs the Canadiens). Jack Eichel also loves to put up points vs the Habs (24 points in 24 games). Same thing for some of the Canadiens players versus Vegas : Suzuki has 10 points in 10 games versus them and Caufield has 5 points in 5 games. All in all I expect both teams to score a lot!\n\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr7bho2/"
    },
    {
      "created_utc": 1764329196.0,
      "author": "Dangerous-Ad4255",
      "text": "**Record:**  \nPlay of the Day: 10-2\n\n**Net Units:**  \nPlay of the Day: +7.48\n\n**Write-Up:**\n\nThe Europa League delivered as Roma vs. Midtjylland hit **BTTS + Over 2.5 goals** , adding another unit to the run.\n\nWith the soccer win, we're going to try and keep that momentum rolling right back to the NBA for today's official play.\n\n**Play of the Day: NBA | 29 Nov**  \nBasketball | NBA | 28 Nov, 02:30 AM SAST\n\n**Milwaukee Bucks @ New York Knicks**  \n**Pick: New York Knicks -7.5 @ 1.83**.(-120) 1 Unit\n\nThe trajectories of these two teams are heading in opposite directions. The Bucks are on a downward spiral and simply haven't looked good, while the Knicks are building positive momentum and are just playing a better, more cohesive brand of basketball right now.\n\nI'm backing the Knicks to cover at home in a spot I love. This is a quick revenge game after the Knicks lost in Milwaukee 121-111 earlier in the season, and now they get to host at Madison Square Garden. Beyond the revenge narrative, this game is critical for the NBA Cup standings, and point differential is a key tiebreaker. I expect the Knicks to be fully motivated not just to win, but to win by a margin.\n\nAnd I like this play regardless of Giannis Antetokounmpo's status. The Knicks' current form and the situational spot are strong enough for me to believe they would cover.\n\nI'll be honest, I had a hard time deciding between this spread, Jalen Brunson over 29.5 points, and Cade Cunningham over 29.5 points—both of those player props were my other favorite plays of the day. However, the Knicks spread ultimately checks a couple more boxes for me, so that's the official pick.\n\nhttps://preview.redd.it/x4g0vtlafz3g1.png?width=341&format=png&auto=webp&s=a6d1cae8dcc6975739b7d0978cee5a4687e93ffe\n\nLet's try to make it three in a row. Good luck",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr7a636/"
    },
    {
      "created_utc": 1764328312.0,
      "author": "_AnalkingSkywanker",
      "text": "**Pick of the day**\n\n**POTD Record:** 0-3\n\n**ROI** -100%\n\n**Last Pick:** Frankfurt vs Atalanta - Frankfurt DNB ❌\n\n**Today's Event:**  Bundesliga - \nBorussia Monchengladbach vs RB Leipzig\n(19.30 GMT) \n\n**Pick:** Leibzig to WIN 10€ to win 22.25€\n\n**Write Up:** Three losses in a row... Well this one can't go wrong! Leibzig is on ANOTHER level compared to Gladbach, it will be an easy win to Leibzig and the odds are so great on this one, that we cannot simply let this one go! I have been watching Leibzig games and they are absolutely on fire compared to Gladbach. Leibzig is 2nd of bundesliga and Gladbach is 13th. Even tho they have been playing great games aswell lately, this one will lean towards to Leibzig. Will definently be a match worth to watch!\n\nLet's start our winning streak going!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr78mjj/"
    },
    {
      "created_utc": 1764325692.0,
      "author": "222benz",
      "text": "Record: 0-0\nNet Units: 0.00\n\nEvent: Dota 2 BLAST Slam V | 9:00 AM EST\n\nPOTD: Tundra Esports ML vs Heroic @ 1.625 odds 1u\n\nWrite Up:\n\nTundra is just the better team overall, even though Heroic somehow got a 2-0 win against them recently. I can't see a consistent top-tier team like Tundra dropping to the same opponent twice. The odds at 1.625 are way higher than they should be for Tundra. They're too good not to capitalize on this value spot.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr7455q/"
    },
    {
      "created_utc": 1764320900.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 24-14-1\n\nSoccer\n\nLast Pick: Midtjylland to score @ 1.64 ✅\n\nLast Pick Write Up: A bit more sweaty than I wanted, but we pulled through with a win.\n\nNow for today..\n\nPick: Viborg vs Sonderjyske - BTTS Yes @ 1.56\n\nWrite Up: The odds are not high here, but sometimes it's good to just pick something that looks like an easy winner. Sonderjyske is at 5th in the table with 7W4D5L and 26 goals scored vs 23 conceded. Viborg is at 6th place with 7W1D8L and 26 goals scored vs 24 conceded. Sonderjyske has BTTS in their last 8/10, O2.5 last 5/6 and no clean sheet in last four, while Viborg has BTTS in their last 6/10 and O2.5 in last 8/9. BTTS has hit in their last 8/10 H2H and O2.5 has hit in the last 4/5 H2H.\n\nThis seems like a goal fest, so I'm taking a relatively safe BTTS at 1.56 for my POTD. You can add BTTS + O2.5 goals for 1.8 odds if you want. Viborg hasn't lost in their last 12 H2H so you can even do Viborg/draw + BTTS + O2.5 for 3.25 if you are a degen. 3.6 if you add O6.5 corners (they average about 8 and 9 corners per game). Would not really recommend this 4 leg parlay tho lol.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr6wau9/"
    },
    {
      "created_utc": 1764319329.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 12-6, +4.77u\n\n**Previous Pick:** Switzerland +22.5 spread, 1.74, 1.5u ✅️, (last 5: ❌️✅️✅️❌️✅️)\n\n**Event:** World Cup qualifications: Latvia - Netherlands, 18:30\n\n**POTD:** Latvia -6.5 spread, 1.89, 1.5u\n\nAnother day of World Cup qualifications, today I got stuck on this game, where I'm siding with the favorite and the home team. \n\nWe have already seen how big basketball is in Baltic countries during Eurobasket, so I expect the home crowd to bring something extra from their players. It is Friday evening at the game time, perfect for a full house.\n\nThe players on the list are actually decent, 3-4 played Eurobasket, and others are experienced club players.\n\nNetherlands has a few interesting names, but they lack the height and are going to be too dependent on their threes shooting. Latvia, too, but Latvia has better options under the basket, so they should get plenty of second chances. \n\nTo put spread at 7 is a bit too low, I expect 15+ for Latvia.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr6toij/"
    },
    {
      "created_utc": 1764314465.0,
      "author": "hungyellow1223",
      "text": "Been a lurker and finally ready to give this a go for the first time.\n\nRecord: 0-0\nNet Units: 0\nROI: 0\n\nBasketball | NBA | 6:30pm CST\n\nPick: Kon Knueppel under 7.5 Reb+Assists (+104 at DK) - 1 Unit\n\nWrite Up: When Brad Miller plays, Knueppel becomes more of a shooter. Since Brad Miller has been back for the past 2 games, Knueppel has had 2 and 6 RAs respectively. The only other game Miller played in the regular season 10/22 and Knueppel got 6 RAs.  As long as Ball, Bridges, and Miller are all playing, Knueppel's RA line should be 5.5. It has been inflated with Miller out and some games with Ball out and Knueppel having to be more of a playmaker.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr6lbn8/"
    },
    {
      "created_utc": 1764311602.0,
      "author": "momachti",
      "text": "Record: 0-0\n\nSoccer | Serie A | 2:45pm EST\n\nPick: Como ML (-155 on FD) to win 1U\n\nWrite Up: Feels like a changing of the guard here on this thread recently so as a longtime lurker, I’ve decided to try my hand. Soccer and tennis are the sports I watch the most and am the most knowledgeable about so if this goes well expect my contributions to be made in those sports.\n\nFor our first pick I’ve chosen Como to win at home. Not only are they undefeated in their last 11 they are undefeated at home since May. I’ve been riding this team with some great picks since last season and they have only upped their level under manager (and retired legend) Cesc Fabregas. Most recently, they won away from home against Torino. That game they were priced at +125 and won comfortably in a game that ended 5-1.\n\nComo boasts a solid core with in form defenders Jacobo Ramon and Diego Carlos as well as attacking prowess with Nico Paz and Jayden Addai who’s bagged 3 goals in his last 2 games.\n\nOn the opposite side we have Sassuolo who have been pretty consistently middle of the pack for a few seasons now. Their most recently game was a 2-2 draw with 16th place Pisa who have been struggling. Of note is that they are undefeated away from home in their last four but these results have come against similarly middle of the pack teams or struggling sides. \n\nOverall, Como has conceded only 7 goals in 12 games as compared to Sassuolo’s 14. Expect Como to control the pace of the game and come out on top.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr6g2lp/"
    },
    {
      "created_utc": 1764310395.0,
      "author": "OliveCritical5134",
      "text": "**Record:** 27-18\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅✅✅✅❌❌✅✅✅❌✅✅❌❌❌✅✅❌\n\n**Sport:** ⚽ / English Championship / Oxford City v Ipswich Town (20.00 GMT)\n\n**Net Units/ROI:** \\+23.78u / +19.33%\n\n**Previous Pick:** *Celta de Vigo to win + Celta de Vigo over 1.5 goals @ 2.05 -- 3 units*❌\n\n**Summary:** Unbelievable how Ludogorets turned up for the first time since October.\n\n**Today's Pick:** *Ipswich Town to win + over 1.5 total goals @ 1.86 -- 2 units*\n\n**Write up:**\n\nFriday's pick is always a bit of a tricky one. That being said, there were a few options I was looking at, but we travel to the second level in England for today's pick, specifically: Oxford.\n\nAnd it isn't the home side we are supporting today, because Oxford's season has not been close to what they would have liked: They are caught up in a relegation battle whilst sitting in 21st. Now let's look at their most recent form: If we rank the table purely on results in their last 5 they are also sitting 21st, only getting 3 points out of 5 matches. It's not like there's a big difference in home or away games as they've only picked up 7 points in their 8 home matches this season, scoring only 8 times and conceding 12 times. Cameron Brannagan, one of Oxford's topscorers with (only) 4 goals is out of the running with an injury and missed Tuesday's matchup against Norwich (23rd) that ended in a 1-1 draw. Oxford got away with a point there because of a 95th minute winner, against a relegation side..\n\nNow let's take a look at Ipswich. After being relegated from the Prem last season they are desperately trying to get back up. They are currently sitting in a playoff spot (4th) after a bad start to the season. They haven't lost in their last 5 matches and dominantly dealt with Hull on Tuesday. They have 4 players available that sit on 5 or more goal contributions, compared to Oxford who only have 20-year old Will Lankshear.\n\nAnyone can win against anyone is what people always say about the Championship, but I don't see Oxford winning against Ipswich today.\n\n**Best of luck if tailing!** 🍀\n\n**PS:** If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr6dte5/"
    },
    {
      "created_utc": 1764309034.0,
      "author": "NateTheGreat1004",
      "text": "Record: 26-14\n\nNet Units: +13.49\n\n**Last pick:** Raptors-9.5 vs Pacers L\n\nRaptors went from trailing double digits to leading by double digits. And then they blew that lead right back. Dont know what to say.\n\nPick: **Andre Drummond o12.5 rebounds** | NBA | 7:40 pm ET | (1.91 on FD) (2 units)\n\n**Writeup:** Nets give up 56.2 rebounds per game this season although their last 3 games is a lot lower at 47.0. We have Watford and Edgecomb out who are big rebounders. With Edgecomb out in the last 2 games, he got 24 and 12 rebounds (blowout loss). Drummond will be in the starting lineup and should get big minutes due to injuries. This will help Drummond get to at least 13.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr6b6ca/"
    },
    {
      "created_utc": 1764308801.0,
      "author": "wes2211",
      "text": ">**Record:** 116-97\n>**Net Units:** +25.88 units\n\n>**Curling** | **Canadian Olympic Trials** | **6:30PM EST**\n\n>**Pick:** Team Dunstone +1.5 @ 1.92\n\n>After a 9-5 semifinal win over Saskatoon's Team McEwen at the Scotiabank Centre in Halifax, Team Dunstone advance to the best of 3 final series against Team Jacobs. Dunstone's draws were incredibly precise in the semis and it looks like he's shaken whatever was holding him back earlier in the week after getting a nearly miraculous berth into the semis. Lott is also looking very strong and this final will be a very tightly fought battle. The line on this matchup is a huge overreaction to recent results. Team Dunstone are ranked ahead of Team Jacobs everywhere you look for this season so to get +1.5 with the number two team in the world is huge. Before this event, Dunstone had beaten Jacobs in four straight matchups. I think Dunstone has the better lineup in front of him and each of these final matches should remain very close, regardless of who wins.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr6apjs/"
    },
    {
      "created_utc": 1764308493.0,
      "author": "major-couch-potato",
      "text": "Record: 167-137, +5.81 units\n\nLast Pick: Stefan Kozlov ML vs David Jorda Sanchis (-141, 1 unit)\n\nTennis | Bogotá Challenger | 3:00 PM EST\n\nToday's Pick: Juan Pablo Varillas vs Nicolas Mejia | **Mejia ML at +142 (FD). 1 unit.**\n\nWrite-up: Good win for Kozlov, as he never looked to be in too much trouble. That brought me to **9 wins in a row**, and I'm looking to make it 10 with today's pick! \n\nI don't have a super long write-up for this play, as I had limited time and odds are dropping fast. However, I don't believe that Mejia should be this big an underdog in these conditions. He loves playing on altitude clay (look at my Mejia pick from earlier in the week for more details about that), and has breezed through his opening two matches in straight sets. Juan Pablo Varillas has been slowly building up some momentum after coming back from injury, but he might be low on stamina after making it all the way to the final in Guayaquil last week. Both players have earned similar performance ratings in their opening two matches, and I believe that Mejia's backhand and serve are stable enough to keep up with Varillas's firepower. There isn't quite enough value for this to be a 2-unit play considering the risk involved, but I believe that a fair price for Mejia would be around +110.\n\nNote: The [POTD Capper Tracker](https://potd.lol), which you may remember from its Google Sheet days, is finally back in a cleaner, more robust website format! If you have any questions or suggestions regarding the site, feel free to reach out to either me or u/EthicalGambler.\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/major-couch-potato-xJXnQW?utm_source=mdembed&utm_campaign=major-couch-potato) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr6a3f2/"
    },
    {
      "created_utc": 1764306493.0,
      "author": "Lyx97",
      "text": "Record: 4-1-1\n\nNet Units: +1.72\n\n*Prev Pick : Packers +6 handicap @ 1.51 (1u) --> Win* \n\nCricket | Womens Big Bash League | Adelaide Strikers (W) vs Sydney Thunder (W) | in \\~3hrs\n\nAdelaide Strikers (W) Win @ 1.75 (1u) (if u can, take 0.5u. but i'll be recording it as 1u)\n\nWrite Up: Its a do or die match for the Thunder, needing a win for them to stay alive. But, their team has been over reliant on their top order, as seen in their previous loss. On the other hand, I would still rate the Strikers a pretty decent team & they need to win this to cement their run to the playoffs. Will be close game, but i still favor the Strikers, if their bowlers turn up. \n\nBoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr65zvn/"
    },
    {
      "created_utc": 1764302711.0,
      "author": "PurpleDragonBets",
      "text": "Record: (114-72-11) \\[+20.01\\]\n\nPOTD⭐️:🏈Texas A&M ML (-130) \\[BetMGM\\]\n\nStart Time & TV: 7:30pm EST (ABC)\n\nUnits: 3 Units\n\nReasoning: Collaborating with my brother u/amphetaphene for this play today!! For some Black Friday football action well be going with a SEC rivalry showdown between the Texas A&M Aggies (11-0) and the Texas Longhorns (8-3). The Aggies come into this one with a perfect record so far and they have played well on the road this year with road wins over Missouri, LSU, Arkansas and a very impressive road win in South Bend against Notre Dame. Although having an 11-0 record the Aggies have not clinched a spot in the SEC Championship game yet so they wont be letting off the gas at all in this one. Texas comes into this one with 8 wins and three losses against Ohio State, Georgia, and an embarrassing loss to a poor Florida team. In the Longhorns last game against Arkansas despite winning that game they showed their fatal flaw that has been a problem for them all year which is struggling to stop the quarterback run as Arkansas quarterback Taylen Green averaged over 9 yards a rush before exiting the game with injury so I think the Aggies and Marcel Reed will exploit this weakness as he is an explosive dual threat quarterback and averages over 5 yards a rush and has 6 rushing touchdowns on the year so I see him using his legs against the Longhorns in this one. This Aggies offense is a balanced offense having success in the run and the pass this year, averaging 270 passing yards per game and almost 200 rushing yards per game. They are 10th out of 136 FBS schools in points scored per game with over 38 points scored per game and they face a Texas defense that also has weaknesses in their secondary allowing over 240 passing yards per game but they are good at forcing turnovers. If the Aggies can limit turnovers in this one I see them coming out of Texas Memorial Stadium with a win to solidify a perfect 12-0 regular season. Texas A&M Defense:\n\n* 3,321 total opponent yards (301.9 YPG)\n* 236 points allowed (21.5 PPG),\n* 39 sacks (3.5 per game)\n* 3 INTs (0.3 per game).\n* A&M’s pass rush is elite (top-5 in sack rate at 11.9%), forcing negative plays on 12% of rushes and collapsing pockets quickly.\n* They’ve limited opponents to 183 passing YPG (best in SEC). Weakness: Secondary struggles in coverage without pressure (allowing 6.1 YPA when sacks are missed), leading to just 3 picks despite 56.5% opponent completion rate allowed. Texas Defense:\n* 3,691 total opponent yards (335.6 YPG)\n* 220 points allowed (20.0 PPG)\n* 37 sacks (3.4 per game)\n* 11 INTs (1.0 per game).\n* Texas leads the nation in turnover margin (+8 from INTs alone),\n* They’ve held 7 of 11 opponents under 300 total yards, excelling vs. the run (allowing 3.9 YPC). Weakness: Vulnerable to mobile QBs. Opponents average 85 rushing YPG). Marcel Reed is an elite mobile QB.\n\nPrediction: 30-24 Aggies\n\nLast pick:🏈Chiefs -3💩Whenever the Cheifs needed a stop they just couldnt get one.\n\nBest of luck to everyone tailing and remember to bet responsibly! Super stoked with my first collab play with the college football king u/amphetaphene in this one, hope everyone has a great Black Friday!!🍀💜🐉\n\nhttps://preview.redd.it/jh40w6sr9x3g1.jpeg?width=1088&format=pjpg&auto=webp&s=79891daff5f0edc05896bf56e1139e742aa95ddc",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr5xiph/"
    },
    {
      "created_utc": 1764299709.0,
      "author": "Lumpy-Dentist3891",
      "text": "POTD Record: 2-0-0\n\nLast POTD: **Midtjylland Over 3.5 team corners @ 2.00 1.5U (Bet365)** ✅️\n\nWell, they end up getting 6 corners. I knew all they needed was a first-half goal push.\n\nToday's Pick: **Josh Hart RA Over 12.5 @ 1.74 2U** (Bet365)\n\n**NBA | Bucks @ Knicks** \n\nJ Hart has been quite consistent with playmaking and rebounding when he is given 30+ minutes. And this game will be quite important for the Knicks to clinch the group stage of the NBA Cup. So there will be a lot of playmaking. Knicks also have a good FG% in their last 10 games, with almost 50% of the attempts being on the basket(good for assists). Now analysing Hart stats without OG Anunoby (Should increase his usage and rebound):  \nvs MIA: 5R+9A (14 RA)  \nvs DAL: 10R + 5A (15RA)  \nvs ORL: 5R + 2A (7RA)  \nvs BKN: 12R + 7A (19RA)  \nvs CHA: 8R + 7A (15RA)  \nHit 4/5 of the O12.5 RA\n\nI was originally planning on taking KAT's rebound over, but it is too inflated. Hart has the second-best defensive rebounding record in the Knicks.  Bucks are among the top teams to allow rebounds, so that's an extra information to make the probability of this bet more hittable. GL 🍀.\n\nMy bets are being tracked [here](https://www.potd.lol/handicapper/Lumpy-Dentist3891-T7Acgq). Thanks to the tracking team. \n\nhttps://preview.redd.it/zi905tj2uw3g1.png?width=449&format=png&auto=webp&s=70970693b73b2399bb2ea23612bfcc466763a451",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr5qbid/"
    },
    {
      "created_utc": 1764295277.0,
      "author": "Agitated-Ad3361",
      "text": "Record: 0-0\n\nSoccer | Keuken Kampioen Divisie 🇳🇱 | VVV Venlo vs. ADO Den Haag | 20:00 CET (Amsterdam)\n\nPick: ADO Den Haag -1 Asian Handicap\n+105 @bet365\n 2 units \n\nWrite Up:\n\nADO Den Haag is on fire and are on their way to promote back to the Eredivisie where they belong. In their last 4 games they average 2.8 goals. They have only lost once this season, drew once and won the 14 other games and top the league with 43 points.\n\nThey visit VVV Venlo, who have only won 1 game in their last 5 and lost the other 4. Over their last 5 games they average 0.6 goals, but concede 2.0. They have a lot of issues scoring and concede a lot against mid tier teams with more than 1 goal, that happened 3/5 last games. Now they are playing the best team in the league which are relentless.\n\nLast season in May ADO Den Haag won 1-7 in Venlo.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr5f6yg/"
    },
    {
      "created_utc": 1764295097.0,
      "author": "Few-Radish5584",
      "text": "Record: 2-0\n\nNet Units: +1.47\n\nPrevious Pick: Jake Ferguson O4.5 Receptions  (-134 ✅)\n\nEvent: NFL | Bears @ Eagles | 3:00pm EST\n\n**POTD: Saquon Barkley Anytime TD** (-125 FD)\n\n.5u\n\nWrite Up: I know he hasn’t been himself but I can’t see Barkley missing the endzone for a 4th straight game. Bears allow 5.3 yards a rush and 6.1 yds/play (both bottom 3). He’ll have opportunities and he’s too good not to capitalize. \n\nBOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr5eqr3/"
    },
    {
      "created_utc": 1764294304.0,
      "author": "1234unodostrescuatro",
      "text": "__Record: 17-10__\n\nForm (old to new): ❌✅✅✅❌✅✅✅✅✅❌✅✅✅❌❌✅✅❌✅❌✅❌❌✅✅❌\n\nLast pick: Barcelona +1.5 & LeBron O5.5 ast (-155)❌\n\nGame: Eagles-Bears\n\n__Today’s pick: Jalen Hurts U0.5 INT (-168)__ \n\nAnalysis: My fav prop. We will ride it until the wheels come off and continue to drink the juice. 1 int all year. 2 int in his last 23 reg season games. Eagles run first and Jalen protects the ball when passing hardly ever taking risks.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr5crqd/"
    },
    {
      "created_utc": 1764293016.0,
      "author": "Thooney_Toons",
      "text": "Record:  **5-1**\n\nNet Units:  **+5.8U**\n\nLast Pick:  **Christian Watson o25.5 Longest Reception (-120) 1.2U W**\n\nWhat a great Thanksgiving Day gift from Jordan Love and Christian Watson. A 51-yard TD to seal the deal. We were looking for that one big play and they did not disappoint. That makes 5-in-a-row, let's keep this train rolling!\n\nEvent:  **NCAAF - Georgia @ Georgia Tech, 3:30PM ET**\n\nPOTD:  **Georgia -13.5 (-120) 1.2U**\n\nWrite-Up:\n\nI know that the initial reaction to this line is that the Yellow Jackets should be able to cover 14 points, they are ranked as the 23rd best team in college football. However, they have not had to play a team quite like Georgia yet. \n\nThe Yellow Jackets just had a home game in Georgia against a Pittsburgh team and quickly showed up that when it matters most and the CFP is on the line, they are not up to the challenge. They ended up **losing that game by 14 to a Pitt team** that just got smacked by Notre Dame. Now they go up against this Georgia team that has finally hit their full stride with a **35-3 win over Charlotte** and an impressive **35-10 win over #10 Texas** at the time.\n\nI expect this Georgia team, who might as well have home field advantage in the state of Georgia, to lay 21+ point win against the Yellow Jackets. \n\nLet's continue this streak, huh!\n\n*As always, BOL!*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr59pwq/"
    },
    {
      "created_utc": 1764292764.0,
      "author": "redditusernameuneak",
      "text": "Record: 0-1\n\nPrevious Pick: (NBA) OKC Thunder -8.5 vs MIN Timberwolves ❌ Game ends OKC 113 - MIN 105\n\nEvent: WNBL - Sydney Flames (W) vs Bendigo Spirit (W)\n\nPOTD: Bendigo Spirit (W) -4.5 (1.95 on Bet365) 1.05units for 1unit ✅ Game ends Spirit 80 - Flames 64\n\nWrite-Up: The gulf between WNBL teams are pretty large, and this is #2 vs #6. Spirit have covered this spread in the last 6 meetings against the Flames, most recently was 2 November 2025 (Spirit 88 - Flames 75).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr594a4/"
    },
    {
      "created_utc": 1764292611.0,
      "author": "D0N_L0U1S",
      "text": "Record 16-10 on yt \n\nFirst post on this thread\n\nGame: Lakers - Mavericks 🏀\n\nPick: Max christie Over 10.5 points (-132 fanduel)\n\nReasoning: He’s facing his former team, which ranks 28th in the league at defending spot-up shooters, exactly where Max Christie gets most of his scoring opportunities. He also performs significantly better on the road, averaging 15 points away from home if you exclude the Minnesota game, where he struggled in limited minutes. \n\nLast season, he scored 10 and 11 points in his two matchups against the Lakers, so if you prefer a safer option, you can take his line at 10+ points for a smaller payout.\n\nTo sum it up: he has scored at least 9 points in every game this season except one, he’s in a strong matchup, he tends to play better on the road, and he’s going up against his former team. To me, this looks like an easy over, the books are simply undervaluing Max Christie.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr58qxl/"
    },
    {
      "created_utc": 1764292576.0,
      "author": "SoggyDatabase2348",
      "text": "***POTD Record: 12-7 (+15.36$)***\n\nLast POTD: *Detroit Lions -1.5 -134 (2.50$ TO WIN 1.86$) x*\n\n***POTD: Illinois +3.5 -130 vs. UConn (5.00$ TO WIN 3.84)*** \n\n*Write up: My model says this is the top play for the day. I will always try to get odds that between +100 & -120 for you all.*\n\n*• ⁠Edge is set at +13-14% in favor of Illinois*\n\n*• ⁠Model is showing heavy money on UCONN - I will start paying attention to this because my model gathers the information on public betting - The Lions +1.5 pick, model showed about 80% of the money was on Lions ML, and they lost. This was the first time that it had been that high on my model's top play.*\n\n*• ⁠Model's probability 67% (highest I have seen on the model thus far)*\n\n*BOL!*\n\n***POTD: Illinois +3.5 vs. UConn (5.00$ TO WIN 3.84$)***\n\n*Tips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.*\n\n[*http://buymeacoffee.com/claysmiith*](http://buymeacoffee.com/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr58nvh/"
    },
    {
      "created_utc": 1764292430.0,
      "author": "Ralphjinasseater",
      "text": "Record 9-10-2\n\nLast pick: Anthony Edwards UNDER 26.5 Points ❌\n\n(Rant notes)*at with halftime at 6 points was I  ready to close call it a W for me then with 11 , then 17 before 4 quarter 💀💀💀then those two 3s sealed the deal for me ⚰️\n\nPick of the Day: Jaren Jackson Jr. U 28.5 PRA (-115)\n \n\n• Clippers are the #2 team that allows the\nLEAST PRA from PFs. LAC is also TOP-10 in best defense in Jaren's 3 main plays (Spot Up, Transition, and Post Up).\n• Under in 8/11 games this month (74%).\n• Under in 14/17 games this season, averaging 25.2 PRA.\n• Under in 3/5 games without Morant, averaging 27.8 PRA.\n• The Clippers allow the 9th FEWEST points in the restricted area (22% of his points).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr58b4k/"
    },
    {
      "created_utc": 1764292049.0,
      "author": "DisastrousPurple2339",
      "text": "POTD Record: 3-0\n\nNet Units: +6\n\nLast Pick: Mahomes 250+ passing yards: This pick ended up being a sweat against a recently tough cowboys defense but he got the job done despite taking the loss.\n\nTodays pick- Sacramento Kings vs Utah Jazz- Lauri Markkanen 25+ points (-172 FD)\n\n9:40 PM EST\n\nWrite Up: In this matchup of the NBA cup, the struggling Kings travel to face the struggling Utah Jazz. I was thinking about taking Jazz ml, but I like this pick more due to the fact that Lauri never lets me down. He’s been a little cold as of late which I like because he’s due for a good game, the Kings are also very small in size at the moment, Sabonis is injured and the Jazz have a big lineup compared to them. I expect Lauri to dominate no matter who’s guarding him. I’ve had the hot hand since starting my POTD journey and I don’t expect it to stop here. \nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr57doy/"
    },
    {
      "created_utc": 1764290495.0,
      "author": "dreamchasing1",
      "text": "Record: 228-218 Net Units: -30.87 48-52 on 1.5u plays, 38-40 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Europa League] Crvena Zvezda (Red Star) vs FCSB\nLast pick: BTTS @ 1.80 - 2 Units loss\n\n\nEvent: Soccer/Football, [Serbia Superliga] Cukaricki vs IMT Novi Beograd\n\n\nPick:  BTTS @ 2.00\n\n\nIMT Novi Beograd have never failed to score in this matchup, a BTTS already hit between them earlier this season in a 3-1 win for Cukaricki. Cukaricki at home have managed just two clean sheets, one of them vs Napredak where Napredak had a very early red card, other than that 6/8 home league games hit btts for them this season. IMT Novi Beograd with 6/8 away league games hitting btts. In general both sides have had big majority of their league games hit btts this season -  11/14 for Cukaricki, 11/16 for IMT Novi Beograd.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr53frf/"
    },
    {
      "created_utc": 1764289785.0,
      "author": "pubsubpounder",
      "text": "POTD Record: 1-1\n\nPrevious pick: Green Bay Packers +3.5 ✅\n\nToday's Event: **Nebraska Vs. Iowa 🏈 12 P.M EST**\n\nPick: **Nebraska +7.5 -145**\n\nWrite Up: Nebraska’s better 3rd down conversion rate and much higher total net yards, and you get a team that moves the ball more consistently and is less likely to fall behind by multiple scores. Iowa just doesn’t score enough to blow teams out, while Nebraska has the firepower to answer back. Put together, the numbers paint a simple picture: Nebraska has the tools to stay well within 7.5. while Iowa’s rushing attack is stronger, Nebraska is more balanced overall — they don’t need to rely on one phase to move the ball. Their ability to generate steady yardage on multiple fronts prevents the long scoring droughts that lead to big margins. I’ll take Nebraska in this one.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr51mko/"
    },
    {
      "created_utc": 1764289679.0,
      "author": "Certain-Challenge202",
      "text": "Record: 54-38\n\nLast Pick: Rock ML vs Aspinall\n\nToday’s Pick: Getafe Most Cards v Elche \n\nSport: La Liga \n\nReasoning: Getafe pick up more cards than almost anyone in the league, averaging noticeably higher bookings than Elche, and their low-block, foul-heavy style under Bordalás always inflates their card count. Elche dominate more possession, which forces Getafe into repeated defensive actions, so the most likely outcome is Getafe finishing with more cards.\n\nOdds: 11/10\n\nUnits: 1-2",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr51d06/"
    },
    {
      "created_utc": 1764288902.0,
      "author": "ControlRoyal1768",
      "text": "Record includes Tet pick that lost.\n\nRecord: 25-16 (+24.46u)\n\nLast 10:✖️💰💰✖️💰✖️✖️💰✖️✖️\n\nLast POTD: 🏈 Chiefs vs Cowboys under 52.5 (-110). ✖️\n\nWriteup: 3rd quarter of the game is what I was expecting for around 3/4 of it, unfortunately too much offense in the first half to try to make this plausible.\n\nToday’s POTD: 🏈 Eagles team total under 26.5 (-113).\n\nGame starts at 3pm EST. Bet 3U\n\nWriteup: For the Black Friday game, we have the Philadelphia Eagles hosting the Chicago Bears. In all honestly, I’m all in on the Bears on this one. I think they have a real shot to win this game. I love Bears +7 in this spot, but we are going to deviate slightly with the same thought process as the market is pretty split on the spread, but there is massive support on the total under. \n\nThe Bears offense looks as good as it has all season. They are firing on all cylinders and looks like the have a legitimate game plan and vision, both with the run and the pass. With that being said, the Eagles defense also looks as good as it has all season. This is going to be a huge battle, strength on strength.\n\nThe big difference will be the Eagles offense against the Bears defense. The Eagles offense has no vision, no cohesion, no identity. The fact that Saquon Barkley has shown such little explosion this season is insane. With this, the Eagles WRs, who have a top 3 1-2 punch at the position in the league, have been wildly inconsistent to the point that Devonta Smith is taking over as the WR1 in recent weeks. To top it off, Jalen Hurts has not been playing good football. Put all that together and add on the fact that the Bears are getting back their top defender in Jaylon Johnson, and this spells trouble. \n\nGame script is going to be huge in this one. The Eagles are going to need to find a way to play while having the lead and start running out the clock in the 4th in order to feel even somewhat comfortable. If they start playing from behind, it may start to spiral out of control. In either scenario, I think the Bears defense, who has been top 10 all season, keeps the Eagles in check throughout the game and limit them under 26.5 points. \n\nRemember to only bet what you can afford to lose, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr4zdsr/"
    },
    {
      "created_utc": 1764288590.0,
      "author": "bigtime-operator",
      "text": "Record: 61-48\n\nComo - Sassoulo\n\nPick: Nico Paz Fouls Over (1.5) @ 1.70\n\n\n\nNovember 24, 2025 Torino (Away) 2 Fouls\n\nNovember 8, 2025 Cagliari (Home) 2 Fouls\n\nNovember 1, 2025 Napoli (Away) 2 Fouls\n\nOctober 29, 2025 Hellas Verona (Home) 2 Fouls\n\nOctober 25, 2025 Parma (Away) 3 Fouls\n\nOctober 19, 2025 Juventus (Home) 3 Fouls\n\nOctober 4, 2025 Atalanta (Away) 4 Fouls\n\nSeptember 27, 2025 Cremonese (Home) 3 Fouls\n\nSeptember 21, 2025 Fiorentina (Away) 2 Fouls\n\nSeptember 15, 2025 Genoa (Home) 2 Fouls\n\nAugust 30, 2025 Bologna (Away) 4 Fouls\n\nAugust 24, 2025 Lazio (Home) 2 Fouls\n\n\n\nIn the 2025/26 Serie A, Nico Paz's average fouls committed is ≈2.6/90 min. Sassuolo's wingers (Berardi–Laurienté) and central midfield (Koné, Thorstvedt) are able to draw fouls through dribbling and carrying. For example, Berardi's average foul earning this season is \\~1.7/game. At the team level in the league, Sassuolo's play is characterized by a high concentration of duels and fouls.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr4yked/"
    },
    {
      "created_utc": 1764288309.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p8gqes/pick_of_the_day_112825_friday/nr4xukt/"
    }
  ]
}