{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/10/25 (Wednesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/",
  "target_date": "2025-12-10",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-10T13:47:51.736092+00:00",
  "comments": [
    {
      "created_utc": 1765373129.0,
      "author": "Exception1228",
      "text": "Happy Ned Pepper day!!!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/ntaai7n/"
    },
    {
      "created_utc": 1765370916.0,
      "author": "Donloppa",
      "text": "Record: 2-1\n\nNet Units: +0.8 units\n\nPick: 2 Units to win 1.81 Units.\n           Texas St vs Southern UNDER 140 -110 Bet365\n\nWrite Up: Model shows that as long as Texas St controls this game it'll be a low scoring game. As before this is just a pick from a model I am trialing out. Let's hope it works out.\n\nTail or fade, best of luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nta4t0h/"
    },
    {
      "created_utc": 1765370588.0,
      "author": "lordestros",
      "text": "POTD Record 4-3\n\nFlorida Panthers vs Utah Mammoth at 10:00pm EST (NHL/Hockey)\nFlorida Panthers ML (-115)\n\nStanley cup champions are coming back to form while the Mammoth lost their #1 center long term. Mammoth also lost 4 out of their last 6 home games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nta40t9/"
    },
    {
      "created_utc": 1765364029.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 18-12, +4.51u, (ROI +12%)\n\n**Previous Pick:** Paris to win by 18 or more, 1.86, 1.5u ✅️, (last 5: ❌️❌️❌️✅️✅️)\n\n**Event:** FIBA Champions League: AEK - Levice, 18:30h\n\n**POTD:** AEK to win by 13 or more, 1.80, 1.5u\n\nLevice is the Slovakian top team; they had 11-0 in the league before this weekend, and they lost at home to Komarno. AEK is, let's say, in the top 5 Greek clubs, and they chose to play in this competition, probably with nice incentives from FIBA. They lost 3 of their last 4 games in Greece, all 3 close games against top teams: PAOK, Olympiakos, and Peristeri.\n\nThis evening is a great chance to bounce back and continue a perfect score in this competition. I like the difference in quality, home game, and the current form of both teams.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt9ql0y/"
    },
    {
      "created_utc": 1765360452.0,
      "author": "san_solares",
      "text": "Net Units: +65.25  \nROI: 18.91%  \nRecord: 40-18-10 (W/L/P)\n\nLast POTD: Tottenham Hotspur -1.0 (W)\n\nAs always, full transparency, tracker at the bottom.\n\nToday's POTD: UEFA Champions League - Real Madrid v Manchester City - 15.00 PM EST - Manchester City Team Total O 1.5 Goals (1.90) - 5U\n\nPlayers out for Real Madrid's Defense: Trent Alexander-Arnold, Daniel Carvajal, Eder Militao, Dean Huijsen, David Alaba, Ferland Mendy. \n\nStarting RM Defense: Federico Valverde, Alvaro Carreras, Raul Asencio, Antonio Rudiger. \n\nDon't tell me City is not scoring on this defense at least twice. Xabi is getting fired tomorrow. City should win outright.\n\nBOL, tail responsibly.\n\n[TRACKER](https://docs.google.com/spreadsheets/d/1-PHX-U7eiB5neVpbTJVkzwquGE1KyGVQA5nfejcDT_A/edit?usp=sharing)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt9kekd/"
    },
    {
      "created_utc": 1765359255.0,
      "author": "slickniick26",
      "text": "Record: 4-0 (+4U)\n\nLast Pick: Indiana -15.5 ✅ 1.1 Units for 1 Unit\n\nEvent: Minnesota at Indiana (NCAAB) (4pm Pacific)\n\nPOTD: Purdue -19.5 (-115) 1.15 units to win 1 unit\n\nWrite Up: \n\nJust a one sided affair on Tuesday evening in Bloomington as Indiana absolutely drilled Penn State by 42 in that one.\n\nHeading into Wednesday, I believe we‘re dealing with a similar situation with Purdue as we did with Indiana the previous night.\n\nMinnesota are coming off their best win of the season against the aforementioned Hoosiers this past Saturday in The Barn and will now travel to Purdue. I’m a supporter of Niko Medved after his outstanding job with Colorado State the past few years as he takes over this program in Year 1, but this will be up and down season for him.\n\nOn the other side, Purdue is coming off an embrassing 23 point defeat against Iowa State in their own building. Even though the Cyclones are an elite team that performance by the Boilermakers was shocking. Off a loss, I feel confident they will want to lay the hammer down and showcase to their fans that last performance was an outlier.\n\nMinnesota is also 5-4 with a home loss to San Francisco, a couple neutral site losses and a 23 point defeat at Missouri in their only true road game.\n\nThis is a hefty number, but given the situation this game screams Purdue wins by 25+. I expect Trey Kaufman-Renn and Oscar Cluff to dominate the glass and Fletcher Loyer to shut down the Gopher guards. \n\nBOL and enjoy the games!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt9ifva/"
    },
    {
      "created_utc": 1765358653.0,
      "author": "StoneKoldPlaya",
      "text": "**Record:** 0-1 \n\n**Net Units:** -1u \n\n**Previous POTD:** Inter ML vs Liverpool ❌\n\n**Event:** PSG ML vs Athletic Bilbao (-118) 1.5u \n\n**Start Time:** 3PM EST\n\n**Reasoning:** PSG come into today’s UCL matchup against Bilbao looking like the much sharper side, and the data backs it up. They’ve been rolling lately, scoring five goals against Tottenham in their last Champions League outing and smashing Rennes 5–0 in league play after an undeserved loss vs Monaco, which pretty much sums up how dangerous their attack is right now. On the season, they’re averaging about 2.5 goals per match while giving up less than one, a combo that usually travels well even in tough stadiums like San Mamés. Bilbao, on the other hand, haven’t shown the same punch. They’re scoring under a goal per match on average and their home form has been all over the place. With only four points in the league phase, they’re basically in desperation mode today, which could force them into taking chances that PSG can punish on the counter, which they thrive off of. PSG are missing Ousmane Dembélé who’s out with the flu, but the defending European Champions have proven that they have one of the deepest squads in the world, with plenty of guys able to step up and control the game. Guys like Kvaratskhelia and Vitinha have been stepping up, and the team hasn’t really slowed down in attack even with a few absences. The small bit of history between these sides leans toward high-scoring games, and that favors PSG’s efficiency in front of goal. When you stack up recent form, scoring trends, and overall squad quality, PSG ML makes sense. Bilbao will have the crowd behind them, but PSG are simply the better team, and the matchup tilts their way.\n\nGood luck to all those who tail!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt9hgxu/"
    },
    {
      "created_utc": 1765358562.0,
      "author": "oldpascas",
      "text": "**Record: 6-0**\n\n**Last Pick:** Bayern Munich vs Sporting CP – Bayern Munich -1 Handicap @ 1.72 (3 Units) **W**\n\n**Net Units:** \\+9,88\n\n**Soccer | UEFA Champions League | December 10, 2025 | 21:00 CET / 03:00 PM ET**\n\n**Pick:** Borussia Dortmund vs Bodo Glimt + Club Brugge vs Arsenal - **Dortmund + Arsenal ML @ 1,89 (1 Unit)**\n\nAs I predicted yesterday, the results were mostly not what you would expect, and Liverpool and Chelsea are simply hard to grasp right now. Bayern should have been leading at half-time, but they still put in a convincing performance after the break and gave Phonzy Davies the chance for his comeback.\n\nToday no extensive write-up, value was hard to find. You can take a risk and go for Real Madrid to win at home at odds of up to 2.80 - if Mbappé can play. It's still the Bernabeu and the Champions League, and Man City's defence is still very shaky.\n\nI've chosen a parlay of Dortmund at home and Arsenal in Bruges. The difference in quality is simply too great in these games, which is perfectly shown in xG, xGa and xPoints values. Dortmund are playing solid soccer under Kovac and they need to win here to qualify at least for the knock outs. Arsenal can clinch the round of 16 with a win. Given a draw is also practically enough and they looked somehow vulnerable against a strong Aston Villa side on the weekend, I am still confident that we will see a positive reaction with a slightly rotated squad. Brugge could also score, so over 2.5 goals is fair alternative for this parlay, if you don't feel confident in Arsenal. \n\nMy model predicts a cumulative probability of 60%, resulting in a clear value at odds of around 1.90.\n\n**Please only bet money that you can afford to lose. BOL to all of you!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt9hbpd/"
    },
    {
      "created_utc": 1765351224.0,
      "author": "kab1218",
      "text": "PoTD RECORD: 3-4 \n\nNet units: -1\n\nPrevious pick: Bayern Munich -1.5 ✅\nBayern went down early to an own goal that made it a little sweaty, then decided to decimate Sporting. Moving on. \n\nToday’s pick: LEVERKUSEN v NEWCASTLE O 2.5 + DORTMUND -1 \n1U @ +138 odds\n\nLeverkusen v Newcastle:\nTwo teams that are looking good right now and scoring. Leverkusen just beat ManCity in the competition 2-0 recently, but don’t let that bother you as we all know city are weird this year. Leverkusen are 5/10 in their past 10 games for going over this mark, while Newcastle are 8/10 in covering this in their last 10. I see at least a 2-1 coming from this game, if not more goals. \n\nDortmund:\nThey’re just the better team playing at home, outscoring their opponents 9-4 at home in their last 5 home games. \n\nBOL if tailing",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt94ynk/"
    },
    {
      "created_utc": 1765349700.0,
      "author": "Ralphjinasseater",
      "text": "Record 14-12-2 \n\nLast pick: Jalen Brunson under 6.5 Assists(-105 Bet 365) ✅\n\nPick of the day : Oklahoma City Thunder ML +  Shai Gilgeous-Alexander Over 29.5 Points(-120HR)\n\nReason •  \nsomething simply\nOklahoma City Thunder are  are on a 15-game winning streak, outscoring opponents by an average of 18.9 points per game. They lead the league in forced turnovers (17.8) and points off turnovers (24.6),and  Shai Gilgeous-Alexander is averaging 29.8 points, 5.5 assists and 2.0 (62.5%) 3-pointers made hai is averaging 29.8 PPG this season, has cleared 29.5 in 83% of games, and just dropped 37 on these same Suns two weeks ago ,This is the closest thing to a lock on a two-game slate. since it''s the nba cup shai should play more for the point differential",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt927c7/"
    },
    {
      "created_utc": 1765347805.0,
      "author": "GreenhandDri",
      "text": "Pick: UCL\nManchester City +0 (-150)\nReason- Madrid is coming off a 2-0 defeat to a mid-level team in la liga. Their defense is mostly in reserves and their lineup is mixed up with valverde playing in the back and guler in the middle. City are hot on offense lately and have been scoring plenty of goals. Especially with mbappe out tomorrow I really don’t see madrid doing well offensively or defensivelyz",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8ynog/"
    },
    {
      "created_utc": 1765347242.0,
      "author": "Lumpy-Dentist3891",
      "text": "POTD Record: 6-4-0\n\nLast POTD: **Bam Adebayo O27.5 PR @ 1.86 2U** **(Bet365)** ❌️🪝\n\nLost by 1. Really hate this kind of hook bet. Bam should have stuck to his center position and taken the rebound. In this kind of game, he should have easily gotten 10+ rebounds; instead, rebounds were hugely distributed among guards, resulting in a poor structural game. (Norman and Tyler each had 7 freaking defensive rebounds, not even an offensive rebound). But we move on.\n\nToday's Pick: **Real Madrid Over 4.5 team corners @ 1.72 5U (Bet365)**\n\n**UCL | Real Madrid v Man City**\n\nReal Madrid is coming with a loss from their recent domestic home match. And now they are facing Man City on their home turf. Real Madrid have something to prove to their fans after their tragic loss. And a win here would secure their top 8 position in the league. I expect them to explode here offensively and, in doing so, create a lot of chances and corners.  \nReal Madrid is among the top 3 teams in the league with the highest corners so far. At home, they are averaging 6.71 corners and 71% are above 4.5 corners. In their last 5 games, this has hit 4/5 times, and in their home game, this has hit 3/4 times.  \nGL 🍀.\n\nMy bets are being tracked [here](https://www.potd.lol/handicapper/Lumpy-Dentist3891-T7Acgq). Thanks to the tracking team.\n\nhttps://preview.redd.it/42tij8j19b6g1.png?width=449&format=png&auto=webp&s=e53a24381f5405686df14e8982297e09062f4a90",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8xkhx/"
    },
    {
      "created_utc": 1765347049.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 26-13 (+16.1U)\n\nLast Pick: Sabres @ Oilers over 6.5 (+100) (1U) ✅\n\nWow. With 1 second left. Mcdavid. What an absolute win. Was especially frustrating that oilers were 0/6 on power play but what a comeback. Love to see it.\n\n[Over write up](https://www.reddit.com/r/sportsbook/s/JKrGdi36Pk)\n\nEvent: Wisconsin @ Nebraska (NCAAB) (8pm central)\n\nPOTD: Nebraska ML (-115) (1U) \n\nWrite up:\n\n\nNebraska is primed to beat Wisconsin at home because the Cornhuskers are peaking at exactly the right time, riding a perfect start and fresh off a statement win over Creighton that vaulted them into the national rankings. Their defense has been suffocating, holding opponents to just 45% effective field goal percentage and a mere 30% from three, which is especially important given that both teams love to hoist shots from deep (over 51% three point rate for both teams). Nebraska’s ability to contest and limit perimeter looks stands in stark contrast to Wisconsin, who has allowed opponents to hit 35% from downtown, a weakness that could be exposed in Lincoln. The Huskers showed just how dominant they can be defensively when they held Creighton to only 2 points in the first 8 minutes of their showdown, completely suffocating one of the nation’s most potent offenses. Offensively, Nebraska has found balance with Rienk Mast providing a strong interior presence and Pryce Sandfort stretching defenses with his shooting, while Sam Hoiberg’s energy sets the tone on both ends. Meanwhile, Wisconsin enters this matchup without a true road win, as their only game away from Madison was a neutral-site blowout loss to BYU in Salt Lake City, which was essentially a home game for the Cougars. With Nebraska surging, locked in defensively, and backed by a raucous home crowd, the Huskers have every advantage to extend their streak and prove they are the more complete team right now. Coach hoiberg knows how important this win would be as the huskers look for their first big ten opener win since 2018-19. In what I think will be a closely contested affair for a while I like the huskers to pull out a home win to start their big ten season. As always, cheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8x70x/"
    },
    {
      "created_utc": 1765346638.0,
      "author": "Background_Law8395",
      "text": "Record: 0-0\n\nLast picks: N/A (I know I posted on here months and months ago but I'm not digging through posts to find my old record so starting with a clean slate)\n\nEvent: UEFA Champions League: Real Madrid vs. Manchester City 12:00PM PST\n\nPOTD: Manchester City ML (+125, BET365) 2u\n\nWrite up:\n\nManchester City and Real Madrid have a lot of history in the champions league and all of their games the last 5ish seasons have been pretty hectic. \n\nReal Madrid come off a gruelling 0-2 defeat at home where, even before the red cards, they looked horrendous. They have no Huijsen, Trent, Militao, or Camavinga and Mbappé is listed as doubtful as of right now.\n\nManchester City on the other hand have finally found some form, winning their last 3 games and scoring at least 3 goals in each. I think this game is extremely dependant on Pep and how he lines up the squad for tomorrow. If they play the same team that started against Sunderland, I can easily see a Manchester City victory. If the wingers or midfield get touched at all (specifically if Savio somehow starts over Cherki) I see this game being much closer. \n\nAlthough City haven't beat Madrid in Spain since 2020, the teams this year are very different than the past, and Madrid's injury list is shifted the favour towards City heavily. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8we4z/"
    },
    {
      "created_utc": 1765344176.0,
      "author": "this_guy9",
      "text": "**POTD Record:** 15-13\n\n**Net Units:** \\+2.67\n\n**Previous Pick:** [❌ Zach LaVine o21.5 Points -110](https://www.reddit.com/r/sportsbook/comments/1pgwjii/comment/nswt92j/?context=3)\n\nAlright, we back. And we learned our lesson. LaVine still banned.   \nBetter news, today's Spurs Lakers game looks like a banger.\n\n**🏀 Luka Doncic o17.5 RA -112**  vs the San Antonio Spurs\n\nLuka has been too good lately. Even off a few personal days in Slovenia and the birth of his second child, he goes to Philly and puts up 26 RA.\n\nOverall, he's cashed this line in L4/6 (avg 19.8 over L5) but against the Spurs he's cashed in L6/8 (avg 20.5). \n\nWith Wemby still out, this is the exact type of youth in the Spurs I expect Doncic to bully. The Spurs rank 27th in Rebounds Allowed to PGs and Doncic is still seeing 14.2 potential assists / game.\n\nFull stats if you'd like to do additional research: [https://www.statpick.ai/73630774/luka-doncic-ra](https://www.statpick.ai/73630774/luka-doncic-ra)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8reva/"
    },
    {
      "created_utc": 1765343326.0,
      "author": "UserQAV",
      "text": "**Record**: 1-2 ❌✅❌\n\n**Net Units**: +0.25u\n\n**Event**: UEFA Champions League (Soccer)\n\nReal Madrid vs Man City\n\n**Pick**: Man City to win at 2.25 (3U)\n\n**Write Up**: This will definitely be a tough game for both teams, but Real Madrid have not been good of late. Failing to score in their most previous match in La Liga, their form looks off. Man City is gaining form, and some of their big players are starting to shine in Foden and Cherki. The value of a Man City win here seems too good to ignore.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8pl9g/"
    },
    {
      "created_utc": 1765343076.0,
      "author": "michfanboi",
      "text": "POTD: phoenix suns ATS.. tease a bit if you want",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8p1d0/"
    },
    {
      "created_utc": 1765339008.0,
      "author": "ptrckfrnndz",
      "text": "+.32\n\n8 - 6\n\nSports: Tennis\n\nPICK: ponchet vs rajaonah ML @1.80 5UNITS\n\nTime: ABOUT 8HRS FROM POSTING\n\nReasoning: cant win anything 🫠🫠, consensus pick based on recent form and indoor hard courts played.. hoping to be back on the green. Bol",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8fh57/"
    },
    {
      "created_utc": 1765338919.0,
      "author": "Substantial-Pay-4591",
      "text": "\nPOTD Record 7-3 (+4.19u)\n\nTuesday’s Pick - ✅ Boston Bruins ML +134 vs St Louis Blues\n\nWednesday’s Pick - PSG win and over 1.5 goals -105 (1.05u to win 1u)\n\nI know that PSG will be out a couple of players in this matchup, but this is still a matchup that they can take advantage of shorthanded and they will still want to take 3 points in order to remain in the top 8.\n\nThey’ve scored 19 goals in their 5 Champions League games so far this season, so even without Dembélé I can see them putting up more than 2 in this spot. \n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8f983/"
    },
    {
      "created_utc": 1765337480.0,
      "author": "PurpleDragonBets",
      "text": "Record: (115-76-11) \\[+14.64\\]\n\nPOTD⭐️:🏀Weber State -4.5 (-110) \\[Bet365\\]\n\nStart Time & TV: 8:00pm EST (Midco Sports)\n\nUnits: 3.25 Units\n\nReasoning: Going with the Weber State Wildcats (4-5) over the Kansas City Kangaroos in this Wednesday night college hoops matchup. I like fading the Kangaroos in this spot as they are one of the worst teams in division one college basketball this year as they are 1-8 with their only win being over Evangel University who isnt even a division two or division three school, they are an NAIA school and the Crusaders of Evangel University were actually leading the Kangaroos by four points at the half. In the Kangaroos 8 division one losses this year they are yet to keep a game within 4 points with their closest loss being a 9 point loss at home to Idaho State so I expect them to get blown out of the water again in this one. Kansas City and Weber State have actually already faced off once this year with the Wildcats defeating the Kangaroos 82-61 in a game where the Wildcats controlled from the beginning. The Wildcats have been really solid against the spread this year with a 6-2 record against the spread and they lead the Kangaroos in points per game, points allowed per game, field goal percentage, free throw percentage, rebounds, and blocks per game. I like the Wildcats to handle the Kangaroos just like they did the first time these two squads faced off.\n\nPrediction: 79-69 Weber State\n\nLast pick:🏈Seahawks ML/Buccaneers ML 💩Baker Mayfield playing like was when he was on the Panthers and the Browns\n\nBest of luck to everyone tailing and remember to bet responsibly! Lets turn this around here on and break our cold spell weve been having here on this thread. I hope everyone has a great Wednesday!!😃🍀💜\n\nhttps://preview.redd.it/s1xc6g7oqa6g1.jpeg?width=1170&format=pjpg&auto=webp&s=5ce07fd20c6ecea2154b698e8d4ca35c4ab9189c",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8bkew/"
    },
    {
      "created_utc": 1765337178.0,
      "author": "Elevate203",
      "text": "Record: 8-2\n\nLast POTD: Brandon Ingram o31.5 PRA (-128)✅\n\n**BI came out aggressive and at halftime had 19/4/3. Easy 💰**\n\nForm: ✅✅✅✅✖️✅✅✅✖️✅\n\n\nToday’s Event: Phoenix Suns @ OKC Thunder 7:40 PM EST\n\nPOTD: SGA o31.5 points (-105) FanDuel\n\n(Line will most likely move quickly, again I would watch for live lines in the first half. Would play this up to -120)\n\n\nReasoning: Pretty simple here. MVP caliber players step up big in meaningful games. Cleared 32 in 7/10 games. He’ll be getting to the line all game, and connecting there at 88%. The Suns have been playing well as of late so I see this game being more competitive than the line suggests. Although OKC have been know to separate in the 4th, but I think it stays close enough until late when the Thunder pull away. SGA starts late some games so I would watch the live line here. I’ve been able to snag his over in the first half at like 27,28 for good value. I think he goes off for 36 and down the stretch takes over. \n\nIf anyone wants to support, I’m a student just looking to get by. Appreciate the upvotes and comments for sure! Best of luck to everyone!\n\nhttps://buymeacoffee.com/elevate203\n\nVenmo @Elevate203",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8asda/"
    },
    {
      "created_utc": 1765336511.0,
      "author": "Swimming_Trust_2406",
      "text": "**Record:** 1-1-0 (-1.3 units)\n\n**Last:** **Soccer Parlay : Barcelona v Eintracht Frankfurt (Barcelona -1.5 goals) + Inter v liverpool (Inter and draw double chance)** ❌\n\n**POTD: 1st quarter winner/total parlay (OKC/ Under 57.5)**\n\n**Start Time:** 7:40PM ET\n\n**Odds:** \\+190 (fanduel)\n\n**Units:** 5U\n\n**Reasoning:** OKC has been one of the strongest opening-quarter teams this season — they start games fast, defend aggressively, and usually establish momentum early. They match up well in the first 12 minutes because their starters are high-efficiency scorers and their defensive intensity is higher before rotations kick in. On the other side, this matchup tends to play slower early, with both teams settling into their offense and feeling each other out. That makes the **Under 57.5** a solid complement: OKC can still control the quarter without it turning into a shootout. The combination of OKC’s strong first-quarter track record + a typically paced, lower-scoring start makes this parlay a logical, data-supported play.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt8912o/"
    },
    {
      "created_utc": 1765335360.0,
      "author": "Best_Accountant_5471",
      "text": "Record: 50-33 (+31.4 units)\n\nLast 10 (most recent on right):  ✅❌✅✅✅❌❌❌❌❌\n\nLast Pick: Frederikstad O3.5 team corners vs Viking FK ❌\n\nEvent: EFL Championship ⚽️\n\nPick of the Day: George Dobson (Wrexham) 3+ tackles vs Hull City 1.1 units to win 1U @ 1.90 (Bet365)\n\nWrite-up: It does seem as though I sold my soul to get that 50th win as I’m on my worst streak yet. I would suggest fading me at the moment (which is why I’m also staking small) but I’m here for the love of the game and changing up the strategy. That last pick really riled me up as Frederikstad had 3 corners by the 25th minute… and proceeded to have none more. Well actually they did in the 90th but the ref was somehow the only person in the stadium to not see a touch by the defender and gave a goal kick to Viking much to everyone’s shock (and my anger).\n\nGeorge Dobson should start this game but he’s been dropped on occasion so do pick a book that voids props if the player isn’t starting. He’s a 90 minute man though if he does get the start having played the full match in 14/15 starts so no need to worry about having super-sub (though as a general rule of thumb would recommend it). Dobson is your typical pitbull-type defensive midfielder, he loves to get stuck in to challenges and breaking up play. He’s been averaging 3.4 tackles per match since the start of the season. He’s covered this line in 12 of his last 15 Championship matches (80%), including the last four. Away from home he’s been averaging 3.5 tackles and cleared the line in 7/9 (78%). Midfielders have been averaging 2.5 tackles per 90 vs Hull away from home however it’s important to note that a lot of these players aren’t of the same profile as Dobson and the value is therefore quite high. With Hull and Wrexham only separated by a point and looking to push for the play-off spots already, this could therefore be a feistier encounter than expected as both teams know they could pick up a good win over a rival which is good for this play. BOL !\n\nhttps://preview.redd.it/0g6kfz9dka6g1.jpeg?width=1179&format=pjpg&auto=webp&s=0b35aced534beeb0cea2c3a90df92b0d1524e549",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt85wjg/"
    },
    {
      "created_utc": 1765333982.0,
      "author": "2thyKing",
      "text": "Record: 9-1 (W9) 💩☘️☘️☘️☘️☘️☘️☘️☘️☘️ \n\nNet Units: +12.46\n___\n￼￼￼￼￼￼￼￼Last pick:\n\nAnthony Black OVER 7.5 Reb+Ast ✅🤑\n\nThis one was about as sweat-free as they get 😎 \n___\n\n￼￼￼￼￼￼￼￼Today’s pick:\n\nNBA Basketball 🏀\n\nSan Antonio Spurs @ LA Lakers 10:00PM EST / GMT -5 (23 hours from time of comment)\n\n**Luka Doncic OVER 50.5 PTS+REB+AST (-117 DK) 1 Unit**\n\n￼Write Up: Luka is consistently hitting this line and has surpassed it in his last 8 games. Last month he put up 57 PRA against this same Spurs squad. San Antonio has allowed the 3rd most assists in the NBA over the last 3 games.\n\nComing off a triple double and playing to advance in the NBA Cup bracket should give Luka some additional edge. I might sprinkle a bit on a ladder for 60 PRA as well. Luka seems to genuinely enjoy the competitive aspect of the in-season tournament:\n\n*“I mean, obviously, I’ll accept money. That’s easy, but I never got more than, I think I never got past the group stage,” he admitted. “So, something new for me. I played in Spain, something like this. So, I like it. Just the courts, please.”*\n\nI think we all hate the court paint jobs \n\nBOL\n___\n￼￼Tips, if you’re so inclined:\n\nhttps://buymeacoffee.com/2thy",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt81zsm/"
    },
    {
      "created_utc": 1765333106.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 21-10 (+23.15$)**\n\nLast POTD: NCAAB Michigan -15.5 vs. Villanova -110 (2.50$ TO WIN 2.17$)✅\n\n**POTD: 2 Pick Parlay: UCL Man City vs. Real Madrid O3 Total Goals / NBA Chet Holmgren 20+ Points + Rebounds -104 (2.50$ TO WIN 2.41$)**\n\nWrite up: Wow, Michigan is freaking legit man - I needed that after yesterday's NFL under was a sweat - We move - Model says this is the top play for the day. Well HELLO soccer, the first time that some footy has popped up on the model!\n\n• ⁠Model has Chet hitting this line at 65% - it is to note, that the model did consider a potential blowout, which moved the % to 58%, which I believe is very high\n\n• ⁠Models' projection is 53.8% chance that O3.5 hits in the soccer matchup, 62% for the O2.5\n\n• Model is showing most lines for the soccer match, the O2.5 is set anywhere between, -210 & -255, telling us they are expecting at-least 3 goals\n\n• Model believes that Chet will be able to rack up most of his points and rebounds early in the game, so taking into account a potential blowout, this will help the chances of the 20+\n\n• Model has a % of 57.4% that Chet Holmgren has O26.5 Points + Rebounds - only reason I am not playing this as a straight is because this may be a blowout game\n\nLet's keep rolling.\n\nBOL!\n\n**POTD: 2 Pick Parlay: UCL Man City vs. Real Madrid O3 Total Goals / NBA Chet Holmgren 20+ Points + Rebounds -104 (2.50$ TO WIN 2.41$)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt7zjea/"
    },
    {
      "created_utc": 1765332403.0,
      "author": "SP7988",
      "text": "**Record:** 32-16-1 (+14.43u) \n\n**Last:** (CBB) Illinois -3.5 (1u) - ✅\n\n**POTD:** (CBB) No. 23 Nebraska (+1.5) vs Wisconsin\n\n**Start Time:** 9:00 PM ET (BTN)\n\n**Odds:** -105 (DraftKings)\n\n**Units:** 1U\n\n**Reasoning:** There are few better stories in college basketball this season than the undefeated start put together by Nebraska. \n\nFresh off a 71-50 drubbing of in-state rival Creighton on Sunday, the Cornhuskers (9-0) find themselves one win shy of matching the best start in program history. Additionally, having won 13 straight dating back to last season, a win on Wednesday night would also match the school mark for the longest win streak. Not surprisingly, Nebraska finds itself in the AP Top 25 for the first time since 2018. \n\nA large part of the early-season success can be credited to a pesky defense. \n\nThrough nine contests, the Cornhuskers rank 13th in opponent field-goal percentage (37.9%), 28th in defensive efficiency (0.924) and 47th in scoring defense (67.9 PPGA). Believe it or not, the unit has been even better over the last three outings, holding its opponents to just 62.0 points per game on 35.3% shooting. Take the aforementioned Blue Jays, for example, who shot just 16-of-52 (30.7%) from the field and 8-of-33 (24.2%) from deep while being limited to their fewest point total since January 2024. \n\nThe defense will once again be tested Wednesday night against a very formidable Wisconsin offense. \n\nAlthough the Badgers (7-2) might boast some pretty gaudy offensive numbers—30th in scoring (87.9 PPG) and 36th in offensive efficiency (1.177)—who exactly have they played? Out of the team’s nine opponents, only two rank inside the Top 120 in defensive efficiency (No. 22 TCU and No. 35 BYU). In those contests, Wisconsin’s offense found life difficult, shooting a combined 43-of-119 (36.1%) from the floor and 14-of-57 (24.5%) from the perimeter. Not surprisingly, the team dropped both of those games by double digits. \n\nOn the other end of the floor, things should come a little easier for Nebraska’s offense. \n\nThus far, the unit ranks 66th in scoring (83.2 PPG), 68th in offensive efficiency (1.133) and 74th in field-goal percentage (47.6%). While those numbers aren’t going to blow anyone away, it does pose a difficult task to a middle-of-the-road Badgers defense that ranks 96th in defensive efficiency (0.988), 152nd in opponent field-goal percentage (43.8%) and 158th in scoring defense (73.8 PPGA). Furthermore, in three contests against opposing offenses that rank in the Top 140 in offensive efficiency, those opponents managed to shoot a comfortable 45.6% from the field and 38.8% from beyond the arc against this Wisconsin defense. \n\nThree-point shooting could be the X factor in this one. \n\nThere aren’t many teams who shoot more threes than these two. In fact, both rank in the Top 10 in three-point attempts with the Badgers ranking 5th with 33.0 attempts per game and the Cornhuskers coming in at 9th with 31.9. But while both shoot the three ball at around the same clip—34.8% for Nebraska and 34.3% for Wisconsin—it’s in how the teams defend the perimeter where we will see a difference. The Cornhuskers rank a solid 74th in opponent three-point percentage (30.2%), the Badgers have struggled mightily, ranking 248th in the category (35.1%). \n\nTrust Nebraska to capitalize on Wisconsin’s woeful perimeter defense and get the job done in front of the home fans.\n\nBOL if tailing, and as always, please do so responsibly. One bet should not cause you to crash out.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt7xjls/"
    },
    {
      "created_utc": 1765331700.0,
      "author": "Lyx97",
      "text": "Record: 11-4-2\n\nNet Units: +3.49\n\n*Prev Pick : Barrow vs Tranmere Rovers : BTTS @ 1.73 (1u) --> Loss \\[Got cooked by Barrow. Guys played like utter shite. Ended the 6W streak\\]*\n\nFootball | Champions League | Club Brugge vs Arsenal | in \\~18hrs\n\nArsenal -1 Handicap @ 1.6 (1u)\n\nWrite Up: While i stayed away from the CL yesterday, since i couldnt trust the Chelsea & Liverpool games (for good reason too), Im going to place a bet on Arsenal, who have possibly been one of the best teams in Europe vs one of the whipping boys in Champions league. Should expect them to win quite comfortably. But, due to key player injuries, I'm not sure if they can keep a clean sheet & may concede a goal or 2. So, I'm avoiding the clean sheet stats & going with Arsenal -1 Handicap\n\nNote : My bet means that, if Arsenal win by 1, we get refund. If they win by 2 or more, we get the winnings\n\nHope we rebound from the loss & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt7vkb0/"
    },
    {
      "created_utc": 1765331501.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 204-156\n\nUnits Won: +97.96u\n\nLast Pick: Fire Flux Map 1 ML (-120) vs. FORZE Reload **X**\n\nToday's Pick: **Fire Flux -2.5 Rounds Map 1 (-105) vs. SPARTA** 5u ✅ \n\n**Fire Flux Map 1 ML vs. SPARTA** \n\n* Fire Flux lower seeded team, they will pick their map first\n* Fire Flux in much better form as a team, have won 7 of their last 8 matches\n* SPARTA have lost 4 of their last 6, very streaky/momentum based team\n* Fire Flux 3-0 lifetime h2h against SPARTA, 6-1 in maps overall, 3-0 on their own map pick\n* Fire Flux pick Dust 2, 62% winrate on 24 maps of Dust 2, SPARTA 39% winrate on 23 maps of Dust 2\n* Fire Flux are 3-2 in their last 5 on Dust 2, SPARTA are 1-4 in their last 5 on Dust 2 and 3-10 in their last 13 maps. \n* SPARTA are a really bad Dust 2 team, 43% winrate on CT, 45% on T side, 39% winrate on pistol rounds, been outscored 61-37 in the last month in rounds on the map. SPARTA have a ton of ugly losses and downright blowouts on this map, even worse then FORZE Reload\n* Despite Fire Flux's loss today, they basically lost both pistol rounds (won first but lost the force, these lead to 4 very easy rounds completely free giving a total of 6 rounds overall, they still brought to overtime.\n* Fire Flux 13/15 cover rate on -2.5 rounds on Dust 2 map wins in the L3 months\n* SPARTA 1/14 cover rate on +2.5 rounds on Dust 2 map losses in the L3 months",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt7v06b/"
    },
    {
      "created_utc": 1765328195.0,
      "author": "GeraltDuke",
      "text": "POTD Record: 4 - 2\n\n\nPrev Pick : Eagles @ Chargers Over 41 🔨✅\n\n\nNet Profit : +4.35\n\n\nEvent: NBA |  Spurs @ Lakers | 8.15PM EST\n\n\nPOTD: Lakers -5.5 @2.00 2u to win 2u\n\n\nWrite Up:  \n\n\n\n\nThe matchup tilts heavily toward the Lakers due to both injury context and current form. San Antonio enters this game without Victor Wembanyama, their anchor on both ends of the floor. In the games he has missed, the Spurs defensive efficiency drops significantly, especially around the rim where Wembanyama usually erases mistakes and deters drives. With Luke Kornet still questionable and Jordan McLaughlin out, San Antonio lacks both size and rotational stability, forcing them to rely on smaller lineups that have struggled defensively.\n\n\nThe Lakers, meanwhile, have been trending upward. Even with Marcus Smart out, their core rotation remains intact and has produced more consistent two-way basketball over the last stretch of games. Los Angeles has tightened its half-court execution, improved ball movement, and reduced defensive lapses  all areas where San Antonio continues to struggle, especially on the road.\n\n\nWithout Wembanyama, the Spurs often fail to generate enough stops to stay within striking distance against disciplined offenses. The Lakers ability to pressure the paint, control the glass, and dictate pace becomes a decisive advantage here. This sets up a scenario where LA can build and maintain separation throughout the game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt7lsvk/"
    },
    {
      "created_utc": 1765326084.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 61-29-1 (+71.0u)\n\n__Previous Pick:__ [✅ Illinois -3.5 (-110), 3.3u](https://www.reddit.com/r/sportsbook/s/y59T0hRegy)\n\n__Event:__ NBA: Suns @ Thunder 7:30pm EST\n\n__POTD:__ Collin Gillespie o2.5 3PM (-125), 3.75u to win 3u\n\n*Odds have swung to around -150 overnight. See comment below the post for pivots or Same Game Parlay to potentially pair it with*\n\n__Write Up:__ I find it crazy NBA Hall of Famer Joe Ingles hasn’t had a single NBA POTD in 90 write-up’s. That changes today. The Oklahoma City Thunder (23-1) are heavily favored (by -15.5 points) to continue an 11 game home winning streak when they host the Phoenix Suns (14-10) on Wednesday night, in an elimination game in the Quarterfinals of the NBA Cup. Oklahoma City is coming off a 30 point win over the Utah Jazz this past Sunday. With the win, the Thunder tied their franchise record with 15 consecutive wins. They became the THIRD team in NBA history to start a season 23‑1 or better, along with the 1970 Knicks (23-1) & 2016 Warriors (24-0). What’s even scarier is that their starting five has played zero minutes together so far this season (SGA, Dort, JDub, Chet, I-Hart). To make it to the Semi’s of the NBA Cup they’ll be up against a Suns team that played them close just a little over a week ago on Black Friday with a final score of Suns 119 to Thunder 123. The Suns have played well this year, currently 7th in the Western Conference standings, despite dealing with injuries all year long with Guard Jalen Green having missed 22 games, DBook missing some games, Grayson Allen, as well as others. This has resulted in Collin Gillespie stepping up & instantly becoming one of the Suns most feared weapons.\n\nThe Suns are coming off a huge win at Minnesota on Monday night, without star Devin Booker. He’s been out for more than a week with a right groin strain, but Phoenix head coach Jordan Ott said that he could play on Wednesday. Booker has taken complete control of the Suns since they traded away Kevin Durant in the offseason. Booker is averaging 25 points, 6.7 assists, & 4.3 rebounds per game. What has this cause opposing defenses to do? Double team the hell out of him. __Besides Giannis who is a freak, Devin Booker is getting double teamed at the highest rate in the league, on 21.15% of his touches. Among the Top 10 most double teamed players, he is shooting the least amount when doubled, just 19.12% of the time. He is passing on 60.5% of his touches when doubled, highest rate in the NBA.__ He is getting majority of the attention of opposing defenses & is finding his open teammates. Collin Gillespie has benefited from this more than anyone as he is one of the best catch & shooters in the league. Gillespie, 2018 NCAA Champion at Villanova & 2023 NBA Champion with the Nuggets, went undrafted in the 2022 NBA draft. In his first season in the league with Denver he played just 9 minutes per game averaging 3.6 points. Phoenix signed him last year & his minutes increased to 14 per game & he averaged 5.9 points. Now this year, in his 3rd season, his career has taken off. __Over his last 10 games Gillespie is averaging 18.7 points per game, 4.5 assists per game, 4.2 rebounds per game, & has a 65.5% True Shooting percentage.__ Gillespie is now one of the front runners for the NBA’s Most Improved Player Award, as well as in contention for 6th Man of the Year. But he is likely playing his way out of the 6MOY because he has earned a spot in the starting lineup with his stellar play. Where he has excelled has been behind the 3 point line. Gillespie has become one of the best shooters in the league lately. Just last week he had a Career High 28 points vs the a Lakers, knocking down 8 three pointers. Just 2 games before vs OKC he had 24 points, with 6 three’s made. __Gillespie has made 3+ three pointers now in 9 of his last 10 games, hitting 4+ in 6 of them.__ Where he has been the most efficient has been hitting 3’s at the top of the key. __Gillespie ranks 4th in the NBA amongst Guards over the last 10 games in Three Pointers Made at the top of the key, averaging 3.5 per game (shooting 46.1%). He gets a juice matchup vs the Thunder who are allowing the 3rd most 3PM to Guards at the top of the key over their last 10 games, allowing 6.8 per game. This was evident less than 2 weeks ago vs OKC when he knocked down 6 threes on them. OKC has allowed the 7th most threes in total this season (14.4 per game), while allowing 15.3 in last 3 games.__ Devin Booker’s status is up in the air, but I love this prop either way. If Booker plays, I mentioned earlier he gets doubled a ton & passes to his teammates at the highest rate in the league. __This is great for Gillespie who ranked 1st in the NBA in catch and shoot 3P% (min. 60 attempts), knocking down 51.8%. His 77.6% Effective Field Goal % on catch & shoot shots ranks in the 97th percentile, with his 7 catch & shoot 3’s attempted per game ranking in the 93rd percentile.__ If Booker is out this game, Gillespie will still hit them. He averages 5 Three Pointers Made on 11 Three’s Attempted per 36 minutes without Booker on the floor this season. Regardless he should play at least 26+ minutes. __When Gillespie has played 26+ minutes this season he has had 3+ threes in 13 of 15 games.__ He has proven himself valuable on the court & the statistics prove it. __Collin Gillespie currently ranks 25th in the NBA in Value Over Replacement. To put it in perspective Steph Curry ranks 24th, Jalen Brunson ranks 26th.__\n\nAnother huge factor in this game is this is an elimination game for the NBA Cup. Every game teams advance each individual player makes more money, with the opportunity to make $530k if they win the Cup. Gillespie only made $500k in each of his last 2 seasons before this year. This is a big game for him & I fully expect him to eat their butt.\n\n__Collin Gillespie o2.5 3PM__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial)  [PayPal](https://paypal.me/joeinglesofficial)  [Bitcoin](https://pastebin.com/raw/GEXAsA2S)  [Venmo](http://Venmo.com/mackenzie-botz-1)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt7fm6x/"
    },
    {
      "created_utc": 1765325542.0,
      "author": "Easy_Independence811",
      "text": "POTD Record: 5-26 (HIGH ODDS PLAYER HERE)\n\nFrom oldest to newest: ✅❌✅❌❌❌❌❌✅❌❌❌❌❌❌❌❌❌✅❌❌❌❌❌❌✅❌❌❌❌❌\n\n-19,25 units (translated all dollars to units).\n\nLast pick : A -1 handicap for Middlesbrough vs Charlton Athletic at 4,75 odds ❌\n\nCET 21:00 Football Champions League\n\nToday: Villareal vs Copenhagen to win at 8,5 odds\n\nReason: Something is not right here. Villreal is heavily underperforming in the Champions League and overperforming in La Liga. My guess is they might lose this one on purpose or go with a weaker squad even, since there is no hope of advancing to top 24. La Liga is their top priority here. They might pull a win vs Ajax in the round after, though. Copenhagen on the other hand is doing decent given the squad and their level of play. They are also capable of winning against top teams from time to time. The odds are wrong according to me and should be alot closer. Let's say around 2x for Villareal, draw around 3x and Copenhagen around 4,1-4,5x. This game is closer than it gives the sense of, but the bookies might know something which I don't! This was written on my phone. Good luck everyone.\n\nBookie: Unibet and a 5 unit bet. Gamble responsibly!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt7e01k/"
    },
    {
      "created_utc": 1765325370.0,
      "author": "dreamchasing1",
      "text": "Record: 237-221 Net Units: -24.49 53-54 on 1.5u plays, 38-40 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [UEFA Youth League] Bayern u19 vs Sporting u19\nLast pick: BTTS + Over 2.5 goals @ 1.90 win\n\n\nEvent: Soccer/Football, [Champions League] Villarreal vs Copenhagen\n\n\nPick: Villarreal over 1.5 goals + Both teams to get carded at least once @ 1.72 - 2 Units\n\n\nMust win game for Villarreal who have looked really good at home - in all competitions, they scored at least 2 goals at home in 8/9 games. They now face Copenhagen who are not in great form, especially in away games, they've allowed 2+ goals in their latest 6/7 games in all competitions, in CL they lost 0-2 vs Qarabag and 0-4 vs Tottenham in away games. if Copenhagen want any chances of advancing they probably would like their chances in this game considering their final two games are vs Napoli and Barcelona so that should allow for Villarreal goals. The card line has hit for both sides in 5/5 games and the referee is good for cards as well with him reffing 4 games this season in the CL, giving out 7, 4, 5, 2. Villarreal are also one of the best card generating sides in LA LIGA.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt7di42/"
    },
    {
      "created_utc": 1765324488.0,
      "author": "222benz",
      "text": "Record: 1-2\n\nLast Pick: Execration ML vs Yakult Brothers @ 1.67 odds (1u) ❌\n\nEvent: Dota 2 DreamLeague Season 27 | 6:00 AM EST\n\nPOTD: Team Liquid -1.5 Maps Handicap vs Nemesis | Team Spirit -1.5 Maps Handicap vs 1WIN Team @ 2.32 odds (1.5u) ❌\n\nWrite Up:\n\nOkay, so this parlay is just backing two top tier teams to sweep their opponent. For the Liquid leg, I'm fading Nemesis because they are currently struggling and just went through a roster change, so their team chemistry is likely not 100% yet. Liquid should be able to capitalize on that instability. For Team Spirit, the data is just too strong to ignore they have beaten 1WIN in 5 of their last 6 matchups, and notably, 4 of those wins were 2-0 sweeps. The stats show Spirit handles this matchup well, so I'm banking on them to cover the handicap again.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt7axjq/"
    },
    {
      "created_utc": 1765323834.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 11-7 (Avg Odds +130)\n\n**Previous Pick:** Thiago 1+ SOT (+100) ❌️\n\n**Today's Event:** UEFA Champion's League | Real Madrid vs. Man City (12:00PM PST)\n\n**Pick:** Erling Haaland ATGS and 2+ SOT (+122) 1.0 unit to win 1.22 units\n\n**Write Up:** Hi friends. Back after a week off. We went on a 2 game losing streak, with some major bad luck that Thiago did not start in one of the most baffling lineup decisions of the season. This is always the risk in player props for soccer. **So please always feel free to wait for lineups to be released before making your final decision to tail or fade**. Anyways, we move on. \n\nHuge matchup today as spanish side Real Madrid host EPL Man City in what is likely the match of the week, clash of the titans, insert other hype terms here. Seriously should be a great match. Real Madrid is one of the few non-EPL teams that I follow closely. And they play a very fast game. They shoot a ton, and in turn give up a lot of chances in the form of SOTs and goals. Mbappe is questionable for the match, and if he doesn't play I think they'll be even more aggressive than usual. \n\nHaaland has been on a bit of a downtick, only scoring one goal in his last 5 matches. But, as I've said before, big players show up for big games. For the 5 UCL matches this season so far, Haaland is averaging 1 goal per game, 4 shots per game, and 2.2 SOTs per game. He has also scored in every UCL game he's started (4/4), but did not score in his last match where he only played the last 25 minutes (he still took 4 shots though!). I really like Haaland here in this fast paced match under the lights in Madrid. \n\nTo be clear, this play is Haaland to Score a goal AND also have 2+ SOTs. Feel free to leave off the 2+ SOTs for less risk if you prefer, I just like the value better. \n\nBOL everyone and have a great Wednesday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt791a9/"
    },
    {
      "created_utc": 1765323471.0,
      "author": "MrPunter500",
      "text": "**Record: 6-2**\n\n**Net Units: 2.91 units up**\n\n**ROI: 36.38%**\n\n**Most recent plays**\n\nKorpatsch vs Friedsam - Korpatsch ML @ 1.80 ✅ \n\nKorpatsch vs Rakhimova - Rakhimova ML @ 1.71 ✅\n\nKartal vs Pieri - Kartal Handicap -6.5 Games @ 1.71 ✅ \n\nBassols vs Leonard - Leonard ML @ 2.19 ✅\n\nClose match when it comes to serve percentages but I always felt like Leonard had the advantage and she ended up winning in straight sets. 4th win in a row for us!\n\n**Tennis** | **WTA 125 Limoges** | **11:30 AM (Eastern Time)**\n\nPlays will always be shared as 1 unit for fair record purposes\n\n**Pick:** **Kartal vs Kalinina - Under 19.5 Games @ 1.85**\n\nKartal is here after beating a really weak opponent in the first round by 6-1/6-0, where her level of play was quite high, which might be a sign that she's taking this tournament quite seriously, in order to try to climb some ranking spots before the start of the new season. \n\nKalinina did not play for 6 months before coming into this tournament and beating Deichmann in straight sets in the previous round, which was an expected win. By missing most of the 2025 season, she's now out of the top 150. \n\nWhen it comes to playstyles both players like to be aggressive and dictate the pace of each point, with Kartal being superior when it comes to pace absorption and point construction. Kalinina is considerably taller than Kartal but I don't consider the Ukrainian a better server. In my opinion, Kartal serves much more efficiently, with a disguised toss and decent accuracy. \n\nWith this, I'm expecting a one-sided match, especially because Kalinina hasn't gained much playing rhythm and is yet to face a player with Kartal's quality since her return. The under can work both ways but in summary, this play is focused on Kartal's quality.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt77zxv/"
    },
    {
      "created_utc": 1765322715.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Wednesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt75tdc/"
    }
  ]
}