{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 10/24/25 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/",
  "target_date": "2025-10-24",
  "timezone": "America/Chicago",
  "collected_utc": "2025-10-24T17:13:20.313045+00:00",
  "comments": [
    {
      "created_utc": 1761324024.0,
      "author": "Elegant-Ad-4057",
      "text": "Record : 2-2\nLast pick Vikings +3 🤡\n\nPOTD: spurs -4 \nAbsolutely love them here, wemby is going off , pelicans absolutely suck. Zion looks great this year for once but he’s fumbled year Over year so ya spurs to cover!\n\nBEST OF LUCK TO ALL TAILING",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl5vzp8/"
    },
    {
      "created_utc": 1761322909.0,
      "author": "Initial_Increase_242",
      "text": "Record: 16 - 13 \\[+3.22u\\] Bets are to win 1u unless otherwise stated\n\nLast Pick: 🏈 Both Teams To Make a 33+ Yard FG - MIN/LAC (-125)  ✅\n\nToday's Pick: 🏀 Derrick White 4+ Threes (-136) 2u \\[FD\\]\n\nWhite went 4 of 13 from three in the season opener. The Knicks allowed the Cavs to shoot 46 threes and now they face the Celtics who shot 43 in their season opener. The Celtics are a team that rely on the three ball as well. White should get the volume and I love taking three pointer props when the volume is there.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl5s5s0/"
    },
    {
      "created_utc": 1761321075.0,
      "author": "Fit-Breakfast5005",
      "text": "I know it’s the wrong thread as I can’t find a parlay thread. But here’s an A* parlay\n\nAc Milan\nAlabama ncaa\nAspinall\nAtlanta Falcons \n\nAll begin with A",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl5lvtv/"
    },
    {
      "created_utc": 1761320672.0,
      "author": "Kind_Buffalo_249",
      "text": "Record: 7-4\n\nLast Pick: Ausar Thompson over 16.5 points+assists ✅\n\nToday's pick: Desmond Bane over 21.5 Points+assists\n\nReasoning: Bane is one of the primary ball handlers in this offense and went past this line last game with just his points. He also had 2 more potential assists on top of what he had. In a matchup against the Hawks, who let up 138 last game, Bane should have plenty of opportunities to score and dish. \n\nScottie Barnes and RJ Barrett easily passed this line themselves, and Immanuel Quickley had 21 PA.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl5kh5o/"
    },
    {
      "created_utc": 1761320423.0,
      "author": "owenf10",
      "text": "Overall record: 0-1\n\nLast pick: Porto double chance + Roma ML @1.96 ❌\n\nTodays pick: Milan ML & BTTS: NO @1.90\n\nAC Milan are flying at the top of Serie A with 16 points from 7 games, unbeaten in their last 7 across all comps (6 wins) and keeping clean sheets in 5 of those. At San Siro, they're lethal, scoring 2+ in 6 of their last 8 homes. Pisa are rock-bottom with just 3 points, winless in 7 (4 losses, 3 draws) and failing to score in 5 of their last 6—newly promoted and toothless up front. Milan's quality under Allegri should overwhelm them for a routine clean-sheet win.\n\nBest of luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl5jlzc/"
    },
    {
      "created_utc": 1761320346.0,
      "author": "Romans828Believer",
      "text": "**POTD Record:** 7-2\n\n\n**Last Pick:** Chargers ML + Jefferson 60+ Receiving✅\n\n\n**Event:** MLB Dodgers @ Blue Jays\n\n\n**Pick:** Dodgers ML -150\n\n\n**Writeup:**\n\n\nMy Model Projects the dodgers winning by almost 1.5 runs. Dodgers are 5-1 SU in their last 6 Game 1s and NL faves of –140+ are 9–2 SU in WS Game 1 since 1990. No one can deny how good this team is and how hot they've been. They just swept the best team in the MLB record wise and almost swept the 2nd best team in the NL in the Phillies. They're putting their ace on the mound, Blake snell who has been absolutely insane this post season, being 3-0 with a .86 ERA! The bluejays are pitching a prospect who has been everything but unhittable. The pressure on this kid will be insane facing the best hitting team in the league. The dodgers should lay runs early and often. \n\n\nBuy Me A 🍻\n https://buymeacoffee.com/romans828",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl5jcer/"
    },
    {
      "created_utc": 1761319185.0,
      "author": "BrokenClock9",
      "text": "4-5-0\nDown 3.1 Units \n\nLast POTD: Jordan Mason ATTD +110\nNFL Chargers v Vikings \n\nTime to start fading me but I’ll keep shooting. Vikings looked awful. That OL needs to heal. This one stung. \n\nToday’s POTD: Cal +6.5 @ VT -115\n\nUnits 2.3 to win 2 \n\nData \n\nVT OFFENSE \nTotal 93rd \nPassing 98th\nRushing 65th \n\nVT DEFENSE\nTotal 76th\nPassing 71st\nRushing 79th\n\nCAL OFFENSE\nTotal 105th\nPassing 54th \nRushing 127th\n\nCAL DEFENSE\nTotal 41st\nPassing 51st\nRushing 42nd\n\nGoing to VT is always tough, and coming from the west coast is even tougher but Cal did best BC earlier in the season at BC. \n\nThis bet really is all about cals Defense. I don’t think VT will be able to move the ball very well and this will be an uneventful game. Leads me to take the points and I’m gonna sprinkle Cal ML as well. \n\nCal 20-13",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl5fceb/"
    },
    {
      "created_utc": 1761318825.0,
      "author": "No-Guide2790",
      "text": "**POTD Record 51-29**\n\n**Previous POTD: Michael Page ML ✅** \n\nCash it! Cruised through the first 2 rounds and Cannonier didn't do enough for a 10-8 in the third. Lets go!\n\n\n**POTD: Julius Randle over 3.5 free throw attempts (BET365 1.74 odds)**\n\nNBA: MIN Timberwolves vs LA Lakers\n\nI absolutely love this line.\n\nIn 3 regular season games last year, Randle had 7, 4 and 8 free throw attempts. The 4 attempts was in a blowout game where he just played 24 mins. \n\n\nIn the 5 game series in the first round vs the Lakers of last year's playoffs. Randle played very well and his free throw attempts were 1, 9, 10, 4 and 7. Game 1 was his worst game of the series where he had just 16 pts.\n\nHe also had 4 attempts in game 1 of the year vs Portland who definitely has more bodies to throw at Randle than the Lakers do.\n\nThere is no match up that I like for the Lakers. LeBron probably played him the best in the playoffs, but Randle still went off. Rui, Vando or any other Laker as very little chance of guarding him.\n\nLet's hope he stays out of foul trouble and the game remains competitive.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl5e2xg/"
    },
    {
      "created_utc": 1761318444.0,
      "author": "Valuable-Bad2558",
      "text": "🎯 Record: W–P–L = 31–3–33\n\n📉 Net Units: –11.0\n\n\n\n📈 Recent Plays (L → R):\n\nL–W–L–W–W–W–W–W–W–L–W–W–L–L–L–W–L–L–W–P–W–W–W–W–L–W–L–W–L–L–W–W–L–L–W–W–L–W–W–L–W–L–P–L–L-L\n\n\n\n❌ Last Pick:\n\nAl Hilal (KSA) vs. Al Duhail (QAT)= Al Hilal – Over 1.5 Goals in 1st Half\n\n🟰 Result: Loss\n\n\n\n📌 Today’s Pick\n\n🗓️ Event: ATP Basel\n\n🏟️ Match: Casper Ruud vs Alejandro Davidovich Fokina\n\n🕒 Time: 1:30 PM ET\n\n🎯 Pick: Fokina to win\n\n💸 Odds: 2.50\n\n🎯 Units: 3\n\n📚 Book: DraftKings\n\nAnalysis\n\nBoth players are having a balanced season. They had ups and downs recently but Fokina current form in Basel is back to his best form. I think this is a 50/50 match but I will go with the better odds.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl5cr6m/"
    },
    {
      "created_utc": 1761315715.0,
      "author": "RichPickz1",
      "text": "**PICK OF THE DAY**\n\n**NBA 🏀 | 25/10/2025 📅**\n\n**Record:** 5-7-0\n\n**Net Units:** \\-1.50\n\n**Last Pick:** OKC Thunder -7.5 ❌ \n\n**Today's Pick:** Suns +10.0 vs Clippers (1.90)\n\nhttps://preview.redd.it/61vp5forj2xf1.png?width=1206&format=png&auto=webp&s=829c6dca76f1e7d4bee98f49c268400340ef75ed",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl53dvg/"
    },
    {
      "created_utc": 1761313335.0,
      "author": "bigtime-operator",
      "text": "Record: 40-38\n\n**AGF - Nordsjaelland ⚽ Danish Superliga**\n\nAGF home matches \n\n⛳️ 6-9-9-8-8-6\n\nNordsjaelland away matches\n\n⛳️ 7-7-9-3-6-11\n\nDon't be alarmed by the 11 corners in Nordsjaelland's last match. They faced Vejle, who are bottom of the league.\n\nFredericia leads the league in corners with an average of 5.1. AGF follows with an average of 4.9. When these two teams met, 8 corners were taken.\n\nThis season, AGF and Nordsjaelland faced each other, with 4 corners taken in that match. Last season, 8 corners were taken in the match played at this stadium.\n\nPick: **Total Corners Under 9.5 Odd: 1.65**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl4voxp/"
    },
    {
      "created_utc": 1761310462.0,
      "author": "FrozenStride",
      "text": "**Record:** 4 - 2 *(+2.95units)*\n\n\n*Fantastic result yesterday, $2.15 Odds and they won 0 - 3. Absolutely crushed them.* 🔥 \n\n\n**Todays Pick:** Leeds United - West Ham \n**BTTS - Yes**\n\n\n**Odds:** $1.95\n\n\n**Wager:** 1 unit \n\n\n**When:** 6 hours from post\n\n\n**Why:**\n\n\nBoth teams to score in Leeds vs West Ham makes a lot of sense when you look at how they’ve been playing lately. Leeds are strong going forward at home and usually manage to create a few clear chances, but they’re also not exactly watertight at the back. West Ham however, have enough attacking quality to take advantage of that, and their defence has been shaky all season.\n\n\nTwo struggling teams, not sitting in a good spot on the table but usually have they attacking power to find an opportunity. Both teams are experiencing many BTTS matches. With Leeds at 15/20 and West ham at 10/15 having both teams score in them. Stat wise it tells us this is likely to happen.\n\n\nIt’s one of those games where both sides are desperate for a result, and that usually leads to an open, scrappy match with mistakes and goals at both ends. Leeds should find the net with their energy and pressing, and West Ham always seem to nick one through a counter or set piece.\n\n\nIn short, neither team looks capable of keeping a clean sheet, but both have the firepower to score. Seems like a pretty fair bet for both teams to get on the board in this one.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl4mxi1/"
    },
    {
      "created_utc": 1761306723.0,
      "author": "wes2211",
      "text": ">**Record:** 108-86\n>**Net Units:** +26.99 units\n\n>**Curling** | **Pan Continental Curling Championships** | **3:00PM EDT**\n\n>**Pick:** Japan women -5.5 @ 1.63 vs New Zealand\n\n>Round robin play is wrapping up today at the PCCC. New Zealand started yesterday with a 10-4 loss to China, whose skip was unable to play due to injury. Japan had a dominant 12-2 victory yesterday over Mexico. Fujisawa has covered -5.5 in each of the last three matchups against Becker. Should be an easy cover with this line being a little light.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl4cvgb/"
    },
    {
      "created_utc": 1761301876.0,
      "author": "Moist-Conflict-7850",
      "text": "RodPicks ⚽️\n\nRecord: 32 - 24\n\n\nBet size: 5 units\n\n\nLast pick: Go Ahead Eagles vs Aston Villa & Lille vs PAOK (Villa to win @ 1.47 & Lille or Draw @ 1.18 = @ 1.73) ❌️\n\nToday's pick: Heerenveen vs Breda & Al Ittihad vs Al Hilal (Heerenveen or draw & over 1.5 goals @ 1.45 & Over 2.5 goals on Al Ittihad vs Al Hilal @ 1.42 = 2.05) 🍀\n\n \n\nAnother day, another Moist Conflict! Bad day yesterday, most teams that were supposed to win didn’t match the expectations but that's ok, we keep going.\n\n\n\nPick of the day for today is a combo at odds 2.05\n\n\nToday's combo bet brings together two solid picks with strong data and context behind them. We're backing Heerenveen to avoid defeat while seeing goals against NAC Breda at 1.45, and combining that with over 2.5 goals in the massive Saudi derby between Al Ittihad and Al Hilal at 1.42, giving us combined odds of 2.05. \n\nStarting with the Eredivisie clash at the Abe Lenstra Stadion, Heerenveen comes into this match in impressive form, particularly at home where they've been nearly unbeatable this season. The stats tell a clear story here. Heerenveen has lost just once at home this campaign, giving them a remarkable 6.7% home loss rate, one of the best in their club's history. They've secured two wins, two draws and just that single defeat in five home matches this season, averaging 1.8 goals scored while conceding 1.6 per game at home. The head-to-head record heavily favors the hosts as well, with Heerenveen winning 10 out of 16 previous meetings against NAC Breda, including their last four consecutive victories. In recent form, Heerenveen has won their last two matches and sits comfortably in 11th place with 12 points from nine games.\n\nNow, NAC Breda shouldn't be completely dismissed here. They've actually shown some improvement lately, particularly in their attacking output, having scored in several recent matches and showing better finishing. Sydney van Hooijdonk has been their main threat with four goals, and they've managed to find the net in most away games this season. However, their away form remains a concern, with zero wins in their last four road trips and just one point collected from four away matches overall this season. They currently sit 14th in the table with only eight points, and while they can score, they've also conceded 16 goals in nine matches.\n\nThe goals angle looks solid too. Both teams have been involved in high-scoring affairs this season. Heerenveen's matches have seen over 2.5 goals in 80% of their home games, with both teams scoring in all five home fixtures. NAC Breda's away matches have produced over 1.5 goals in 100% of games, though they struggle defensively on the road. Given Heerenveen's attacking prowess at home averaging nearly two goals per game, combined with NAC Breda's ability to find the net but also their defensive fragility, expecting at least two goals in this match is very reasonable. The double chance covering Heerenveen win or draw protects us against an upset while the over 1.5 goals complements the attacking nature of both sides.\n\n\n\n\n\n\n\n\nMoving to Saudi Arabia, we have one of the biggest fixtures in Asian football as Al Ittihad hosts Al Hilal in what promises to be an explosive encounter. The head-to-head history between these giants is packed with goals. In their last 34 meetings, a combined 108 goals have been scored, averaging over 3 goals per match. Al Hilal dominates this rivalry with 20 wins compared to Al Ittihad's six, but crucially, 80% of recent matches between them have produced over 2.5 goals, and 65% have seen both teams score.\n\nAl Hilal comes into this match in sensational scoring form. They're averaging three goals per game this season in the Saudi Pro League, having netted 15 goals in just five matches. In their last five games across all competitions, they've been absolutely ruthless going forward, with recent results including 5-0 against Al Ettifaq, 3-1 against Al Akhdoud, and 2-2 against Al Qadisiyah. Their away form is particularly strong with four goals per match on the road, and they've scored in every single game this season without fail. With 80% of their matches producing over 2.5 goals and 60% seeing both teams score, Al Hilal brings serious firepower to every fixture.\n\nAl Ittihad's situation is interesting. While they're currently sixth in the table with 10 points, they've actually been scoring well themselves, averaging 2.2 goals per match this season. However, they've been experiencing significant defensive issues, which even led to the sacking of manager Laurent Blanc after a 2-0 home defeat to Al Nassr just recently. Blanc had openly admitted before his dismissal that he was dealing with serious defensive problems, particularly due to injuries in the back line. They've conceded 1.4 goals per game, and at home specifically they've leaked two goals per match in their two home fixtures this season. Their matches have produced over 3.5 goals in 40% of cases, with 60% seeing both teams score.\n\nThe context makes this even more compelling. This is one of the biggest derbies in Saudi football, with Al Ittihad, Al Hilal and Al Nassr traditionally being the three powerhouse clubs fighting for supremacy. These high-stakes matches naturally produce goals, and with Al Ittihad currently dealing with defensive chaos and a new coaching situation, while Al Hilal arrives in blistering scoring form, the over 2.5 goals looks extremely solid. Their most recent meeting in September ended 3-1 to Al Hilal and historically their clashes at King Abdullah Sports City have averaged 4.75 goals.\n\n\n\n\nHeerenveen's home fortress combined with NAC Breda's poor away record makes the double chance safe, while both teams' attacking capabilities support the goals. Meanwhile, the Saudi derby has everything pointing toward goals, from historical head-to-head records to current form, defensive issues for Al Ittihad, and Al Hilal's incredible scoring run. Combined at 2.05 odds, this represents solid value for today's action.\n\n\n\n\n\nPS: Glad to hear so many of you are enjoying the write-ups and making profits from the tips! If any of the picks have helped you out and you’d like to show some appreciation, feel free to drop me a small tip, it keeps the motivation and energy flowing for creating even better content. No pressure at all, the biggest win is seeing people benefit from the work I put in. We win together ❤️  \n\nhttps://www.paypal.me/RodPicks",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl42brl/"
    },
    {
      "created_utc": 1761298162.0,
      "author": "Advanced_Tax5641",
      "text": "POTD Records: 0-0\n\nEvent: NBA Lakers vs Timberwolves\n\nPick: Austin Reaves over 4.5 Free Throw Attempts (1.8 Bet365) 1unit to win 0.8 unit\n\nWolves gave up 35 Free Throws (6th most in the league so far) to the Trail Blazer last game. Reaves cleared this line last game with 10 attempts. Lebron is out again so we will be expecting Reaves to have the ball in his hands more, sharing his usage with Luka and running the offense without Bron he will have more opportunity getting in the paint and be able to draw some fouls.\n\nAustin Reaves over 4.5 Free Throw Attempts",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl3vkxr/"
    },
    {
      "created_utc": 1761295327.0,
      "author": "PurpleDragonBets",
      "text": "Record: (107-65-10) \\[+25.71\\]\n\nPOTD⭐️:⚾️Dodgers F5 ML (-145) \\[ESPN Bet\\]\n\nStart Time & TV: 8:00pm EST (FOX)\n\nUnits: 3 Units\n\nReasoning: Time for some World Series baseball with the AL champions the Toronto Blue Jays and the NL champs the Los Angeles Dodgers. My key factor in this one comes down to the starting pitching as I think the Dodgers have an upper hand in starting pitching in this one. They are starting Blake Snell who has been amazing this year for the Dodgers, he finished his 2025 regular season with a 2.35 ERA, 1.26 WHIP and an opponent slash line of .230/.307/.315. He has performed even better in the playoffs with 3 performances with his last two games being shutouts with only one hit allowed in each game and tallying 19 strikeouts. I think he will out pitch Trey Yesavage who only has 6 appearances this year with 3 of them being in the postseason and he was hit on pretty hard in his last two starts with 7 runs allowed in his two appearances against the Mariners.\n\nPrediction: 3-1 Dodgers F5\n\nLast pick:⚾️Mariners Blue Jays O7.5💩What a tease there in the 8th with first and third nobody out but couldnt get a run.\n\nBest of luck to everyone tailing and remember to bet responsibly! Lets get this World Series started off right!💜🐉\n\nhttps://preview.redd.it/nsidely9v0xf1.jpeg?width=1046&format=pjpg&auto=webp&s=82c38c7cc30d3e94dad35fd04ed2b448c9e35d09",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl3qtyw/"
    },
    {
      "created_utc": 1761293682.0,
      "author": "yeahicreatedsomethin",
      "text": "**Record: 8-5-1**\n\n**S**occer\n\n**Last Pick:** Roma win + Crystal Palace win\n\n**Last Pick Write Up:** They both lost. This is one of those losses that is more funny than frustrating, that's gambling for ya\n\nNow for today..\n\n**Pick:** Soccer - Wuhan Three Towns vs Shenzen Peng City - BTTS Yes @ 1.61 - 1 unit\n\n**Write Up:** In their last 4/5 H2H both teams have scored and both teams are in similar spots in the tables. Shenzen hasn't kept a clean sheet in their last 4 games and Wuhan has O2.5 goals in their last 6/8. Shenzen has 4/5 \"first to score\" stats and Wuhan has 6/8 \"first to concede\" stats. Also, the Chinese league loves goals. I think this is a game where both sides fill find the net. I think this is a statistically sound bet, but as my last pick showed, nothing is guaranteed. BOL, Xi Jinping demands goals",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl3o5kd/"
    },
    {
      "created_utc": 1761289579.0,
      "author": "Vet100",
      "text": "Record: 2-1 \n\nNet Units: +0.68U \n\nTotal Staked: 3U Total Returned: 3.68U \n\nNBA, Spurs v Pelicans\n\nPick: Wembanyama O26.5P @ $1.86, B365 \n\nWrite-Up: I’ve been trying to target markets with less volume (free-throws, fouls & turnovers) and also stay away from the superstars, as these markets with more volume through them should be sharper. However I find it incredibly difficult to stay away from Wemby scoring 27 points. The Pels just gave up 128 to the Grizzlies, and while Ja is good and went 11-14 from inside 2FG range, he isn’t an alien. Wemby is. This is purely a can’t stay away play and I’d be surprised if his line stays at 27 for long, should be 30 in a week or 2. I don’t see how they stop him. \n\nEasily the squarest single bet I’ve made I reckon but I just think I will ride this Wemby train for the foreseeable future until we see real line change. He gets ~20 shots again, with his ability to get close to the basket and make it a certainty, he’s going over 27.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl3hahz/"
    },
    {
      "created_utc": 1761287534.0,
      "author": "Folklore_cardigan",
      "text": "Record: 0-0\n\nNet units: 0\n\nPast Pick: N/A\n\nGame: Celtics @ Knicks 7:30 ET\n\nPOTD: Brunson o29.5pts, +134, 2u->4.7u\n\n\nReasoning: the Celtics are coming off of a shakey loss against the 76ers who had a lackluster performance out of embiid. The main stars of that game were Maxey (40 pts) and Edgecombe (34 pts). While the Celtics perimeter defense of Brown and White have always been above average, they’ve lost a form of their defensive identity after losing Porzingis, Holiday, and Tatum. They’re coming into night 2 at MSG, a notoriously difficult stadium to play in. Although Brunson only scored 23 against the Cavs on opening night, he shot an abysmal 5-18 field goal and 1-9 from 3. This is a far cry from his usual efficiency and I would expect a bounce back game in MSG against a geographical rival. Given that the guards of the 76ers scored so much, a bad first game from Brunson, and a lack of defensive identity from the Celtics. I am hopeful my first pick here will be a success",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl3docb/"
    },
    {
      "created_utc": 1761287020.0,
      "author": "OliveCritical5134",
      "text": "**Record: 7-3**\n\n❌❌✅✅✅✅✅✅✅❌\n\n**Sport:** ⚽ / Azerbaijan PL & Serbian Super Liga / Karvan v Turan & Napredak v Vovjvodina\n\n**Net Units/ROI: +11.27/38.86%**\n\n**Previous Pick:** *Bologna to win(1.70) & Aston villa to win(1.53) @ 2.60 -- 4 units*❌\n\n**Summary:** Villa not being able to win here is something I could never have imagined. Big upset here by Go Ahead Eagles. Buendia missing the penalty ruined the chance for them to get a winner in the last 15 minutes. Bologna was still right so we weren't far off here. Very unlucky here but we move with an early match on the Friday!\n\n***Today's Pick: Turan to win (1.48) + Vojvodina to win (1.85) @ 2.73 -- 3 units***✅\n\n**Write up:**\n\nAfter a midweek of European football where the UCL was more favorable then the EL, the football weekend starts early this Friday! In Azerbaijan the kick-offs are very early for the rest of the world, 12.30 PM my time. Hence why I've posted this pick in the comment section of yesterday's pick beforehand, so everyone could trail this way ahead of time as I post my picks at around 8.30am my time (4 hours before kick-off). Here's the write up!\n\n**Karvan FK v Turan Tovuz:**\n\nKarvan FK are one of the 3 teams in Azerbaijan that are competing for bottom of the league this season. Karvan have only scored 1 goal in their last 6 games. They´ve only managed to win one game so far, and that was against the only team below them, who are also dog in what was a game who could literally conceed the least (3-2). Then if we look at Turan Tovuz, they are competing this year. Sitting 3rd in the league and winning all games against lower sides (their 3 losses were against 1st/2nd/4th) they are looking good enough to beat this Karvan side.\n\n**Napredak v Vojvodina:**  \nNapdredak are bottom of the league in Serbia. They have lost their last 5 games. To check if those losses weren´t undeserved I went through the XG-stats of all those games and they´ve only managed to outperform XG in 1/5 matches. Napredak has only won 1 game this season, And hey, in that specific game their opponent received a red card in the 21st minute.\n\nThen we look at Vojvodina, they´ve only lost twice this season. Both those losses happened to be in their last 5 and I figure that is why there´s a good value on this bet. If we look deeper into those losses what stands out are that they were against teams placed 2nd and 4th and that in both those games Vojvodina received a first half red card! As long as Vojvodina does not get a red card in the first half, and even then, I don´t see them losing or drawing this one.\n\nBest of luck if tailing! 🍀\n\nPS: If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZw](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZw)\n\n**Update:** Hit✅, bounced back from yesterdays lost and won the units back + a bit of profit, lesgoo! Congrats to everyone keeping faith!🍀",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl3cs1m/"
    },
    {
      "created_utc": 1761282526.0,
      "author": "Icy-Road6438",
      "text": "\nPICK OF THE DAY RECORD : 2-0\n\nRECORD ON YEAR : 2-0 (+5 units) \n\nPREVIOUS PICK : Bennedict Mathurin over 18.5 Points (-119)\n\nSUMMARY : Well that one was a layup. Mathurin looked great especially towards the end of the second quarter and he picked up right where he left off and went off in the second half. This cashed before the 4Q!!!! I will say it helped once nembhard was ruled out as it was him and siakam dominating the ball. His odds for MIP surely have to be improved after tonight.\n\nFRIDAY OCT 24 PICK OF THE DAY \n\nEVENT : BUCKS VS RAPTORS (NBA 6:30 PM   EST)\n\nMyles Turner over 21.5 PRA (-110 Hard Rock Bet) \n2.5 UNITS\n\nI always like to look at matchups and this one caught my attention quick. Looking at Turners last game he went over with 24 and had 5 assists which was a bonus he only shot 4/12 and 2/8 from deep which is well under his career averages. If you look at what the bigs from Atlanta were able to do against the raptors you will see why 21.5 is simply too low in my opinion. Kristaps was able to clear his over and this number with 29 as well as jalen Johnson with a whopping 37. Oneyaka Onkungwu also cleared his with 25. Point being the raptors just lack frontcourt depth with Poetl as the only viable big and he tends to foul a lot. Not to mention you have Giannas that can put anyone in foul trouble fast. It is not remotely funny his game logs vs the raptors…he has cleared this line in 9/10!!!! The kicker is the only miss was a blowout where he ended with 21 in 21 minutes. I know this is a different team and Myles turner has not had someone like Giannas on his team that is so shot and ball dominant but simply put this line is ridiculous. Grab it now before it’s at 23.5 before tip. BOL!!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl34gfj/"
    },
    {
      "created_utc": 1761281591.0,
      "author": "haloline",
      "text": "🎯 Pick of the Day (Record: 1–3 ✅❌❌❌)  \n**Previous Pick:** ❌ FC Porto ML (+180)  \n**Event:** ATP Antwerp – Denis Shapovalov vs Fonseca (8:10 AM CST)\n\n**POTD:** Denis Shapovalov ML (-105) — 3.15u to win 3u  \n  \nMissed last one, but we got another one from our tennis expert El TioSharp today. Shapovalov has quietly been in strong form, winning 9 of his last 10 hard-court matches. Fonseca is an incredible young talent and will be a force in the future, but he’s still working through some growing pains against more seasoned opponents.\n\nThis should be a fun match — both players hit big, but Fonseca’s aggressive style still comes with a lot of unforced errors. Shapo’s experience, court coverage, and ability to stay composed in longer rallies should give him the upper hand.\n\nLooking for the vetted player to come through in a spot where experience matters.\n\n**Pick:** Denis Shapovalov ML (-105)\n\nWe need this one to bounce back, and we feel good it will.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl32kan/"
    },
    {
      "created_utc": 1761279435.0,
      "author": "Initial-Tank-9424",
      "text": "**POTD RECORD 4-1 ( +8.6 Unit )**  \n**FORM :** ✅✅❌✅✅\n\nPrevious POTD : Football - AS Roma VS Viktoria Plazen - **Under 3.5 Goals** \\- Odds : 1.59 - UK time 20.00 ( 5 Unit ) ✅\n\nToday's POTD : **Football - AC Milan VS Pisa - Under 9.5 Shot On Target** \\- Odds : 1.61 - UK time 19.45 ( 4.5 Unit )\n\nReasoning : With Milan expected to dominate and Pisa likely spending most of the match defending, the match is expected to be played at a controlled, slow tempo",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl2xw8p/"
    },
    {
      "created_utc": 1761276576.0,
      "author": "yeahhhhhboiii",
      "text": "Record: 8-6, + 10.09u\n\nLast pick: Denver Nuggets ML vs Warriors (+108) 3u ❌ -3u\n\nFucking hell man, Denver really should have had that. Curry’s still Curry, special player. Warriors are a very good team. AG Career high 50 points. He looks incredible—books might take a minute to adjust to the new AG—could be some good prop opportunities in the immediate future. Nuggets as a team too, despite the result, they looked very good. \n\n**POTD** Ausar Thompson 7+ rebounds (+160) 3u\n\nPistons @ Rockets 10/24 6:00PM MST\n\nAusar Thompson has 8 and 9 rebounds for an average of 8.5 in his last two games vs the Rockets. He only played 18 and 23 minutes in those games too. He played 33 minutes in the opener vs the Bulls and pulled in 9 boards. He should see similar minutes here, and his twin brother plays for the Rockets, so good chances he’ll want to show out with his best effort.\n\nHe pulled in at least 5 boards in every preseason game, playing low minutes: 5.5 rebounds in 21 mpg. \n\nHe should play 30+ minutes again, he’s already gotten 9 rebounds in the first game, and he’s averaging 8.5 rebounds against his brother last year on 20.5mpg. \n\nThis line seems straight up mis-priced to me. You can go with 6+ at -125 on FD if you want to be safer or add 5+ at -230 to a parlay like AC Milan ML that works out to around +100 and looks very good, but I’m just going to go with the alt line of 7+ rebounds at +160 on bet365.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl2r6s1/"
    },
    {
      "created_utc": 1761275520.0,
      "author": "whidswhinners",
      "text": "**2025 NFL Record:** 14W - 6L  \n**2025 MLB Record:** 4W - 1L  \n**2025 NBA Record:** 1W - 0L  \n✅✅✅❌✅✅✅✅❌🩼✅✅✅✅❌✅🪝✅✅✅❌✅✅✅❌✅\n\n**Net Units:** \\+8.61 units (I only promote 1u waigers)\n\n**Last Pick:**  Will Reichard - o1.5 Field Goals Made (or Vikings Team Field Goals Made on Bet365) (-115 on Bet365) (Pending)\n\n**Today's Pick:** Franz Wagner - o4.5 Rebounds (-140 on Bet365)\n\n**Writeup:** *I like this play a lot and have it laddered up to 7 rebounds in my Twitter writeup (lower units for 6+ and 7+ obviously.*\n\n*Wagner has cleared in 8 of his last 9 vs the Hawks, which comes out to roughly 6.5 RPG in that span.* \n\n*Atlanta play fast—3rd-fastest pace last season—and they’re right back on the gas to start this year (tied at the top of the early pace board through opening night), which typically inflates rebound chances for wings.* \n\n *We also just watched Toronto out-rebound the Hawks 54–34, with Brandon Ingram (9) and RJ Barrett (8) combining for 17 boards from the wing spots—a blueprint for Wagner’s lane tomorrow.*\n\n *Zooming out, Atlanta were a top-10 team in opponent rebounds per game last season (≈44.2, 8th-most), and several defense-vs-position models had them in the bottom third vs small forwards on the glass (Rotogrinders logged \\~8.1 REB allowed to SFs per game).* \n\n *On Wagner’s side, his typical workload sits in the mid-30s minutes with \\~5.7 RPG last season, and he’s consistently active crashing from the wing—enough that a 6–7 board median in this pace spot feels more than fair.*\n\n*The Hawks allowed the 9th-most rebounds to SFs last year and the 2nd-most to SFs in the Raptors game.*\n\n*Bottom line: fast pace + soft wing glass + proven matchup trend = great line for + money.*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl2ok78/"
    },
    {
      "created_utc": 1761275302.0,
      "author": "Abstract709",
      "text": "POTD Record: 39-40-3 (-4 units / -2% ROI)\n\nLAST PICK: NHL Florida Panthers in Regulation (3-way ML) vs Buffalo Sabres +115  (FanDuel) 1 PM EST - Loss\n\nTODAY’S PICK: MLB Dodgers ML -151 (Pinnacle)\n@ Toronto Blue Jays \n\nPick: Dodgers to Win\n\nStreak (Last 5): LWLLW\n\n5 Unit Play to Win 3.3 Units\n\nWe have best pitching vs. best hitting in this World Series. We all know defense wins championships. \n\nBlake Snell, the Dodgers post season giant is on the mound and he will likely go at least 6 innings. He’s given up 1 earned run in his past 3 starts with 0.86 ERA. Meanwhile, the Jays are starting their rookie fast ball pitcher Yesavage. Yesa has been great, but he burns out after 4 IP. The problem there is the Jays pen has looked rocky as the Rockies were this season. Consistently burning through pitchers. They got away with that with the Mariners just barely, but won’t likely be able to with the Dodgers. \n\nThe series is priced at -200 or shorter and I think this is the best price we get all series with Snell at the mound too and I have to take it even as a Jays fan. Speaking of Jays fans, sports betting is rampant in Canada and 80% of their bets are on the Jays. Part of the reason we are getting a decent price. Good luck and only bet what you can afford to light on fire.\n\nBest,\n\nAb",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl2nznj/"
    },
    {
      "created_utc": 1761273284.0,
      "author": "Flashy-Literature423",
      "text": "Record: 1-0\nUnits: +1.96u\n\nLast 10 Form: ✅\n\nLast Pick: Pascal Siakam Over 20.5 Pts (-102 on DraftKings) Bet 2u to Win 1.96u✅\n\nCashed in a win on what was a pretty sweat free over for Siakam. He started off scorching hot 4/4 shooting in the 1st Q as I anticipated he would facilitate majority of the offensive load for his squad early. Great way to start off the POTD journey on the win column. On to the next!\n\nNBA | MIL Bucks @ TOR Raptors | 6:30PM EST\n\nNext Pick: **Giannis Antetokounmpo Over 30.5 Pts** (-130 on Fanduel) Bet 2u to Win 1.54u\n\nGiannis has been absolutely on fire stemming from last season, averaging 32+ points over his last 10 games and a 37 pt outting last game against Wizards **in just 26 mins.** The Raps defense is shaky inside, and losing Boucher doesn't help their defensive case either. \n\nWith Kevin Porter out with a sprained left knee he suffered in the season opener, **this correlates to some extra usage and playmaking from Giannis** (without their starting PG to help facilitate their offense.)\n\nRaptors also consistently struggle defending high pick n roll actions, Giannis bread and butter offensive system. Milwaukee’s offensive sets are specifically designed to exploit this weakness, with Giannis operating in space where Toronto’s defenders can’t effectively recover. I expect Giannis to have his way against this raptors defense for the point total over.\n\nIf tailing, only risk what you can afford to lose. Bol!\n\n**UPDATE**: Giannis is listed as probable for tonight’s game due to a minor back issue, but all signs point to him suiting up as expected. He carried this same status before the opener, then dropped 37 points against the Wizards **without visible limitations**. As always, monitor for any last minute news, but this appears to be Milwaukee exercising its usual early season caution.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl2ik7v/"
    },
    {
      "created_utc": 1761272183.0,
      "author": "thepeachgod",
      "text": "POTD Record: 0-0 (0 Units)\nPick: Norman Powell o21.5 Points -105 1u (Hard Rock)\nEvent: Miami Heat vs Memphis Grizzlies 8:00 PM EST.\nExplanation: Decided I would try doing this now that the NBA season is back. Will mainly focus on NBA bets but will definitely sprinkle in some NCAAB, UFC and American football picks too.\n\nRemember last year when Norman Powell had a stupidly low line for like 2 months? Well I think this is a stupidly low line. Powell was Miami’s big offseason move and showed it in game 1. Without Tyler Herro he took over his role by leading the team in minutes, shots and points with 36, 19 and 28 each. \n\nMemphis has a pair of high level defensive guards in KCP and Jaylen Wells. I figure that KCP will get the assignment on Powell which should bode better for Norm. KCP has carved out a nice NBA career but he’s the smaller and older option of the two. \n\nIn terms of game script it should be close and high pace. Both teams I figure should be around .500 this year and had top 10 paces in the first game of the season. I figure it to be a close game (within 10) and higher scoring (both teams easily clearing 100+ points) which figures to be very positive. I think Powell gets pretty similar stats to game 1 and the multifaceted scorer should be able to adjust to whatever the game demands he does whether it’s spot up shooting or iso scoring or driving into the lane. \n\nTail if you’d like. Hard Rock easily has the best odds from what I could find right now. I’ll try to post consistently and hopefully we can all make money together :)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl2fiof/"
    },
    {
      "created_utc": 1761272029.0,
      "author": "Iloveyoutooeh",
      "text": "**12–9** Net Units: +8.01U Total Risked: 66U ROI: +12.13% 🔥\n\n[Last pick](https://reddit.com/r/sportsbook/comments/1odlz1o/pick_of_the_day_102325_thursday/nkz6h0m/): FCSB vs Bologna, Bologna ML and most corners 💰\n\n\nthat was nice and easy, 10 corners for Bologna and they dominated the match and got the  result we want\n\nLast 5: ✅❌❌❌✅➡️\n\n⚽ | Italy Serie A | [Time, 21:45 EEST]\n\n**POTD:** AC Milan vs Pisa, AC Milan ML and over 1.5 goals\n\nOdds: [-200/1.5]\n\nUnits: [5U to win 2.5U]\n\n**Write-Up:** Milan is the better team \"top of the league currently\" at home vs last place Pisa that have been terrible so far \"3 points from 7 matches and 3:10 goal difference. last match they played Verona and they failed to register a single shot on target.  I don't see a world where this doesn't hit.\n\n**Only** bet what you can afford to lose, good luck to everyone.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl2f3b0/"
    },
    {
      "created_utc": 1761271444.0,
      "author": "InconsolableBrat",
      "text": "POTD Record: 141-97 | Profit: +86.46u | ROI: 12.7%\n\nSeason Record: 1-1\n\n \n\nLast Pick: Denver Nuggets vs Golden State Warriors U233.5 @ 1.91. 3U. ***TBD***\n\nGame starts at 10pm ET.\n\n \n\nNext Pick: **Julius Randle (Timberwolves) O30.5 PRA @ 1.91**. 4U play.\n\nRandle certainly has a grudge against his former team and always shows up for this fixture. You’ll see him playing with extra aggression: attacking the paint more, grabbing contested boards and taking more shots than usual. He’s over this line in his last 4 games against the Lakers, and in two-thirds of all the games he played last season. It’s expected to be a close game, so I am not worried about a blowout. With near-34 minutes, and a highly motivated and in-form Randle, expect him to go over.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl2dgwl/"
    },
    {
      "created_utc": 1761270478.0,
      "author": "MikeDanTonyBrothers_",
      "text": "Record: 1-2\n\nUnits: -1u\n\nAll bets are 1u\n\nPrevious POTD: Basketball - Pacers v OKC - Andrew Nembhard o6.5A (+113) ❌\n\nCaught the line early. Odds shifted to -150. Has 4 assists in the first half and then gets hurt. Can’t make this shit up. Whatever moving on. \n\nToday's POTD: Basketball - Raptors @ Bucks- Gradey Dick 10+ points (-121)\n\nWrite up: Gradey had 21 points on 14 fga in game one. He averaged 14.4 ppg last year. He’s hit this line in 5/6 vs bucks in his career. He is the Raptors 6th man this year and his only job is to come in and score.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl2as4b/"
    },
    {
      "created_utc": 1761269548.0,
      "author": "major-couch-potato",
      "text": "Record: 148-134, -10.17 units\n\nLast Pick: Mariano Navone to win 2-0 vs Hady Habib (-140, 1 unit): Win\n\nTennis | Costa do Sauipe Challenger | Time TBD\n\nToday's Pick: Juan Manuel Cerundolo vs Gustavo Heide | **Cerundolo ML at -135. 1 unit.**\n\nWrite-up: Two days were fully rained out in Costa do Sauipe, but Habib and Navone were finally able to play today. Navone 2-0 closed around -175, and he ended up mostly cruising to victory. \n\nSimilar angle to the Navone one here. Juan Manuel Cerundolo, younger brother of Francisco, struggled a bit during the hard court season (though he did win a Challenger title during the Asian swing), but his game is much better suited to clay courts. In this season alone, JuanMa has managed to defeat Felix Auger-Aliassime, Alex Michelsen, and Casper Ruud on the surface. His biggest tournament this year in Gstaad came in pretty different conditions to these, as Gstaad sits at a much higher altitude, but he's also found success in lower-altitude SA clay tournaments like Buenos Aires.\n\nIn comparison, Gustavo Heide is also a strong clay player, though his season was disrupted by a long injury break in the middle of the year. He possesses a heavy serve that does a ton of damage on the surface, but I don't feel that he's nearly as adept a grinder as Cerundolo, and his overall results haven't been quite as impressive. Heide certainly comes into this match with plenty of rest having played his first round on Monday, but I honestly think I prefer Cerundolo's situation. Juan secured a fairly straightforward victory over Sebastian Gima, and I feel like he got in rhythm with losing much energy. Meanwhile, I'm not sure how much practice time Heide has gotten since Monday given the rain situation (and the fact that all the R1 were packed into today), and this could be a difficult mental spot for him. \n\nThis is definitely a slightly different spot from the Navone-Habib one, as Heide is a legitimate clay-courter. However, I expect Cerundolo's lefty grinding game to be extremely effective in these conditions, as RealFeel temperatures are expected to climb into the 30s tomorrow, and I feel that he should be a bigger favorite here. \n\nNote: The [POTD Capper Tracker](https://potd.lol), which you may remember from its Google Sheet days, is finally back in a cleaner, more robust website format! If you have any questions or suggestions regarding the site, feel free to reach out to either me or u/EthicalGambler.\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/major-couch-potato-xJXnQW?utm_source=mdembed&utm_campaign=major-couch-potato) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl285ig/"
    },
    {
      "created_utc": 1761268728.0,
      "author": "Geluksspook24",
      "text": "Record: 6-10 ✅✅❌✅️✅️❌❌❌❌✅️❌❌❌❌❌✅️\n\n\nProfit: -3.76 units\n\n\nLast pick: (Feyenoord - Panathinaikos) Feyenoord to win (1.60) ✅️\n\n\nAfter a terrible first half, Feyenoord picked up the pace and showed their class in the second half to record a deserved 3-1 win over Panathinaikos. This means we finally won a bet again!\n\n\n------------------------------------------------------------\n\n\nCompetition: Eredivisie\n\n\nMatch: Heerenveen - NAC Breda\n\n\nStart time: 2pm EST / 20.00 CET\n\n\nPick: Boy Kemper over 0.5 shots on target (odds 6.00 at bookmaker VBet or Bet365)\n\n\nUnits: 1\n\n\nYes we are back with a player prop as I simply cannot ignore the value in this bet. NAC Breda make the trip to Heerenveen for the opening match of round 10 in the Eredivisie. Heerenveen are the favourites, but NAC should not be underestimated. NAC have scored at least 1 goal in all of their last five matches, with a total of 8 goals. They play in the 4231 formation. Boy Kemper, the captain of NAC, plays as a left back. Even though he’s technically a defender, he comes forward quite often on the wing during attack and when there is a corner. Here’s the key stats:\n\n\nIn 9 matches this season, Boy Kemper has shot a total of 10 times, averaging 1.11 shots per 90 minutes played\n\n\nHe shot on target in 5 out of 9 matches this season, averaging 0.56 shots on target per 90 minutes played\n\n\nHe is 2nd on the list of NAC players with the most shots on target (5), only behind forward Mohamed Nassoh, who has a total of 6 shots on target\n\n\nAs he is the captain, he played the full match in all games this season and never got subbed off\n\n\nAccording to these stats and taking into consideration the opponent they play against, the true odds for a shot on target from Boy Kemper should be between 1.80 - 2.50. But bookmakers VBet and Bet365 give us odds of 6.00 (!!!). If you don’t use VBet or if you are banned on Bet365 like I am, then Unibet offers odds of 4.60 for this bet which is still really good value. Other bookies I use price this bet at 2.80.\n\n\nLet’s hope he can have his moment of magic in this match and give us an amazing return on the stake, which we would really deserve after the bad luck we’ve had with player props. I’m not giving up, let’s keep finding the value.\n\n\nGood luck and bet responsibly 🍀\n\n\nI share all this research for free so everyone can benefit. If you want to leave a small tip for the time and effort I put in, I’d really appreciate it :) https://buymeacoffee.com/xgenius_betting",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl25twy/"
    },
    {
      "created_utc": 1761268466.0,
      "author": "VAM89",
      "text": "Record: 12-5\n\nLast Five Predictions (Old - New): ✅❌✅✅✅\n\nNet Units: +14.83\n\nYesterday's Pick: Hvidovre to win vs HB Koge. 3u @ $1.61 ✅\n\nUnfortunately not an easy 7-1 win where we were basically home after 15 minutes. However, I assure you that I could tell who would win 7-1 every day I'd be on my own private beach sipping cocktails and not sharing them on Reddit. \nGood win today though; 3-1 win. \n\nWas a classic game of two halves. We were 1-0 down at half time, and playing bad in some terrible weather. However, three goals in the second half (one of which in injury time, so it felt like a 2-1 more than a 3-1) got us over the line \n\nToday's Pick: Melbourne Victory to win at Newcastle Jets 1u at $2.15 \n\nPick: I don't really have too much that I like a lot in the price range today (I backed Coventry over Watford -.75, then realised that game is tomorrow in the states), so I'm going with a one unit bet that is - and this isn't great to say - largely vibes based because the season in Australia is so new (this is round 2).\n\nNewcastle Jets have been rubbish for years. There's a bit of optimism after they won the biggest cup competition in the country recently, however that ends in the preseason for the A League, so most teams don't really take it too seriously. The ones that do take it seriously definitely aren't match-ready. Proof of this is that there were so many \"cupsets\" over the course of the comp this year.  With semi-pro teams knocking out A League opposition.\n\nYes, Newcastle look better, and there are some really signs. But they just copped three goals to a Central Coast team that is an absolute disaster. \n\nBasically, I think some people are upping Newcastle a tad too much. \n\nVictory had a rough patch last season and their reputation suffered a lot. But they turned it around, and made the Grand Final. \n\nI think Victory have a way better chance at winning this than the price tag says.... But I'm only 1u confident because it's the A League and anything goes.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl253j4/"
    },
    {
      "created_utc": 1761267705.0,
      "author": "Square-Johnson",
      "text": "Record: 8-2 +9.25u\n\nForm: 💰❌💰❌💰💰💰💰💰💰\n\nRecent pick: Martin Schindler to WIN vs Dave Chisnell -148 for 2.3U to win 1.55U. 💰— What a fucking match!!!!! Definitely got lucky!🍀\n\nEvent: DAY 2 PDC Machinesheeker European Championship match at 2:05pm est\n\nPick: James “The Machine” Wade to WIN vs Mike “Small” de Decker at -146 on FD for 2.5u to win 1.7u\n\nWriteup: Alright I was looking at this matchup from the jump. I think we have a statistically balanced matchup but recent form I believe leans in James Wade’s favor. Even if Mike de Decker wins the first throw, Wade has the edge in consistency and experience. He’s been floating around a 94–95 average over the past year, hitting close to 46% on his doubles. He may be getting older but he still knows how to grind out wins on the big stage. Wade’s recent mid-90s averages and calm under pressure, show he’s still got that old-school composure that wins short, tense matches.\n\nMike De Decker’s got plenty of talent and can throw heavy when he’s on, averaging about 94 himself, but his finishing sits lower at around 39%, and he’s been a bit streaky this season. Really just consisting of one good run followed by a few flat games. The head-to-head and odds lean Wade’s way, and in a short best-of-11 format, that experience in closing legs is massive. Unless De Decker finds top gear early. With that being said the odds aren’t great but I’m a big fan of Wade’s swagger and demeanor. I have a feeling Wade will break de Decker and will hold throw.\n\nTrust “The Machine” on his first game in the 2025 PDC Machineseeker Championship.\n\nAs always, BOL, if you have any interest in darts this may not be the Biggest game on the slate but I think it will be profitable… only bet the shmeckles you’re willing to wipe your ass with. let’s keep the streak alive!!!\n\n![gif](giphy|YlRyARavj55JWtL1xn|downsized)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl22yp7/"
    },
    {
      "created_utc": 1761267114.0,
      "author": "milldura",
      "text": "**Record:** 12-3\n\n*Last 10:* ✅ ✅ ✅ ❌ ✅ ❌ ✅ ✅ ❌ ✅\n\n*Units:* 8.73\n\n-\n\n**Previous POTD:** Football - UEL - Feyenoord vs Panathanaikos - Feyenoord H2H (ML) - $1.55 - 2 Units ✅\n\nAfter an extremely rough start that could have seen us down even further, Feyenoord managed to get on top of the game roughly 30 minutes in and never looked back. \n\nFeyenoord pushed to get a late 1st half goal to really restore hope in the game and followed that with a clinical second half that was more to the quality they have played throughout the season.\n\nCruised to a 3-1 victory in the end. 💰\n\n-\n\n**Today's POTD:** Football - EPL - Leeds v West Ham - Under 2.5 Goals - $1.90 - 1.5 Units\n\nThe opening premier league game of the week features 2 relegation candidates. If they are going to offer almost even money for the 2.5 goal line for a West Ham game then I’m happy to take it. \n\nNuno playing away from home is more likely to take the safe approach and stick to his counter attacking football for West Ham. They were gutless moving the ball forward last game.\n\nLeeds have shown defensive capabilities this year too producing a few clean sheets along the way, but have struggled going forward. They were unable to break down somewhat stubborn defence in Burnley (also relegation candidates) last week, failing to score.\n\nLeeds have only registered 6 goals in the league, including an anomaly 3-1 win against bottom place Wolves which gives them 3 goals in their 7 other games.\n\nWest Ham hold an identical scoring record with 6 goals, and 3 of them coming against Forest who funnily enough Nuno was managing at the time before being sacked.\n\nAll of West Ham’s games with Nuno in charge have seen the under 2.5 mark hit. Everything points towards under goals, I just see the right value here.\n\n-\n\n**12 wins in 15 bets**, well done to any followers. No pressure whatsoever, but if you are willing, any help goes a long way.\n\nBuy me a coffee! - https://www.paypal.com/ncp/payment/K4C6AK2VCT9EJ\n\n**Thanks, GL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl219s6/"
    },
    {
      "created_utc": 1761265672.0,
      "author": "dreamchasing1",
      "text": "Record: 214-201 Net Units: -17.94 46-48 on 1.5u plays, 36-36 on 2u plays, 1-1 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Finland Veikkausliiga] TPS vs KTP\nLast pick: BTTS @ 1.90 lost\n\n\nEvent: Soccer/Football, [Spain La Liga] Real Sociedad vs Sevilla\n\n\nPick: Asian total corners over 10.0 @ 2.00 - this is a Push if exactly 10.\n\n\n7/9 games for Real Sociedad have covered this line, 3/4 at home they've been the biggest corner generating side in the league averaging 7.60 for and close to 12 total per game, at home those numbers increase even more. Sevilla have so far covered in 5/9 games, averaging just above 10 total, with that number increasing to 12 in away games. While Sevilla are not the biggest corner generating team, theyve allowed plenty corners in similar matchups to other sides who rack up plenty, such as vs Rayo Vallecano (16 total), Barcelona (13 total).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl1x8cl/"
    },
    {
      "created_utc": 1761265636.0,
      "author": "Moist_Incident_3085",
      "text": "Overall record 17W-10L\n\nUnits: +3.91 (All picks are 1 unit)\n\nLast pick: LaMelo Ball 4+ threes made (-102) ✅\n\nLaMelo cashes for us with a clutch three late in the 4th quarter on his last attempt of the game. Admittedly he was passing more this game than I thought he would due to the Nets occasionally sending double teams on him and then his teammates would never really look to get him the ball back but LaMelo comes through for us in the end unlike Shai in our previous bet.\n\nToday's match: North Texas vs Charlotte (CFB)\n\nPick: North Texas over 41.5 Team Total Alternate Line (-140, Draftkings)\n\nGoing back to college football today, last week we faded Sam Houston State and today we are taking a similar route. North Texas is having an incredible season, they started 5-0 for the first time since 1959 before eventually falling to USF who are currently ranked 18th in the AP Top 25. North Texas leads the NCAA in scoring with a whopping 45 ppg and 42 total touchdowns. Admittedly their scoring is mainly due to their matches outside of the USF game being against weak competition but that should not be a concern because their opponents today are definitely the weakest competition they will be facing this year so far. Charlotte currently ranks 110th in the nation in stop rate standings with a 54.4% stop rate and allows 2.84 pts per drive and have allowed 32 touchdowns on them this year which is in the bottom 10 for touchdowns allowed. With North Texas and Charlotte being on complete opposite sides of the spectrum on offense and defense I'm trusting in the Mean Green to get the job done today with an alt line that would cover exactly 6 touchdowns. BOL and bet responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl1x4q6/"
    },
    {
      "created_utc": 1761265559.0,
      "author": "mvpeav",
      "text": "***Updated with 10/23 results\n\nRecord: 5-2\n\nWeek 8: ✅️✅️✅️✅️\n\nWeek 9: ✅️❌️❌️( Rashod Amos o30.5)\n\nProfit: 2.8\n\nPOTD: Cal +5.5 (Cal @ VT, College Football, 7:30pm)\n\nReasoning: Cal has proven to be good (not great team) while VT has proven to be anything but. Cal is coming off a close win to a bad UNC team so that have something to prove going into the BYE Week.\n\nOut of the 1000 simulations, Cal covers the current line of +5.5  in 68%.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl1wx0x/"
    },
    {
      "created_utc": 1761265475.0,
      "author": "Certain-Challenge202",
      "text": "Record: 41-30\n\nLast Pick: MVG win v Nijman \n\nToday’s Pick: Wade win vs De Decker\n\nSport: Darts, European Championship \n\nReasoning: Wade’s finishing remains one of the most efficient on tour, consistently above 40%, which is decisive in short races. De Decker scores well but lacks Wade’s control and composure on doubles. \n\nOdds: 4/6\n\nUnits: 2",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl1wp0g/"
    },
    {
      "created_utc": 1761265474.0,
      "author": "Diamondhf",
      "text": "POTD Record: 14-7\n\nNet Lifetime Units: +24.92\n\nLast Pick: [Maryland ML] LOSS\nhttps://www.reddit.com/r/sportsbook/comments/1o9eizo/comment/nk5x1zp/?context=3&utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button\n\nPretty annoyed at myself for the Maryland play. Maryland ended up covering the +3.5 but did not hit the ML. I think I had the correct  read, just tried to get too cute with it and ended up paying for it. We move onto the next pick.\n\nPOTD: Cal +5.5 -112 4u to win 3.89\n\nCalifornia Golden Bears @ Virginia Tech Hokies. Lane Stadium, Blacksburg, Virginia. 7:30pm EST Kickoff.\n\nThis line is a headscratcher. You’re telling me a 5-2 team is 6 point dog against a 2-5 team? It really piqued my interest so I did a deep dive on both programs and tried to understand what the hell Vegas is seeing.\n\nSTATS SECTION:\n\nAccording to nearly every power rating computerized system, this game should be a Cal lean on a neutral field. Sagarin rating has Cal as the 77th rated team in the country with a rating of 67.74. Their recent metric is sitting at 65.77. ESPN SP+ has them rated as the 75th team in the country with an overall rating of -2.3, offensively at 97th in the country with a 23.0 rating, and 59th in the country at 25.3 defensively. Their Resume SP+ is -39.9, 63rd in the country. PFF has them at 78.1 overall rated, offensively 68.5, defensively 84.5.\n\nVirginia Tech is the 76th rated team in the country per sagarin with a rating of 67.99. Their recent metric is sitting at 66.53. ESPN SP+ has them rated as the 91st team in the country with an overall rating of -5.7, 91st in the country offensively att 23.6, and 88th in the country at 29.6 defensively. Their Resume SP+ is 109th in the country at -62.2. PFF has them rated at 74.5 overall, offensively at 64.5, and defensively at 77.0. \n\nIn nearly every metric that I care about, Cal either matches VA Tech, or beats them handedly. Cal is the better team in a lot of statistical metrics, and both are just as undisciplined, in the bottom quartile of penalties in their last three matchups.\n\nI’m not in love with stats, but Vegas is, which makes sense why they’re giving Cal 5.5 points on the road. Their computers likely indicate a pick’em, typically a road team gets a 2.5 point bump, and I’m assuming a cross country road trip is worth an additional 2 points. \n\nEYE TEST:\n\nDefensively, VA Tech gave their most recent opponent, Georgia Tech ZERO struggles offensively. Georgia Tech is rated highly and run an untraditional offense with a lot of strange run sets that are difficult to scheme against. Georgia Tech had 0 notable negative plays that weren’t turnovers, and were effectively able to do whatever they wanted on the ground, scoring 35 points. G5 Old Dominion beat the piss out of VA tech, throwing for  nearly 300 yards, and rushing for 250, averaging 8.5 YPP. Both teams notably have running QB’s. Offensively they operate successfully in the run game by handing the ball off to Terrion Stewart, who is liable to cut loose for a 25 yard gain on any given play, or in the pass game by getting lucky with blown coverage. Their receivers can’t catch, can’t run routes well, and the line doesn’t block well in pass pro. Don’t gift VA tech a wide open receiver in off coverage and contain the RB and you’ll be in great shape to win against Tech.\n\nCal’s key to victory? Score 21 points. 3 touchdowns. That’s all they need. I’m not worried about their defense, it doesn’t take an elite defense to stop this VA Tech team. (It does help that Cal has a pretty good defense, rated in the top half of the ACC.). Cal has scored at least 21 points in all but one game this year. In watching their game against Minnesota and having a really good understanding of Minnesotas defense, they operated very successfully in both phases. Passing the ball is their strong suit, and their QB is very precise, manages the pocket well (not the cleanest of pass pro’s by any stretch of the imagination but he handles it well), and receivers get open. I’m extremely impressed in his discipline of diagnosing coverages and hitting the pockets in zones. Receivers aren’t great playmakers by any means, but they catch the ball well and sit down in routes well.\n\nINJURIES:\n\nVA Tech’s #1 contributor offensively is listed on the injury report, Terion Stewart. He’s currently listed as probable but if he’s not ready to go, I don’t think VA tech has a glimmer of hope.\n\nTL:DR:\n\nI think 5.5 is a lot of points to give Cal. At the end of the day, records DO matter, and teams that consistently win ballgames are better than teams that don’t (Duh). This may be a matchup that is relatively similar on paper, but Cal has the momentum and history to prove they’re a better team than Tech this year. One of Tech’s two wins on the year comes from a team called Wofford. I don’t know where the hell Wofford is, and I know damn well if 50% of your wins come from schools that nobody has ever heard of in week 9, you’re NOT a good football team. Their only other win came from NC State, which was a 2 point win.\n\nCal is the better team. I’m sprinkling a little bit of the ML, and definitely taking Cal + the points in this matchup.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl1wous/"
    },
    {
      "created_utc": 1761265427.0,
      "author": "CeaselessAction",
      "text": "Overall Record: 11-4\n\nUnits: +12.45 units\n\nForm: ✅✅✅❌✅✅✅✅✅❌✅❌✅✅❌\n\nLast Pick\n\n2 Leg Parlay // Justin Jefferson 60+ Receiving Yards✅ + Minnesota Vikings +10.5 (Alt Spread)❌\n\n(-135 on Bet365) - 3.5u to win 2.59u\n\nLoss  // -3.50 units\n\nSummary: \n\nWell, there isn't a whole lot to say about that one. That was just an all around awful game by the Vikings. They were out coached, and outplayed on both sides of the ball. After watching nearly all of their Eagles game last week, it was a completely different team that came out last night. They couldn't run the ball, because they couldn't block. They couldn't pass because they couldn't block. When they blocked, Wentz held the ball for too long. It was a mess. For a team that at least put up a fight against the Eagles last week, the Vikings simply laid down last night. Always unfortunate when a game isn't even competitive. I'll take a loss when its a competitive game, but that was a complete blowout from the jump.\n\nToday is a new daw folks and this is long term game we're playing. Apologies to anyone who followed me onto the Vikings last night.\n\nOn to the next💰\n\nFriday’s Pick\n\nItalian Serie A\n\nAC Milan v. Pisa (1:45 PM CT)\n\nStraight  // AC Milan Win to Nil \n\n(-117 on Fanduel) - 3u to win 2.56u\n\nAlright alright alright. I jumped back and forth about 50 times writing this as to whether I wanted to add one more leg and rock a 2-leg Football+Futbol parlay or keep it to one. Ultimately, I decided that I will keep it simple for today’s pick and not give the anti-parlay purists any ammunition /s. If you are interested in the 2-leg parlay that I’ll be taking with this pick and a football pick, feel free to shoot me a DM and I’ll send it over! I’ll probably toss a unit on that and drop this straight bet from 4u to 3u.\n\nAfter an odd day of Europa League matches where we saw a ton of favorites stumble (which was preceded by a bunch of favorites winning in CL the two days before), I am headed away from Football and am moving back to the pitch for some Futbol. We are headed to Italy for a beautiful night game at the Stadio Giuseppe Meazza in Milano. AC Milan is playing host to Pisa, and according to every data point out there, the home team *should* cruise here. \n\nAC Milan sits atop the Serie A table through 7 games in which they have collected 16 points and are 5-1-1. They are one point above a three team, 15-pt tie of Inter, Napoli, and AS Roma. So far this season AC Milan has played exceptionally well, scoring 11 times and only conceding 4 times. Those 4 goals have come against Napoli (1), Fiorentina (1), and Cremonese (2). The Cremonese match is their only loss this season, and was on matchday 1. Their form has been tremendously improved since that loss, with their only draw coming away against Juventus (0-0). They have held a clean sheet in 4 of 7 matches (including the Juve match) and all of those games have been against teams a fair bit stronger than Pisa. Serie A table leaders on 4 days of rest, at home, against the Serie A bottom dwellers. What’s not to love? Give me AC Milan to take this one.\n\nFor the second portion of this straight bet, we are looking at AC Milan to keep a clean sheet and see zero goals conceded to Pisa. I kind of hate these bets because you are watching the whole match for something to not happen, which is way worse than waiting for something to happen (in my opinion). Nevertheless, I think there is good value in the win to nil bet here.\n\nSince AC Milan’s loss in their first match, they have only conceded 2 goals in 6 matches, and those were to a more formidable Napoli side and a Fiorentina team who has also netted against Napoli and Roma. Pisa on the other hand has only scored 3 times through the first 7 matches of the season, and have gone their last 4 matches without scoring. They have only got on the score sheet in 2 matches so far this season and against one of the top defenses in Serie A, there is good value on Pisa to go another match without a goal.\n\nBest of Luck to those who tail, as well as those who don’t! Please make sure to bet responsibly and only bet what you can afford to lose.\n\nI generally spend a couple hours a day combing through as much action as possible from across the world, in order to find value. I do have my own bankroll behind all my picks, but if you are feeling generous, any tips will just go towards enjoying a cold, 22 oz lager at the bar down the street (they're only $4.50 each during happy hour).\n\n[Sponsor a cold, 22 oz 🍺](https://buymeacoffee.com/ceaselessaction)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl1wk6o/"
    },
    {
      "created_utc": 1761264949.0,
      "author": "SorryIdea1714",
      "text": "POTD Record: 0 - 1 \n\n\nPrevious Pick : Feyenoord ML vs Panathinaikos + Crystal Palace O1.5 vs AEK Larnaca @2.05 ( 3u ) ❌\n\nCant believe Crystal Palace sell us out , literally lost against team with wifi password name\n\nNet Units / Profit : -3.15u\n\n\nEvent: Serie A & Saudi Premier League \n\n\nPOTD: AC Milan ML vs Pisa + Al Ittihad vs Al Hilal BTTS @1.86 ( 2u ) \n\n\nWrite Up: \n\n\nLets keep this short.\n\n\n- 1.Milan are in strong form at home: in recent matches they’re averaging ~2 goals scored per game and conceding under 1. Pisa are struggling: hardly any wins, very low goal-scoring output, especially away from home. \n\n\n- 2. Both teams are strong offensively in recent form (particularly Al Hilal) so the scenario where BTTS will hit its gonna happen. BTTS occurred in 6 of the last 8 matches. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl1vajk/"
    },
    {
      "created_utc": 1761264836.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oejhku/pick_of_the_day_102425_friday/nl1uzv6/"
    }
  ]
}