{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/25/25 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/",
  "target_date": "2025-12-25",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-25T18:50:04.056785+00:00",
  "comments": [
    {
      "created_utc": 1766685600.0,
      "author": "PogRashy",
      "text": "Record 4-1(+1,65U) - always 1U if not stated otherwise\n\n✅✅✅✅💀\n\nLast pick - Valmiera +9,5(1,76)💀\n\nToday's pick - Spurs +10,5(1,8)\n\nReasoning - First NBA bet. Few rotational injuries for OKC and Spurs just beat them by 20, insane spread, have to take it.\n\nhttps://preview.redd.it/27nc1dyb3e9g1.jpeg?width=1016&format=pjpg&auto=webp&s=87e0d89b6ea121fae403e2ab58fd18edeb387c25",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvweql7/"
    },
    {
      "created_utc": 1766685147.0,
      "author": "zan12231",
      "text": "**POTD Record:** 1-2\n\n**Net Units:** \\-1.09 UNIT (-36,33% ROI)\n\n**Previous Pick:** California ML(-102), 1 UNIT ❌\n\n**Today's Event:** NFL: Detroit vs. Minnesota\n\n**Today's Pick:** O43.5 (-122), 1 UNIT\n\nWrite up:\n\nChristmas game, everyone will play on 100%. In last 5 meetings between them, 4 times this total was achieved, so  great value. BOL and happy holidays.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvwdfg3/"
    },
    {
      "created_utc": 1766684570.0,
      "author": "MaxxHysteria",
      "text": "POTD Record 6-5\n\nPick: Minnesota Vikings +8.5\n\nHappy Holidays everyone, Today I've got the Vikings to keep it close. The Lions haven't looked convincing lately so I expect the Vikings to control the pace of the game and defend well enough to shit down Goff. \n\nBest of luck everyone",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvwbsha/"
    },
    {
      "created_utc": 1766681345.0,
      "author": "HiiroYuy",
      "text": "Record: 1 - 0  \nNet Units:  +1\nROI:  \nNBA / Cavs vs Knicks   \n**Pick: Sam Merrill 10+ Points (-113)**    \n\n\n**Write Up:** Merrill has returned to the starting lineup for the Cavs with immediate returns showing. He’s hit 6+ treys in two of his past three games, eclipsing the 20 point mark twice. I’m laddering his points and threes if he hits something early. No matter what I feel good about him getting enough run to find 10 points. Throwing a unit down to start.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvw2u1z/"
    },
    {
      "created_utc": 1766681276.0,
      "author": "FRANKLINC69420",
      "text": "Reddit Record: 107-66-6\n\nNet Units: +35.37U\n\nPrevious Pick: Cal Berkeley Golden Bears +1.5 (-112) <- Risk 1u❌\n\nToday’s Pick: Golden State Warriors -7 (-135) <- Risk 1u\n\nMerry Christmas everybody, not going to lie this doesn't really feel like a trap or even an overinflated line for Golden State, I just don't think they would do that to the Mavericks after they beat the Nuggets now. The Warriors are also on extended rest too, getting two days off Tuesday and Wednesday, which is absolutely CRUCIAL for a team of uncs like this one. I have this model at -9 so I'll buy some juice and take some points here. Interestingly this is also the one game the public absolutely LOVES the underdog in the Mavericks here. Teams on 2+ days of rest against a team that is on their 3rd game in 4 days and also play in the same conference are 216-128 ATS. Good for a 63% winrate. Let's go!\n\nBOL! Please react if tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvw2n3b/"
    },
    {
      "created_utc": 1766680987.0,
      "author": "Alive_Economics3836",
      "text": "POTD Record: 1-1\n\nPOTD Last 10: ❌✅\n\nPOTD Profit: -0.58u\n\nLast POTD: Sudan Under 0.5 Goals Scored (-164) ✅\n\nLeague: NFL\n\nTime: 1:00 PM EST\n\nGame: Dallas Cowboys @ Washington Commanders\n\nPOTD: CeeDee Lamb ATTD (+110)\n\nUnits: 2.5\n\nExplanation: Washington has a bottom 5 passing defense so far this year (giving up ~242 yards on average, and ~257 yards in the air at home), and faces a slew of injuries, including CB Marshon Lattimore. On the flip side, CeeDee has had a fine year (currently 10th in receiving yards in the league) that has been plagued by injuries. He hasn’t scored a TD in the past three games, but has averaged 7-10 targets per game over that stretch against defenses arguably better than Washington. I doubt the Cowboys starters will get snaps in Week 18, so combined with the poor passing defense, I expected CeeDee will the find the end zone one last time this season.\n\nBest of luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvw1uc9/"
    },
    {
      "created_utc": 1766679280.0,
      "author": "Laird87",
      "text": "POTD Record: 212-209, -75.49 Units\n\nCurrent streak: ✅✅✅\n\nLast 10: ✅✅✅❌✅❌❌❌❌❌\n\nGoddamn yesterday was immaculate.  Thank you all for helping me to get [20 total downvotes](https://www.reddit.com/r/sportsbook/comments/1pu95ez/comment/nvqaf86/?context=3) on what was obviously a low-effort pick that ended up hitting.  Lots of downvotes came AFTER the pick hit which shows how cantankerous a lot of you get when bad analyses still produce wins, which is exactly why so many of you get even more butthurt about losses when research is involved (some stupid irrelevant British city FC always converts on set pieces when the temperature is above 55.4 degrees and the wind is out of the southeast, this pick was a lock, I can't believe it lost, the betting gods hate me!!!!)  I am starting to base picks on teams that I think suck.  And I was yesterday years old when I learned that Gabon existed (pretty interesting country though, look it up!) and I decided they likely sucked and low and behold, Cameroon wins 1-0 to cash a +120 and my third in a row.\n\nToday's Pick:  New York Knicks -6.5 vs. Cleveland Cavaliers, +101, 12:00 PM EST\n\nBack to this stupid league, the Cavaliers really fucking suck lately and they are on the road.  The Knicks have shown some flashes of sucking too, but not as bad and are at least half decent at home.  This is a scheduled loss for the Cavaliers.\n\nBOL, tail or fade! Tip Jar: [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvvx39e/"
    },
    {
      "created_utc": 1766676731.0,
      "author": "Aggravating-Quit-528",
      "text": "Record: 2-2 (-1.4u)\n\nLast Pick: McCaffery/Taylor Rush+Rec ❌\n\nEvent: NFL - Lions at Vikings \n\nPOTD: Justin Jefferson o60.5 (3.6u to win 3.0) (-120 Fanatics)\n\nWrite up: Merry Christmas! On today’s joyful day full of NFL games we are running it back with Mr. Jefferson. Minnesota will be without Nine today, but I think that has the potential to help us. Max Brosmer will be the starting QB, although he is booty, he will be looking to his all star wideout to keep them in this game. Detroit’s defense has also been terrible against stat WR’s this year. \n\nPuca - 181 yards \nCeedee - 121 (injured 3Q)\nWatson/Wicks - 80/94\nWan’Dale - 156\n\nThe list goes on and on. I expect JJ to clear this line easily. Let’s ride!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvvq54r/"
    },
    {
      "created_utc": 1766674725.0,
      "author": "marcopolo_12",
      "text": "POTD Knicks & ML Brunson 30 points +155 on FD \n\nTrust me bro it’s a lock",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvvkxlf/"
    },
    {
      "created_utc": 1766673992.0,
      "author": "Timely-Conclusion532",
      "text": "Record: 300-188\n\nForm: ❌❌✅✅✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅✅❌❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌❌❌❌✅✅❌✅✅✅❌✅✅✅✅❌✅✅❌ ❌❌❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌✅✅✅✅❌❌✅✅✅✅✅✅❌✅✅✅✅❌✅❌✅❌✅✅❌✅✅❌❌❌✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅✅✅❌✅✅❌✅✅❌✅✅❌❌✅❌✅✅❌❌❌❌❌✅✅✅✅✅❌✅✅✅❌✅❌✅❌❌✅❌✅❌✅❌✅✅✅✅✅✅❌✅❌✅❌✅✅✅❌❌✅❌✅❌❌❌✅✅✅✅❌❌✅❌❌✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅❌✅✅✅✅✅✅✅✅❌❌✅✅✅✅❌❌❌✅❌✅✅✅❌✅✅❌✅❌❌❌❌✅❌✅✅✅✅✅❌✅✅❌✅✅✅✅✅✅✅✅❌✅❌✅❌✅❌❌❌❌✅✅✅✅❌✅✅❌✅✅❌✅✅✅✅❌❌✅✅✅❌✅❌✅✅❌❌✅❌✅❌❌✅❌❌❌✅✅❌✅✅❌✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅❌✅✅✅✅✅❌❌✅✅✅❌❌❌❌❌❌✅❌✅✅✅✅✅✅✅✅❌✅❌❌❌✅❌✅✅❌✅❌❌✅❌✅✅✅❌✅✅❌✅❌✅ ✅❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅❌✅✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌✅❌✅✅✅❌✅❌❌❌✅✅❌❌✅✅✅❌❌✅❌✅❌✅❌❌✅❌❌❌❌✅✅✅✅✅✅❌✅✅❌❌❌❌✅✅❌❌❌❌✅✅✅✅❌✅✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅❌✅✅❌\n\nNet Units: +0.20 units (All plays 1 unit)\n\nYesterday’s Pick: (NCAAF) California Golden Bears vs Hawaii Rainbow Warriors under 55.5 alternate points (-174) ❌\n\n**POTD: Dallas Cowboys -6.5 alternate spread vs Washington Commanders (-180) (1:00 PM EST)**\n\nReasoning: We have strong trends, line movement, injuries, stats all favoring the Dallas Cowboys. The Dallas Cowboys are 8-2 ATS vs the Commanders in the last 10. Line movement has went in favor of Dallas as well (-3 ➡️ -10). The Cowboys should light up a weak Commanders defense. The statistics back the Cowboys as well as the Cowboys average .433 points per play while Washington averages only .349 points per play. On defense, Cowboys allow .487 points per play and the Commanders allow .431 points per game. Despite the Cowboys weak defense, the Commanders are without their QB Jayden Daniels which significantly impacts their already weak offense. With that said, let’s expect the Cowboys to win by at least a touchdown. BOL to those tailing 🎄\n\n👇\n\nhttps://preview.redd.it/at798n7l4d9g1.jpeg?width=1170&format=pjpg&auto=webp&s=109687878c0eba6be20c43049f5126ca03449889",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvvj4s4/"
    },
    {
      "created_utc": 1766673429.0,
      "author": "ControlRoyal1768",
      "text": "Record: 30-24 (+20.4u)\n\nLast 10:💰✖️💰✖️✖️💰💰✖️✖️✖️\n\nLast POTD: 🏈 George Kittle over 66.5 receiving yards (-114). 💰\n\nWriteup: Great pick for us, bet hit in the first half!\n\nToday’s POTD: 🏈 Chiefs +14.5 alt spread (-130).\n\nGame starts at 8:15pm EST. Bet 2.25u\n\nWriteup: Merry Christmas to those who celebrate! 🎄🎄For today’s festive bet, I am plugging my nose and taking the Chiefs to cover a 14.5 point alternate spread. This is more of a gut pick than based off of statistics, but let me explain my reasoning.\n\nLast week, one of the best bets was to take the Titans spread against the Chiefs as the market clearly had not adjusted enough for the Chiefs starting their backup QB Gardner Minshew. Now for this week, I feel the market has overcorrected waaaaay too far for the chiefs 3rd string quarterback. This line was set at 5.5 with the assumption Minshew was starting, and has now gone all the way up to 13.5-14. This is a huge movement for going from a 2nd to a 3rd string QB, and I feel the public is overreacting. My fair number for this game is 11.5.\n\nLet’s also consider that the over/under for this game is a measly 36.5 points. This basically implies that the Broncos will score about 23 points while the Chiefs will score about 13.5 points, with the current market bets at 24.5 for the Broncos and 10.5 for the Chiefs. There are better odds on the under for both of these. With basic math theory, having a total as low as 36.5 and a spread as large as 14.5 is very difficult to achieve. But yes, this is football, not math class.\n\nWith that in mind, let’s now consider how the Broncos have played this season. While they are the number 1 seed in the AFC, they have only won 2 games this season by more than 1 score, many of which coming from 4th quarter comebacks. One game was against the Bengals without Joe Burrow, which have one of the worst defenses in the history of the NFL. The other was against the Cowboys, who also had one of the worst defenses in the league at the time. Every other game this season, the Broncos have played to their competition. They go up against a Chiefs defense that, while not as great as usual, are still being coached by defensive coordinator mastermind in Steve Spagnuolo. They aren’t going to let their division rival’s offense do whatever they want.\n\nAll in all, this is a divisional rivalry game on Christmas Day under the lights. Yes, the Chiefs are out of the playoffs. Yes, they have their 3rd string QB playing. Yes, they are going up against the top seed in the AFC. But I refuse to believe that a Kansas City team who is arguably one of the faces of the NFL are going to let a division rival come into their stadium and let the Broncos beat them down on national TV when the over/under is this low. 14.5 points is a massive spread given the over/under, the Broncos have an inability to win big, and having Spag giving the defensive play calls is huge. Give me the Chiefs to put up a fighting chance against their division rival and keep it within 2 touchdowns.\n\nRemember to only bet what you can afford to lose, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvvhsmt/"
    },
    {
      "created_utc": 1766672437.0,
      "author": "BrokeAndFamouss",
      "text": "NBA Basketball - Thursday 12/25/25\n\nPick of the Day: Minnesota Timberwolves vs. Denver Nuggets -2 (-110)\n\n1 unit to win 0.91 units\n\nRecord: 2-2\n\nProfit: -0.14 units\n\nPrevious Pick : [Utah Jazz + 2.5 Loss](https://www.reddit.com/r/sportsbook/s/mzeOEtSaN0)\n\n\nDenver has the league's most efficient offense, leading in true shooting percentage, effective FG%, and offensive rating, while Minnesota ranks 9th in offensive efficiency. That scoring edge should shine through, plus Denver is 8-6 ATS at home this season, while the Wolves are just 5-8 ATS on the road.\n\nMerry Christmas everyone!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvvfi4p/"
    },
    {
      "created_utc": 1766672198.0,
      "author": "NoFilterD",
      "text": "**57-33**\n **4085.31 units +40 units**\n\nLast pick chiefs + 3 Travis Kelce over 3.5 receptions \n\nNBA Pick **Josh Hart over 6.5 Rebs/ Jalen Brunson over 24.5 pts -105 3 units $300 to win 585.71**\n\nJosh Hart despite not being the biggest player can flat out rebound. His motor is insane and he is 20th in the NBA in rebounds per a game. His last 5 games 15/10/10/8/6. Last year on Christmas Day hart finished with 12 rebounds against Wemby and the spurs..\nJalen Brunson is the heart of the Knicks team and is 6th in the NBA in points per a game averaging 29.1. His last 5 games he has gone over 24.5 pts in 4/5 of the games. He will have fresh legs after missing the timberwolves game but having no injury designation. When it comes to him coming back after a game or low point performance Brunson has always shot well and I anticipate at home the Villanova boys are going to give Madison square garden a great performance. I was also leaning towards KAT but I think his numbers are high because he went off against his former team the wolves but I also think he can have a big game, it just depends if Mobley is playing or not and that is still up in the air. best of luck everybody and happy holidays!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvvey0y/"
    },
    {
      "created_utc": 1766661257.0,
      "author": "Slimery111",
      "text": "Record: (+2.85U)\n\nLast Pick: Micheal Pittman Jr Over 3.5 Receptions @-130 on DK\n\nWager: 3.7U\n\nResult:✅ Welp that was sweatier than anticipated but I’m telling yall I’m seeing the matrix lately 😭 it all makes sense. We roll that 3.7 into our CURRENT BR: 6.55U \n\n\nPOTD: Dak Prescott Over 2 Passing TD’s & Jared Goff Over 2 Passing TD’s\nWager: 3.5U\n\nEvents:DAL vs WAS @1pmEST & DET vs MIN @ 4pmEST; Odds at +160 on DK.\n\nReasoning: Feel free to tweak the Goff leg down to 1 TD, his consistency has me worried lately. But both picks are pretty simple and you can adjust them to your favor and based on how big ur balls are feelin. We goin big balls today I mean Christmas and Lady Luck has been kind, so I’ll take +160 over -170.\nThere can be any sort of garbage in the script is what we’ve learned. Except that dak has been very efficient connecting in the end zone, and if Goff wants to make up for these last 2 games he should have over 2 easily but you never know how many the lions will just rush in.\n\nMerry Christmas all! I’ve become nocturnal so I’ll be awake by the time our second leg is about to hit. BOL! 🍀\n\nEdit: wrote this write up half asleep, barely managed to post it but had written ATL instead of WAS lol",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvuu4xd/"
    },
    {
      "created_utc": 1766657773.0,
      "author": "Ralphjinasseater",
      "text": "Record : 20-17-2  \n\nNet units:(-0.74 units)\n\n\nLast pick: Coby White OVER 3.5 Assists (-155 HR)✅\n\nPick of the day : Chet Holmgren under 9.5 Rebounds+Assist(-130HR)\n\nReason • \nComing from an OKC fan it always sucks taking a players under on the team, BUT from what I’ve seen over the last few games with Chet is that he’s not showing ANY effort in the RA department in the last few games. He’s under this line in 4/L5 games averaging just 7 RA on 12.8 RA chances, including going under in 6/L10 games averaging just 8.4 RA on 13.8 RA chances (averaging 28.6 minutes per game this szn). \n\nChet not only hasn’t been showing any effort, but has already faced this Spurs team TWICE in this month alone going under in BOTH games: \n\n- 7 RA | 18 RA chances | 30.5 minutes | 6 days ago\n- 4 RA | 6 RA chances | 27.2 minutes | 2 days ago \n\nIn Chet’s last four matchups against the Spurs, he’s under in all 4/4 (100%) of games averaging just 6.5 RA! This is due to the fact this Spurs team has the best matchup for Chet in Wembanyama. Not to mention, the Spurs are allowing the 3rd FEWEST rebounds & 9th FEWEST TOTAL RA to opposing PFs. Chet also has NOT been looking to pass the ball as he’s only averaging 1.2 assists on 1.6 potential assists in his L10 games. \n\nThe Spurs have done very well (when healthy) at holding recent PFs under their respective RA lines: \n\n- Franz Wagner: 10 RA | 10.5 line ❌\n- Saddiq Bey: 8 RA | 8.5 line ❌ \n- Chet Holmgren: 7 RA | 9.5 line ❌\n- Jalen Johnson: 17 RA | 18.5 line ❌\n- Chet Holmgren (PT2): 4 RA | 9.5 line ❌",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvuostu/"
    },
    {
      "created_utc": 1766657737.0,
      "author": "donjavogosca",
      "text": "POTD Record: 28-16, +11.03u, (ROI +20.3%)\n\nPrevious Pick: Sloboda to win -16.5 handicap, 1.85, 1u ✅️, (last 5: ✅️❌️✅️✅️✅️)\n\nEvent:  NBA: GSW - Dallas, 23:00h\n\nPOTD: Cooper Flagg to score over 19.5 points, 1.90, 1.5u\n\nIt's Flaggs' first Christmas game, of course. It's also a first big lights game against one of the greatest teams in history (or what's left of that team, but they are still a big magnet).\n\nFlagg started to show his full potential recently, and in the last 7 out of 10, he has made this limit. In 3 other games, he had 19 and 2 times 16.\n\nThe logic is that he is going to be extra motivated to show himself today and that he can make this limit easy.\n\nAn extra 0.5 unit today, I like this one.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvuoqwv/"
    },
    {
      "created_utc": 1766655749.0,
      "author": "MadsR2021",
      "text": "Record: 2 - 0 (+1.49U)\n\nLast Pick: Callan Rydz -1.5 180'S (1.83) 1U ✅️\n\nToday's pick: El Gounah +0.5 asian handicap (1.70) 1U\n\nEl Gounah are coming in to this game with 4 wins in their last 5 games. National bank of egypt are coming in to this game with 4 wins  and 3 draws from their last 7 games. However, NBE are missing 2 of their starting attackers, due to them playing African Cup of Nations. In the domestic league El Gounah are 10th with 1 point more than NBE, so overall two very evenly matched teams. I will happily take the double chance with El Gounah at home and with NBE missing a couple of starting attackers. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvulpb9/"
    },
    {
      "created_utc": 1766655075.0,
      "author": "ptrckfrnndz",
      "text": "+50.57\n\n21 - 7\n\nFORM: ->>✅️✅️✅️✅️✅️✅️❌️✅️✅️✅️ (LAST 10)\n\nSports: TENNIS ( I mainly use 1xbet, i dont have any other books available)\n\nPending: smiej ML ⏳️\n\nPrev: dragus nicolae cazacu 2-0 @1.73 vs. Ivan lutkin 5 units ✅️\n\nPick: smiej ml / dragus nicolae cazacu ml ✅️ @ 1.836 1 UNIT\n\nTime: idk anymore 😭\n\n\nThis is a greeting more than a pick\nMerry christmas yall!!\n\nReasoning: fair warning ⚠️⚠️ bet moderately on this or maybe u should pass on this. We already have a bet on these two and since im up of units i can afford to throw some on this. I JUST LITERALLY PUT 1 UNIT ON THIS. REALLY I JUST WANT SOMETHING TO ANTICIPATE ON CHRISTMAS AND GREET YALL A MERRY CHRISTMAS!!\n\n\n\n\nPosted this early from my new account since the thread open but i dont see it here. Can anyone help me pls\n\n\nBol\n\n\nMaybe you can tip me if i made you some money. So i can buy food for my self.. thank you\n\nhttps://www.paypal.me/ptrckfrnndz06",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvukpkg/"
    },
    {
      "created_utc": 1766651318.0,
      "author": "this_guy9",
      "text": "**POTD Record:** 21-18\n\n**Net Units:** \\+3.87\n\n**Previous Pick:**[ ](https://www.reddit.com/r/sportsbook/comments/1pq66p0/comment/nuxfvkk/?context=3)[✅ Trae Young o9.5 Assists +111](https://www.reddit.com/r/sportsbook/comments/1ptdxum/comment/nvindze/?context=3)\n\nTrae was free a couple days ago. Lets get a Christmas Day W.\n\n**🏀 Stephen Curry o4.5 Threes +120** vs the Dallas Mavericks\n\nSteph hasn't been cashing this line lately, but it's not for lack of trying. He's averaging **13.4** attempts per game in his last 5. His average Threes made over that L5 is actually quite good at **5.6**, though colored by a **12** Three game against Portland.\n\nThe Mavs have had quite a good defense against Threes lately, but over all his 10+ attempt games, Curry has cashed in **L4/5**. With AD back, I expect Steph to have more room to shoot as well (not that he needs it).\n\nLooking for Steph to build off some momentum in the second half of last game. Against a good Magic defense, he hit **4** Threes in the second half.\n\nLast but not least, Steph continues to fight washed allegations. On a big Christmas Day showing, I expect him to be putting up attempts regardless if they're going in or not.\n\nFull stats if you'd like to do additional research: [https://www.statpick.ai/23523689/stephen-curry-threes](https://www.statpick.ai/23523689/stephen-curry-threes)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvuf0md/"
    },
    {
      "created_utc": 1766647552.0,
      "author": "binkage13",
      "text": "Event: NFL Detroit Lions @ Minnesota Vikings 4:30 pm EST\n\nRecord: 4-1 (+2.75u)\n\nPOTD: Jameson Williams longest reception 25+ yards -140 (Fanatics) 4.2u to win 3u\n\nPrevious play: ✅ Pavel Dorofeyev o2.5 SOG + Michael Bunting 1+ SOG\n\nMerry Christmas! Let’s hit our first 3u winner. \n\nThe Detroit Lions head into this NFC North matchup against an already eliminated Minnesota Vikings team with everything on the line. For Detroit, the path forward is narrow but clear: win their final two games and hope the Green Bay Packers lose their final two games. It’s not total control of their destiny, but it’s the only route left. and there’s no margin for error.\n\nLast week’s gut-wrenching loss to the Steelers still lingers. What should have been one of the most iconic walk-off wins in franchise history was ripped away in a game Detroit desperately needed. In that final drive of the game, the Lions moved the ball with precision, urgency, and confidence, despite coming of short of the W, that is exactly the brand of football they need to replicate against Minnesota.\n\nWhen your season is on the brink, conservatism goes out the window. This is the moment to unleash your playmakers, and for Detroit, that means leaning into the explosiveness of Jameson Williams. Trying to pound the ball on the ground when it’s clearly being neutralized isn’t a luxury the Lions can afford right now. They need chunk plays, tempo, and aggression.\n\nWith the game indoors and conditions ideal, expect Detroit to open things up offensively. The Lions know what’s at stake, and they’ll be throwing everything they have at a Vikings team playing without anything on the line expect pride. This is about urgency, execution, and survival, and Detroit understands a win isn’t just necessary, it’s non-negotiable. Expect at least 1 bomb to Jamo on Christmas Day!\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvu943c/"
    },
    {
      "created_utc": 1766645813.0,
      "author": "PurpleDragonBets",
      "text": "Record: (118-78-11) \\[+13.22\\]\n\nPOTD⭐️:🏈Cowboys -3/Lions -3 (-125) \\[Fanatics\\]\n\nStart Time & TV: 1:00 & 4:30pm EST (Netflix)\n\nUnits: 3 Units\n\nReasoning: Merry Christmas to everyone I hope you all have a wonderful Christmas and I hope you got gifted something better than the games the NFL gifted us for Christmas. With this abysmal Christmas slate of games featuring third string quarterbacks in every single game well be going with the Dallas Cowboys (6-8-1) over the Washington Commanders (4-11) and the  Detroit Lions (8-7) over the Minnesota Vikings (7-8). The Cowboys tote the leagues #1 overall passing offense in the league and they are going up the 26th ranked overall passing defense, 29th ranked rush defense, and 26th ranked scoring defense so I believe they will be able to move the ball pretty easily on this Commanders defense. The Commanders are without Jayden Daniels and Marcus Mariota so they will be going with third string quarterback Josh Joshson under center and when he came in the game for Marcus Mariota in relief last week he threw an interception on his first drive so I dont believe Josh Johnson will be able to hang in and keep up with the scoring of the Cowboys offense in this one. I also like going with the Lions over the Vikings as I believe Jared Goff will significantly outperform Vikings third string quarterback Max Brosmer. Under Jared Goff the Lions have the 3rd ranking passing offense in the league averaging 270 passing yards per game and the 2nd ranked scoring offense in the league averaging just over 30 points per game. Vikings quarterback Max Brosmer has made one start this year and it was an abysmal performance as he threw for only 125 yards, had 0 touchdowns and 4 interceptions, and managed to get shutout on the scoreboard putting up 0 points all game. I dont see either of these third string quarterbacks being able to hang in this game and I like the Cowboys and Lions to take care of business on Christmas day.\n\nPrediction: 27-16 Cowboys, 24-17 Lions\n\nLast pick: 🏈🏀Louisville -2.5/UCF ML💰Great second half from UCF and Louisville got the job done for us in the bowl game!\n\nBest of luck to everyone tailing and remember to bet responsibly! Merry Christmas to all and God Bless everyone!!🙏🏼😇🍀💜🐉🎄✝️\n\nhttps://preview.redd.it/p9z2icwzsa9g1.jpeg?width=1053&format=pjpg&auto=webp&s=cd3d937735033d57ac70c3b1a4c5d7251d109f5c",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvu68qe/"
    },
    {
      "created_utc": 1766644113.0,
      "author": "Section1ne0h4our",
      "text": "8-2, +5.28\n\nLast 5: ✅❌✅❌✅\n\n(Previous play review at end of post)\n\nNBA - San Antonio @ Oklahoma City\n\nStephon Castle o23.5 PA (-110) 1u\n\nStars are born on Christmas Day - and today we want to add a name to a list that includes Jesus, Annie Lennox & Jimmy Buffett (Who is the headliner?!)\n\nStephon Castle has stepped up in the absence of Wemby to not only be a concise playmaker, but a growing role as a bucket. The Spurs have shown great strides this season, and Castle is a big reason why.\n\nWe see the over here hitting on a number of runs: **6 in a row, 12 of the last 15, 75% rate on the season, & 3 in a row H2H** - why would I bet against this? Well I’m not, but this is OKC, potentially in revenge mode after the NBA Cup semi final loss, and with the world watching. *Roadblock* potential is on the cards, that only gives me more of a belief that the Spurs can stay competitive enough that we can cash another one.\n\nGut play? Sure, but with alot of math to go with it. I wanna wish you all a merry Christmas and you all feel the best joy of the holiday season.\n\nLast play review:\n\nNCAAF - Cal @ Hawaii, Kendrick Raphael o2.5 rec (-163) 1.5u ✅\n\n(Boy oh boy that was sweaty: not a single look through about 80% of the game before finishing up with 3 - a Christmas miracle for sure, thankfully Hawaii were able to make it competitive for us which made Cal have to push the ball in the passing game more than they already were. Counting some very lucky stripes this morning.)\n\nBOL if you’re tailing, and if not BOL in general.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvu3b0x/"
    },
    {
      "created_utc": 1766643732.0,
      "author": "Ghost_eggs",
      "text": "**POTD Record:** 10-2\n\n**Record (oldest -> newest): ✅✅✅**❌**✅✅**❌**✅✅✅✅✅**\n\n**Net Units:** \\+21.14\n\n**Previous Pick:** Bulls +4.5 (-115 on DK); 4 units **✅**\n\n**Previous Pick Reaction:** Crazy game with the Bulls in rough shape most of the way through. But sure enough the Hawks collapsed in the 4th and Chicago not only covered but won the game outright **again**.\n\n**Today's Event:** NBA 🏀 Cleveland Cavs @ NY Knicks (9:00am PST)\n\n**Today's Pick:** Knicks -5.5 (-108 on DK); 3 units\n\nFirst, the basic ATS evidence.\n\n**Knicks:** This is the best the Knicks have looked in a very long time, especially at home. Knicks have the second best home record in the NBA, behind only OKC. As the home team, Knicks are 13-3 ATS, **and as the home favorites they are 12-3**, giving them an 80% cover rate in this spot.\n\n**Cavs:** On the other end, the Cavs have a poor record ATS. Specifically as the away team Cavs are 4-8 ATS, and as away underdogs are 1-1 ATS (small sample). We have also recently seen the Cavs lose outright to some of the weakest teams in the league, so morale is low.\n\n**Matchup:** In their only prior matchup, Knicks (at home) beat the Cavs by 8, despite missing Hart and Mitchell Robinson. This was early in the season but I think the disparity between these two teams is even greater now. The Knicks have really found their groove and the Cavs have not.\n\nThe biggest advantage for NYK is depth. Cavs lost their best bench scorer in Ty Jerome, and sharp-shooter Strus has been out all season (and still is). Mobley, arguably the 2nd most crucial player for CLE after Donovan, is listed as questionable for today after being out since Dec 13. Even if he does play, he likely won't be at 100% since he was supposed to miss \"at least two weeks\" according to the NBA's official update on Dec 13. Meanwhile, the Knicks have a bench consisting of an all-time bench scorer in Clarkson, Mitchell Robinson who suddenly learned to shoot FTs and is unstoppable on the offensive glass, and Kolek who has taken a massive leap in development this season.\n\nSecond, the Knicks have a large 3pt-shooting advantage. Knicks are 4th in 3P% (37.9%) and 8th in attempts (39.3 3PA per game). The Cavs are 21st in 3P% (34.8%) despite being 1st in attempts (43.9 3PA per game). There is a similar disparity in overall FG% and simply put, the Cavs miss a lot of shots.\n\nThis complements the Knicks 3rd major advantage, rebounding. Knicks rank 3rd in rebounding while the Cavs rank 14th. And with Mobley either out or at less than 100%, this advantage will be all the more glaring. Large gap in missed shots (especially from 3) + getting outrebounded likely means a large score differential.\n\nAnd the final bit of spice is of course the Christmas spirit. The whole \"Christmas game\" thing may seem dumb or inconsequential but it does tend to create a play-off like atmosphere, and historically Knicks tend to play well on these Christmas games whereas the modern Cavs are unproven.\n\n**Summary:** the relative ATS records and depth, shooting, and rebounding advantages over the Cavs seems like a good case for the Knicks to cover.\n\n[**Tip link (buymeacoffee)**](http://buymeacoffee.com/ghost_eggs) **-** I post these picks for fun. I genuinely enjoy the challenge, the research, and writing up my reasoning. I am happy to freely share picks with you POTD degens and I never expect tips but any support is greatly appreciated.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvu2n0r/"
    },
    {
      "created_utc": 1766642933.0,
      "author": "malabroka",
      "text": "My Record: 0-0 \nTodays Pick : Denver Broncos -12.5 (Broncos Vs Chiefs) \nOdds: -130 \nUnits : 3 \n\nWrite up: Garrett Boles leads league in pass blocking efficiency and has allowed zero sacks. Bo nix should have plenty of time to feast on KC’s injured secondary. Broncos lead the league with 63 sacks and chiefs are down to their 3rd string qb with their o line being unhealthy. Defensive stops should turn into easy points for Denver. Buying a point for good luck on my first POTD. \n\nMerry Christmas to All.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvu17ei/"
    },
    {
      "created_utc": 1766638948.0,
      "author": "Emergency_Emu_891",
      "text": "Record: 19-5, +23.84u, 36.53% ROI\n\nForm (oldest -> newest): ✅✅✅❌✅❌✅✅✅❌✅✅✅✅✅✅✅❌✅✅✅❌✅✅\n\nLast Pick: Algeria vs Sudan AFCON (soccer): Algeria ML and Mohamed Amoura 1+ SOT, -115 on DK at time of writeup, betting 1u ✅\n\nRandom soccer match comes through. Helped by an early red card by Sudan. 3-0 win for Algeria and Amoura had at least 1 SOT. Back to NBA.\n\nToday's Pick: SGA o24.5 pt v SAS, Naz Reid o1.5 3PM v DEN, -135 on DK at time of writeup, betting 3u\n\nThis is what my model says the best play of the day. It's getting silly with SGA. I don't mean to make the same pick over and over again, but it's pretty much free, and something I will take in the appropriate spots (close games that should not be that low scoring) every time. It's down to -564 on DK, which is pretty low, but it juices the Naz leg at -206 all the way up to -135. SGA just clears this line in every game. He has missed it twice all year. This is a mega revenge spot for OKC, who will not allow SAS to beat them for a third time in 2 weeks on Christmas Day at home. AJ Mitchell is still out. The stars show up on Christmas Day on primetime. SGA will score at least 25 points here. 29 and 33 points against them in the past 2 games against them, which is not nuclear, but it is consistent. Naz Reid gets regular volume from deep, and he has a competitive matchup against DEN, who is missing Aaron Gordon, Cam Johnson, and Christian Braun. He is due for some positive shooting regression too: under 28% from deep in each of his last 4 games for someone who shoots it at 36%. Also, Jaden McDaniels might not play, which could result for even more minutes for Naz. We have a fairly high total for a MIN game. If Jokic and Murray are lighting it up for DEN, Naz will try to respond from deep. Give me this pick at 3u. BOL to all tailing.\n\nIf you’ve been appreciating and tailing my picks, tips are greatly appreciated! [https://buymeacoffee.com/emupicks](https://buymeacoffee.com/emupicks)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvttpez/"
    },
    {
      "created_utc": 1766637378.0,
      "author": "EthicalGambler",
      "text": "**My Record:** 73-63-3 (+4.42u)\n\n**Today’s Pick:** Luka Doncic o0.5 Blocks (Rockets vs Lakers)\n\n**Odds:** +135\n\n**Units:** 4.0\n\nTip off is 7:10PM PST. Continuing with this Luka program. He left the last game midway due to injury and should be back today on Christmas day. I will continue to hold with Luka to get one block per game even though this is a venerable time. \n\nShould this not hit I will double my wager on the same prop on 12/28\n\n**Previous Pick**: Luka Doncic o0.5 Blocks (Lakers vs Clippers) ❌\n\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/EthicalGambler-U6cnjV?utm_source=mdembed&utm_campaign=EthicalGambler) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvtqh77/"
    },
    {
      "created_utc": 1766631645.0,
      "author": "jdstewart19",
      "text": "Record: 1-1\n\nPrevious Pick: Army vs Binghamton O138.5 ✅\n\nNFL / Cowboys @ Washington\n\nPick: CD Lamb O5.5 rec (-145)\n\nWrite Up: Biggest amount of money I have ever put on a bet. Of course had to wait until Christmas day for it. CD has hit this line in his last 4 games. No matter how the game script is going, the Cowboys always get Ceedee involved. The Commanders have a terrible passing defense, Dak will look to exploit this. It always seems like big primetime games always have heavy scripted first drives to their star players. Would not be surprised to see 3+ catches in the first drive from screens/short routes. \n\nMerry Christmas all\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvtedth/"
    },
    {
      "created_utc": 1766628292.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 16-8-1 \n\nStreak: 5W ✅\n\nNet units: +5.89u All bets are 1 unit.\n\nLast POTD 12/20/25: Jacory Croskey-Merritt rushing yards O24.5 (-110 Bet365) ✅\n\nToday's POTD 12/25/25: George Pickens longest reception O26.5 (-114 FanDuel)\n\nEvent: Cowboys @ Commanders 11:00MST\n\nWrite Up: Pickens has hit his longest reception of 27+ in 9 of his games this season and has already hit a long of 44 yards against the Commanders in their first matchup.\n\nWashington's secondary is some of the worst in the league and gives up the leagues 2nd worst in yards per completion (11.7) and is 3rd worst for home games (12ypc). Due to injuries and their lack of a reliable pass rush, I believe the Commanders will struggle outside the numbers all game.\n\nDallas will have more than enough opportunities to heave the ball down the field as the Commanders will be looking to their 3rd string QB to facilitate their offense.\n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvt6ziz/"
    },
    {
      "created_utc": 1766628188.0,
      "author": "International-Fox-76",
      "text": "Two-pick parlay (5U)\n\n\n\t•\tCowboys -3\n\t•\tLions Moneyline\n\n\nRecord: 1–0\n\nLast pick: Eagles -6 ✅ \n\nUnits: +3.85\n\nDallas at -3 continues to offer value by staying below the key number of -3.5 and aligning with clear matchup advantages. The Cowboys benefit from continuity under center, while Washington’s QB situation is compromised — Marcus Mariota and Jayden Daniels are both out, pushing veteran Josh Johnson into the starting role. Johnson has historically struggled to sustain drives and isn’t built for consistent down-to-down execution, weakening Washington’s offensive rhythm and opening the door for Dallas to control pace and cover the number.  ￼\n\nDetroit on the moneyline pairs well by leaning on offensive effectiveness and quarterback stability rather than spread margin. Even with recent dips, Detroit’s offense has been one of the most productive in the league, generating well over 5,000 total yards on the season and scoring near the top tier in points per game, powered by an efficient passing attack and balanced run game.  ￼ With J.J. McCarthy out for Minnesota (following a hand fracture) and backups in at quarterback, Detroit’s more experienced unit — led by Jared Goff — should hold a clear edge in execution and consistency.  ￼\n\nTogether, this parlay blends quantitative value (line plus offensive production) with situational factors (injury-induced QB instability), forming a reasoned, upside-oriented two-leg play.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvt6r4m/"
    },
    {
      "created_utc": 1766627895.0,
      "author": "giovannidm15",
      "text": "Record: 0-0  🥲\n\nNet Units & ROI: N/A\n\nBasketball | Spurs vs. Thunder | 2:30PM EST\n\nPick: \n**Spurs +14.5 vs. OKC Thunder** & **Stephon Castle 15+ Points**\n\n+100 odds on DraftKings (1.5 units)\n\n*Write Up:*\n \nSeems like the general feeling is that the Thunder will bounce back strongly at home, as they are big favorites to win this rematch. \n\nTo make this safer than the current Spurs +9.5 spread, while maintaining good odds, we are adding in Castle 15+ points. \n\n**In his 8 games back from recent injury (Spurs 7-1 Record) :**\n\nHe's only scored under 17 Points once, which was 15 in their loss to the Knicks.\n\nHe's also scored over 20 Points 3 times in that span, with 2 against the Thunder.\n\nIn addition, he's averaged 6.4 Free Throw attempts in these 8 games as well.\n\nWith all that said, I think Castle can get 15 points, even on a poor shooting night here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvt63kp/"
    },
    {
      "created_utc": 1766627480.0,
      "author": "urahara_kei10",
      "text": "I need a Christmas parlay miracle… fellow degenerates, help a brother out.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvt56nj/"
    },
    {
      "created_utc": 1766627148.0,
      "author": "tennisfanatic101",
      "text": "💎POTD: 🏈Cowboys Spread -6.5\nOdds: -169 on DraftKings \nWager: 3 units\n\n👀MY POTD MAPLE LEAFS ML WON THE OTHER DAY (Got a lot of criticism for the last POTD lol🤫🤣) \n\nNFL🏈 . Cowboys at Commanders, 1 pm ET 12/25/25\n\nRecord: 8-9\nNet Units: -3.97 Units\n\nExplanation: Forget home field advantage. The Cowboys can easily cover -6.5 because Dallas is still one of the too efficient and performance offenses in the league. Washington is expected to start Josh Johnson with Jayden Daniels on IR and Marcus Mariota out, so i expect a lot of miscommunication plays and punts, giving the Dallas defense a lot of help (which they need) . So , I see no reason why cowboys don’t just slowly slip away with this game down the stretch. If not, then you just gotta tip your cap to Washington, they’re all professionals, anyone can beat anybody in the league.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvt4g58/"
    },
    {
      "created_utc": 1766624790.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 5-13-3 *Absolute scenes in the Burkina Faso game! Winless against Equatorial Guinea, 1/13 in AFCON openers, and trailing in the 95th minute in a match where even just a draw would've won us the bet. But of course, the football gods had another idea, letting Burkina Faso score not once, but twice in quick succession to win the game in the process. As I always say though, if I go out, might as well go out in style and oh boy did we lose that bet in an absolutely ridiculous fashion. Can't say I saw that coming, one of those fair enough moments for sure. Crazy how the same scenario happened twice in the space of a week to me (El-Gaish were up 1-0 to a team they haven't lost to in the last 10 H2H meetups, and proceeded to lose it through goals in the 89th and the 92nd minute). We move though, here's hoping Santa listened when I asked for better luck on my picks*\n\n**Last Five:** 🅿️❌❌❌❌\n\n**Event:** Vietnam U19 Championship, Công An Hà Nội U19 v PVF U19, starts in 4 hours 54 minutes\n\n**POTD:** Công An Hà Nội U19 Win or Draw +115, 1.5 units\n\n**Write Up:** Yesterday's madness might've done something, because why am I betting on the Vietnamese youth team championship? Well, because I've found a cheeky value play, that's precisely why. From my pov, Công An Hà Nội appears to be a seriously underrated team that's just now finding its feet, having won 3 out of the 4 matches at the start of the new season, after a ropey last season that saw them leak goals like no tomorrow. They've now **scored 13** and conceded just 6 goals **in 4 matches** (a **massive improvement** from last season). Their opponents, PVF boast a **similar record,** with a slightly better goal difference, but, inversely, they looked much more convincing last season. This gives them inflated odds for today's match, hence the fade. The Công An Hà Nội U19 squad is known for its **dynamic playing style,** characterized by quick passing, line breakage, tactical awareness, and conditioning, being able to effectively **counter-press** the moment they're dispossessed, which is something **their opponents occasionally struggle with.** This commitment to player development has led to the emergence of several talented individuals who have gone on to represent the national team and succeed in professional leagues. I feel like covering both the win and the draw at + odds is a goldmine and one I'm absolutely willing to explore in today's dry ahh calendar. The only thing that makes me slightly wary is the H2H (Công An Hà Nội U19 are winless in the last 4 outings), but I've learned my lesson and will stop paying this much attention to old statistical data, and instead focus on the expected value of the play (sweet plus odds for covering two outcomes of two pretty evenly matched teams on paper). After being hit hard in the AFCON madness and since I'm just slightly less familiar with the intricacies of the Vietnamese footballing pyramid, I'm going with 1.5 units. Merry Christmas and BOL y'all, whether you decide to tail or fade I just hope everyone has fun at the end of the day. Going to bed and I just know I'm waking up to a sweet notif ☘️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvszc1p/"
    },
    {
      "created_utc": 1766624134.0,
      "author": "AMathTeacher",
      "text": "**Record:** 1-2\n\n**Net Units:** -1.13\n\n**Last Pick:**  MN o3.5 Goals (+118) Betting 1U to Win 1.18U✅️\n\n**Event:**  NBA: Mavericks @ Warriors (3:10 PM MST)\n\n**POTD**: SGP: Steph Curry 1+ Steal and Cooper Flagg 1+ Steal (-125) Betting 1.25U to Win 1U\n\n**Write Up:** Both of these guys have 1+ steal in 4 of their last 5 and are both averaging above 1 steal per game this season. The Warriors and the Mavericks both give up a lot of steals, ranking #5 and #3 respectively, in opponent steals. They should be able to each get 1 steal tomorrow.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvsxvds/"
    },
    {
      "created_utc": 1766623281.0,
      "author": "realjohnkeys",
      "text": "Record 3-3  -0.4 units\n\nLast bet nets/76ers Under 219.5 - final 220. \n\nReally wish these threads opened sooner, line open would've cashed.\n\nThursday pick. \n\nDallas -8.5 @ -110. 2.2 units\n\nI took Dallas -3.5 days ago. Still like it at -8.5. Washington is banged up and while Dallas D has improved in recent weeks it's still bottom of the pack against the pass so I'm sure well see some scoring on both sides but the Johnson led commanders are simply not equipped to keep up with Dallas offense.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvsvwhm/"
    },
    {
      "created_utc": 1766621658.0,
      "author": "Hey52511",
      "text": "NBA POTD 17-11\n\nLast Pick: **Tyrese Maxey Over 25.5 Points.**\n\nToday's Pick: **Anthony Davis over 23.5 Points at $1.86**\n\nTo lazy for numbers .\n\nAlright so why are we going with Anthony Davis? The truth is Anthony Davis is being heavily slept on currently he has has had injuries which has prevented him from playing full minutes or trying to understand how the team functions. Truthfully we have seen how this team will and can force swaps and mis matches CONSTANTLY, for example in the Pelicans game the whole game plan was for AD to bully Derrick Queen on every single play. Also Draymon Green is whining that hes sick and tired of having to play Center and that he wants a true center.\n\nAlso I like that his minutes are pretty high in his last 5 games now being 36, 35, 34, 37, 33 which is a pretty good indication he will have minutes granted no foul trouble or injuries. As a Laker if not injured he's consistently hitting this line if not injured.\n\nI wouldnt take this above this line, anyway if you want to see more of my picks I also post on the NBA daily picks thread as well and currently am 8-0 since starting.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvss0xz/"
    },
    {
      "created_utc": 1766621601.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 68-33-1 (+76.93u) - __16-5 in last 21__\n\n__Previous Pick:__ [❌ SGP: Kittle 50+ rec yds & JT 80+ rush yds (-110), 3.3u](https://www.reddit.com/r/sportsbook/s/AHvRxuFjBl)\n\n__Event:__ NFL: Cowboys @ Commanders 1pm EST\n\n__POTD:__ CeeDee Lamb longest reception o26.5 yards (-115), 5u to win 4.55u\n\n__Write Up:__ Happy Holidays to all! 5u Max play for a Jingles Holiday Present 🎁 __You can’t spell Christmas Day without CD!__ The Dak and Ceedee connection has been elite all season, they have connected for a 28+ yard longest reception in 9/11 games this season. Dating back to last year, he’s covered this line in 14/20 games. He had a 74 yard reception earlier this year vs Washington. When he’s faced teams in the bottom 10 in Yards Per Route Run, he’s covered this line in 4 of 4 games (not including Chicago game he left with an injury). Washington is 31st in EPA per game as a pass defense (-8.5). They allow a league high 8.3 yards per pass attempt & 12.3 yards per completion, as well as a 66.9% completion rate (25th). Lamb has played 36.3% of his snaps from the slot. Washington is allowing a league high 9.5 yards per target, has given up the most receiving yards per game (97.0), & has allowed the 2nd highest target rate (35%) to slot receivers. Dak has 11 completions for 40+ yards, 2nd most in the NFL. Washington has given up 12 catches for 40+ yards this year, 2nd most in the NFL. CeeDee shines in big games, he’ll have a big one on Christmas. \n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial)  [PayPal](https://paypal.me/joeinglesofficial)  [Bitcoin](https://pastebin.com/raw/GEXAsA2S)  [Venmo](http://Venmo.com/mackenzie-botz-1)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvsrw0u/"
    },
    {
      "created_utc": 1766621246.0,
      "author": "awkward__fly",
      "text": "4-3-1 (+0.5 units)\n\n\nLast Pick: UCF -6.5 vs FAU for 1.2 units to win 1 ❌\n\n\nRecap: 2 losses in a row. UCF was up 7. FAU scores with 7 seconds left and then don't foul. Simply disappointing. \n\n\nToday POTD's pick of the day via me\n\n\nLions vs Vikings: Lions -6.5 (alt line) @ -125 for 5 units to win 4\n\n\nReasons: While Brian Flores has created a great defense in Minnesota, I have no faith in Brosmer to move the chains. He had the worst PFF score in the past 18 years when he played against Seattle. Add in the fact his offense line has injuries and Lions still have slim playoff hopes, I have the utmost faith the lions will cover a touchdown. If I'm wrong, I won't be posting here again",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvsr1fa/"
    },
    {
      "created_utc": 1766620819.0,
      "author": "Certain-Challenge202",
      "text": "Record: 100-0. (100000+) \n\nLast Pick: Going church \n\nToday’s pick: Enjoy your Christmas \n\nUnits: Everything \n\nOdds: 1000000948383838/1 \n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvsq0ik/"
    },
    {
      "created_utc": 1766620780.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 13-9 (+4.02u)\n\nPrevious Pick ❌  - Dallas Stars 60 min line +125 (1u to win 1.25u)\n\nThursday’s Pick - RJ Harvey o 15.5 rec yds -114 (1.14u to win 1u)\n\nThere is risk of a blowout here, but otherwise this feels a little too easy. Harvey has cleared this in 4 of his last 5 and he cleared this in his last game against the Chiefs.\n\nWhile this game is meaningless for the Chiefs, it is a big deal for Denver and Harvey has been on the field 60% or more of the time in their last 3 games. Outside of week 15, he’s getting almost 3-4 catches a game, which should help him eclipse that number.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvspx4p/"
    },
    {
      "created_utc": 1766618095.0,
      "author": "kylemclaren7",
      "text": "Santa cookies eaten OVER 1.5 PER HOUSEHOLD (CPH). -110, on ChristmasKings or JesusDuel. \n\nGet this one before the line pushes up to 2, steam will come in from the chimney!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvsjie8/"
    },
    {
      "created_utc": 1766617740.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 180-137\n\nSeason record: 17-14\n\nLast POTD: __Scottie Barnes O13.5 RA @1.80 1U__ ❌\n\nToday’s POTD: __Anthony Edwards 30+ Points @1.71 (BetMGM) 1.2U__\n\nNBA | Timberwolves v Nuggets | 🏀  \n\nEnds with 12 RA, would play Barnes in that matchup everytime so no regrets. We move\n\nMerry Christmas to everyone, wishing a blessed day full of blessings. What better way to celebrate Christmas than to have some NBA action on this special day. Antman immediately stands out to me in this somewhat of a rival matchup and especially on this day. This’ll be his 2nd Christmas Day game in his career scoring 26 in his first one against the Mavs last year and im expecting a motivated Edwards here.\n\nAnd here’s what Ant said himself: “\n\n_It’s gonna be a night,” Edwards told Shams Charania of ESPN. “I’m gonna have 30 (points), for sure. I might have 40. But it’s gonna be a night.”_\n\nI mean hard not to back Ant with this statement right? \n\nI’m definitely sold on Ant chucking in this one, with only 20+ FGA, Edwards is over in 10/14 games with five 40-point performances in that span. \n\nDespite only going over in 2/L5 reg season games against the Nuggets (two hooks on 29), the volume has been top tier having 22+ FGA in all those games.\n\nBacking this Ant narrative play and im hoping he’s efficient, confident he’ll get his shots up just about making them.\n\nWould play this up to 31.5.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvsini4/"
    },
    {
      "created_utc": 1766617668.0,
      "author": "InconsolableBrat",
      "text": "POTD Record: 158-105 | Profit: +113.12u | ROI: 14.8%\n\nSeason Record: 18-9 | Profit: +25.86u | ROI: 29.1%\n\n \n\nLast Pick: Toronto Raptors vs Miami Heat -4.0 @ 1.91. 3U. ❌\n\nJust a really bad game for the Heat, none of their starters shot even 50%, and as a team they shot just 26% from 3.  Anyways, we move on because we have an amazing slate of games for Christmas Day.\n\n \n\nNext Pick: **San Antonio Spurs +9.5 vs OKC Thunder @ 1.91**. 3U play.\n\nIt’s not every day you bet on a near double digit underdog to cover the spread, but this line feels disrespectful and not supported by form. The Spurs are at full strength, with Wemby having ramped his minutes up, and have multiple guys playing very well recently (Castle, Vassell, Keldon, Kornet etc.) and I won’t be surprised to see Fox and Wemby go berserk on this nationally broadcast game. The Spurs have literally beaten OKC straight-up twice in the past 11 days, and have won 9 of their last 10 games. OKC are the best team in the league and favorites for the title for a reason, but this line requires nearly everything to go perfectly for OKC and I think this young, energized Spurs team will bring it against OKC. Even if OKC win I think the game stays close.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvsih5l/"
    },
    {
      "created_utc": 1766617534.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 25-17 (+6.46U)**\n\nROI: +11.75%\n\nLast POTD: NBA: Brandon Ingram 20+ Points + Donovan Clingan 8+ Rebounds Parlay -126 (1U TO WIN 0.79U) x\n\n**POTD: NFL: Ceedee Lamb 5+ Receptions + Gibbs 90+ Rushing & Receiving Yards Parlay -124 (1U TO WIN 0.79U)**\n\nWrite up: Model has this as the highest confident Edge % and EV % for the day. Merry Christmas everyone!!!!! Make sure to spend some quality time with the family if you celebrate. Let’s cash. Please PM me for other model plays if you want some more options for XMAS GAMES! \n\n• ⁠Model has Gibbs at 115+ \n\n• Model has Ceedee at 7+ receptions \n\n• The model has this as a high confidence play - there is about a 10-11% edge for both of these plays\n\n• EV better betting 100$ = 12-14$ for both of these plays combined\n\n•It’s Christmas, I expect the stars to shine today \n\nPOTD History: [https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn](https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn)\n\nBOL!\n\n**POTD: NFL: Ceedee Lamb 5+ Receptions + Gibbs 90+ Rushing & Receiving Yards Parlay -124 (1U TO WIN 0.79U)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith))",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvsi5g3/"
    },
    {
      "created_utc": 1766617475.0,
      "author": "Fair-Asparagus-9264",
      "text": "**Record 6-4** (+3.94 Units)\n\nPrevious Pick: De’Von Achane 120+ yards Rush and Receiving +100 2U X\n\n**POTD:** **Cowboys -2.5** and **Lions -2.5** **(-139) 5U**\n\nTwo games against two eliminated teams starting two terrible back-up quarterbacks.\n\nLeg 1: Tale of two sucky defenses which would have made for a surefire shootout if either Jayden Daniels or Mariota were playing. Instead the commanders, injured beyond the pale, are forced to go with their third string veteran bench warmer QB Josh Johnson who, until last week, threw a sum total of 3 receptions since 2021. When he came in for the injured Mariota against the Eagles, he went 5/9 for 43 yards and an INT earning him a QBR of 5 (no like that’s an actual score a QB can get). It’s the Cowboys, so he may get in a decent drive or two – but given that Dallas is likely to put up 30+ against one of the worst defenses in the league save the Bengals, -2.5 should not be an issue.  \n\nLeg 2: A must win for the Lions after a devasting loss where they had two game-winning TD’s overturned by OPI in the final 20 secs. They are now on the brink of missing the playoffs and need to win out. They come in banged up (Amon St. Brown nursing a knee injury, o-line and secondary bleeding) but still have Goff and Gibbs in an indoor stadium. What seals this game for me is Max Brosmer under center. Brosmer has been awful in the limited action he’s seen – avg 3.3, 5.8, 4.2 yards/attempt in garbage time. The only game he started was against Seattle where he threw 4 interceptions, was sacked 4 times, and earned a pathetic QBR of 5 (no like that’s an actual score a QB can get) on way to a 0-26 blowout loss (first shutout for Seattle since 2010 and first time Vikings failed to score in a game since 2007). So yea, He’s epochally bad. There is simply no way he is keeping up with a Lions team desperate to make the playoffs.\n\n**Cowboys -2.5** and **Lions -2.5** **(-139) 5U** – BOL of Tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvsi060/"
    },
    {
      "created_utc": 1766617403.0,
      "author": "Pefkov",
      "text": "**Record**: 20-11\n\n**Net Units**: +8.01\n\n**Last Pick**: Phillip Rivers 170+ passing yards (+120 on DK) 1u to win 1.2u ✅️\n\n**Todays Event** 🏈 NFL 🎄Christmas🎄 Thursday  Football  @  12 PM CST 🏈 \n\n**Todays Pick** Javonte Williams o73.5 rushing yards (-113 on DK) 1u to win 0.88u\n\n**Writeup:** Cowboys face Commanders for a classic no stakes matter holiday beatup. Javonte Williams has been taken off the injury report for neck problems so it's his time to shine.\n\nJavonte is averaging 15.9 rushing attempts a game with 76.5 averaging rushing yards, for an average of around 4.8 YPC, with the Commanders defense allowing that exact YPC\n\nCommanders have been awful, one of if not the worst rush defenses as of lately. Np wonder they are ranked 29th. Saquon rushed for 132 last week. Tyrone Tracy Jr for 70 two weeks ago. Aaron Jones for 76, held RJ Harvey to 35 but got destroyed by Achane and Gibbs the weeks prior. In the past 6 weeks, the RB1s average 95.8 rushing yards against the commies.\n\nCowboys are heavily favored to win this despite being on the road against a divisional opponent and having a bad defense Their line sits at a whopping -8.5, Vegas clearly expects a spanking here. Mariota is out putting in third stringer Josh Johnson who's passing line sits at 178.5 despite going against such a mediocre defense.\n\nThis game should be over after the first half. Commanders season has been done for awhile, expect lots of rushing and more than likely boring Football. \n\nBOL everyone tailing, may those bets be cahsed to spend on some christmas/new year shenanigans, and be sure to spend some time with friends and family if you can!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvshtuq/"
    },
    {
      "created_utc": 1766617375.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1puznd1/pick_of_the_day_122525_thursday/nvshrde/"
    }
  ]
}