{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/12/25 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/",
  "target_date": "2025-12-12",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-12T19:36:39.435317+00:00",
  "comments": [
    {
      "created_utc": 1765566186.0,
      "author": "ControlRoyal1768",
      "text": "Record: 28-21 (+21.22u)\n\nLast 10:✖️✖️💰💰✖️✖️✖️✖️💰✖️\n\nLast POTD: 🏈 Chris Godwin 25+ alt receiving yards + Tyler Allgeier 15+ alt rushing yards (-156) ✖️\n\nWriteup: Nailed the game script, missed on Godwin. Thought Mike Evans would take a week to ramp up production, but he’s already back.\n\nToday’s POTD: 🏀 UConn -13.5 (-110)\n\nGame starts at 8pm EST. Bet 2.25U\n\nWriteup: Fading the public and taking UConn to cover the spread against Texas. \n\nTexas holds a 66th position in all-play percentage and an offensive efficiency ranked 43rd, boasting a field goal percentage of 47.92%. In contrast, UConn excels defensively, ranking 10th overall in defensive metrics. The game is expected to be played at a slower tempo, with UConn preferring this pace.\n\nTexas is expected to hit 27.6% from three, 38.2% from mid-range, and 40.2% overall, whereas UConn is projected to achieve 39.8% from three, 37.4% mid-range, and an impressive 49.8% overall.\n\nWhen it comes to rebounding, UConn shows a significant advantage, dominating both offensive and defensive boards, while Texas has faced challenges limiting second-chance opportunities. UConn effectively limits turnovers and maintains a high field goal attempt rate.\n\nIn free throw opportunities, Texas ranks second nationally in attempt rate but struggles with a 72.02% conversion rate.\n\nI like the UConn defense to show up in this one as they still need to prove to the committee why they belong with the top dogs in NCAAB. Their slower, more methodical pace should help them find points in the paint as well as beyond the arc, with the massive rebounding advantage being a huge part of getting more shots up. Give me UConn to win by 14 or more tonight.\n\nRemember to only bet what you can afford to lose, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntoxpvw/"
    },
    {
      "created_utc": 1765564909.0,
      "author": "Mikeyxy",
      "text": "Where are my goats",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntotf4g/"
    },
    {
      "created_utc": 1765564778.0,
      "author": "slickniick26",
      "text": "Record: 5-1 (+3.9U)\n\nLast Pick: UT Rio Grande Valley -2.5 ❌ 1.1 Units for 1 Unit\n\nEvent: Cal Baptist at Eastern Washington (NCAAB) (6pm Pacific)\n\nPOTD: Cal Baptist -3.5 (-110) 1.1 Unit to win 1 Unit\n\nWrite Up:\n\nTough one with the Vaqueros on Thursday as they had a lead for about 25 minutes before the wheels fell off.\n\nLooking to bounce back on Friday with one more small slate before we attack Saturdays insanity. Cal Baptist started 7-0 overall with some quality wins at Oregon State and UC Irvine. Since the start of December they’ve been playing in some hostile environments in altitude at Colorado, BYU and Utah. They had every chance to win the game in Boulder and Salt Lake City, but ultimately ran out of gas late in the second half.\n\nEastern Washington is 1-7 overall against D1 competition with their one win coming at home last time out against a very crappy UMKC squad. Prior to that, they played every other game on the road. \n\nUsually I’d be on the home team in this spot, but I’m not a fan of Dan Monson’s Eastern Washington’s group this year. I also believe the five true road games along with an active three game losing streak for Cal Baptist will keep them laser focused for a full 40 minutes.\n\nI wouldn’t be suprised if this game is tight in the first half, but I expect the Lancers to settle in and win this game by 8+ points on the road. \n\nBOL and enjoy the games",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntosz06/"
    },
    {
      "created_utc": 1765563306.0,
      "author": "coltysports",
      "text": "__POTD Record:__ 1 - 0 __+1u__\n\n__Previous Pick:__ North Dakota State -6.5 ✅️\n\n__Event:__ Cal Baptist @ Eastern Washington 9pm EST\n\n__POTD:__ Cal Baptist -3.5 @ -110                        \n\n__Reasoning:__ Cal Baptist (7-3) RPI is 67. Close losses to Utah and Colorado. Lost three straight to good teams. They are due for a win over a E Washington (2-7) team who's been losing to slouches.\n\n__Bets:__ .5u\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntonzrn/"
    },
    {
      "created_utc": 1765562715.0,
      "author": "Timely-Conclusion532",
      "text": "Record: 293-182\n\nForm: ❌❌✅✅✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅✅❌❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌❌❌❌✅✅❌✅✅✅❌✅✅✅✅❌✅✅❌ ❌❌❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌✅✅✅✅❌❌✅✅✅✅✅✅❌✅✅✅✅❌✅❌✅❌✅✅❌✅✅❌❌❌✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅✅✅❌✅✅❌✅✅❌✅✅❌❌✅❌✅✅❌❌❌❌❌✅✅✅✅✅❌✅✅✅❌✅❌✅❌❌✅❌✅❌✅❌✅✅✅✅✅✅❌✅❌✅❌✅✅✅❌❌✅❌✅❌❌❌✅✅✅✅❌❌✅❌❌✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅❌✅✅✅✅✅✅✅✅❌❌✅✅✅✅❌❌❌✅❌✅✅✅❌✅✅❌✅❌❌❌❌✅❌✅✅✅✅✅❌✅✅❌✅✅✅✅✅✅✅✅❌✅❌✅❌✅❌❌❌❌✅✅✅✅❌✅✅❌✅✅❌✅✅✅✅❌❌✅✅✅❌✅❌✅✅❌❌✅❌✅❌❌✅❌❌❌✅✅❌✅✅❌✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅❌✅✅✅✅✅❌❌✅✅✅❌❌❌❌❌❌✅❌✅✅✅✅✅✅✅✅❌✅❌❌❌✅❌✅✅❌✅❌❌✅❌✅✅✅❌✅✅❌✅❌✅ ✅❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅❌✅✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌✅❌✅✅✅❌✅❌❌❌✅✅❌❌✅✅✅❌❌✅❌✅❌✅❌❌✅❌❌❌❌✅✅✅✅✅✅❌✅✅❌❌❌❌✅✅❌❌❌❌✅✅✅✅❌✅✅❌❌✅✅✅❌\n\nNet Units: +2.08 units (All plays 1 unit)\n\nYesterday’s Pick: (NHL) Dallas Stars ML vs Minnesota Wild (-142) ❌\n\n**POTD: (NBA) Chicago Bulls ML vs Charlotte Hornets (-152) (7:00 PM EST)**\n\nReasoning: The 9-14 Chicago Bulls take on the 7-17 Charlotte Hornets on the road tonight in a battle of mediocrity however I like the Bulls to come away with the victory. Reason being, we have strong H2H trends in this game. In the last 10 meetings between these two teams, the Bulls are 8-2 in those games. The Bulls are also 8-2 ATS in the last 10 vs Charlotte. To further the reasoning, line movement has also favored the Bulls. The line opened at -110 and currently sits at -152. To go along with the trends and line movement, the Hornets will be without their best player, LaMelo Ball tonight along with some other key players. Looking at the bet and money %, Charlotte is receiving 40% of the bets and 28% of the money, meaning Chicago is receiving majority of the money, which is what we want to see. So with H2H trends, line movement, money percentage, injuries all going in favor of Chicago, let’s play the Bulls on the moneyline tonight.\n\n👇\n\n&#x200B;\n\nhttps://preview.redd.it/w6szy1zect6g1.jpeg?width=1170&format=pjpg&auto=webp&s=6a3d2d163e448b44a7e68e4f0f9afb2bf2af4fd7",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntom045/"
    },
    {
      "created_utc": 1765562501.0,
      "author": "ubertodev",
      "text": "AI NFL Analytics Agent at [https://pollox.ai?q=rt](https://pollox.ai?q=rt)  \nHere are the best betting picks for Week 15:\n\n# 🎯 Best Picks:\n\n1. **IND @ SEA**\n   * **Pick:** **Fade Home Favorite** — **IND +13.5**\n   * **Confidence:** High\n   * **Key Factors:**\n      * Line moved from -3.5 to -13.5, indicating sharp money on SEA.\n      * Historically, sharp money often fades big moves toward home favorites.\n      * Injuries: Key players for both teams are questionable.\n2. **ARI @ HOU**\n   * **Pick:** **Fade Home Favorite** — **ARI +9.5**\n   * **Confidence:** High\n   * **Key Factors:**\n      * Line moved from -6.5 to -9.5, suggesting sharp action on HOU.\n      * Value on ARI as underdogs, especially with key injuries on both sides.\n      * Marvin Harrison Jr. is OUT for ARI.\n3. **WSH @ NYG**\n   * **Pick:** **NYG -2.5**\n   * **Confidence:** Medium\n   * **Key Factors:**\n      * Line tightened 4.5 points, indicating sharp money on NYG.\n      * WSH's QB is OUT, supporting the fade on the road team.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntola5f/"
    },
    {
      "created_utc": 1765561463.0,
      "author": "Mysterious-Career938",
      "text": "**POTD Record: 8-7**  \n  \n**POTD Unit Count: +1.3u**  \n  \n**Last POTD: Kawhi O 7.5 RA Points -135 1.35u CASH**  \n**Today’s POTD: Jalen Johnson O 23.5 Points -125 1.25u (Onyxodds)**   \n**NBA | Hawks @ Pistons | 7:00 PM EST**\n\n100% HIT RATE! \n\nJalen is over this line in 8 of 8 games this season without Kristaps & Young when playing at least 30+ minutes, which he should see here! \n\nJalen is over this line with 28/25/29 in the last 3 matches head to head vs the pistons \n\nJalen also did the 29 and 25 in both games vs them this season so this isn’t just a fluke of last years data!  \n\nPistons also give up the 4th most points to the PF position",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntohrji/"
    },
    {
      "created_utc": 1765559803.0,
      "author": "Donloppa",
      "text": "Record: 3-2\n\nNet Units: +0.61 units\n\nPick: 2 Units to win 1.81 Units.\n         South Carolina St vs Queens University\n        Over 156.5 -110 Bet365\n\nWrite Up: Feel free to fade, model is showing me this is the play for today. \n\nTail or fade, thanks",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntoca1f/"
    },
    {
      "created_utc": 1765558762.0,
      "author": "OkGuarantee1024",
      "text": "POTD Record: 0-0\n\nEvent: Bundesliga, Union Berlin vs RB Leipzig ⚽️\n\nToday’s Pick: Union Berlin ML +215, 1 Unit\n\n\nIts a bit of a risky pick but everyone seems to be on leipzig. Leipzig’s back line is top tier but their attacking front is young (all 20 y/o or younger) and this feels like a bit of a trap of RB Leipzig. Union lost 3-1 to wolfsburg while only allowing 3 shots on target so ill wager on that not to happen again. Their loss against heidenheim they allowed two 90th minute/extra time goals. They also almost beat Bayern but a Harry Kane 93rd minute equalizer left that a draw. Unions showed the potential to win as an underdog and I’ll take the home side to put it together in this fixture and secure the victory at home.\n\nAlso the Blues are 1-8 SU as a favorite of -130 or less this season. Blackhawks ML a secondary play for those inclined (not counting on POTD record) just a tip",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/nto8tvh/"
    },
    {
      "created_utc": 1765558396.0,
      "author": "Emergency_Emu_891",
      "text": "Record: 14-4, +19.35u, 40.96% ROI\n\nForm (oldest -> newest): ✅✅✅❌✅❌✅✅✅❌✅✅✅✅✅✅✅❌\n\nLast Pick: Kevin Durant o19.5 pt v LAC, Toumani Camara o1.5 3 pointers made v NOP, -154 on DK at time of writeup, betting 2.5u ❌\n\nWhat a weird game from KD. 3 points in Q1, 0 in Q2, 13 in Q3, 0 in Q4. I didn't watch this game so not sure exactly what was going on, but him having 2 scoreless quarters in a close game is very odd. Camara hit 2 3s early. First loss in the last 8 picks, let's bounce back today.\n\nToday's Pick: Josh Giddey o6.5 reb v CHA, Michael Porter Jr o19.5 pt v DAL, -135 on DK at time of writeup, betting 2u\n\nJosh Giddey only had 3 rebounds last game in a blowout loss to GSW, but in a winnable game against CHA, the model likes him (again, we had Giddey a few picks ago) to bounce back to his typical rebounding performance. CHI is a team facing a lot of injuries, Ayo and Kevin Huerter are out, and Tre Jones, Coby White, Zach Collins, Jalen Smith, and Isaac Okoro are all probable. Assuming these probable guys play, they're not going to be at 100%, which could create more rebounding opportunities for Giddey. This MPJ line seems like a trap if I'm being honest, but I can't quite crack it. Cam Thomas is still out. MPJ has dropped 20+ in 12 of L13. His last games have been 35, 33, and 35 point outings. Yes, DAL is an opponent that typically plays in low scoring games. Yes, BKN is on the road and 8.5 point underdogs. But, we're taking such a low number for the clear top scorer on this BKN team. Trusting my model's second top play of the day. Standard 2u play for this parlay, let's get back in the win column. BOL to all tailing",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/nto7krl/"
    },
    {
      "created_utc": 1765557815.0,
      "author": "AdAggressive6388",
      "text": "Record: 7-4\n\nSport | NHL Chicago Blackhawks vs saint Louis Blues\n\nPick: Over 5.5 (-130)\n\nWrite Up: the last couple games for both these teams have been very high scoring. The blues are coming off one day of rest in which they got smoked 7-2. They have been leaking goals giving up more than three goals the last 3 games. On the other side the blackhawks are no better aside from their last game they gave up 7 and 6 goals before that. I think that 5.5 is too low for this match up so expect the over to hit.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/nto5lcy/"
    },
    {
      "created_utc": 1765557461.0,
      "author": "coltysports",
      "text": "__POTD Record:__ 1 - 0\n\n__Previous Pick:__ North Dakota State -6.5 ✅️\n\n__Event:__ Cal Baptist @ Eastern Washington 9pm EST\n\n__POTD:__ Cal Baptist -3.5\n\n__12/12 Complete Picks:__\n\n__Colt's Picks (2-3)__                           \nUMBC -6.5                          \nXavier -17.5                          \nTexas +14.5                          \nMcNeese -19.5                          \nCal Baptist -3.5                          \n\n$25 bonus bet on UMBC -6.5 + McNeese -19.5 + Cal Baptist -3.5 = $149.21\n\n__Sky's Picks (2-3)__                                       \nArmy/UMBC Over 146.5                          \nMizzou St +18.5                          \nTexas +14.5                          \nE Texas/McNeese Over 142.5                        \nCal Baptist 1st half ML\n\n                                                                                \n__Dad's Picks (4-1)__                          \nArmy +6.5                                              \nMizzou St +18.5                          \nTexas +14.5                          \nMcNeese -19.5                          \nCal Baptist -3.5                          \n\nDad hit is UT Arlington bet. He's got $50 on Cal Baptist -3.5 with odds boosted to payout $110.45.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/nto4dkr/"
    },
    {
      "created_utc": 1765554896.0,
      "author": "BackgroundAd3210",
      "text": "Record: 0-0\n\nNet Units: +0.00\n\nROI: 0.00%\n\nBasketball | NCAAB | Friday, Dec 12 @ 6:00 PM ET\n\nPick: UMBC -6.5 (-105) (2u)\n\nWrite Up:\nThis pick targets a significant mismatch in offensive efficiency and home/road splits. The core of this handicap is Army's extreme reliance on the three-point shot; they attempt threes at one of the highest rates in the country but are converting just ~32% of them. \n\nConversely, UMBC is shooting 47.4% from the field effectively and has posted a strong 4-1 record at home. The Retrievers have the perimeter defense to contest Army's primary weapon, and Army's defense (allowing ~78 PPG) lacks the interior resistance to stop UMBC’s more balanced attack. I expect UMBC to control the pace and pull away in the second half for a double-digit victory.\n \nBOL and stake responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntnvkow/"
    },
    {
      "created_utc": 1765551370.0,
      "author": "Candid_Assignment963",
      "text": "Mervyn in a merkin never had a chance , white was the 💰",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntnjttr/"
    },
    {
      "created_utc": 1765551319.0,
      "author": "Sufficient_Ad8399",
      "text": "Great tipster that was one of the most bad bets I've seen Mervyn king has been shit for years LOL easy money ian white 💸",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntnjo06/"
    },
    {
      "created_utc": 1765549849.0,
      "author": "Hey52511",
      "text": "NBA POTD 10-9\n\nRudy Gobert Over 9.5 Boards. $2.05\n\nRudy Gobert in the regular season has hit this line in 18 out of 19 games with the one game with him ending up on 9 boards. Furthermore Draymon Green is out, so that's another big body that will not be on the floor. Now the issue here is Post is likely to be the replacement center, who is a stretch big who will likely pull gobert out from the ring, and GSW shoots a lot of threes meaning Gobert may not get to many boards rather than Randle. However, when GSW plays a rebounder that is top 10 in rebound chances they have gone over their line. Rudy gobert is ranked 6th in rebound chances at 19 potential rebounds a game. Currently GSW is also ranked 25th out of 30 in rebounds to centers per game. I expect gobert to crash the boards as well, as if he does not then I have no doubt chris flinch will bench Gobert instantly to have naz reid to go small ball. GSW is 27th out of 30th allowing opponents for Offensive rebounds and gobert is ranked 11th when crashing the boards. I think truthfully this bet may not hit as in the Playoffs Gobert has gone under this line, with his team mates varying with McDaniels getting 13 boards or Ant/Randle getting the boards. But at $2.05 i think there is a lot of value.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntnf4zq/"
    },
    {
      "created_utc": 1765549210.0,
      "author": "kobetolebron",
      "text": "I bet darts once.... once..\n\n![gif](giphy|G1LLrj1ZJR3jayfxj7)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntnd6nm/"
    },
    {
      "created_utc": 1765549131.0,
      "author": "ShadowJacker1113",
      "text": "Mervyn a bum",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntncxvq/"
    },
    {
      "created_utc": 1765545864.0,
      "author": "whidswhinners",
      "text": "**2025 NFL Record:** 20W - 10L  \n**2025 MLB Record:** 4W - 1L  \n**2025 NBA Record:** 4W - 5L  \n✅✅✅❌✅✅✅✅❌🩼✅✅✅✅  \n❌✅🪝✅✅✅❌✅✅✅❌✅❌✅  \n✅✅❌✅❌❌✅❌❌✅✅✅✅❌  \n❌❌\n\n**Net Units:** \\+6.03 units (I only promote 1u wagers)\n\n**Last Pick:** Anthony Black - o4.5 Rebounds (-125 on Bet365)❌\n\n**Event:** NBA: Pacers vs 76ers (7:00PM EST)\n\n**Today's Pick:** Andrew Nembhard - o6.5 Assists (-120 on Bet365)\n\n*Nembhard has cemented himself as the offensive hub, recording 12+ potential assists and 6+ actual assists in five consecutive games.*\n\n*The 76ers surrender the 8th most assists in the league (2nd most in the paint), and their aggressive pressure scheme has recently allowed opposing PGs like Giddey (12) and Doncic (11) to pile up stats.*\n\n*Nembhard is averaging 60+ passes per game and leads the team in assists in 80% of his appearances, offering a high floor for production.*\n\n*Indiana has stabilized, winning 4 of their last 6 games with top-12 efficiency ratings, ensuring Nembhard stays on the floor in competitive game scripts.*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntn3f6r/"
    },
    {
      "created_utc": 1765534681.0,
      "author": "SkillResident4169",
      "text": "🎯 WORLD CHAMPIONSHIP 🎯\n\nDARTS POTD RECORD **75-40** | Overall 75-42 | All POTD bets between 1U-2U\n\nToday’s Pick: **Ian** **White ML** vs Mervyn King **@ 1.90** \\[bet365\\] / 1.5U\n\nWell well well, if it ain't that time of the year. Christmas is coming and that means one thing: the pinnacle of Darts, every night. Opening night was quite boring to be real, I didn't manage to get a pick out in time but I'm looking to get this shit rolling tonight. \n\nNot a whole lot I like on tonight's card but I am more than happy to back Ian White vs ole' Merv King who I genuinely can't believe is here. Not because he's playing badly but because he's been in the darting wilderness last few years. I will say its great to have him back. One of the most hilarious characters in Darts lol. \n\nI wouldn't say either of these guys have played particularly great this year at all but I do think White has the slight edge in this one and 1.90 is decent value. I know Ned has made his yearly appearance and is backing King so I wouldn't be surprised if he's actually moved the line a fair bit, and fwiw I wouldn't have taken this pick at the earlier price of \\~1.66.\n\nWhite edges almost all metrics that I'm interested in. White in his prime was notorious for destroying the trebles but not finishing well, and whilst the second part is still true he actually has an ever so slight edge in checkout % compared to Merv. His 3 and 6 month rolling averages are higher and one of my favourite stats is avg with throw of which he has an edge 91.4 vs 87.6. Power scores per leg White leads (0.24 v 0.2) and actually despite his poor form he is winning a higher % of deciding legs than Merv (43 vs 38). One factor that is hard to quantify is how Mervyn King will react to being away from the big stage for 3 years. His performance could go either way I think.\n\nHonestly I don't imagine many (if any) will be tailing me tonight given Ned's on the opponent but still thought I'd put my 2c out there. And please no bullshit comments after regardless of who wins. I only post here for a bit of fun. Ta",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntmfjy4/"
    },
    {
      "created_utc": 1765533320.0,
      "author": "Lyx97",
      "text": "Record: 12-5-2\n\nNet Units: +3.09\n\n*Prev Pick : Samsunspsor Handicap 0  @ 1.945 (1u) --> Loss \\[I would still stand by the pick, but what an utter shitty performance by the home side. Went into lead at the 4th minute & then did nothing to win & collapsed spectacularly in the 2nd half. Too damn depressed with this result\\]*\n\nFootball | Bundesliga | FC Union Berlin vs RB Leipzig | in \\~9.5hrs\n\nBTTS @ 1.73 (1u) \n\nWrite Up : Trying my luck with the Bundesliga, another league where goals flow. While Leipzig is the favorite, being 2nd in the league, Union is pretty good at home and also has scored in all their 5 recent matches (including 2 against Bayern). Leipzig is also a team that loves to score & will want to continue their winning streak. I expect some goals from both side & attacking football. BTTS at 1.7 seems value for me.\n\n*Just hoping that it doesnt become a park the bus by Berlin or a total runaway victory for Leipzig.*\n\nHope we return to winning ways & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntmd7z1/"
    },
    {
      "created_utc": 1765531094.0,
      "author": "san_solares",
      "text": "Net Units: +69.25  \nROI: 19.93%  \nRecord: 41-18-10 (W/L/P)\n\nLast POTD: Manchester City TT O 1.5 (W)\n\nAs always, full transparency, tracker at the bottom.\n\nToday's POTD: Bundesliga - Union Berlin v RB Leipzig - 14.30 PM EST - RB Leipzig ML (2.30) - 5U\n\nI really don't understand why Leipzig is plus money here. \n\nI'm not saying they will win surely, but I feel like this is a spot that is just too hard to pass up. Union Berlin hasn't won a Bundesliga game at home since october; while Leipzig hasn't been great away from home, at least they have looked better. They have scored 6 goals in a match twice since halloween, and overall just score a lot of goals. I'd say this is a fairly inconsistent team but I feel like they should have the upside versus a weak Berlin team. \n\nBOL, tail responsibly.\n\n[TRACKER](https://docs.google.com/spreadsheets/d/1-PHX-U7eiB5neVpbTJVkzwquGE1KyGVQA5nfejcDT_A/edit?usp=sharing)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntm9hmq/"
    },
    {
      "created_utc": 1765526226.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 19-13, +3.93u, (ROI +9.8%)\n\n**Previous Pick:** Maccabi - Lyon, over 172.5 points, 1.92, 1u ✅️, (last 5: ❌️✅️✅️❌️✅️)\n\n**Event:** Euroleague: Monaco - Fenerbahce, 19:30h\n\n**POTD:** over 167.5 points, 1.92, 1.5u \n\nMonaco is one of the best offensive teams in EL across all categories, ranking in the top 3 in points, total attempts for 2 and 3 points, and %.\n\nFenerbahce has the best defense in EL, despite problems on the other end; their defense has led to 10 consecutive wins across all competitions. I like the given limit of 168 points; it is very manageable for the team that just broke the EL record with 125 points in one game. That game was with crazy 60% for 3, so hard to beat, but all that is needed here is 85 points from each team.\n\nFenerbahce had a canceled game last round with Olympiakos, unfortunately for them, since they are in good form, and Olympiakos is not.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntm19m9/"
    },
    {
      "created_utc": 1765520552.0,
      "author": "xanderforde",
      "text": "Record: 0-0\n\nNet Units: 0\n\nROI: 0\n\nCounter-Strike 2 | Budapest Major | 11 hours from now\n\nPick: Rounds handicap (overall) = MOUZ -6.5 vs FaZe Clan @ 1.85 - 5 units\n\n\nWrite Up: Sharing my CS2 picks here as my predictions have been 80% spot on.\n\nThe quality between MOUZ and FaZe is massive, to say the least. MOUZ are better tactically as a team and they have a better AWPER. For the uninitiated, the AWP is the most powerful gun in the game, usually held by a team's best player. FaZe's AWPER, broky, has been struggling a lot recently. He is the weakest link in this FaZe team, and many consider him to be the only one holding them back from reaching greater heights - which is true. Although broky performed well against Passion UA, no offense but Passion UA is a terrible team with an equally terrible AWPER. Against a tactically sound team like MOUZ with an arguably Top 5 AWPER in torzsi, FaZe doesn't stand a chance. And FaZe is known for playing chaotic CS. They won't stand a chance against MOUZ and I can see MOUZ covering this rounds handicap.\n\nAlthough they beat Vitality in Round 1 of Stage 3, FaZe got wrecked by Team Spirit and Mongolz. They only got to the playoffs by beating weak and unstable teams like 3DMAX and Passion UA. And even though Passion UA is a bad team, they still managed to put up a fight against FaZe.\n\nMeanwhile, MOUZ got to the playoffs by beating PARAVISION, B8 and Falcons in convincing fashion. They lost to Spirit 2-1, but it was evenly matched compared to the beating that FaZe got from the same team.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntlqphk/"
    },
    {
      "created_utc": 1765519884.0,
      "author": "Ralphjinasseater",
      "text": "Record 14-13-2 \n\nLast pick: Oklahoma City Thunder ML +  Shai Gilgeous-Alexander Over 29.5 Points(-120HR)❌ \n\nPick of the day :Pascal Siakam OVER 31.5 Points + Rebounds (-105 Fanatics)\n\nReason •  \nSiakam has been by far my favorite wagon this season and we go right back to him here in a great matchup versus the Sixers.\n\nComing off a bad game I love backing Siakam here for a great bounce back spot in a game he gets a perfect matchup.\n\nSiakam has stepped up big for the Pacers after the team dealt with many injuries to star players seeing great usage this season averaging 31.5 PR a game on 11.6 rebound chances and 18.6 FGA per game.\n\nSiakam gets a matchup versus the Sixers that gives him a favorable matchup to rack up points and rebounds here, let me break it down 👇\n\nSiakam scores a majority 18% of his points from transition where the Sixers allow the 6th most PPG against, and another majority comes from the free throw line where the Sixers allow the 13 most FTA per game.\n\nWhen looking at scoring zones Siakam gets a majority of his points from the RA where he records 31% of his points from, and the Sixers have been getting killed down low allowing the 4th most PPG in the RA, and when looking at shot type Siakam also gets a great matchup, he shoots 50% of his shots from <10 feet where the Sixers allow the 7th most shots per game.\n\nWhen looking at the rebounding matchup Siakam also gets an amazing matchup here 👇\n\nWe saw Siakam kill the glass against the Sixers last season averaging 7 rebounds per game against them on 15.7 rebound chances per game and I expect that to continue here as he now plays an even bigger role for this team than he did last season.\n\nWhen seeing 13+ rebound chances Siakam has cleared this line in all 8/8 games this season averaging 39.1 PR per game.\n\nThe Sixers allow the 3rd most rebounds per game to PFs(11.53) \n\nSiakam has killed this line against weak rebounding defenses clearing this line in 9/11 games this season versus teams that rank 16th or below in rebounds allowed averaging 34 PR per game.\n\nSiakam has been automatic this season when he gets the matchup, clearing this line in 8/10 games against teams that rank 15th or worse against transition and he’s over in 5/6 against teams bottom 15 rebounding and transition defenses avergaing 34.3 PR per game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntlpdd8/"
    },
    {
      "created_utc": 1765508402.0,
      "author": "Agitated-Ad3361",
      "text": "Record: 1-2 (-2.00 units ROI)\n\nSoccer | Keuken Kampioen Divisie 🇳🇱 | TOP Oss vs. ADO Den Haag\nDate: 12 December | Kickoff: 20:00 (Amsterdam time)\nPick: ADO Den Haag Over 2.5 Team Goals +100 | 2 units\n\nWrite Up:\n\nUnlucky on the last pick as the game finished with 3 total goals, just one short. The read was right, but that’s part of betting. We move on.\n\nFor this one I’m backing ADO Den Haag away at TOP Oss. ADO sit top of the league and continue to look like the strongest team in the Keuken Kampioen Divisie. Over their last five matches they average 2.4 goals scored, and their attacking output has been consistent home and away.\n\nTOP Oss are a bottom-tier side. While they’ve managed to keep some recent games close, the quality gap here is still significant. Against top teams in the league, Oss tend to struggle to hold their shape and concede chances once the pressure builds.\n\nThe head-to-head strongly supports this pick. For some reason, the last three games played at TOP Oss have all seen ADO score over 2.5 goals, and that was when ADO were still a mid-table or playoff-contending side. This season they are clearly a level above, leading the league from the start and playing with far more confidence and consistency.\n\nAdd in the fact that ADO have won the last six meetings overall, including the most recent 5-1 win, and this matchup continues to favor them heavily.\n\nEven away from home, with promotion firmly in sight, I expect ADO to dominate possession, create volume chances, and score at least three goals again.\n\nADO Den Haag Over 2.5 Team Goals at +100 for 2 units. Let’s get back to winning ways.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntkwhjw/"
    },
    {
      "created_utc": 1765507413.0,
      "author": "Certain-Challenge202",
      "text": "Record: 58-40 (+12.6)\n\nLast Pick: Razma -1.5 v Van den Herik\n\nToday’s Pick: Smith -1.5 v Harrysson \n\nSport: World Championship Darts\n\nReasoning: Smith is a far stronger scorer with a massive ranking gap, so over a short best-of-5 he’s likely to control legs early and build a multi-set lead. Harrysson’s lower 12-month averages make it hard for him to win enough legs consistently to force a 3–2, which pushes the match toward 3–0 or 3–1 outcomes, and although Harrysson can take advantage if Smith briefly switches off, Smith’s overall consistency and quality should carry the handicap.\n\nOdds: 4/6\n\nUnits: 0.5-1.5 units",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntktmuf/"
    },
    {
      "created_utc": 1765507376.0,
      "author": "2thyKing",
      "text": "Record: 10-2 (W1) \n\n💩☘️☘️☘️☘️☘️☘️☘️☘️☘️💩☘️ <- last pick\n\nNet Units: +12.23\n___\n￼￼￼￼￼￼￼￼￼￼Last pick: \n\n2-leg SGP James Harden 1+ STL / Kris Dunn 1+ STL ✅🤑\n\nLove it when the bet cashes in the first quarter! 😎 \n____\n￼￼￼￼￼￼￼￼￼￼Today’s pick:\n\nNBA Basketball 🏀\n\n**Joel Embiid UNDER 7.5 REB**\n(-126 DK) 1 Unit\n\nIndiana Pacers @ Philadelphia 76ers \n8:00PM EST / GMT -5 (22 hours from time of comment)\n\n￼Write Up: Embiid is yet again “probable” due to left knee injury management. He’s only seen over 26 minutes TWICE this season. \n\nThis rebounds line is too high. He has not recorded more than 7 rebounds in ANY game this season. He still seems to be frustrated and is a shell of his former self. His rebounds are reduced, he’s hurt, and the Sixers are being cautious with his use. \n\nThis one screams under all day.\n\nBOL\n___\n\n￼￼￼￼Tips, if you’re so inclined:\n\nhttps://buymeacoffee.com/2thy",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntktj8h/"
    },
    {
      "created_utc": 1765505848.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 205-157\n\nUnits Won: +97.73u\n\nLast Pick:  Career U 5.5 Deaths Map 1 + Keria U 5.5 Deaths Map 1 (+133) X\n\nToday's Pick: **Kanavi O 3.5 Kills Map 1 (-135)** 5u\n\nTeams: Hanwha Life Esports (HLE) vs. Damwon Kia (DK) | Time: 3:00 AM EST.\n\nWriteup:\n\n* Short writeup from me, bit unfortunate last night, caught two error lines that were later corrected and traded down by 2 deaths each, but we got two long games and losses which led to them going over anyway then going well under each of their next two maps each.\n* HLE come into this game as over -600 favorites, last night they were -110, so this game should be significantly easier for them\n* Kanavi is averaging 5.9 kills so far at Kespa Cup, he has a **7/7 cover rate** **on this line so far** and is averaging 6.16 kills per map win\n* Kanavi is one of the highest kill share junglers in the entire world, he almost always plays carries and takes a high % of kills relative to others at the role, he is one of the most elite carry junglers there is and he has looked great on HLE so far, very low risk of tanks especially this early in the series\n* Looking back at his previous map wins at more serious tournaments, 6/7 hitrate on this line at worlds, 11/13 hitrate in LPL playoffs\n* As mentioned yesterday, this tournament has a higher pace of play, more kills higher tempo good for overs\n* Books currently have kill total set to 36.5 with DKia \\~22.5 kills, that would mean if these are accurate, Kanavi needs just \\~17% kill share to hit this line, significantly lower then his normal number\n\n\\~If anyone needs help finding the pick or a place to bet esports can always reach out!\n\nBest of Luck",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntkp70j/"
    },
    {
      "created_utc": 1765503235.0,
      "author": "UserQAV",
      "text": "**Record**: 2-2 ❌✅❌✅\n\n**Net Units**: +4.0u\n\n**Last Pick**: Man City to win vs Real Madrid at 2.25 (3U) ✅\n\n**Event**: Germany Bundesliga (Soccer)\n\nUnion Berlin vs RB Leipzig\n\n**Pick**: Over 2.5 goals and RB Leipzig team total over 1.5 goals at 2.40 (2U)\n\n**Write Up**: Great win in the champions league. Moving onto our next pick. Leipzig have scored 6 goals in their most previous match, while Union Berlin had 4 goals combined from both teams. Both teams are attacking in their own ways and I am predicting at least 3 goals in this match, with at least 2 to come from Leipzig.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntkhxad/"
    },
    {
      "created_utc": 1765501930.0,
      "author": "NoDivide1763",
      "text": "NBA Atlanta Hawks at Detroit Pistons\n\nPrevious Pick: N/A\n\nRecord: 0-0\n\nNet Units: +0.00\n\nPOTD: 2 units **Jalen Johnson “O” 42.5 PRA** \\-115 (2.3u to win 2u)\n\nWrite up: \n\nJalen Johnson has been a real solid and consistent player as of late and has to go up against a solid defense of the Detroit Pistons. Despite this, 42.5 is a seriously underplaced line at 42.5 with Jalen Johnson having at least 49 pra or more in the last 5 games. This includes an away game at Detroit where he had 49 pra despite coming off a double OT game from the previous night and on the road. With Trae Young still out, it leaves the main ballhandling opportunities in the hand of NAW, Dyson Daniels, and JJ and it seems that JJ has been taking more and more on this role as of late. Kristaps Prozingis has also been ruled out for this game leaving most of the defensive rebounding opportunities open for Jalen Johnson. Have played this line as a straight the last 4 games and I’m sure he’ll keep this hot streak up, BOL. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntkeemx/"
    },
    {
      "created_utc": 1765501668.0,
      "author": "dreamchasing1",
      "text": "Record: 239-221 Net Units: -22.18 53-54 on 1.5u plays, 39-40 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Conference League] Jagiellonia vs Rayo Vallecano\nLast pick: Asian total corners over 9.5 @ 1.87 won\n\n\nEvent: Soccer/Football, [Netherlands Eerste Divisie] FC Dordrecht vs FC Eindhoven\n\n\nPick: total corners over 10.5 @ 1.72 - 1.5 Units\n\n\nWith 9 games played at home, Dordrecht have averaged 13 total, close to 7 for and went over this line in 7/9 games. In away games, Eindhoven average 13 total, 5.60 for, going over this line in 8/9 games. The two teams met in September in a game with 15 total. In general, in 19 total games, both sides have went over this line in big majority of games as well, with good averages.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntkdpcw/"
    },
    {
      "created_utc": 1765500824.0,
      "author": "Dmyers9099",
      "text": "Record 1-0\n\nUnits: +1.1\n\nPrevious: Braga ML ✅\n\nEvent: ⚽️ Palermo v Sampdoria (Italy Serie B) 2:30pm EST\n\nPOTD: Palermo ML -150 (DK)\n\nPalermo hosts Sampdoria in league play. They’ve scored 14 goals in their last 5 matches while only allowing 3. Sampdoria have scored 5 in their last 5 while allowing 7.\n\nSampdoria have been poor on the road this season with an away league record of 0-2-5. Palermo’s home record is 4-3-1 including 5-0 wins in each of their last two home matches.\n\nPalermo sit at 5th on the league table with a goal differential of +13. Sampdoria are sitting at 19th with a differential of -7.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntkbfpf/"
    },
    {
      "created_utc": 1765499456.0,
      "author": "ptrckfrnndz",
      "text": "+10.32\n\n10 - 6\n✅️✅️\nSports: Tennis\n\nPrev: sevastova vs rajaonah ML @2.2 5 UNITS ✅️\n\nPick: mattel marie/webb stefani vs. Miyamoto ayumi/yoshioka kisa ML @1.83 5 UNITS ✅️\n\nTime: abt 1hr from posting \n\nReasoning: another win. Hopefully we can get 3 in a row.. 2/0 compare to 6/0 doubles record, also data shows that the japanese pair even tho separately, have been playing more doubles matches compare to their opponent.. bol\n\n\nReddit daily pick \nhttps://www.reddit.com/r/sportsbook/s/yUJ5FO7kAG",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntk7m16/"
    },
    {
      "created_utc": 1765498934.0,
      "author": "redditusernameuneak",
      "text": "Record: 4-3\n\nUnits: +3.09\n\nPrevious Pick: (NBA) De’Aaron Fox over 22.5 points ❌ he ended with 20, and I’m 0-3 for NBA picks. Fade me if I ever do an NBA pick again if you want to make money.\n\nEvent: (WNBL) Geelong Venom (W) vs Bendigo Spirit (W) \n\nPOTD: Bendigo Spirit (W) -9.5 (1.90 on Bet365, 2.2 units for 2.18 units)\n\nWrite-Up: Spirit are on a 6 game win streak whereas Venom have won 1/6. They just met last week Friday 5 December where Spirit dismantled them 93 - Venom 58. I think the spread is still “moderate” despite the thrashing as Venom will be playing at home this time, and will have Ashley Arlen suiting up to make her debut (as an injury replacement player).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntk64kx/"
    },
    {
      "created_utc": 1765498779.0,
      "author": "Background_Law8395",
      "text": "Record: 2-0 +4.5u\n\nLast picks: UEFA Europa League: Dinamo Zagreb vs. Real Betis ML (+100) 2u ✅\n\nEvent: France Ligue 1: Angers vs. Nantes 11:45am PST\n\nPOTD: Angers ML (+115, BET365) 2u\n\nWrite up:\n\nComing back with yet another soccer pick as this tends to be my bread and butter. Angers are 3-2-2 at home this year, with their losses and draws coming against much better teams (Lens and Monaco being the main 2). They're 3-0-2 in their last 5 with the losses against much better squads in Lens and Lille. \n\nNantes have been very poor this season, just 1-3-3 away from home this season and 0-2-3 in their last 5 games. \n\nWhile both teams have only scored 13 goals each in Ligue 1 this season, Angers have conceded 7 less in the competition. See them winning 1-0 or 2-0, something along those lines. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntk5oao/"
    },
    {
      "created_utc": 1765498641.0,
      "author": "No-Gift-2350",
      "text": "POTD record: 0-0\n\nPOTD: **G2 MINNESOTA MAP 2 WINNER (-138) VS. BOSTON BREACH.** \n\n**2u**\n\nwrite up: \n\nThe Call of Duty league is back, and I think this season, in particular, so far, has been easier to predict than previous years. I am hoping for some beginner's luck, but I don't think I will need it with this one. \n\nThis line is the result of the new COD being released in the last month, team changes happening, new game mechanics, etc.\n\nWe have already seen some action this season, so I could give some data to make my picks, but the reality is, if you have ever heard of the game mode search & destroy, that is what map 2 is in the CDL game mode wise. \n\nIn the one search and destroy Boston has played this year, they lost it to the Carolina Royal Ravens, who are not a very good team at the moment, 6-5. In the three SNDs G2 has played this year, they have won two and lost to the reigning world champs 6-4 in an extremely close game.\n\nOn top of that, G2 has the second-highest Search & destroy Kill death ratio in the league and historically, have very good SND specialists like Estreal, Kremp had a 1.11 KD last season, Skyz(former world champion) and a really talented rookie in Mamba. While Boston has Snoopy who was a top 5 SND player, the rest of the team around him is incredibly mid at SND, Cammy and Nastie were ranked 40 and 41 out of 70 in KD last season, and Purj was ranked 59th. Compared to g2: Mamba(6th in a small sample size), Kremp(13th last season, 1st this year) Estreal(33rd), Skyz(56th). \n\n  \nI am going to say don't max bet this one. I would be comfortable around two-three units because it is still a brand new season, and things can get flukey, though this season is easier to predict because the game has a movement skill gap.\n\n  \nLol I hope this made sense, not always easy writing about cod cause most people have no clue what I am talking about.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntk5a4o/"
    },
    {
      "created_utc": 1765496756.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 12-8 (Avg Odds +131)\n\n**Previous Pick:** Donyell Malen 2+ SOTs (+160) ❌️\n\n**Today's Event:** Spanish La Liga | Real Sociedad vs Girona (12:00PM PST)\n\n**Pick:** Mikel Oyarzabal to Score or Give Assist (+100) 1.0 unit to win 1 unit\n\n**Write Up:** Malen had a duck of a game. Couldn't control the ball whenever it made it to him. Fluke bad game or bad read on my part, either way we move on. \n\nNot a ton of games today, but I do like this bottom table La Liga matchup. Oyarzabal has been on a year lately, scoring or assisting in 4/4 last La Liga games. He is really the best player on Real Sociedad, takes penalties, and has played all 90 minutes for the last 10/10 matches. Sociedad is not in any sort of European competition this year and the team has been in good form, so I suspect we will see a heavy dose of Oyarzabal. \n\nGirona have been very poor this season. They have not held a clean sheet in an away match all season and have kept only 2 clean sheets all year, both at home. Fresh off a 3-0 loss away at Elche, I expect Girona to struggle here again. \n\nI thought about taking ATGS straight here, but Oyarzabal has 2 assists in his last 3 matches and I like the odds at even money here to buy it down and give us both options to cash. \n\nBOL and happy Friday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntjzydm/"
    },
    {
      "created_utc": 1765495367.0,
      "author": "Ned_Pepper",
      "text": "Darts 🎯- 2026 PDC World Championship \n\n🌶️ Overall: 52-32-1 \n\n2026 PDC 🎯 World Championships: 1-0\n\nPrevious: \n\nMadars Razma (-161) v Jamai van den Herik ✅ \n\nPOTD: Mervyn King (+120) v Ian White\n\nRazma takes care of business for us on Day 1, winning 3-1, but with all but one set going down to that pivotal 5th leg. Even with a less-than-stellar performance, Madars turned it on down the stretch and advances to the next round. \n\nHere on Day 2 I am dead set on playing a slight underdog - really like the current world #125 Mervyn “The King” King to defeat current world #51 Ian “Diamond” White.\n\nDo not be fooled by the current world ranking disparity here - King has a plethora of experience at the highest levels of darts, albeit some time ago. King reached the World Championship SF & was Premier League runner up in 2009. More recently, King had his best PDC ranked finish at the 2021 Masters, a darts major, ultimately losing 8-11 in the Finals to Jonny Clayton. \n\nSince 2021, King took a bit of a hiatus from darts, though he has returned and been grinding hard on the Modus & PDC Tours this year. \n\nKing disclosed this year that a large factor in his hiatus was due to filing bankruptcy, as he owed $500k in unpaid taxes, admitting to reporters he was unaware he needed to pay taxes on his winnings. \n\nIan White has been a consistent player on the PDC since 2010, but he has zero televised titles and has not won on the PDC Tour since 2020. White also historically has been solid at scoring, particularly hammering that triple-20, but his finishing has long been his biggest weakness. \n\nOne other point worth noting on the Diamond is that- White has not won a single match on the PDC since October 14 of this year, finishing the tour season with four consecutive first round exits. \n\nLastly, since 2021 these two have met three times in ranked matches. In those matches, King is 3-0, winning each 6-0; 6-3; 6-3 respectively. \n\nI expect more of the same from White in this one, struggling on the outer ring and letting King hang around. Expect King to keep pace on scoring, while punishing White for his finishing mistakes. I believe King still has tremendous talent, and entering with a bit of a chip on his shoulder, will prove it to the darts world today.\n\n\n————Edit- Loss ❌——————\n\nKing goes down 2-3 in a pretty gross match all around. The King missed seemingly countless opportunities, especially in the pivotal moments, especially in an extremely disappointing fifth set. 27 missed darts at double is inexcusable. \n\nTough board tomorrow, with only one match even qualifying for the POTD. Will look to bounce back in the days to come.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntjw2g6/"
    },
    {
      "created_utc": 1765494233.0,
      "author": "MrPunter500",
      "text": "**Record: 6-4**\n\n**Net Units: 0.91 units up**\n\n**ROI: 9.10%**\n\n**Most recent plays**\n\n* Korpatsch vs Friedsam - Korpatsch ML @ 1.80 ✅\n* Korpatsch vs Rakhimova - Rakhimova ML @ 1.71 ✅\n* Kartal vs Pieri - Kartal Handicap -6.5 Games @ 1.71 ✅\n* Bassols vs Leonard - Leonard ML @ 2.19 ✅\n* Kartal vs Kalinina - Under 19.5 Games @ 1.85 ❌\n* Siskova vs Leonard- Leonard ML @ 1.97 ❌\n\nLeonard got completely destroyed and her performance was awful. A bad look on my end as two previous tournament wins probably made her a bit more tired than usual and not so invested in Limoges. Sorry to those who tailed these last two losses.\n\n**Tennis** | **WTA 125 Limoges** | **5:30 AM (Eastern Time)**\n\nPlays will always be shared as 1 unit for fair record purposes\n\n**Pick:** **Kalinina vs Parks - Kalinina Handicap -2 Games @ 1.89**\n\nKalinina appears in this tournament after a long break, and she impressed me quite a lot when she faced Kartal, showing solid groundstrokes from both sides and a gigantic clutch ability when it came to saving break points. While it's true that Kartal had the chance to dominate the first set, it was clear that Kalinina stepped up after breaking back, and her typical \"warrior\" mentality ended up being the main difference. She's not the most flashy player you'll see, but she plays simple and efficient tennis. \n\nWhen it comes to Parks, I was expecting much more from her in Angers, but she had an awful match against Korpatsch, where she lost on her own with unforced errors and a low first serve percentage. While I recognize that Parks can play well on this surface when her serve is on fire, things quickly change when that particular weapon is not on point. I feel like any player who's a decent returner can really punish Parks on the second serve and just keep the point alive until she makes an unforced error. \n\nKalinina is known for always trying to stay on each rally and produce sharp angles, especially from the forehand. This playstyle is usually a good recipe to beat someone like Parks, who is currently 0-3 against Kalinina, with each loss happening on a different surface (Hard, Clay, and Grass). The American was never able to take a set from Kalinina.\n\nWith the momentum and the confidence of beating someone like Kartal just in the 2nd match since her return, I feel like Kalinina will find a much easier path to victory against Parks.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntjss31/"
    },
    {
      "created_utc": 1765493831.0,
      "author": "tennisfanatic101",
      "text": "💎POTD: RB Leipzig ML\nOdds: +130 on FanDuel\nWager: 2 units\n\nRecord: 3-2\nNet Units: +.26\n\n⚽️Bundesliga, Union Berlin vs RB Leipzig, 12/12/25 Fri, 2:30 pm Eastern Time\n\nExplanation: Leipzig is coming in near top of the standings come with 9 wins, 2 draws, 2 losses and a +15 goal difference (28 scored, 13 conceded) through 13 games, while Union is not doing too well in 12th place, with just 4 wins, 3 draws, 6 losses and a negative goal difference. Also Berlin is in bad form losing there last 3 while Leipzig has won 3 of there last 4 with a draw as there non win.\n\nLeipzig is generating about 1.77 expected goals for (xG) per game and allowing only 1.39 xG against, so they consistently create more and better chances than they concede, whereas Union are around 1.3 xG for and 1.5 xG against. \n\nAlso, Leipzig is averaging roughly 16–17 shots per match compared to Union’s 12, which matters because over 90 minutes that shooting volume plus higher xG per shot tends to translate into at least one or two “big” chances created, which is crucial to score the goals necessary to win. \n\nLeipzig’s high-tempo, vertical attacking style,  pressing and pace in transition are exactly the recipe for them to win this match.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntjrlft/"
    },
    {
      "created_utc": 1765493672.0,
      "author": "nickhernandez1212",
      "text": "POTD Record: 0-1 (-2.0u)\n❌\n\nPrevious Pick: Luke Littler u5.5 180’s❌\n\nMy theory was correct but maybe my pick was flawed. Littler came out to a slow start, and the pick looked good with only 1 180 in the first set, however, Labansuskas put up way more of a fight than I expected giving Littler more legs with darts in his hands, leading to too many chances for 180’s. Onto the next. \n\nEvent: PDC World Championship (Darts) : Niels Zonneveld v. Haupai Puha 7:30am EST\n\nPOTD: Niels Zonneveld -1.5 (-130), 2u to win 1.5u\n\nWrite Up: Puha has not looked good recently, losing his last 6 matches all by a good chunk. Zonneveld is coming off a loss to Nick Kenny in the players championship finals, however he averaged a 92.41 in that match and had 19 100+ throws in 10 legs. Zonneveld was just unable to hit his doubles, which I think will be corrected coming into the World Championship. Zonneveld and Puha have gone H2H twice this year, 6-1 Zonneveld and 5-6 Puha. However I feel Puha’s downtrend and Zonneveld’s consistency could allow Zonneveld to even take this match in straight sets.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntjr4jo/"
    },
    {
      "created_utc": 1765493149.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pkbewy/pick_of_the_day_121225_friday/ntjpk7c/"
    }
  ]
}