{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/25/25 (Tuesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/",
  "target_date": "2025-11-25",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-25T19:12:57.453174+00:00",
  "comments": [
    {
      "created_utc": 1764097687.0,
      "author": "YGWYD",
      "text": "**SEASON RECORD:** 28-4-19 \n\nNet Units: (-2.06) \n\nPrevious Pick: Manchester United vs Everton - Manchester United to Win @ 1.80 ❌️ \n\n**Today's Pick:**  Chelsea vs Barcelona- Barcelona (+0.75 Asian Handicap) @ 1.55 \n\n**TIME:** 9pm (BST) \n\n**Wager Amount**: 2 units \n\nLast 10 Matches (❌️❌️✅️✅️❌️❌️❌️❌️❌️❌️) \n\nThat was a pathetic performance from United cant even score a single goal against 10 men, banlist potential right there. Anyway lets try to break the L streak today with the UCL \n\nNow going for the value here as plus 1.50 odds Asian Handicap for a big team like Barca is insane I mean sure they are missing Pedri amd Raphinha is not fully back but still I dont see how Chelsea are favourites \n\nBarcelona have no losses in 4 games while Chelsea are unbeaten in 5 games, Barcelona have 2 wins in 4 games in the UCL same with Chelsea so they are evenly matched.  However I think Barca have the slightly better quality in players like Yamal, Lewandowski, Rashford amd Torres. \n\nChelsea are missing key players Cole Palmer while Barca are missing Pedri, in Barcas last UCL loss they lost by one goal so even if theres a world where Barca lose i dont think it will be more that a 1 goal difference. BOL if you're tailing or fading cause of my L streak lol.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqr2slc/"
    },
    {
      "created_utc": 1764096911.0,
      "author": "1234unodostrescuatro",
      "text": "__Record: 17-9__\n\nForm (old to new): ❌✅✅✅❌✅✅✅✅✅❌✅✅✅❌❌✅✅❌✅❌✅❌❌✅✅\n\nLast pick: CMC O43 rec yds (-110)✅\n\nGame: Chelsea-Barcelona & LAC@LAL\n\n__Today’s pick: Barcelona +1.5 & LeBron O5.5 ast (-155)__ \n\nAnalysis: I don’t care who the opponent is, Barcelona shouldn’t be this heavy of a dog. We’ll take the +1.5 as leg 1. In the last year (365 days) Barca have only not covered this spread twice. Minutes have slowly ramped up for our glorious king. Tonight should be high paced action as it a cup game. Plenty of opportunity for our king to feed his kingdom.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqr03uh/"
    },
    {
      "created_utc": 1764096070.0,
      "author": "Timely-Conclusion532",
      "text": "Record: 284-174\n\nForm: ❌❌✅✅✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅✅❌❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌❌❌❌✅✅❌✅✅✅❌✅✅✅✅❌✅✅❌ ❌❌❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌✅✅✅✅❌❌✅✅✅✅✅✅❌✅✅✅✅❌✅❌✅❌✅✅❌✅✅❌❌❌✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅✅✅❌✅✅❌✅✅❌✅✅❌❌✅❌✅✅❌❌❌❌❌✅✅✅✅✅❌✅✅✅❌✅❌✅❌❌✅❌✅❌✅❌✅✅✅✅✅✅❌✅❌✅❌✅✅✅❌❌✅❌✅❌❌❌✅✅✅✅❌❌✅❌❌✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅❌✅✅✅✅✅✅✅✅❌❌✅✅✅✅❌❌❌✅❌✅✅✅❌✅✅❌✅❌❌❌❌✅❌✅✅✅✅✅❌✅✅❌✅✅✅✅✅✅✅✅❌✅❌✅❌✅❌❌❌❌✅✅✅✅❌✅✅❌✅✅❌✅✅✅✅❌❌✅✅✅❌✅❌✅✅❌❌✅❌✅❌❌✅❌❌❌✅✅❌✅✅❌✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅❌✅✅✅✅✅❌❌✅✅✅❌❌❌❌❌❌✅❌✅✅✅✅✅✅✅✅❌✅❌❌❌✅❌✅✅❌✅❌❌✅❌✅✅✅❌✅✅❌✅❌✅ ✅❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅❌✅✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌✅❌✅✅✅❌✅❌❌❌✅✅❌❌✅✅✅❌❌✅❌✅❌✅❌❌✅❌❌❌❌✅✅✅✅✅✅❌✅✅❌❌❌❌✅✅\n\nNet Units: +5.07 units (All plays 1 unit)\n\nYesterday’s Pick: (NBA) Scottie Barnes over 28.5 PRA + Julius Randle over 26.5 PRA (-188) ✅\n\n***POTD: (NBA) Ivica Zubac under 35.5 PRA + Jalen Johnson over 31.5 PRA (-200)***\n\nReasoning: Ivica Zubac is facing the best defense in the league vs Centers (Los Angeles Lakers), Kawhi Leonard is returning tonight and Clippers are 26th in pace. Zubac has gone under this line in 76% of his games this season. That percentage increases vs similar defenses vs his position. For the other leg, Jalen Johnson is facing the worst defense vs Power Forwards (Washington Wizards) and both teams are top 10 in pace. Johnson hits this over at a 88% clip and even higher vs similar ranked defenses.\n\n👇\n\nhttps://preview.redd.it/qfjn3urb7g3g1.jpeg?width=1170&format=pjpg&auto=webp&s=76f66fdeb219514a1b9c75590bca10f18d82d13d",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqqx6da/"
    },
    {
      "created_utc": 1764095223.0,
      "author": "Kinorenschedules",
      "text": "POTD Record 0-0 \nToday’s pick: \nNBA Atlanta Hawks vs Washington Wizards\nNickeil Alexander-Walker over 3.5 FT at (-120) 2U\n\nThe Wizards have given up the most points to anyone this year, and are particularly egregious at giving up free throws being second worst in the league. NAW has cleared this line 9/11 times since Trae Young went down and he became the main point guard for the offense. Kennard is also potentially out today. \n\nPlus… that’s SGA’s cousin guys… free throw merchanting runs in the blood.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqqua43/"
    },
    {
      "created_utc": 1764093996.0,
      "author": "DisastrousPurple2339",
      "text": "Record: 0-0 \n\nSport- NCAAB \n\nTime-6:00 PM ET \n\nPick: Tennessee vs Houston: Tennessee ML (+146 on FD) 1u\n\nWrite Up: My POTD debut! Tennessee has been exceptionally strong early this season, posting dominant wins and showcasing both offensive firepower and defensive discipline. They’ve been shooting efficiently and thriving in transition, which could disrupt Houston’s typically slower, methodical pace.￼ Meanwhile, Houston’s offense has yet to fully click at top-form and may be vulnerable in spurts. If Tennessee can impose their tempo, protect the ball, and get out in transition, they will win.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqqq1du/"
    },
    {
      "created_utc": 1764093881.0,
      "author": "OTDR_cat",
      "text": "POTD Record: 0-1 (-1U)\n\nPrev POTD: NC St -9.5 (1U) - Will Wade's bunch let me down\n\nRecord: 2024 overall record: 276-215-2 (56.2%); 2025 record: 32-28 (53.3%)\n\nPOTD: Kansas -4.5 (-125 DK); Auburn +5.5 (-112 DK)\n\nReasoning: Back on the train today after a disappointing effort from the Wolfpack yesterday. \n\nI was impressed in a big way with Kansas coming out with a 10-point win against Notre Dame yesterday. Bidunga and White both stepped up on offense and will need to again without Darryn Peterson. Syracuse played well against an ice-cold Houston team (33% FG) and I believe Houston's shooting struggles last night are affecting the line here too much. Kansas should be able to control the pace of this game and continue shot-making at a clip that a weaker Syracuse offense can't keep up with over 40 minutes. \n\nI am also happy to take the points with Auburn. I am not high early on what I have seen from Michigan. They have looked out of sync on offense and turn the ball over at too high of a clip for the talent they have. Auburn holds opponents under 30% from beyond the arc and pressures ball handlers better than most teams Michigan will face. I make this game closer to a pick em with an edge to Michigan due to Auburn's propensity for long scoring droughts. However, happy to take the +5.5 in what I expect to be a 1-2 possession game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqqpn6o/"
    },
    {
      "created_utc": 1764093086.0,
      "author": "Laird87",
      "text": "POTD Record: 208-205, -72.43 Units\n\nParlay Record: 1-3, -2.52U\n\nCurrent streak: ❌❌\n\nLast 10: ❌❌✅❌❌✅❌❌✅❌\n\nLast Pick: Heat ML/FLA-NSH Under 7.5 Goals❌❌\n\nThe only game that went over 7.5 goals was that Florida/Nashville one last night.  Figures.\n\nToday's Pick: 2 Pick Parlay:  LA Lakers ML (-258, 11:00 PM EST Tip-Off) and Philadelphia 76ers +10.5 (-363, 8:00 PM Tip-Off), -132, 5 Units.\n\nGoing with the NBA today, the Lakers are coming off a close one a few days ago and even if it's not the best home court advantage because dumbass California needs to have 15,000 sports teams in one city, I like the Lakers to handle the Clippers tonight.  The 76ers have been a really moody team but that's basically Philly sports in general.  Hopefully their tampons are in and they're able to stay close with the Magic tonight.\n\nBOL, tail or fade! Tip Jar: [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqqmvbu/"
    },
    {
      "created_utc": 1764092801.0,
      "author": "Individual-Ground946",
      "text": "POTD Record: 0-0\n\nSport: Basketball Tournament: NCAAB Time: 20:00 est\n\nPOTD: Texas A&M Aggies -41.5 1u ×$1.8 \n\nMississippi Valley State is one of the worst 3pt shooting team and A&M are solid at defending 2pts. A&M gives up a lot of 3pts but i dont think Mississippi can take advantage.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqqlw3w/"
    },
    {
      "created_utc": 1764089777.0,
      "author": "Thooney_Toons",
      "text": "Record: **2-1**\n\nNet Units:  **+2.8U**\n\nLast Pick:  **Teaser, Panthers +14.5 & u54.5 total points, -110 2.2U**\n\nWon't lie the Panthers tried their best to give us a scare, but it was always a lock. Let's keep the streak going!\n\nEvent:  **CBB - St. Johns vs. Baylor, 4:30PM ET**\n\nPOTD:  **St. Johns -6.5 (-1.08) 1.1U**\n\nWrite-Up:\n\nAt first glance, the Red Storm might seem a little unimpressive sitting at 3-2 through the first five games of the season. However, this is not the case. Pitino's squad is firing on all cylinders this year, just like how they left off last season. Their **losses** are at the hands of **2 of the top teams in the nation**. Including a heartbreaking loss last night to an Iowa State team that came down to a few rather *questionable* calls. \n\nSt. John's has been playing phenomenal basketball, which has been an impressive team effort. There is no 1 standout star. This squad, led by senior **Bryce Hopkins**, is ranked **13th in offensive efficiency** and **T-20 in defensive efficiency**. Paired with their fast play style and high forced turnovers per game should make this matchup much easier than their previous.\n\nBaylor is no cakewalk, but the **Bears are allowing just over 76ppg** despite playing weaker teams. Paired with a slower adjusted tempo, Baylor's defense won't be able to keep up with a fast-paced **Red Storm unit who also sits in the T-20 in tempo**. St. John's, with something to prove, should roll this team by 10+ in a bounce back spot this evening. \n\n*As always, BOL!*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqqbrob/"
    },
    {
      "created_utc": 1764086151.0,
      "author": "TheOneMB5209",
      "text": "Pick of The Day - 11/25/25 (Tuesday)\n\nTie No Bet Parlay\n\nhttps://preview.redd.it/rzeln7nvcf3g1.jpeg?width=1290&format=pjpg&auto=webp&s=0ed8fc6e028fc53abf4cc05ac9d133fbed5dab03\n\nUCL 11/25/25 12:45 PM\n\n* Galatasaray has been playing well in UCL, including a win over Premier League Champion Liverpool. Quality compared to Union SG is clearly ahead. Benfica also clearly better quality and form at the moment over bottom dwelling Ajax. Could go straight ML, but with UCL… you never know… LOL.\n* 1.1 Units",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqpzib2/"
    },
    {
      "created_utc": 1764085503.0,
      "author": "jcrew1392",
      "text": "POTD Record: 2-0\n\nMade my debut yesterday on the Reddit page! Had a NBA PoD and NHL PoD. Couldn’t have asked for a better start. Had 2 sweat free cashes, I wish I could say it’ll always be like that but sorts betting is volatile. \n\nPrevious Picks: \n\nNBA: Kel’el ware Double Double ✅ (1st Half Cash)\n\nNHL: FLA v NSH o5.5 Total Goals ✅ (1st Period Cash)\n\nI hope that I can make some of y’all some money for the holidays! Let’s get to it!\n\nNBA | 8:00pm / EST\n\nPick: Franz Wagner o10.5 RA (-132) 1u\n\nWrite Up: Tonight is the IST so we should get 32+ mins here because point differential matters. \n\nBanchero is OUT again. Without Banchero, Franz is averaging 13.78 RA per 36 minutes. Embiid is ACTIVE, this is important because the Sixers have allowed the MOST rebounds to PF when Embiid is on the floor.\n\nFranz has covered in 4/6 w/o Banchero. Has logged 17+ RA chances in 4/L5 games. The spread is 2 points so I’m expecting a competitive game here. \n\nIf I helped you make some money and you want to show appreciation/support, you can do so here 👉🏼 [CashApp](https://cash.app/$JCruz1392)  Thank you! Let’s keep on winning!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqpxbns/"
    },
    {
      "created_utc": 1764084111.0,
      "author": "Chevre_",
      "text": "**Previous Pick:** George Kittle o56.5 receiving yards (-112), 5 units ✅\n\n**POTD Record:** 5-0\n\n**Net Units:** 22.95\n\n**ROI:** 91.8%\n\n5-0 guys, incredible start. Got some serious action yesterday on the post. This has been pretty fun so far, thanks to everyone joining me on the ride. On to the next one:\n\n\\_\\_\\_\n\n**NBA | Orlando Magic vs. Philadelphia 76ers | 8:00pm EDT**\n\n**Pick:** Desmond Bane o4.5 Assists (-115), 5 units\n\n**Write Up:** Man this slate sucks today! No NFL and 3 meh games for NBA. Going to try my best for you guys to keep the dream alive here, but don't be afraid to take the day off. I'm expecting some mid pace from both teams, script says low-mid 50s by half. I think Maxey will keep it competitive enough to stay moderately interesting. Bane's assist line is 4.5 at normal odds, and he's averaging 4.6 (Current assists form:  5, 5, 5, 5, 4, 2, 8, 7, 6, 7). So  that's 8 in his last 10, clearing the line the last 4 games in a row. Risk is that he was assisting way more when Banchero was playing, but I think that Wagner and Suggs have been stepping up a ton in points recently so that should help the slip. The Magic are 10th highest in defensive rebounds, and the 6ers are a bottom-third team in opponents ppg, but what's more interesting is they are the bottom 30th in opponent fastbreak points, which could create some cheap assist opps.\n\n**Take Desmond Bane over 4.5 assists**\n\n*Please tail at your own risk and only ever wager what you can afford to lose. BOL!*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqpsq4n/"
    },
    {
      "created_utc": 1764081661.0,
      "author": "Hour-Tie1627",
      "text": "**Pick of the Day:**  \n⚽ *Parlay:*  \n• **Over 2.5 Goals – Chelsea vs Barcelona**  \n• **Over 2.5 Team Goals – Manchester City**  \n**Odds:** 1.89  \n**Units:** 5\n\n**Event:** UEFA Champions League  \n**Time:** Tonight  \n➡️ **Standard Time:** 8:00 PM UTC\n\n# Chelsea vs Barcelona – Over 2.5 Goals\n\n* Barcelona have **scored and conceded in 9 of their last 10 matches**\n* Chelsea have **scored in all of their last 10 matches**\n* Expected total goals for this matchup is **minimum 3**\n\n# Man City – Over 2.5 Team Goals\n\n* City at home should control the match\n* Leverkusen defence vulnerable\n* Strong response expected after Newcastle loss\n* Looking for **2–3 goals from City**\n\n# Bounce-back note\n\nYesterday’s pick didn’t hit, so this play leans on **clear scoring trends and stronger matchups**.\n\n# Track record\n\n**Record:** 0–1  \n**Units:** –5",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqpkzkv/"
    },
    {
      "created_utc": 1764076033.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 1-6-0 *Once again everything looked nice and comfortable until Brentford started spamming goals. I’m more than positive I’m ending my dry spell with this next pick though*\n\n**Event:** UEFA Women’s U19 Championship Qualification, Israel W U19 v Kazakhstan W U19, 8:30 am EST\n\n**POTD:** Kazakhstan U19 +2.0, +2.5 Asian Handicap -125, 1 unit\n\n**Write Up:** Once again the stakes have been pitted against an underdog too harshly. Kazakhstan U19 is a very respectable team that **doesn’t concede much** and should be absolutely fine at the proposed Asian handicap. They’ve **not lost by more than 2 goals in almost TWO years,** when they played a very strong Slovakia side. **They’ve also scored in L3/4,** showing they can nab a goal if they really want to. Some of their most notable recent results include **a 7-0 thrashing of Liechtenstein, a 5-1 dismantling of a talented Georgia side, a surprising 0-0 draw with Romania,** and a narrow 2-1 defeat at the hands of Kosovo, despite being a player down. Especially in the Euro U19 qualifiers, lower ranked teams tend to lock their opponents pretty well, not allowing a whole lot of goals. We don’t chase losses here so I’m going with just the standard unit today. The match starts in half an hour and I don’t have much time to complete the write up so BOL if you do tail, and let's get this comeback started fr 🫡\n\nEdit: *Didn’t realize the odds have slightly dropped since I placed my bet. I’ve updated the odds since that’s what most people are going to see and I think that’s only fair. The current odds are -125 and I’d take this play up to -133*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqp58es/"
    },
    {
      "created_utc": 1764071043.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 10-5, +3.4u\n\n**Previous Pick:** Buducnost to win by 38 points or more, 1.86, 1.5u ✅, (last 5: ✅❌️❌️❌️✅️)\n\n**Event:** Bosnia Premier League: Siroki - Mladost Mrkonjic Grad, 18:00\n\n**POTD:** Siroki to win by 22 points or more, 1.84, 1.5u\n\nSiroki plays on two fronts, ABA2 and Bosnian League, and is doing very well on both. 5-0 in the Bosnian league, and also 2 games less than other teams. They have 8 straight wins, not all with big difference, their last 3 wins in the league were small difference, Jahorina and Leotar 3 and 4, and Donji Vakuf at home also by 3.\n\nGuests are in a terrible shape, and also, at this point, it is clear, without enough quality, for this level of competition. Siroki coach said in a statement that Mrkonjic made some changes and does not expect an easy game, but it's probably just a common courtesy. The big losses against Sloboda and Jahorina, the other 2 top teams, which are not out good as Siroki, show me that this should go in 30+ won direction.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqotx81/"
    },
    {
      "created_utc": 1764070895.0,
      "author": "lagambapeligrosa2",
      "text": "POTD record: 13-11 -1.11u\n\nlast pick: zweih under 32.5 kills first 2 maps\n\nCS2 Budapest Major | Faze - NIP\n\ntoday’s pick: Twistzz under 17.5 kills at 1.85 2u (bcgame/stake)\n\nTwistzz been great for Faze since he has joined his old team, but this line is simply too high. This match will most likely end up on Nuke imo, where Twistzz been under 18 kills in his last 9/10 games excluding OT.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqotmpc/"
    },
    {
      "created_utc": 1764067949.0,
      "author": "wes2211",
      "text": ">**Record:** 114-96\n>**Net Units:** +24.6 units\n\n>**Curling** | **Canadian Olympic Trials** | **1:00PM EST**\n\n>**Pick:** Team Epping ML @ 2.99\n\n>The trials continue today and we have a huge matchup between Team Epping and Team Jacobs. We are getting a great price here on Team Epping because they are coming off of a loss last night but this is a gross overreaction. Team Epping have played much better than their record, McMillan in particular has been very precise with their guard setup. Part of this bet comes from the struggles of Gallant. He has been missing a lot of the runbacks that he would typically make which has made the back end work for Team Jacobs much more difficult. My rating system has these teams at just about a coin flip so we have incredible value at 2.99. These teams are 4-4 head-to-head over the last two seasons.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqoo6qe/"
    },
    {
      "created_utc": 1764065767.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 22-13-1\n\nSoccer\n\nLast Pick: Newcastle vs Man City - Haaland to score @ 1.68 - LOSS\n\nLast Pick Write Up: Haaland did not put ball in net.\n\nNow for today..\n\nPick: Manchester City to win + Chelsea-Barcelona BTTS  @ 1.76\n\nWrite Up: 🚨🚨🚨🚨🚨 DO NOT TAIL ME. I AM ON A 4 PICK LOSING STREAK 🚨🚨🚨🚨🚨\n\nI think Manchester City is a better team than Bayern Leverkusen.\n\nI think a Chelsea-Barcelona match is a goal producing match.\n\n🚨🚨🚨🚨",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqokfbo/"
    },
    {
      "created_utc": 1764063446.0,
      "author": "mouse_that_runs",
      "text": "POTD RECORD: 10-3-1\n\n✅️✅️✅️✅️✅️➖️✅️✖️✅️✅️✅️✅️✖️✖️\n\nLAST POTD: \n\nSoccer\n\nManchester United vs. Everton (Manchester United to win) @1.74 ✖️\n\nTODAY'S POTD:\n\nSoccer\n\nChelsea vs. Barcelona (Barcelona over 1.5 goals) @1.87\n\n20:00 GMT\n\nAfter these last two bets, I've quickly realized that I don't necessarily need to put a bet in that I'm uncomfortable about just because there are games that day.\n\nThat said, Barcelona has scored a minimum of three goals in their last four fixtures. They play with a high line, meaning their games are end to end, though they combat this with their boisterous attack. Despite whatever advantage Chelsea may take of their high line, Barcelona will guarantee an abundance of chances and subsequently two goals to ensure this pick is successful.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqogjvv/"
    },
    {
      "created_utc": 1764058822.0,
      "author": "Vet100",
      "text": "Record: 20-11\n\nNet Units: +6.58\n\nROI: 21.2%\n\nPick: NBA 76ers v Magic \n\n1U Embiid O17.5 points @ $1.86, B365 \n\nWrite-Up: First loss in last 8 picks (5-1-2) and again it’s on Robinson who I seem to catch at the end of his form. Moving on. Yes, Embiid may not play. Yes, this may be another void. But if he does play, 17.5 is just such a low line for him. Hit it every game since his stinker season opener - 20-25-20-20-29 in his last 5 averaging 24 minutes. \n\nI think if he bothers to play he’ll be 20-21 minutes, more than enough time for him to get 18 points. He is listed as “questionable” but with Oubre and Edgecombe ruled out, and PG still finding his way back, Embiid will get plenty of chances if he plays. Genuinely doesn’t worry me if he doesn’t. Just want to jump on the odds early as if he is confirmed to play I think they’ll come in. \n\nAlso thought about the O4.5 1Q points @ $2.10 but might start a bit rusty is my thinking.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqo92wv/"
    },
    {
      "created_utc": 1764058660.0,
      "author": "RetiredBookie",
      "text": "POTD RECORD: 0-0 \n\n\nPICK: Man City ML and over 1.5 + Barca vs Chelsea BTTS (-134 BET 365)\n\nEVENT: Champions League - 2:00 PM US Central Time\n\n- Barca have scored in 24 straight Champions League games\n- Chelsea are averaging over 2 goals at home, Barcelona over 2.5 away\n- Both teams in great form, I see goals from both teams here\n- City have hit 2+ goals in their last 6 straight home UCL games \n- They’re averaging 3 goals per home game\n- Leverkusen concede 2.5 per game\n\nBeen following for a long time, finally decided to hop and send some picks, long time footy watcher and gambler, let’s get these W’s coming!! BOL!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqo8t3l/"
    },
    {
      "created_utc": 1764058438.0,
      "author": "Busy_Presentation463",
      "text": "Record: 7-2\n\nNet Units: 13.76U\n\nRange of unit size per bet \\~3-5U\n\nPrevious Pick: [Breece Hall under 15.5 rush attempts (Loss)](https://www.reddit.com/r/sportsbook/comments/1p49ox5/comment/nqdeerg/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nWHAT A HOOK!! Ends the game with 16 rush att not a bad read jus got a lil unlucky especially in the first half\n\nPOTD: (Parlay) Onyeka Okongwu over 13.5 pts + Ivica Zubac over 8.5 rebs (2.14) (Stake)\n\nBet 5U (This is a power play)\n\nWrite up:\n\nOdds have slightly dipped since making this especially zubac but it should still be a near 2x when taken but this just has to be insane value for each pick\n\nI really like making these 2-man near 2x parlays but this is my first one for the POTD but just insane value so I am announcing only my 2nd power play of my POTD career (First being the carlson under xp)\n\nOnyeka Okongwu hasnt gone under this line in 6 straight games and since the start of the season has just consistently been given the green light. Last 5 games hes played, he has averaged around 32 minutes. The wizards also allow the 2nd most points in the paint which is just the cherry on the top.\n\nIvica Zubac has NEVER gone under this line the whole season so far which is why I think its free (if your book doesn't take 8.5 then take 0.5 dbl dbl). Main reason why Im taking this is because this line shouldnt even be offered and has dipped a little. Yes the lakers got ayton as a decent board crasher but I see zubac cashing easily here\n\nTime to end the losing streak with a power play\n\nNever financial advice, always bet within bankroll limits and BOL!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqo8fv7/"
    },
    {
      "created_utc": 1764058397.0,
      "author": "Uneasiestwig",
      "text": "Record: 6-10\nNet units: -5.85\nLast pick: man utd to win vs everton @1.77 ❌️\n\nToday's pick\nUefa champions league 🇪🇺⚽️\nGalatasaray vs saint Gilloise\n\nGala to win @1.73 (bet365) 4u\n\nGala have beaten Liverpool, bodo glimt and ajax in this year's competition. \nThey are unbeaten at home since August 2024 in all competitions (W24 D9)\n\nGala have struggled against Belgian teams in the past but I think they'll win this one",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqo8dfo/"
    },
    {
      "created_utc": 1764056223.0,
      "author": "OliveCritical5134",
      "text": "**Record: 25-16**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅✅✅✅❌❌✅✅✅❌✅✅❌❌❌\n\n**Sport:** ⚽ / UEFA Champions League / Ajax - Benfica\n\n**Net Units/ROI:** \\+21.78u / 20.36%\n\n**Previous Pick:** *Manchester United - Everton: Both teams to score @ 1.70 -- 2 units*❌\n\n**Summary:** Rough loss after Man U just had to score once against a team with a player sent off, don't know how they managed to fail us there.\n\n**Today's Pick:** *Benfica to win or draw + over 1.5 total goals @ 1.53 -- 4 units*\n\n**Write up:**\n\nKeeping it as safe as possible with this matchup between the two bottom sides in the CL league phase here. \n\nAjax has seen 2 goals scored in every single match this season so far. Ajax lost to (at the the time 16th) relegation fighter Excelsior Rotterdam this weekend. They didn't show up whatsoever and I think their interim-manager described their situation perfectly: \"The manager has changed, but the mentality of the players hasn't\". They just lack confidence in every aspect. They've managed to win 2 games in their last 10 matches.\n\nBenfica is third in Portugal but has recently picked up alright form, at least they are beating teams lower then them in the league, can't say the same for Ajax. If Benfica wants ANY chance of surviving this league phase they need a win here.\n\n**Best of luck if tailing! 🍀**\n\n**PS:** If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqo4o5x/"
    },
    {
      "created_utc": 1764055872.0,
      "author": "ChiliCheeseSandwich",
      "text": "When it rains, it really does pour. I know things haven’t been looking good recently but I really do want to change that and end this dry spell. Onto the next pick. \n\nPrevious Pick:  Detroit Pistons -9.5 @1.94, 2U. ❌\n\nRecord: 3-2\n\nPOTD: Ivica Zubac O10.5 Rebounds @1.91, 1.5U\n\nNBA: Los Angeles Lakers VS. Los Angeles Clippers.\n\nWrite Up: As we all know, Zubac has been on fire recently, entering this match after snatching 18 rebounds in a thirty-three point double-double against the Cavs. He has covered the over 10.5 rebounds line in 5 of his last 6 games. Plus, the Lakers are without their best rebounder, Deandre Ayton, which will give more chances for Zubac to obtain more rebounds. Aside from Ayton, there aren’t really any more Centers that pose a threat in the post to Zubac, in terms of rebounding and in general.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqo42ju/"
    },
    {
      "created_utc": 1764055313.0,
      "author": "Ralphjinasseater",
      "text": "Record 8-9-2\n\nLast pick: Jalen Duren O 20.5 PA (-125) ❌\n\nPick of the Day: Austin Reaves (Lakers) under 4.5 assists (-130 ESPN)\n\nApp: Props.Cash | Prop & Pick Finder\n\nReason:\n\n* Hes failed to cover this line in both games since LBJ returned to the lineup with just 4 and 8 potentials.\n* With LBJ back in the lineup Reaves sees a -5.08% decrease in usage and a -22.86% decrease in assist rate.\n\n\\*\\*With Luka and LBJ in the lineup he has gone under this line in 13/L20 (65%) of games dating back to last season.\n\n* As mentioned above Reaves has had 8 or less potentials in each game since LBJ returned. With 8 or less potentials he’s gone under this line in 4/4 games this season and 17/L20 games. Even if he’s sees 10 or less potentials he’s still under this line in 3/7 this year and 13/L20.\n* Overall a solid spot with LeBron back in the lineup. Neutral matchup against the Clippers who rank middle of the league in assists allowed per game. They are getting kawhi leonard back which should bolster their defense.i like the under in this one!\n\nhttps://preview.redd.it/kexairf4uc3g1.jpeg?width=1170&format=pjpg&auto=webp&s=9df2171d9e969a968ff19338c5e2da06a666d037",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqo33v8/"
    },
    {
      "created_utc": 1764052984.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 174-131\n\nSeason record: 11-8\n\nLast POTD: __Bennedict Mathurin 20+ Points @1.76 1U__ ❌\n\nToday’s POTD: __LeBron James 20+ Points @1.76 1U (Bet365)__\n\nNBA | Lakers vs Clippers | 🏀  \n\n3-13 shooting and foul trouble leading to him only playing 28 minutes, got to the line as expected where he shot 7/8 where he got half of his points from. Happy with the read cause he got the volume, but yet another L because of unfortunate circumstances. We move\n\nLebron is facing a Clippers side he’s done great against previously and we now get a very good line for someone who’s cleared this line in 6/L7 H2H games against the Clippers and 18/21 overall since joining the Lakers. Part of that is because he’s only played two games this season just returning from his absence going under in both, but we see a clear uptick in minutes playing 34 minutes last game compared to 29 the first game. Upside for more minutes in his 3rd game as they’re ramping his minutes up and he had 18 FGA last game so clearly getting volume despite his minutes.\n\nWith 33-38 minutes LeBron is over in 3/L4 against the Clippers avg 26 PPG\n\nWith 35-38 minutes he’s over in 16/L20 games avg 26.3 PPG\n\nBron has taken 62% of his shots from the paint this season where Clippers are ranked 17th and his other main area has been above the break threes where Clippers are ranked 28th. \n\nCup game against the Clippers and I’m expecting the goat to show off and have himself a good game in what should be a competitive one.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqnyyx8/"
    },
    {
      "created_utc": 1764049926.0,
      "author": "this_guy9",
      "text": "POTD Record: 10-6\n\nNet Units: +5.04\n\nPrevious Pick: [✅ Scottie Barnes o7.5 Rebounds -110](https://www.reddit.com/r/sportsbook/comments/1p51gu8/comment/nqhs04r/?context=3)\n\nLove an easy win. Let's keep going:\n\n**🏀 Jalen Johnson o23.5 Points -110** vs the Washington Wizards\n\nThis line is high but Jalen has been on a tear recently, both in usage and in stats. He figures to have a huge game against one of the worst defenses in the NBA.\n\nCashed in **L6/7**. In that time, he's been averaging almost **38** minutes a game and over **16** field goals attempts. We love recent surges in usage over the last 5 games.\n\nWizards are as bottom tier as it gets in defense. **29th** in allowing points to SFs, **30th** in defense rating, poor defense in almost every zone. Meanwhile, they're ranked **4th** in Pace in the NBA likely from having to catch up every game. Hawks ranked **15th** are fast as well.\n\nIn a competitive game, I'm not worried about this line at all. In a likely blowout, I'm expecting Jalen's usage to contribute, leading to a potential cash. He had **24** points in **24** min when they blew out the Kings.\n\nFull stats if you'd like to do additional research: [https://www.statpick.ai/69081705/jalen-johnson-points](https://www.statpick.ai/69081705/jalen-johnson-points)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqnt7r5/"
    },
    {
      "created_utc": 1764049082.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 198-149\n\nUnits Won: +95.01u\n\nLast Pick:  NIP ML vs. NRG + Frozen>C4llM3Su3 Map 2 Kills (-143) X\n\nToday's Pick: **Sk0R>Starry Map 1 Kills (+140)** 5u | Esports -->Counterstrike 2 (CS2) | StarLadder Budapest Major \n\nTeams: Lynn Vision vs. The Huns  \nTime: 1:30 PM EST.\n\n\\*\\* ML picks/major bets posted over in the esports channel\n\n**Writeup:**\n\nAfter Day 1 of the major, we have two rounds in the books, with some very intriguing matchups tomorrow. One I am personally very excited for that not many others probably are is actually this match between LV and The Huns. Both teams dropped to the 0-2 bracket and are now one b03 away from ellimination.\n\n* The Huns were a widely speculated name to go 0-3 at this tournament so their losses aren't suprising, however I will say if their is such a thing as a good loss, they have had two of them. They went up 6-1 on T side Mirage against PARIVISION who were 100% winrate on Mirage and on a 10+ map winstreak, they did choke and end up losing 13-8 but played a hard fought and very competitive game. Then faced B8 and narrowly lost 13-11 on Ancient, another map that B8 is very strong on. While these are both tier two teams, they are arguably two of the biggest/hyped tier two teams at the tournament and Huns have been scrappy and looking good so far. Lynn Vision were once looking on the rise as the next big team out of Asia besides MongolZ in the early-mid summer 2025. Their last couple months outside of Asian competition has been AWFUL. In the L3 months they are now 2-10 against tier 1/1.5 competition in matches. So far this tournament they have gotten absolutely dominated in back to back games by FaZe and NIP. While on paper this is better competition, I don't think it is a massive gap between the teams right now and while Huns put up 21 rounds, LV put up 7 total\n\n**Player Stats:**\n\n* Sk0r is averaging a .82 KPR in the L3 months with a .83 KPR in 2025 as a whole\n* Starry is averaging a .70 KPR in the L3 months with a .70 KPR in 2025 as a whole\n* Starry is the second best player on LV behind Z4kr, Sk0r is the clear star of The Huns roster\n\n**Projected Veto:**\n\n* The Huns ban Train, Lynn Vision ban Mirage\n* **The Huns pick Nuke**\n\n**Nuke Stats:**\n\n* The Huns are 75% winrate on 16 maps of Nuke in the L3 months\n* Lynn Vision are 29% winrate on 7 maps of Nuke in the L3 months (against better competition)\n* Despite Lynn Vision dominating the h2h lifetime 12-7, all of their maps have been extremely close, most recently they face in August 2025, both games went 21+ rounds, the time before that, they went 24/23 rounds, \n* Huns core roster is 2-1 on Nuke h2h against Lynn Vision despite a 7-12 record overall in individual maps\n* Starry is averaging a .66 KPR on Nuke in the L3 months, one of his worst maps in the pool\n* Sk0r is averaging a .82 KPR on Nuke in the L3 months",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqnrilt/"
    },
    {
      "created_utc": 1764047969.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 21-8 (+14.3U)\n\nLast Pick: Gonzaga -3.5 (-110) (1U)✅\n\n[Gonzaga write up](https://www.reddit.com/r/sportsbook/s/apuA94qxK2)\n\nFor those that originally saw me place Auburn -4, congrats! To those that rode Gonzaga, congrats! To those that locked both in. What a night. A bit of a knee jerk reaction for me to pull that auburn one back and I do apologize for that. Gonzaga gets it done for us though and as always, we don’t lose two in a row!\n\nEvent: Michigan vs Auburn (NCAAB) (7:30pm central)\n\nPOTD: Auburn +3.5 (-110) (1U)\n\n-everything is bet to win unit amount-\n\nWrite up: \n\nI will be adding more of my usually write up here later or possibly early in the am because I have been at my bar working all night watching these games, however this line makes zero sense to me. Michigan has practically been flirting with a loss for a few games now and although they do look good against SDSU as I write this up, I think Auburn gives them one hell of a game tomorrow. This team has already been battle tested against the likes of Houston and they took care of business against an Oregon team that although I stated in my Auburn write up if u saw is a little bit underwhelming yes. However I think Michigan is the most overrated team in college basketball at the moment. I don’t think Elliot cadeau is all that good either. My power ratings makes this Auburn -1. I fully expect this to be closer to Michigan -1.5 tomorrow so jump on it right now! As always, cheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqnp8he/"
    },
    {
      "created_utc": 1764047676.0,
      "author": "Longjumping-Horse822",
      "text": "> **Record:** 18-14 ( 3 push ) \n\n>Last picks ( form most recent to oldest ) ✅ ✅ ❌ ❌ ❌ 🅿️❌ ✅ ✅ ✅ ❌ ❌ ✅ 🅿️ ❌ ✅ 🅿️ ✅ ❌ ✅ ✅ ✅ ❌ ✅ ❌ ✅ ✅ ❌ ✅ ✅ ✅ ❌ ✅ ❌ ❌ ✅ \n\n\n>In terms of units +3.21, +5.3 , -5 , -5 , -5 , 0 , -5 , +3.39 , +0.73 ,  +8.15 , -5 , -5 , +1.86 , 0 , -1 , +9 , 0 , +3.45 , -2 , +1.09 ,+1.84 ,+4 , -2 , +3.1, -2 ,+1.8 ,+1.7 , -2 , +2.61 , +3.25 , +4.35 , -7 ,+5.65 , -10 , -2 , +2.65\n>\n>\n> **Net Units:**  +9.03 units \n>\n> **ROI:** \n\n\n>Previous pick [here](https://www.reddit.com/r/sportsbook/s/YLcR8sOYI8) : Arsenal vs Tottenham Both team to score @2.07x or +107 (3 unit play ) ✅ \n>\n> **Football** | **UCL** | **04:00PM**|**Eastern time**Nearly 15 hours from now.  \n>\n> **Pick:**  Chelsea vs Barcelona**|**Lamine yamal over 1.5 shots on target @3x or +200**|** ( 3 unit play)\n\n>\n> **Write up** |   Tottenham being Tottenham kept there streak of scoring at Emirates.  And cashed our bet. \n\nFor today's POTD i am once again going with my boy Lamine yamal to get 1.5 shots on target against chelsea. I previously picked this against PSG at home and Lamine didn't even get 1 shot on target. But things have changed. Since that real madrid lose he has learned a few different things. Before real madrid loss this season lamine was asking to take penalties and after scoring a goal he was crowning himself in celebration. But after that real madrid loss and backlash from fans he is celebrating with the fans and Kissing the BADGE. In last match against Bilbao. He was once again back to giving trivela assists and they looked absolutely beautiful. And i may sound dumb for saying this but that girl niki Nicole was a bad influence. He broke up with her after that madrid loss and is back in form. Now it might be a coincidence but i don't think so. \n\n\n**|**In champions league lamine yamal is averaging 1.42 shots on target per 90 . Which makes it a bad bet . But most of those matches were before real madrid loss.  After that against brugge Lamine had 3 shots on target . **|**\n\nWith Lewandowski and raphinha back . Lamine will try to assist more which might result into him getting less shots on target. Lamine yamal to assist is another great bet i would be taking which is also the same odds.  \n\n\nDo whatever you think is best. \n\n\nBUT\n\n\nAlways bet responsibly .\n\n\nBOL if tailing \n\nBOL if fading",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqnom1t/"
    },
    {
      "created_utc": 1764043051.0,
      "author": "PurpleDragonBets",
      "text": "Record: (113-71-11) \\[+20.10\\]\n\nPOTD⭐️:🏈Bowling Green -3.5/Western Michigan ML (-148) \\[Fanatics\\]\n\nStart Time & TV: 4:30 & 7:30pm EST (ESPNU & ESPN2)\n\nUnits: 3.5 Units\n\nReasoning: Time for some midweek MACtion and I feel confident in the Bowling Green Falcons to beat the Massachusetts Minutemen by more than a field goal along with the Western Michigan Broncos to defeat the Eastern Michigan Eagles. The Bowling Green Falcons are facing off against who I believe is the worst FBS football team this year as the Minutemen have been blown out in every single game they have played and with a 0-11 record they have not even beat an FCS team as they lost to FCS Bryant on their home field. This Minutemn team is bad on both sides of the ball as they rank second to last in the FBS in scoring offense with only 10 points per game and bottom five in scoring defense allowing 38 points per game. The rush game on offense and defense is what really kills this Minutemen team as they only average 83 rushing yards per game while giving up over 216 rushing yards per game. I believe this huge weakness on defense plays into the Falcons game plan well as they are a run first team so I expect them to pound the rock a lot in this one and find success doing so. I also like the Western Michigan Broncos in this one as they have a lot to play for in this one as if they win this game they are heading to the MAC championship as well as taking home the Michigan MAC rivalry trophy. This Broncos team has one of the best rushing attacks in the conference averaging over 180 rush yards a game and they face a rush defense that is even rated worse than the Minutemen giving up over 225 rushing yards per game so I think dual threat quarterback Broc Lowry and runningback Jalen Buckley will find success running through this Eagles defense. In contrast, the Broncos have a great defense and is one of the best defenses in the conference and even the nation in passing defense as they rank eighth in the nation with just 160 pass yards allowed on average per game and 16th in FBS in scoring allowing just 18 points per game. Western Michigan has been great in conference play this year winning seven out of their past eight games and I am even impressed about the game this team played earlier on in the year against North Texas where they played a great offensive game against a very solid ranked North Texas team and lost a close one in overtime. On the other hand, this eastern Michigan squad has not played well at all against teams at .500 or better with losses in every game against all of those teams and they even have a loss against FCS Long Island so I believe that the Broncos team outmatches this Eagles team.\n\nPrediction: 28-17 Falcons, 30-24 Broncos\n\nLast pick:🏈Vanderbilt ML/Texas ML💰Love a good no sweat winner like that!!\n\nBest of luck to everyone tailing and remember to bet responsibly! Lets get this Thanksgiving holiday week started off nice with some MACtion!! 🍀💜🐲\n\nhttps://preview.redd.it/ty3u4f3otb3g1.jpeg?width=1053&format=pjpg&auto=webp&s=5d27fd7e9b1f4c557d93e18531195ef3d6e5f6e0",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqne5ad/"
    },
    {
      "created_utc": 1764040898.0,
      "author": "SoggyDatabase2348",
      "text": "***POTD Record: 10-5 (+16.11$)***\n\n*Last POTD: CBB Auburn -4.5 -110 (2.50$ TO WIN 2.27$) ✅*\n\n***POTD: Orlando Magic +1.5 -120 (2.50$ TO WIN 2.08$)***\n\n1. *Side Note: On Thursday, Thanksgiving, I will be playing multiple games that day. Tomorrow night, I will share the link to which Reddit thread I will be utilizing for those picks, because we are only aloud one pick per day in this thread! Going to try a little bankroll builder.*\n2. *Here are the other model plays for today for CBB (ITS FEAST WEEK):* [*https://www.reddit.com/r/sportsbook/comments/1p62byc/comment/nqoyw5h/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button*](https://www.reddit.com/r/sportsbook/comments/1p62byc/comment/nqoyw5h/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n*Write up: My model says this is the top play for the day. I will always try to get odds that between +100 & -120 for you all.*\n\n*•\t⁠Edge is set at 2.5 point favorites*\n\n*•\t⁠Probability 52% chance of ML*\n\n*•\t⁠Model's probability 52.4%*\n\n*•\t⁠My line is set at -2.5*\n\n*BOL!*\n\n***POTD: Orlando Magic +1.5 -120 (2.50$ TO WIN 2.08$)***\n\n*Tips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox*\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqn8p9t/"
    },
    {
      "created_utc": 1764039130.0,
      "author": "bigcocklockzz",
      "text": "Record: 17-14\n\nNet Units: +2.77u\n\nLast Pick: Ben Shelton ML + Jenson Brooksby ML +114 2u  ❌\n\nSoccer | UEFA Champions League | 12:45 PM ET\n\n**Galatasaray ML 5u**\n\n  \nGalatasaray enter this match in great form, especially at home. In 9 competitive matches at home this season, they've won 7 and drawn 2. In both home Champions League matches they won, including a surprise 1-0 upset over Liverpool. Yes they are missing star striker Victor Osimhen, but this team has more than enough firepower to create chances and score goals. I expect them to score 2+ and continue to cruise in home matches. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqn3yj0/"
    },
    {
      "created_utc": 1764038198.0,
      "author": "whiteiversonyeet",
      "text": "RECORD: 4-2\n\nSTREAK: 1L\n\nMBB TENNESSEE VS HOUSTON 5PM CST\n\nTENNESSEE +4 -125\n\nWHY: I LIKE THE VOLS BECAUSE DESPITE HOUSTON’S STINGY DEFENSE, THE VOLUNTEERS HAVE SHOWN THEY CAN KEEP GAMES CLOSE BY CONTROLLING TEMPO AND CAPITALIZING ON BATTLE MODE. IF TENNESSEE CAN WEATHER A SLOW, PHYSICAL WAR AND MAKE A FEW BIG PLAYS LATE, THEY’RE WELL POSITIONED TO STAY WITHIN 3 TO 4 POINTS. AS AN AVID BIG 12 FAN I DONT SEE HOUSTON BEING AS DOMINANT THIS YEAR. PLUS THE VOLS WILL WANT SOME REVENGE AFTER GETTING BOUNCED BY THE COUGS IN MARCH MADNESS. OVERALL, IF THE VOLUNTEERS PLAY SMART, HIT ENOUGH SHOTS, AND STAY DISCIPLINED ON DEFENSE, THEY HAVE A SOLID SHOT TO COVER THAT SPREAD.\n\nTHE VOLS +4 ARE THE ONLY 10 I SEE.\n\nIM SORRY WAS BORED AT WORK AND WANTED ACTION AT 10 AM. FUCK RHODE ISLAND",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqn1dft/"
    },
    {
      "created_utc": 1764037210.0,
      "author": "major-couch-potato",
      "text": "Record: 165-137, +4.1 units\n\nLast Pick: Oleg Prihodko ML vs Bernabe Zapata Miralles (-193, 1 unit): Win\n\nTennis | Bogotá Challenger | 2:10 PM EST (estimated)\n\nToday's Pick: Sebastian Gima vs Nicolas Mejia | **Mejia to win 2-0 at +100 (DK). 1 unit.**\n\nWrite-up: I can't even say what the closing line was on that pick, because pretty much every book took it down before the match. Not sure if there's any sort of suspicious betting activity around those players, but it was quite a strange sight. Either way, Prihodko was able to come back from a tough first set and finish the match with a 6-0 third set. \n\nToday, I'm moving over to the Bogotá Challenger, one of two clay-court events in the final week of the CH season. The city sits at over 3000 meters of elevation, meaning that these courts play a bit faster than your average clay, and players who can handle altitude will have a significant advantage. \n\nNicolas Mejía comes into this tournament as the No. 2 seed and highest-ranked home player in the draw. He will be making his sixth appearance here in Bogota (though all of those events were held at different times in the year); meanwhile, this is Gima's first time playing in the city. Mejia is a bit of an altitude specialist, with two of his six CH finals and one of his two titles coming at over 3000 meters of elevation. He also won a title on green clay, which tends to play a bit faster than usual (similar to altitude clay), earlier this year. Mejia will be coming into this event with two full weeks of rest, while Gima makes the trek from Guayaquil, Ecuador (which sits at just 13 m). \n\nHow much tread a player has on their tires is super important at this time of year, and I believe that Mejia, who has only played three indoor hard events in the US in the past month, should be better situated in that regard. While he didn't perform especially well in those events, he did at least take a set off Murphy Cassone in Knoxville, and will be happy to return to his favorite surface. Gima may benefit to some degree from all the clay-court tennis he's been playing, but he hasn't exactly been performing well in those events, as he took just three games off Andres Andrade in his most recent outing. To be fair, Andrade was a -455 favorite, but that brings up the question of why Mejia's ML should only be at -260 here. I believe that Mejia and Andrade are playing at similar levels right now, and both closed at similar odds against Juan Bautista Torres in Cali.\n\nIn terms of playing style, Gima possesses an aggressive lefty game, but I believe that Mejia has the more stable backhand and superior serve. Mejia also has been solid against lefties on clay this year, with two wins and one three-set loss (close to even money in all three matches). Overall, I'm happy to back the home favorite to come through without much trouble against a slumping clay-courter with much less altitude experience. \n\nNote: The [POTD Capper Tracker](https://potd.lol), which you may remember from its Google Sheet days, is finally back in a cleaner, more robust website format! If you have any questions or suggestions regarding the site, feel free to reach out to either me or u/EthicalGambler.\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/major-couch-potato-xJXnQW?utm_source=mdembed&utm_campaign=major-couch-potato) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqmynaq/"
    },
    {
      "created_utc": 1764036231.0,
      "author": "ptrckfrnndz",
      "text": "+9.09\n\n5 - 2\n\nSports: Tennis\n\nPrev: storm vs tian fangran ml\n\nPick: nikita vs saba purtseladze ml 5units!!! @1.6\n\nTime: 3hrs from posting\n\nReasoning: rank 832 vs 237, played 9 hardcourt games vs 68 hardcourt games.. recent game form is to nikita but that comes from low low level than saba whereas he player decent players.. last match of nikita is retirement idk why this is his comeback match from that retirement.....\n\n\n\nhttps://www.reddit.com/r/sportsbook/s/cNxy5pymgK",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqmvvgj/"
    },
    {
      "created_utc": 1764035242.0,
      "author": "Lyx97",
      "text": "Record: 2-1\n\nNet Units: +0.42\n\n*Prev Pick : United Total over 1.5 goals @ 1.74 (1u) --> Loss \\[Still cant believe how united couldn't score even after having 1 man extra for a good part of the game. Just disappointed & I apologize for the loss\\]*\n\nCricket | Women's Big Bash League | Adelaide Strikers (W) vs Brisbane Heat (W) | in \\~6.5hrs\n\nAdelaide Strikers (W) Win @ 1.65 (1u)\n\nWrite Up: While both these teams are at the bottom of the table, Adelaide still has a good team & has won a match & been unlucky with rain spoiling their chances in 2 matches +their previous match was a close 1 run loss. Dont expect them to lose to a clearly poor Brisbane team\n\nBoL & lets hope to turn it around",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqmt47i/"
    },
    {
      "created_utc": 1764034023.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 7-4 (Avg Odds +113)\n\n**Previous Pick:** Iliman Ndiaye 1+ SOT (+105) ❌️\n\n**Today's Event:** UEFA Champions League | Chelsea vs Barcelona (12:00 PM PST)\n\n**Pick:** Enzo Fernandez 1+ SOT (+100) 1 unit to win 1 units\n\n**Write Up:** So I've never seen that before. A 13 minute red card for an Everton player slapping his own teammate. Obviously this really gutted our chances as Ndiaye shifted to a quasi-right back and Everton saw very little of the ball. Bummer too because he had a great chance early and was looking sharp. Fun fact, that was the 3rd time in Premier league history a player has been sent off for hitting a teammate. 3 times in 33 years. Anyways enough harping on that, on to the next. \n\nIn other news...guys...they're giving us Enzo 1+ SOT at plus money again. We've cashed this twice already in the last month and all of the same stats/data/feelings apply. \n\nOff we go back to London where Chelsea hosts Barcelona in the Champions League match of the week. As you all know, Barcelona is a great team. However, they have been leaky defensively over the last few matches, particularly in UCL, notably conceding 3 goals (6 SOT) to Brugge in their last CL match and 7 SOT to an injury ridden PSG. Both teams will want a win here, but I like Chelsea to show up here in front of their home crowd. \n\nThe caveat here is that **there is a non-zero chance that coach rotates some players** around for this mid week match as he has been known to do, but I really can't see him leaving out Enzo for a match this big. Even if he does come in as a sub, he will want to make an impact quickly and go for goal. \n\nIn case you want more #s, this has hit in his last 2/2 UCL matches (including the last match where he came on as a sub) and in his last 6/6 EPL matches (averaging 3 shots per game, just under 2 on target). \n\n**UCL and Europa matches are tough to predict**, squads get rotated, flukes happen, so mind your units. But I like our guy here again in this huge match, and I'm riding the Enzo train until the wheels fall off. BOL if tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqmprzi/"
    },
    {
      "created_utc": 1764032703.0,
      "author": "_AnalkingSkywanker",
      "text": "**Analking's pick of the day!!**\n\n**POTD Record:** 0-1\n\n**ROI** -100%\n\n**Last Pick:** Manchester United vs Everton, Man Utd to win ❌\n\n**Today's Event:** UEFA Champions League | Galatasaray vs Union Saint-Gilloise (17.45 GMT)\n\n**Pick:** Galatasaray to WIN! 1€ to win 1.69€\n\n**Write Up:** Well my first pick went wrong. But let's not get depressed because of that and I got another one coming here. Here is the reasoning for my pick: \n\nIf we look at the stats, this matchup is in Galatasaray’s favour. Their great attacking, strong defensive team play in past couple of weeks and UNBEATEN home record give them a clear edge. Union SG’s defensive unreliability, combined with their inconsistent away form, increases the difficulty of their mission to win or take points in Istanbul.\n\nGalatasaray are currently one of the hottest home sides across Europe - unbeaten in nine straight matches - and they are well-positioned to extend their Champions League winning streak to FOUR consecutive games.\n\nFew reasons why I expect that Galatasaray Will win:\n\nGalatasaray has three consecutive wins in last 3 rounds of UCL and are still unbeaten on home soil this whole season, with a record of NINE MATCHES WITHOUT A DEFEAT ACROSS ALL COMPETITIONS! Thats a crazy stat IMO! Also to add, USG has three back to back losses on UCL this season.\n\n**Pick: Galatasaray to Win.**\n\n\nBOL, let,s turn the record to 1-1! \n\nps. sorry if the text is not perfect in english, english is not my native language.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqmm8ps/"
    },
    {
      "created_utc": 1764032675.0,
      "author": "Vander_chill",
      "text": "**POTD Record:**  95 – 62 - 9\n\n**Previous:**  Hajduk Split Double Chance & Over 1.5 Total Goals - LOSS\n\n**Recap:**  Single worst beat ever.  Best team in the league vs one of the worst and they lost by 5-0.  Absolute thrashing even suspect at times.  Hadjuk’s defense was passing the ball directly to the attackers right in front of the box.  Just a brutal lack of concentration and effort.\n\n**New Event:**  UCL Man City vs Leverkusen & Marseille vs Newcastle\n\n**Pick:**  Man City -1 Asian Handicap  & Newcastle Double Chance @ 1.80 (Usual 3 units)\n\n**WARNING:**  DO NOT TAIL ME.  I am on 3 game losing streak on POTD. \n\n**Leg 1 :  Manchester City -1 Asian Handicap vs Leverkusen**\n\n* City lost to Newcastle this past weekend by 2-1 in a fantastic match and are looking to bounce back strong and with good reason.\n* City are 23-0 home games without defeat in the Champions League league phase/group stage - winning 20 of them.\n* City have found the back of the net at least twice in each of their seven straight wins at the Etihad.\n* Earlier this month City beat Dortmund by 4-1 in a match with similar circumstances.\n* Leverkusen’s team is riddled with injuries and suspensions making this a lopsided affair favoring City.\n* Erling Haaland faced Leverkusen 4 times during his Dortmund days and scored 4 goals against them.\n\n**Leg 2 – Newcastle Double Chance vs Marseille**\n\n* Newcastle are riding high off a tremendous win against City this past weekend.\n* Newcastle have lost only twice in their last 13 Champions League away matches.\n* Marseille have not won a single match of their last 12 matches against English teams. \n* Marseille have many injuries and one suspension whereas Newcastle’s starting 11 against Man City should take the field.\n\nOnce again, all I can do is take the teams in better form and with higher probabilities of giving us a win.  It seems is has not been happening for me lately but fortune has not been kind to many others on POTD either.\n\nGamble responsibly please and enjoy yourselves. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqmm5yy/"
    },
    {
      "created_utc": 1764031713.0,
      "author": "dreamchasing1",
      "text": "Record: 227-216 Net Units: -28.97 48-51 on 1.5u plays, 37-39 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Denmark Superliga] Randers vs Odense\nLast pick: BTTS + Over 2.5 goals @ 1.95 loss\n\n\nEvent: Soccer/Football, [England National League North] Southport vs Radcliffe\n\n\nPick:  BTTS + Over 2.5 goals @ 2.00 - 1.5 Units\n\n\nThe two teams have been consistently covering this line with Southport at home covering in 9/12 competitive games this season, Radcliffe in 7/11 away games, with all away games for them going over 2.5 goals. The two sides already met this season at Southport's home in a 3-2 win for Southport. Last season, this line covered twice between them in 4-1 and 2-2 scorelines.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqmjj6x/"
    },
    {
      "created_utc": 1764031266.0,
      "author": "nigerianPriince0",
      "text": "**Record: 94 W  - 78 L**\n\n**Form:  ✅✅✖️✖️✅✅✅**\n\n**Last Pick: Jordan Pickford Over 3.5 Goalkeeper Saves  @ 1.83 ✅**\n\n**6 Saves!!!!**\n\n**------------------------------------------------**\n\n**Today's Pick: Robert Sanchez Over 2.5 Goalkeeper Saves  @ 1.64**\n\n**League - Champions  League**\n\n**Game: Chelsea Vs Barcelona** \n\n**Time: 3:00 pm EST**\n\n**-----------------**\n\n**Champions League is back baby!! Keeping it in keeper markets today to keep the streak going (see what i did there lol).**\n\n\n\n**Sanchez has played 3 Champions League games and covered this line in 2/3  of those games.**\n\n**Saves: 1, 3, 3**\n\nBarcelona are going to put pressure on that Chelsea goal to keep their Champions League dream alive. Chelsea structurally will give up more than enough chances to cover this line.\n\nIt should be an open game on both ends with Sanchez having to be at his best to keep this Barca side out. With both teams currently 11th and 12th in the table, shots will fly.\n\n**Anyway BOL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqmi9mn/"
    },
    {
      "created_utc": 1764030543.0,
      "author": "NVSBETS",
      "text": "POTD Record: 13-2\n\nNet Units: +10.78u ROI: 47.28%\n\nPrev POTD: Jan Choinski ML -200✅ +1u\n\nSport: Tennis Tournament: Athens 2 Challenger Time: 3:30AM est\n\nPOTD: Carlo Alberto Caniato ML -154 1u\n(Playable up to -180)\n\nReasoning: absolutely love the young Italian in this spot. He’s very talented (mainly a clay courter) and now he’s having a breakthrough year putting his hard court game together too finally. He had a great showing two weeks ago on the Sentra hard courts where he claimed the title. His performance in the finals *really* impressed me against his biggest step up in completion vs Bailly. He’s had two weeks now to acclimatize to the conditions for Athens 2 so championship hangover won’t be a factor. He’ll be super motivated to continue his great form into this challenger tournament with more ranking points and prize money as incentive.\n\nJames Story. 24 year old British ITF hard court farmer. Better doubles player than he is a singles player. He’ll be playing doubles here too so he’s got a built in fall-back mentally (and financially) knowing he has a doubles game the following day. He does ok farming low level M25 hard court tourneys but He’s only played *TWO* challenger level singles this year on hard courts beating Silvestre as a -10000 favourite and then loses the next game to Sakellaridis as a -500 favourite… He’ll be exposed tomorrow and Caniato will show levels on the outdoor harcourts of Athens 2.\n\nRide with the hottest capper in this subreddit and come see why they NVS🌟\n\n*If I’ve made you money and want to tip*: [BMAC☕️](https://buymeacoffee.com/nvsbets) or [BTC](https://pastebin.com/0Lf0mHqu) [ETH](https://pastebin.com/D2QRi3Bx)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqmg79t/"
    },
    {
      "created_utc": 1764030339.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Tuesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p5y2zj/pick_of_the_day_112525_tuesday/nqmfm0e/"
    }
  ]
}