{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/24/25 (Monday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/",
  "target_date": "2025-11-24",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-24T14:52:24.787416+00:00",
  "comments": [
    {
      "created_utc": 1763995641.0,
      "author": "MoneyBagsMorris4108",
      "text": "Record: 4-1-0 (+4.01u)\n\nPrevious Pick: NCAAF: 2 Leg: Oregon ML + Pitt +7.5 (-137)✅\n\nEvent: NCAAB: Creighton @ Baylor 2PM EST\n\nPick: Creighton Moneyline (+155)\n\nWrite Up: I could just go for the spread here (+3.5), but we are on a three-win streak and momma ain't raise no bitch, so going for it with outright win. While Creighton hasn't had the cleanest basketball so far this season, I do think they have the components to pull this off against Baylor. Creighton is currently holding its opponents to 67.8 PPG and limiting shooters to 29.3% from the three point line, which is a huge point of focus since Baylor survives off of its three point shooting. Baylor might be a better offensive team, but Creighton's has the edge when it comes to rebounding and defense which I think will limit a lot of second chance opportunities for Baylor.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqjbbf5/"
    },
    {
      "created_utc": 1763992120.0,
      "author": "whiteiversonyeet",
      "text": "RECORD: 4-1\n\nSTREAK: 4W\n\nNCAMBB TOWSON VS RHODE ISLAND 10:00 AM CST\n\nRHODE ISLAND ML -148\n\nWHY: RHODE ISLAND HAS A STRONG EDGE IN THIS MATCHUP BECAUSE THEIR OFFENSE HAS BEEN FAR MORE EFFICIENT, AVERAGING OVER 80 POINTS PER GAME WHILE SHOOTING AT A HIGHER PERCENTAGE THAN TOWSON ALLOWS, WHICH SHOULD CREATE CONSISTENT SCORING OPPORTUNITIES. THEIR ABILITY TO CRASH THE OFFENSIVE GLASS AND GENERATE SECOND-CHANCE POINTS ADDS ANOTHER LAYER OF PRESSURE ON A TOWSON TEAM THAT HAS BEEN INCONSISTENT TO START THE SEASON. URI ALSO ENTERS THE GAME WITH BETTER FORM AND MOMENTUM, AND THEIR PERIMETER SHOOTING, LED BY PLAYERS WHO CAN STRETCH THE FLOOR, MATCHES UP WELL AGAINST A TOWSON DEFENSE THAT HAS SHOWN VULNERABILITIES. WITH THEIR EFFICIENT SCORING, REBOUNDING ADVANTAGE, AND OVERALL CONFIDENCE, RHODE ISLAND HAS MULTIPLE PATHS TO CONTROL THE GAME AND COME AWAY WITH THE WIN.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqj18xc/"
    },
    {
      "created_utc": 1763987909.0,
      "author": "OliveCritical5134",
      "text": "**Record: 25-16**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅✅✅✅❌❌✅✅✅❌✅✅❌❌\n\n**Sport:** ⚽ / English Premier League / Manchester United v Everton\n\n**Net Units/ROI:** \\+23.78u /  22.87%\n\n**Previous Pick:** Real Betis to win (1.53) + Hearts to win (1.86) @ 2.85 -- 2 units❌\n\n**Summary:** Rough weekend with Sunday having most results going the opposite way of general expectations, including the two I picked.\n\n**Today's Pick:** Manchester United - Everton: Both teams to score @ 1.70 -- 2 units\n\n**Write up:**\n\nI had a different write up ready before taking a look at this match. I initially didn't want to touch this match because of the fact that Manchester United is just completely impredictable at the moment. You never know if they are going to win or lose a game they turn up to. But there is one thing thats pretty certain, both teams find the net. With Everton climbing the rankings I reckon they will be able to score against a struggling Man U defense. Manchester United have seen both teams scoring in 9/12 official matches this season, 2 out of those 3 matches were games against Arsenal and Manchester City where they still had enough chances to put at least one away. \n\n**Best of luck if tailing! 🍀**\n\n**PS:** If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqiqgge/"
    },
    {
      "created_utc": 1763986894.0,
      "author": "Hour-Tie1627",
      "text": "**Pick of the Day:**  \n🇬🇧 ⚽ *Manchester United or Draw + Over 1.5 Goals (2-leg parlay)*  \n**Odds:** 1.52  \n**Units:** 5\n\n**Event:** Premier League – Manchester United vs \\[Opponent\\]  \n**Standard Time:** 8:00 PM UTC, 24 Nov 2025\n\nAlright lads, it’s my *first* Pick of the Day post, so go easy on me.\n\nI’m rolling with a nice, responsible, “I’d like to sleep tonight” parlay: **Manchester United or Draw + Over 1.5 goals.**\n\nReasons for this pick:\n\n\\- United have a *ridiculously strong* home record this season, just one loss at Old Trafford.   \n\\- We’ve seen 2 or more goals in ELEVEN straight United games.\n\nBasically: goals will happen, and United probably won’t implode.\n\nGoing **5 units** here because if I don’t start strong\n\nLet’s ride. 🔥⚽",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqio7qp/"
    },
    {
      "created_utc": 1763985784.0,
      "author": "Laird87",
      "text": "POTD Record: 208-204, -70.43 Units\n\nParlay Record: 1-2, -0.52U\n\nCurrent streak: ❌\n\nLast 10: ❌✅❌❌✅❌❌✅❌❌\n\nLast Pick: Bulls-6.5/Nuggets -5.5 ❌\n\nThe Nuggets are a frustrating team that inexplicably loses games they should easily win, it's like their team is on its period once a week.\n\nToday's Pick: 2 Pick Parlay: Miami Heat ML (-325, 7:30 PM EST start) and Florida Panthers/Nashville Predators Under 7.5 Goals (-420, 8:10 PM EST Start), -164, 2 Units.\n\nBOL, tail or fade! Tip Jar: [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqilv6k/"
    },
    {
      "created_utc": 1763982837.0,
      "author": "1234unodostrescuatro",
      "text": "__Record: 16-9__\n\nForm (old to new): ❌✅✅✅❌✅✅✅✅✅❌✅✅✅❌❌✅✅❌✅❌✅❌❌✅\n\nLast pick: Jalen Hurts U0.5 INT (-160)✅\n\nGame: CAR vs SF\n\n__Today’s pick: CMC O43 rec yds (-110)__\n\nAnalysis: CMC is averaging about 9 targets for 67 rec yds per game. CMC facing his old team is a cool narrative as well",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqig58d/"
    },
    {
      "created_utc": 1763982494.0,
      "author": "realjohnkeys",
      "text": "Record 1-1  + 1unit\n\nBaylor -4.5 @ -110 for 2 units\n\nStrong offense and defense on the favorite side, key personnel missing with the underdog.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqifiux/"
    },
    {
      "created_utc": 1763980902.0,
      "author": "CashTheTicket",
      "text": "POTD RECORD: 2-0\n\nPOTD UNITS: +6.46💰\n\nLAST PICK: Scotland -29.5 + England ML @ -122 (3 Units)✅✅\n\nTODAY’S FIXTURE: Manchester United v Everton (3pm EST)\n\nPICK: Both Teams to score YES @ -135 (2 Units)\n\nWRITE UP:\n\nanother good win with the last pick to go 2-0! Scotland winning 56-0 and England holding off Argentina to get the job done! \n\nToday’s pick is good value in my opinion. Man United game BTTS has hit in 9 of their 11 games at an aggregate scoreline of 21-14. This shows us two things that most of us already know: A) they’re strong going forward the likes of Mbuemo and Fernandes etc. but also frail at the back conceding 2 goals in all of their last 3 premier league games.\n\nEverton on the other hand don’t see BTTS as frequently, however do have an aggregate score of 14-13 in their favour.\n\nI expect United to score as they have showcased their ability to do so. I also expect them to concede for the same reason. Everton are a good side and I believe this is good value.\n\nObviously outliers happen in sport but the evidence does seem to support BTTS being good value.\n\nCheers!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqicpsc/"
    },
    {
      "created_utc": 1763979503.0,
      "author": "Vet100",
      "text": "Record: 20-10\n\nNet Units: +7.58\n\nROI: 25.3% \n\nPick: NBA Pistons v Pacers \n\n1U Duncan Robinson 3+ 3-pointers made @ $2.18 (+118), Sportsbet (Aus) \n\nWrite-Up: Anytime you get plus odds on something that is 7 in a row & 10/11 for the month (incidentally the one miss he had was one of my POTD’s so hopefully not a bad omen), I think you take it. \n \nAveraging 7.7 attempts in 32.3 minutes per game for November, the usage & volume is good. Going at 46% completion (his current rate) means we will take 7 attempts on average completion. \n\nWent 3-11 v the Pacers last week (without Cunningham). Suspect volume will go down but spacing will go up & should be more accurate so again, so again 3-7 seems very doable. \n\nThe main problem will be if Ivey plays & eats into his minutes & usage - Ivey played against the Bucks and Robinson got 28 minutes & 5 from 6 from 3-point range, his lowest minutes for the month. However, plus odds, 7 in a row, I’m going to jump on the train and see where it goes.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqiad77/"
    },
    {
      "created_utc": 1763976820.0,
      "author": "IAmLeftHandedOk",
      "text": "Record: 0W – 0L\nUnits: +0.00 (All picks are 1 unit)\n\nToday’s match: Carolina Panthers vs San Francisco 49ers (NFL)\n\nPick: Panthers +7.5 (-115, Bet365)\n\nCarolina quietly comes into this game playing better than the market gives them credit for. They’ve covered 5 of their last 7 and have multiple outright wins as an underdog. Their rushing attack has been solid at 4.5 YPC, and Bryce Young is coming off his best performance of the season.\n\nThe 49ers are the heavy public side as a primetime home favorite, which has led to an inflated number. Despite the hype around San Francisco, their defense has been very mediocre recently — giving up high yards per play and high completion percentages. Their run game has also taken a hit with injuries, which makes it harder for them to control the pace.\n\nThis is exactly the type of spot where taking the points with the ugly dog holds value, especially now that the line has moved off the key number of 7. Getting the hook at +7.5 is a big deal in an NFL game expected to be competitive early.\n\nRolling with Panthers +7.5.\nBOL and bet responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqi5zkr/"
    },
    {
      "created_utc": 1763973646.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 9-5, +2.11u\n\n**Previous Pick:** Buducnost +1.5 handicap & over 164.5 points in the game, 1.80, 1.5u ❌️, (last 5: ✅✅❌️❌️❌️)\n\n**Event:** WABA: Buducnost Podgorica W - Orlovi W, 15:00\n\n**POTD:** Buducnost to win by 38 points or more, 1.86, 1.5u\n\nIt is a big spread to get, but considering the current form of guests, I like it still. They are the Bosnian champions, but currently, they have been playing very poorly.\n\nLosses in the WABA league 28. 33, 28, 36 points and a 0-4 score.\n\nBuducnost has 3-1, wins by 57, 13, and 32 points. This 13-point win came against Partizan, a top 3 team in the league. Buducnost should be the best team in this league, and they are worth following in the future also.\n\nThe biggest reason for the pick is Orlovi's loss 2 days ago, against Zenica in the Bosnian league, 61-39; in the last quarter, they lost 21-3. This is the last quarter they played, and the quarter they are coming into this game. And Buducnost comes from the 57-point win.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqi0xbu/"
    },
    {
      "created_utc": 1763972637.0,
      "author": "Rubbunchi",
      "text": "POTD Record : 0-0\n\nPOTD : English Premier League,  Man U vs Everton - Over 9 corners @ 1.53 (2U).\n\nReason : As the point table shows,  Man u stands at number 10 and Everton at 13. Whoever wins this match will get a nice place on standing. There will be much scoring pressure on this match. So, I'm taking over 9 corners. Could have gone higher, but not being greedy.\n\nGood luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhzaxp/"
    },
    {
      "created_utc": 1763972535.0,
      "author": "ChiliCheeseSandwich",
      "text": "Yikes, the Bengals hand us our first loss as they cover the 7 point margin by one point. No excuses here. I apologise for the loss, plus I may have sounded a little too confident going into the match. I’ll try and redeem myself tonight.\n\nPrevious Pick:  New England Patriots -7 @1.84, 2U.❌\n\nRecord: 3-1\n\nPOTD: Detroit Pistons -9.5 @1.94, 2U.\n\nNBA: Indiana Pacers VS. Detroit Pistons.  \n\nWrite Up: We’re going back to where we started off with another NBA pick, rolling with the Pistons once again. Both teams have had a few days to rest, which doesn’t really benefit the Pacers as their performance is usually underwhelming anyway. In their last meeting, the Pistons won by 15 points without the help of Cade or Ausar. With the both of them playing this match, I can see this match getting out of hand real fast. The Pacers are more or less rolling with the same lineup too like they did during their last encounter. Therefore, I’m taking the Pistons to cover the 9.5 point margin.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhz52n/"
    },
    {
      "created_utc": 1763972407.0,
      "author": "Uneasiestwig",
      "text": "Record: 6-9\nNet units: -1.85\nLast pick: Aston villa to win vs Bournemouth @2.4 3u ✅️\n\nToday's pick:\nEnglish premier league 🏴󠁧󠁢󠁥󠁮󠁧󠁿⚽️\nMan utd vs everton\n\nMan utd to win @ 1.77 (betway) 4u\n\nMan utd will be looking to get in the top 5 with a win at home vs everton.\nUtd are unbeaten in five matches (W3 D2)\n\nEverton are on a 9 match winless run in Monday night premier league games (D5 L4)\n\nEvertons only win in their last 32 league trips to old Trafford was in the 2013/14 season.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhyxim/"
    },
    {
      "created_utc": 1763971544.0,
      "author": "FalseBet6850",
      "text": "Overall POTD Record: 8W - 6L (all bets are 1 unit)\n\nFirst pick of the season\n\nEvent: (NBA) MIN Timberwolves vs SAC Kings\n\nPick: MIN Timberwolves -9.0 (1.90 on Bet365)\n\nTwolves have covered this spread twice already (124-110 & 144-117).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhxigb/"
    },
    {
      "created_utc": 1763971409.0,
      "author": "Purevalue_Picks",
      "text": "Record: 0–1\nNet Units: –1.00u\nROI: –100%\n\nLast pick NBA Toronto raptors vs Brooklyn Nets total points over 229.5 ( finished on 228 :( .. \n\nToday’s bet \n\nSport | League | \nSoccer | Indonesia Liga 2 | Today\n\nPick: Over 2.5 Goals (1u)\nODDS @ 1.92 \n\nWrite Up:\nThis matchup profiles extremely well for goals based on both teams’ recent style of play. PSPS Riau have been conceding early and allowing consistent pressure, creating wide-open, attacking games at home. Garudayaksa also play aggressively, leave space in transition, and have been involved in multiple high-chance fixtures with shaky back-line structure. Neither team has shown defensive consistency, and both sides generate enough shots and big chances to push this total over. The tempo of this league is chaotic and typically rewards attacking matchups like this one. Over 2.5 at this number holds strong value.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhxaag/"
    },
    {
      "created_utc": 1763969689.0,
      "author": "mouse_that_runs",
      "text": "POTD RECORD: 10-2-1\n\n✅️✅️✅️✅️✅️➖️✅️✖️✅️✅️✅️✅️✖️\n\nLAST POTD: \n\nRugby\n\nScotland vs. Tonga (Tonga +42.5) @1.59 ✖️\n\nTODAY'S POTD:\n\nSoccer\n\nManchester United vs. Everton (Manchester United to win) @1.74\n\nManchester United are finding their feet under Ruben Amorim, winning their last four matches at Old Trafford. \nEverton is visiting, having not won an away fixture to Manchester United since 2013. They have only won four points on the road this season, three of which were from a win against relegation favourites Wolverhampton Wanderers.\nThis fixture resulted in a 4-0 win for Manchester United last season, and although the score may differ, the result of a Manchester United win will repeat.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhudhm/"
    },
    {
      "created_utc": 1763968282.0,
      "author": "this_guy9",
      "text": "POTD Record: 9-6\n\nNet Units: +3.22\n\nPrevious Pick: [❌ Tyrese Maxey o7.5 Assists +106](https://www.reddit.com/r/sportsbook/comments/1p49ox5/comment/nqbg2te/)\n\nJust way too many bricks off Maxey's passes/potential assists. Difference between cashing and not cashing was just two teammates hitting their shots. No more messing around:\n\n**🏀 Scottie Barnes o7.5 Rebounds -110** vs the Cleveland Cavaliers\n\nGreat matchup play. Scottie eats on rebounds vs the Cavs. He's gotten 10+ boards in each of their last 4 meetings, including two appearances this season and two in last.\n\nCleveland ranks last in the league 30/30 in allowing rebounds to PFs. Clearly an edge that Scottie has been able to capitalize on. Both teams rank similarly in overall team rebounding rankings but Raptors have seen a marked improvement in the last week\n\nHad a couple weak games recently to give us the 7.5 line -110 but overall still cashed in L4/7, averaging 7.6 on the season.\n\nBeat the Cavs on the road about a week ago. Expect them to keep it similarly competitive at home with both teams coming off a game yesterday.\n\nFull stats if you'd like to do additional research: [https://www.statpick.ai/18638284/scottie-barnes-rebounds](https://www.statpick.ai/18638284/scottie-barnes-rebounds)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhs04r/"
    },
    {
      "created_utc": 1763966708.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 198-148\n\nUnits Won: +100.01u\n\nLast Pick: FireFlux -1.5 maps (-125) vs. HyperSpirit✅\n\nToday's Pick: **NIP ML vs. NRG + Frozen>C4llM3Su3 Map 2 Kills (-143)** 5u\n\n\\*\\*More ML picks/major bets posted over in the esports channel\n\nhttps://preview.redd.it/o3uhir5zg53g1.png?width=217&format=png&auto=webp&s=a27c7d252572da203cf83f5dd226dbc8b5c335c8\n\nTeams: NIP vs. NRG | FaZe vs. Lynn Vision  \nTime: 9;00 AM EST. | 10:00 AM EST.\n\n**NIP ML (-250)** vs. NRG\n\n* NIP take on NRG in round 1, the main reason I am so confident in this pick is the loss of nitr0 coming into this major. NRG lose both their leader on the server and their IGL. This is a massive loss to a team, while statistically he is their worst player, the impact of the IGL can sometimes be greater then even the star players on certain rosters which in this case feels like it is a massive impact\n* NIP are a really strong team, they had a great run of form in the middle half of the summer months but have slowly fallen off a bit, I still think this roster is great with Xkacpersky and r1nkle being monsters. NIP main weakness has a team has continued to be their very weak map pool, but in a b01 this is very masked by the fact that they get to ban their 3 maps that are 20% winrate and below (Mirage/Dust 2/Inferno) and force it on a comfort map\n* NRG perma ban Ancient, likely ban Nuke due to the 65% first pick rate NIP have on the map as well as this being their best map. This leaves Train or Overpass, NIP are known for their train but is arguably NRG best map as well so NRG will likely get choice whether to force this onto Train or try to punish Overpass. Regardless of which is chosen, NIP should be heavy favorites, Train and Overpass are easily the two hardest maps to play on with subs/missing pieces in my opinion. Daps the sub for NRG has only palyed 30 rounds of CS this year averaging a .43 KPR, since 2024 he is averaging a .38 KPR against non NA competition\n\n**Frozen>C4llM3Su3 Map 1 Kills**\n\n* FaZe ae -312 favorites in their match tomorrow against Lynn Vision\n* Frozen averages a .75 KPR, second best on FaZe, C4llm3 is averaging a .61 KPR, 2nd best on lynn Vision\n* FaZe ban Train/Overpass/Inferno imo, Lynn Vision ban Mirage/Nuke/Ancient, leaving Dust 2, think if either team was to leave one map up, could see FaZe maybe letting Overpass thru, and maybeeee Lynn Vision go to Ancient but I highly doubt it. To me the only two options are Dust 2 and Overpass\n* Frozen is averaging a .84 KPR on Overpass in the L3 months, C4llm3 is averaging a .58 KPR in the L3 months on Overpass\n* Frozen is averaging a .78 KPR on Dust 2 in the L3 months, C4llm3 is averaging a .56 KPR in the L3 months",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhp7v4/"
    },
    {
      "created_utc": 1763966448.0,
      "author": "Fair-Asparagus-9264",
      "text": "**Record: 3-0 (+5.64u)**\n\n**Last POTD: Kenneth Walker III + Zach Charbonnet 100+ combined rushing yards (-130) 2U** ✅\n\nTitans kept it closer than expected so our RB combo had fewer rushes (17 total) yet cleared the 100 yard mark so we cashed. \n\n**POTD:** MNF **Panthers at 49ers - Each team to score 1+ TD in each half (+125) 2u to win 2.5u**\n\n49ers have hit this 4 straight - both scoring and conceding 1+ TD in each half. Panthers have hit this in 4 of their last 8 but there offense has been clicking of late both in terms of total yardage and in finding the end zone. They have also scored 3+ TDs in nearly half their games (5/11). I think the 49ers should have no problem covering their end. The question is can the panthers? Here SF recent defensive form helps. Over the their last 4 games, SF have given up 14TD's to opposing teams - or 3.5 touchdowns a game. On the season, opponents have a 60% TD percentage when they reach the redzone. \n\nIf you wanted the same odds (+125) on the total - the alt over would be 53. This seems too high for comfort for me and I can see a lot of game scripts where the game stays under 53. If on the other hand, you think Carolina will probably lose though hold its own - then all they need is 2TD, one in each half. BOL if tailing  \n\nThis bet is under Halves-->TD Props in Draftkings",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhoqxq/"
    },
    {
      "created_utc": 1763966047.0,
      "author": "ColdTub10",
      "text": "Let's get this bread, first POTD.\n\nPOTD Record: 0-0 \n\nNet Units: N/A (first POTD)\n\nROI: N/A (first POTD)\n\nEvent: Men's College Basketball | Alabama vs. Gonzaga | 9:30pm EST\n\nPOTD: Alabama +2.5 at -110 2u\n\nWrite Up: I really like Bama this year and I've watched all of their games this season so far. As most CBB fans know, Alabama has become one of the fastest paced teams in the country and this has given them an edge in big time games over the past few years. \n\nAlabama has already won 2 huge ranked games this year - Illinois and St. Johns (St. Johns currently ranked 14th in the nation in defensive efficiency and that is including the game Alabama put 103 up against them). Gonzaga is currently ranked 2nd in the nation in defensive efficiency, but I don't like the matchups they've had compared to Alabama. \n\n**Over their past 3 games, which were all against current top 15 teams, Alabama has averaged 91ppg.** This team moves the ball at a pace I don't think Gonzaga will be ready for. This game is going to be high scoring, I expect both teams in the 80s. But with it being at a neutral site, I'm giving Alabama the edge. Labaron Philon is going to be a lottery pick in the draft next year, and if Aden Holloway gets hot, call it game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqho0yu/"
    },
    {
      "created_utc": 1763962414.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 20-8 (+13.3U)\n\nLast Pick: Two team parlay (Eagles ML/Northwestern ML) (+110) (1U) 🙅‍♂️\n\n[Parlay write up](https://www.reddit.com/r/sportsbook/s/JbUBMJFeiN)\n\nJust despicable what happened in the eagles game. 24 unanswered points in almost three quarters is just awful. Lot of things didn’t sit right with me in the second half. We haven’t lost two in a row ever though and that ain’t gonna change!\n\nEvent: Gonzaga vs Alabama (NCAAB) (8:30pm central)\n\nPOTD: Gonzaga -3.5 (-110) (1U)\n\n-everything is bet to win unit amount-\n\nWrite up: \n\nGonzaga enters this showdown with Alabama carrying one of the most dominant statistical profiles in the country, and laying just 3.5 points feels like a gift when you dig into the numbers. The Bulldogs are averaging 94.0 points per gamewhile holding opponents to just 57.8, giving them a staggering average margin of victory of over 36 points per game. Alabama, by comparison, is scoring 91.0 points per game but allowing 82.8, leaving them with a much thinner margin of just 8.2 points. That gap in two‑way dominance is not noise — it’s the kind of edge that translates directly into covering spreads, especially in neutral‑site showcase games like this one in Las Vegas.\n\nThe rebounding battle is another area where Gonzaga holds a clear advantage. The Bulldogs are pulling down 46.4 rebounds per game, compared to Alabama’s 38.8. That difference reflects both Gonzaga’s superior size and their commitment to controlling the paint. Graham Ike has been the anchor inside, averaging 17.0 points and 9.2 rebounds, and his physicality is tailor‑made to exploit Alabama’s tendency to foul. The Crimson Tide rank outside the top 300 nationally in personal fouls, committing over 20 per game, and Gonzaga’s frontcourt presence is likely to put them in foul trouble early. Even Alabama’s own head coach Nate Oats has admitted this weakness, saying after the Purdue loss that he “wasn’t happy with the rebounding or the toughness” and that if Alabama doesn’t fix the problem, “it could be in for a long season.” That’s not just outside analysis — it’s the coach himself acknowledging the exact area Gonzaga is built to exploit.\n\nEfficiency separates these teams further. Gonzaga is shooting 53% from the field with nearly 19 assists per game, a sign of a connected offense that consistently generates high‑quality looks. Alabama’s numbers — 47% shooting and 16.8 assists per game — are strong but not elite, and against a disciplined defense like Gonzaga’s, those small differences compound quickly. The Bulldogs play fast, but unlike Alabama, they don’t sacrifice defensive integrity to push the pace. Their recent 122–50 demolition of Southern Utah is the perfect example: Gonzaga forced 23 turnovers, held their opponent to 29.5% shooting, and still ran up the score with relentless tempo. That’s the kind of balance that wins showcase games and covers numbers.\n\nHistory between these programs shows volatility — Alabama won by nine in 2021, Gonzaga answered with a ten‑point win in 2022 — but this year’s Gonzaga team is built differently. They have the size, the discipline, and the efficiency to control the game on both ends. When you combine their statistical dominance in rebounding, defense, and shot quality with Alabama’s own coach admitting his team struggles to crash the boards, laying just 3.5 points feels like a number rooted in repeatable edges rather than a hope for an outlier shooting night.\n\nBottom line: Gonzaga’s profile is exactly what you want when betting a short favorite. They rebound better, defend better, shoot better, and play with more cohesion. Alabama’s pace and talent will keep them dangerous, but Gonzaga’s ability to impose their will inside and exploit Alabama’s foul‑prone tendencies makes this matchup lean heavily toward the Bulldogs. At -3.5, Gonzaga is the play of the day, and it’s backed by hard numbers and even Alabama’s own coach admitting the boards are a problem. \n\nIf yall saw the Auburn pick I originally had up here, that’s on me. I should have been more attentive to the injury report before getting that play out and I’m genuinely sorry about that. That’s on me and will never happen again. BOL if you are tailing the zags. As always, cheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhh6tp/"
    },
    {
      "created_utc": 1763960032.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 8-5-1 \n\nStreak: 6W ✅\n\nNet units: +1.91u All bets are 1 unit.\n\nLast POTD 11/23/25: George Pickens O65.5 receiving yards (-110 Bet365) ✅\n\nToday's POTD 11/24/25: Tetairoa McMillan O63.5 receiving yards (-120 Bet365)\n\nEvent: NFL MNF Panthers @ 49ers 6:15MST\n\nWrite Up: The Carolina Panthers have been one of my personal biggest surprises of this season. The 8th overall pick of this year's NFL draft has paid great dividends for this team and the numbers will tell he's set for another great week. \n\nThe 49ers defense has been plagued with injuries and they have not had much to work with since losing their main pieces that really held this defensive unit together. San Francisco ranks 28th in the league for yards allowed to wide receivers (165 yards) and they are the league worst in generating pressure to the quarter back for sacks. Last week the 49ers just gave up an NFL record setting game to Jacoby Brissett in completions and he torched the team with 452 yards with 271 of those yards going to wide receivers.\n\nBryce Young is coming off his franchise record breaking game in passing yards and McMillan was his main target throughout the contest. I believe this duo will continue to keep the hot hands rolling into this matchup and will see many opportunities for deep shots and big plays.\n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqhcajv/"
    },
    {
      "created_utc": 1763959073.0,
      "author": "plssteppy",
      "text": "Record: 1-1 Net: +1.148u\n\nLast pick: Rams Moneyline, Stafford 225+ passing ✅\n\nToday's pick: 49ers Moneyline, McMillan 50+ receiving yards. 1.78 odds on FanDuel. Risk 4 units to win 3.126 units\n\nWriteup: Two legs. 49ers are favorites, leg one check. 49ers passing offense good, Panthers passing defense bad. McMillan has a good matchup and 50 yards is way lower than his projected over under, leg two check.\n\nhttps://preview.redd.it/zf6aqgwyv43g1.png?width=720&format=png&auto=webp&s=bb573ed1a93bfb3303afed6294323df670a4a886",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqha8d3/"
    },
    {
      "created_utc": 1763958460.0,
      "author": "wes2211",
      "text": ">**Record:** 113-96\n>**Net Units:** +23.45 units\n\n>**Curling** | **European Curling Championships** | **1:00AM EST**\n\n>**Pick:** Italy ML @ 2.15\n\n>Italy and Scotland play early this morning as round robin play at the Euros continues. Morrison, the Scottish fourth, has played very poorly so far at this event and despite their first win on Sunday, it looks like that may continue here. On the other side, Lacedelli has been incredibly sharp as the lead for the Italian rink and has set her team up nicely. The wrong team is favoured here, great dog play.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqh8w1m/"
    },
    {
      "created_utc": 1763957415.0,
      "author": "Chevre_",
      "text": "**Previous Pick:** Drake Maye o258.5 Passing Yards (-113), 5 units ✅\n\n**POTD Record:** 4-0\n\n**Net Units:** 18.47\n\n**ROI:** 92.35%\n\n4/4 hits guys! Loving the journey so far. Let's keep it rockin for MNF.\n\n\\_\\_\\_\n\n**NFL | SF 49ers vs. CAR Panthers | 8:15pm EDT**\n\n**Pick:** George Kittle o56.5 receiving yards (-112), 5 units\n\n**Write Up:** This is going to be a bit shorter than usual so apologies there. Going with what I'm sure will be the chalkiest pick on the day. I think this could clear in the first half if I'm being honest. Should be a high-total shootout between these two middling teams. 49ers are second in passing yards per game and the Panthers are tied for the 6th lowest in EPA/Pass with some of the crummiest teams in the NFL. I also like Christian McCaffreys lines here, but with Brock Purdy back and the way The Panthers run their zone coverage, we should see more action to Kittle.\n\n**Take Kittle over 56.5 receiving yards**\n\n*Please tail at your own risk and only ever wager what you can afford to lose. BOL!*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqh6jgs/"
    },
    {
      "created_utc": 1763957253.0,
      "author": "Ralphjinasseater",
      "text": "Record 8-7-2\n\nLast pick: Donovan clingan “U” 21.5 P+R+A ✅ Pick of the Day: Jalen Duren O 20.5 PA (-125)\n\nReason: • Indiana allows the 5th MOST points in the league. • 21+ PA in 10/14 games this season, averaging 22.5 PA. • 21+ PA in seven straight games, averaging 26.2 PA. • Dropped 34 PA vs Indiana earlier this season, playing 28.6 minutes. • 21+ PA in 10/11 games this season when playing 21+ minutes, averaging 25.8 PA. • Indiana allows the 4th MOST points in the paint & the 5th MOST points in the restricted area (96% of his points). • Indiana also gives up the MOST free throws & the 4th MOST points from the PNR roll man (38% of his scoring). • 21+ PA in five straight games vs. bottom 10 defenses for points allowed, averaging 27 PA.\n\nhttps://preview.redd.it/jfddd4uhq43g1.jpeg?width=1170&format=pjpg&auto=webp&s=5e2f7dede9f88b8c80dde7802e1205e0e2dddbe1",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqh65xp/"
    },
    {
      "created_utc": 1763956608.0,
      "author": "Few-Radish5584",
      "text": "Longtime lurker, ready to jump into the action.\n\nRecord: 0-0\n\nNet Units: +/- 0\n\nEvent: NFL MNF Panthers @ 49ers\n\nPOTD: George Kittle O4.5 Receptions (-134 DK)\n\n1u\n\nWrite Up: Kittle’s impact in the pass attack has picked up the last couple of games with 9 catches on 9 targets two weeks ago with Mac Jones, and another 6 grabs upon Purdy’s return last week. Surely he has better synergy with Brock. I just think we’re getting some value here on still one of the best TEs in the game. \n\nBOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqh4nfl/"
    },
    {
      "created_utc": 1763954138.0,
      "author": "herbobets",
      "text": "**Record:** 1-2-0\n\n**Net Units:** \\-7.56u\n\n**Last Pick:** L - Liverpool 5+ shots on target + Manchester City 5+ shots on target (+114) - 5u\n\n**Form (last 5):** LLW\n\n**Streak:** 2L\n\n**Event(s):** Turkish Super Lig: Istanbul Basaksehir vs Trabzonspor (11:00 a.m. CST) + Serie A: Torino vs Como (11:30 a.m. CST)\n\n**Pick:** Trabzonspor over 0.5 goals + Como over 0.5 goals (-138) - 5u\n\n**Write-up:** Both Trabzonspor and Como are in good form, and each matchup lines up well for them to find at least one goal.\n\nTrabzonspor have been one of the strongest attacking sides in Turkey this season and have been especially good away from home. They’ve gotten 10 points from 15 available on the road, including wins at Kasimpasa (1–0) and Karagümrük (4–3), plus a draw at Galatasaray, who have been one of the most impressive teams in the world this year. They’ve also scored in four straight meetings against Basaksehir, winning all four with clean sheets. Even in their last match before the break, they created enough to score early before giving up a late equalizer.  \nBasaksehir’s defense was solid for a stretch, but that run has been broken, with them conceding in two straight matches. They’ve also only won one out of five home league matches this season. With how well Trabzonspor travel, and with Onuachu currently tied as the league’s top scorer, I like them to find at least one here.\n\nComo also set up nicely to score. They’re on a 10-game unbeaten run across all competitions, and while their home form has been elite, they’ve also been competitive in recent away matches. They’ve drawn three of their last four on the road, including an impressive performance against Napoli. They’ve shown they can create chances regardless of venue, and Torino will be without their top scorer Giovanni Simeone, which could tilt the flow of the game a bit more open for Como in transition.  \nComo have also shown real attacking quality this season with players like Nico Paz supporting Morata or Douvikas. I expect Morata to start up top tomorrow and he and Nico should be able to spark some attacking quality. Given Como’s form, confidence, and their ability to generate chances even in tough away fixtures, I like them to find at least one goal in this spot.\n\nBoth teams are playing well, both have consistent attacking threats, and neither leg requires anything more than a single goal. Trying to get back on track after two close losses back-to-back.\n\nBOL and God bless.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqgyk8a/"
    },
    {
      "created_utc": 1763953178.0,
      "author": "nigerianPriince0",
      "text": "**Record: 93 W  - 78 L**\n\n**Form:  ✅✅✖️✖️✅✅**\n\n**Today's Pick: Arsenal Over 4.5 Shots on target @ 1.65  ✅**\n\n**8 Shots on target!!!!**\n\n**------------------------------------------------**\n\n**Today's Pick: Jordan Pickford Over 3.5 Goalkeeper Saves  @ 1.83**\n\n**League - Premier League**\n\n**Game: Manchester United Vs Everton** \n\n**Time: 3:00 pm EST**\n\n**-----------------**\n\nRarely do we get Monday games, but hey, nobody's complaining here\n\nI'm focusing on more niche markets today, as tomorrow's game is too volatile for me to dive into main markets much.\n\nMonday night pressure game for United here, which means another top Pickford performance simply to annoy another big 6 side. \n\n**In Pickford's last 5 games, he's covered this line in 4/5 of those games**\n\n**(5, 5, 1, 2, 4)**\n\n**In United's last 5 Home games, Opponent keepers have covered this line in 4/5 of those games**\n\n**(5, 4, 2, 5, 7)**\n\n**BOL!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqgw4hp/"
    },
    {
      "created_utc": 1763952333.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 174-130\n\nSeason record: 11-7\n\nLast POTD: __Davion Mitchell O6.5 AST @1.86 1U__ ❌\n\nToday’s POTD: __Bennedict Mathurin 20+ Points @1.76 1U (Bet365)__\n\nNBA | Pacers vs Pistons | 🏀  \n\nMitchell ends with 6, and doesn’t check back in for the final 15 minutes of the game due to the big blowout. Just shows how unpredictable betting is, Bulls were favourites pre game and books set a spread of 2.5 yet we get a 36 point blowout win by the Heat. Would’ve without a doubt reached close to 10 assists with normal minutes in a competitive game, was never gonna go over in 24 minutes. Awful beat but we move\n\nRunning back Mathurin who’s been amazing so far this season dropping 20+ points in all 5 games he’s played so far this season, including one against the Pistons where he had 25 points & 16 FGA. I talked about the upside of taking his points with his ability to get to the line and shoot free throws, had 14 FTA last game against the Pistons where he only made 8 so room for improvement there. \n\nOver in 5/5 games this season avg 26.4 PPG with his minutes ramping up from 27 & 25 minutes to playing 34 & 37 his last two games. Only needed 25 minutes against the Pistons to drop 25 points so with more minutes I like our chances even more, looks like he’s back to playing his normal minutes now so expecting 30+ minutes again.\n\nNot overthinking it, Pacers need his production offensively and he’s yet to fail on this line with the upside of more minutes this time around. Playing at home too hopefully makes the game more competitive.\n\nCool with 20.5 but decent odds for 20+ (ALT) so that’s my play.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqgtvtk/"
    },
    {
      "created_utc": 1763950729.0,
      "author": "Lyx97",
      "text": "Record: 2-0\n\nNet Units: +1.42\n\n*Prev Pick : Melbourne Stars (W) to win @ 1.65 (1u) --> Win*\n\nFootball | EPL |  Manchester United vs Everton | in \\~18hrs\n\nUnited Total over 1.5 goals @ 1.74 (1u)\n\nWrite Up: United has been consistently hitting this mark in 5/5 games and 7 of of the last 9 games. They are the favourites + playing at home. Expect it to hit here too\n\nBoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqgplwn/"
    },
    {
      "created_utc": 1763950587.0,
      "author": "major-couch-potato",
      "text": "Record: 164-137, +3.58 units\n\nLast Pick: Juan Pablo Varillas ML vs Murkel Dellien (-147, 1 unit): Win\n\nTennis | Athens Challenger | 5:50 AM EST (estimated)\n\nToday's Pick: Oleg Prihodko vs Bernabe Zapata Miralles | **Prihodko ML at -193 (DK). 1 unit.**\n\nWrite-up: Didn't get CLV there, so maybe not the best play. Regardless, Varillas actually won the first ten games of the match and looked like he might  double-bagel before Dellien started playing a bit better. \n\nBernabe Zapata Miralles comes into this match in horrific form. Zapata Miralles has lost his last 13 matches (17 if you count a Bundesliga interclub tournament) dating back to June of this year. In that span, he has won just four sets and been forced to retire twice. Now, he moves from clay to hard courts, a surface where he has never been very successful.\n\nSimilarly to Zapata Miralles, Prihodko tends to be much more comfortable on clay courts. However, the crucial difference here is that Oleg is not on a 17-match losing streak, and actually put in a decent performance on indoor hard in Bergamo last week. In the second round of that tournament, he was only priced at around +120 against Buvaysar Gadamauri, who has been playing much more tennis on hard courts and was a small underdog himself against eventual champion Francesco Maestrelli. Looking at Zapata Miralles's recent pricing, the market has understandably started to like him less and less. In Montemar last week, he was only around -250 against a mid-tier ITF player in Giuseppe La Vela, and still lost it in straight sets. In his most recent hard court match, meanwhile, Bernabe closed as an underdog against a doubles specalist in Trey Hilderbrand, going on to lose that one in straights as well. \n\nAll of this is to say that I think Prihodko should be an even bigger favorite here. Both players hit with heavy topspin and prefer clay courts, but Prihodko's vastly superior serve should give him the edge. In my experience, someone who has been losing left and right at the end of the year is probably going to start looking towards the next, and I don't expect BZM to be especially motivated to turn things around here. While the opening odds of -143 would have made this a 2-unit play for me, I still believe that there's 1-unit value here. \n\nNote: The [POTD Capper Tracker](https://potd.lol), which you may remember from its Google Sheet days, is finally back in a cleaner, more robust website format! If you have any questions or suggestions regarding the site, feel free to reach out to either me or u/EthicalGambler.\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/major-couch-potato-xJXnQW?utm_source=mdembed&utm_campaign=major-couch-potato) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqgp8iu/"
    },
    {
      "created_utc": 1763950217.0,
      "author": "_AnalkingSkywanker",
      "text": "**Let's do this! My first ever POTD!**\n\n**POTD Record:** 0-0 \n\n**Today's Event:** English Premier League | Manchester United vs Everton (20.00 GMT)\n\n**Pick:** Man United to WIN. Odds: 1€ to win 1.78€\n\n**Write Up:** It's my first ever POTD! Let's keep this short and simple. Manchester United are unbeaten in  last six games and have won four successive home matches. They have won their last three HOME premier league meetings with Everton with 8-0 goal difference! Everton heads to Old Trafford with one draw and three defeats from their last four away games. Should be no problem for ManU even though their engine has been coughing sometimes, but I trust the Red Devils on this one.\n\n\nBOL, lets go and start a winning streak here!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqgo9i1/"
    },
    {
      "created_utc": 1763944015.0,
      "author": "SoggyDatabase2348",
      "text": "***POTD Record: 9-5 (+13.84$)***\n\n*Last POTD: Pending* *Orlando Magic +4.5 -110 (2.50$ TO WIN 2.27$)* x \n\n***POTD: CBB Auburn -4.5 -110 (2.50$ TO WIN 2.27$)***\n\n*Write up: My model says this is the top play for the day. I will always try to get odds that between +100 & -120 for you all.*\n\n* Edge is set at 7%\n* Probability 53%\n* Model's probability 59%\n* My line is set at -7.5\n\nBOL!\n\n***POTD: CBB Auburn -4.5 -110 (2.50$ TO WIN 2.27$)***\n\n*Tips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox*\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\nVenmo: u/claysmiith\n\nPayPal: u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqg7a5o/"
    },
    {
      "created_utc": 1763943236.0,
      "author": "DrRippples",
      "text": "POTD Record: 1-1\n\nNet Units: +.082U\n\nLast pick: Hunter Henry over 39.5 ✅  \nCleared this EASILY - Henry ended with 115 yards receiving. Didn't even have to go to the second half to hit this one.\n\n[Henry Write UP](https://www.reddit.com/r/sportsbook/comments/1p49ox5/comment/nqacyzu/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nEvent: MNF Panthers @ 49ers\n\n**POTD: McMillan Over 4.5 Receptions (-164) 3U play**\n\nMcMillan over 4.5 is driven by how often Bryce Young actually throws his way. He’s pulling almost **27% of Bryce Young’s targets**, **which is a true WR1 workload. McMillan is averaging 4.9 catches per game, and the 49ers are allowing a whopping 6.4 receptions avg to WR1s.** When Carolina gets behind, their pass rate spikes, and he’s the guy Young looks for on all the quick, easy stuff that keeps drives alive. San Francisco gives up a ton of underneath completions to WR1s, so his role actually lines up perfectly with what works against them. With that kind of usage and matchup, five catches is basically just his standard night.\n\nBOL\n\nIf you like the picks, throw a tip my way: [buymeacoffee.com/drripples](http://buymeacoffee.com/drripples)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqg50j2/"
    },
    {
      "created_utc": 1763943164.0,
      "author": "dreamchasing1",
      "text": "Record: 227-215 Net Units: -27.97 48-51 on 1.5u plays, 37-39 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Poland Ekstraklasa] Lech Poznan vs Radomiak Radom\nLast pick: BTTS + Over 2.5 goals @ 1.95 - 1.5 Units win\n\n\nEvent: Soccer/Football, [Denmark Superliga] Randers vs Odense\n\n\nPick:  BTTS + Over 2.5 goals @ 1.95\n\n\nWith 26 scored 36 allowed in 15 games Odense are the best matchup in the league for this line, good odds here because of Randers who have been failing to hit this line lately, they still have hit this in good matchups such as vs Viborg twice and they hit vs Odense in the reverse matchup in a 3-2 loss, with not a lot changing between then and today's match. Odense on the other hand hit this line in big majority of their games including in 4/5 games vs the top 4 teams currently who also have the top defences.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqg4t84/"
    },
    {
      "created_utc": 1763943094.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 7-3 (Avg Odds +114)\n\n**Previous Pick:** Declan Rice 1+ SOT (+135) ✅️\n\n**Today's Event:** English Premier League | Man United vs Everton (12:00 PM PST)\n\n**Pick:** Iliman Ndiaye 1+ SOT (+105) 1 unit to win 1.05 units\n\n**Write Up:** Gotta love a sweat free cash. Rice came through for us less than 3 minutes into the game, couldn't have drawn it up any better myself. A great weekend all around - I very much appreciate all the love and hearing about the wins!  \n\nToday we head back north to Manchester. Where we have 10th place Man United hosting 13th place Everton. A win here for Everton puts them at 10th and a win for Man U puts them all the way up to 5th in the table. Man U has really turned a corner over the last 5 matches, unbeaten in that stretch and winning 3 of 5. Interestingly enough though, they've only kept 1 clean sheet all season (Sunderland), tend to give up a lot of shots, and don't hold possession very well. \n\nEverton are a mixed bag, going 2-1-2 over their last 5 and sitting precariously near the bottom of the table. Pretty much all of their attacking goes through their wingers, Grealish and Ndiaye. With Ndiaye taking more shots on his own and Grealish looking for passes. Ndiaye has started every EPL match for Everton this season and tends to get most of the game, although a late sub is not uncommon. Everton gets a lot of Friday/Monday matches so I've seen a good bit of their play this year, snd stats aside Ndiaye has been the brighr spot of this team, the kid can ball. \n\nStat wise, Ndiaye has hit at least 1 SOT in 5 of his last 6 EPL matches, he picked up a bit of a knock before the break so this did not hit in his last match. He's back to 100% and I expect him to pick up where he left off - I love this play at plus money and don't hate a sprinkle on ATGS as well. \n\nBOL if tailing, have a great Monday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqg4m06/"
    },
    {
      "created_utc": 1763942194.0,
      "author": "Moist_Incident_3085",
      "text": "Overall record 25W-12L\n\nUnits: +8.10 (All picks are 1 unit)\n\nLast pick: Ian Machado Garry by decision (-115) ✅\n\nWent pretty much as expected, Ian was able to defend every Belal takedown and keep the fight on the feet where he completely outclassed him and won by unanimous decision.\n\nToday's match: San Francisco 49ers vs Carolina Panthers (NFL)\n\nPick: 49ers -7 (-120, Fanatics)\n\nNow I know most primetime games have favored the underdog spread this year but I'm simply just not sold on the Panthers. Just two weeks ago their entire fanbase was ready to give up on Bryce Young after losing a crucial game to the Saints but then he just played the best game of his career vs the Falcons last Sunday and threw for 448 yards. I'm looking for him to come back down to earth this week and maybe its suddenly clicked for him but I am definitely not expecting anything near that in todays game.\n\nThe Panthers just simply don't look convincing to me on paper, they look like a team that is able to feed off the bottom of the league but as soon as they play anyone decent they start losing by wide margins. Their wins this year are against the Falcons (x2), Cowboys, Jets, Packers, and Dolphins. Now aside from the Packers all these teams that they've won against have negative records and sit near the bottom of their divisions, but even the Packers have not really been convincing this year outside of their win vs the Lions in week 1. The best teams the Panthers have played this year in their losses are the Patriots, Bills, and Jaguars and in those 3 games they lost by an average of 25.3 ppg. Riding with the 49ers at home coming off a convincing win vs the Cardinals last week with Brock Purdy back from injury. BOL and bet responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqg1zy8/"
    },
    {
      "created_utc": 1763940903.0,
      "author": "NVSBETS",
      "text": "POTD Record: 12-2\n\nNet Units: +9.78u ROI: 47.03%\n\nPrev POTD: Oliynykova -3.5g -110 ✅ +1u\n\nSport: Tennis Tournament: Maia Challenger Time: 9:30AM est\n\nPOTD: Jan Choinski ML -200 1u\n\nReasoning: Choinski is the better overall clay courter and being indoors is only going to amplify his game. Feldbausch doesn’t have an iota of indoors experience in comparison to Choinski. He also hasn’t played a single match in over 2 months since losing the finals in Biella; very odd but rust will be great for Choinski to expose.\n\nRide with the hottest capper in this subreddit and come see why they NVS🌟\n\n*If I’ve made you money and you want to tip*: [BMAC☕️](https://buymeacoffee.com/nvsbets) or [BTC](https://pastebin.com/0Lf0mHqu) [ETH](https://pastebin.com/D2QRi3Bx)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqfyasy/"
    },
    {
      "created_utc": 1763940728.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Monday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p51gu8/pick_of_the_day_112425_monday/nqfxtbp/"
    }
  ]
}