{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/9/26 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/",
  "target_date": "2026-01-09",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-09T13:48:05.444470+00:00",
  "comments": [
    {
      "created_utc": 1767965703.0,
      "author": "Sweet-Tooth_Jonez",
      "text": "**2W-0L-0P +1.86 units**\n\nLast pick: Utah Jazz +7 (-105)💰\n\n**Today's pick: NO/Wsh u242 (-110)**\n\n  \nWriteup: I use two models for totals, one predicts a total of 230.9 and another predicts 225, which gives us roughly 11 points and 17 points of value respectively. This was at 240.5 last night, so I can see this total continuing to rise, however 56% of tickets and 58% of the money are currently on the under so I wanted to lock in now just in case this is the best number. BOL!\n\nBackground: I leveraged the book “Statistical Sports Models in Excel” by Andrew Mack to build a few NBA and NFL models. Each day (or week for NFL), I pull in the latest results to update the models, then make selections mainly based on the delta between my models and the current spread and the % of tickets and money coming in on each side. One thing to note, these models don’t factor in specific players so I also manually consider things like injuries in decisions.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyld5e6/"
    },
    {
      "created_utc": 1767965258.0,
      "author": "Best_Accountant_5471",
      "text": "2026 record: 0-2 (-8.0 units)\n\n2025 record: 55-41 (+26.5 units)\n\nLast 10 (most recent on right):  ✅✅❌❌✅❌✅❌❌❌\n\nLast Pick: Paula Badosa 🇪🇸 U6.5 double faults vs Elena Rybakina 🇰🇿 ❌\n\nEvent: Spain La Liga + Cyprus Division 1 ⚽️\n\nPick of the Day: AEL Limassol vs Omonia Nicosia U11.5 corners + Takefusa Kubo 1+ tackle vs Getafe 5 units to win 4.2U @1.85 (Bet365)\n\nWrite-up: The less said the better, Badosa double faulted a whopping nine times in 17 games.\n\nForget everything I said before this is definitely the way forward. I’m begging for a win this time. Straight to the point with this write-up which I’m not going to overthink. Omonia Nicosia’s games have featured under 12 corners in their last 16 league matches and last 11 away games. This fixture at Omonia’s home ground has cleared the under in their last 15 H2H’s. If that isn’t evidence enough then I don’t know what is. Kubo has tackled in his last 10 matches, averaging 2.0 per game over this span. Nothing more to be added. BOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nylbu9k/"
    },
    {
      "created_utc": 1767964300.0,
      "author": "ControlRoyal1768",
      "text": "Record: 34-25-1 (+27.8u)\n\nLast 10:💰💰🅿️💰✖️💰💰✖️💰✖️\n\nLast POTD: 🏈 Miami +7.5 + Under 59.5 total points (-135) 💰\n\nWriteup: Well that was way too close. Thank you first and third quarters for being so low scoring.\n\nToday’s POTD: 🏈 Indiana -2.5 alt spread (-151).\n\nGame starts at 7:30pm EST. Bet 3.25u\n\nWriteup: Taking a point off the spread and going with Indiana to cover by 2.5 or more. If your book lets you, take them -3 for way better odds.\n\nThis is simply a bet of taking the better and healthier team. The Hoosiers are the top team in the country, sporting an absolute blowout against Alabama in their last game. In said game, Alabama only had 23 rushing yards. They are now getting an Oregon team with a ton of injuries that include their running backs Jordon Davidson and Noah Whittington. I expect them to have struggles having a balanced offense in this game, and it doesn’t help that Indiana has the #2 scoring defense in the league, only giving up 12 points per game. The Hoosiers also have the best redzone defense in the entire country, while Oregon ranks just inside the top 50 for their redzone offense.\n\nIn their last matchup, Indiana defeated Oregon 30–20. Oregon QB Dante Moore struggled in that game, throwing two interceptions and getting sacked six times.\n\nOn the flipside, Indiana quarterback Fernando Mendoza has been playing some incredible football and is absolutely deserving of his Heisman trophy. He has thrown for over 3100 passing yards this season with a touchdown to interception ratio of 36:6, and he boasts the number one EPA/play in the nation. He continues to build chemistry with his top receiver, Omar Cooper Jr., who has 12 receiving touchdowns on the year. This is noteworthy as Oregon’s defense ranks around the 100th spot in terms of defense against deep passes.\n\nIndiana has covered the spread in 9 of their last 13 games, which is quite impressive given the caliber of opponent they have been playing. I do not expect this to be a total runaway game, as Oregon is a different caliber of team compared to Alabama. However, I expect Indiana to show both efficiency and consistency throughout the game and once again show us why they’re the top team in the nation. They are better than Oregon in almost every facet of the game, and I expect the Hoosiers to win by at least a field goal.\n\nRemember to only bet what you can afford to lose, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyl92rc/"
    },
    {
      "created_utc": 1767962094.0,
      "author": "Seventh__Place",
      "text": "POTD RECORD: 6-1\n\nNet units: +4.146\n\nForm: ✅✅✅✅✅❌✅\n\nLast POTD: North Dakota State -9.5 -105 1U ✅\n\nToday’s POTD: **Sacred Heart U31.5 1H points (-111 FanDuel) 1U**\n\nEvent: CBB | Marist @ Sacred Heart (7 pm EST) | 🏀\n\n*Recap: Sweat-free cash. North Dakota State shot 53 percent, led by 20 at the half, and made UMKC look like a pick-up squad. Absolute brilliance from the Bison.*\n\nI'm going back to one of my favorite bets: a smothering defense that plays slow on offense. It's a style play. Sacred Heart (5-11) is a bad team that relies on the 3 ball, and Marist (9-6) is a tempo-control side with elite perimeter lockdown defense. I don't think Sacred Heart will break 30 in the first half. It didn't work two days ago with Northern Iowa against Belmont, but here's why it will work tonight. \n\nFirst, there's precedent. Marist has held five of its last seven opponents to 30 or fewer at the break, with Georgia Tech one of the teams that eclipsed the mark. In their last game, the Red Foxes held an Iona team averaging 80 points per game to just 22 in the first half. Marist is healthy and appears to be peaking defensively as it opens up conference play. For the season, Marist allows a scant 28.1 points in the first half, good for third in the nation. Tonight's bet would easily be a two-unit play if they were at home, where Marist allows just 23.4 first-half points. And just to underline things, KenPom ranks little ol' Marist 30th in defensive rating. \n\nOn paper, tonight's matchup plays into the heart of that defense: Marist builds a wall at the 3-point line, where they rank third in the nation by holding opponents to 25.6 percent shooting. Meanwhile, Sacred Heart ranks 31st in 3-pointers made (10.4) but only 294th in 3-point percentage. In other words, they're going to be jacking up shots. But if those shots aren't falling, Marist isn't going to surrender extra possessions. The Red Foxes are the better defensive rebounding unit. The only way I see Sacred Heart getting to 32 in the first half is if they solve the Red Foxes perimeter wall - or someone goes on an absolute tear, as happened with Jack Freaking Smiley in the Belmont game. Interestingly, both Marist and Sacred Heart play slow. They have identical pace (67.4) and rank 237th. I believe a methodical first half supports my thesis. \n\nGood luck and Godspeed!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyl37cz/"
    },
    {
      "created_utc": 1767960404.0,
      "author": "kumpirbb",
      "text": "2-1-1 +0,95 +32,66%\n\n(all bets are 1 unit, odds taken from Pinnacle)\n\nLast Pick: Dimitrov -2,5 games ❌\n\nLast 6: ✅✅🔵❌\n\n\n\nSport: Tennis 🎾\n\nEvent: WTA Brisbane\n\nMatch: Sabalenka vs Muchova\n\nPick: Muchova +4,5 games @ 2,14\n\n\n\nHonestly, don't understand the odds here. Yes, Sabalenka should be favorite to win this one without a doubt, but her and Muchova performances here definitely don't deserve such a line. These two played each other 4 times, Sabalenka won the first match 7-5 7-6 in 2019, and since Muchova has won all 3, each time in 3 sets. Sabalenka is world number 1 and Muchova in only number 20, but the difference is nowhere near that big. Muchova had injury problems her whole career and that heavily influenced her ranking and achievements, but has looked amazing recently. Definitely one of my favorites on Tour, capable of winning anyone with here variety and all court tennis. She surely has a cure for Sabalenka big game, same as she had one against Rybakina. In my eyes, this is pretty even match, I have put some money on Muchova ML as well, but when I saw this line I jumped on it.\n\n\n\n\n\nAny donations would be greatly appreciated:\n\n[https://buymeacoffee.com/kumpir](https://buymeacoffee.com/kumpir)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nykz50o/"
    },
    {
      "created_utc": 1767960329.0,
      "author": "Chandler_Bing1611",
      "text": "Record: 4-5 (1 Void)\n\nForm (recent first): LWLLWWLWL\n(Football 4-2, Cricket 0-3)\n\nLast pick:  Pakistan vs UAE - Total Match Sixes: Over 15.5\n\nLast pick was a while ago. I think they got like 13 in the whole match, really annoying.\n\n\nCricket | International Series| 12.30 GMT\nPick: Pakistan ML vs Sri Lanka 3U (-138)\n\nWrite Up: \n\nJust to note. I don't bet personally but I just like predicting sports so make of that what you will lol.\n\nI normally predict majority of picks correctly until I post in this sub and then its 50/50. \n\nBut anyways, Pakistan beat Sri Lanka comfortably just 2 days ago. I think they'll do the same again today. Sri Lanka have a really good team but imo Pakistan has a stronger one. Especially on slower pitches like these, I think Pakistan's batting order will do better.\n\nEdited cause I forgot to update the form tracker above.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nykyys8/"
    },
    {
      "created_utc": 1767957228.0,
      "author": "wes2211",
      "text": ">**Record:** 125-105\n>**Net Units:** +25.89 units\n\n>**Curling** | **Players' Championship** | **9:30AM EST**\n\n>**Pick:** Team Edin -1.5 @ 2.56\n\n>Team Edin play Team Xu in the final day of round robin play in Steinbach. Team Edin entered this event with a 33-20 season record, 11-1 against intermediate level teams. Team Xu were 32-27, 4-6 against intermediate level teams. Edin and Shuster play a similar style game and Xu's result against Shuster was a 7-4 loss.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyksbig/"
    },
    {
      "created_utc": 1767953039.0,
      "author": "this_guy9",
      "text": "**POTD Record:** 23-23\n\n**Net Units:** \\-2.44\n\nHeat game gets postponed because it's raining inside? So many voids lately. But good news, it's NBA Friday:\n\n**🏀 Derik Queen o8.5 Rebounds -108** vs the Washington Wizards\n\nIn the 4 games Queen has played without Saddiq Bey, he's averaged 9.3 rebounds vs the 7.0 with Bey in the same number of minutes.\n\nBey is out and Queen is set for a matchup against the Wizards. Wizards are not a great rebounding team. They rank 27th in the NBA in defensive rebounding. The Pelicans meanwhile rank 10th in offensive boards.\n\nQueen sees an average of 16.4 potential rebounds a game, 25% of them are offensive. Over his L5 and L10 games, he's averaging 9 rebounds a game, including cashing L4/6.\n\nTwo fast paced, poorly disciplined teams. Expecting sloppy play and extra rebounds.\n\nFull stats if you want to do additional research: [https://www.statpick.ai/25365771/derik-queen-rebounds](https://www.statpick.ai/25365771/derik-queen-rebounds)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nykkazo/"
    },
    {
      "created_utc": 1767951089.0,
      "author": "yungguardiola",
      "text": "**POTD Record**: 4-1-1 (+4.15u) [All 1 Unit Plays]\n\n**Event**: English FA Cup - Wrexham vs Nottingham Forest - 19:30 GMT+0\n\n**Pick**: Wrexham DNB @2.95\n\n**Write Up**: Wrexham have hit form at the perfect time for this match. They've lost just twice in 14 games and have turned it up a notch to take four wins in their last four in impressive goal scoring fashion. Something detractors of Phil Parkinson's playstyle wouldn't have seen coming. But this is the biggest game of the season for them. Perhaps of the whole Wrexham project. They've waited years to get a Premier League side in the draw and it's finally happened. With the perfect circumstances to actually progress. They're in great form, they're at home, Forest have been poor and a cup run may not be their most immediate of concerns. The 2-1 win against West Ham last weekend didn't do much to inspire Forest that they've turned a corner but maybe just enough to see of relegation. There doesn't seem to be much excitement or anticipation for the match from the Forest side and from fans online would like to see squad players given a run out. If that happens which is more than likely considering how consistent Forest's traditional starting XI has been (opportunity to give them a slight rest) then it creates an opportunity for Wrexham. While it may still have quality, players who are not exactly match sharp and playing with players they're not used to creates some disruption. I would look here to see the starting XI and adjust the bet accordingly if you're not a risk taker.\n\n**Additional Thoughts**: Last pick started off terribly due to some woeful defending for both Cremonese goals but thankfully clawed it back. Riskier one today but this is what betting is all about. The magic of the cup!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nykgrt9/"
    },
    {
      "created_utc": 1767950687.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 34-20-1\n\nSoccer\n\nLast Pick: PSG win & Arsenal to score @ 1.74 odds - LOSS ❌\n\nLast Pick Write Up: Neither of those picks hit, and so the streak is ended. \n\nNow for today..\n\nPick: MC Alger win @ 2.07 odds\n\nWrite Up: Let’s take a trip to Algeria. Chlef (14th place, 3W4D7L, 12:15) is hosting MC Alger (1st place, 11W2D1L). There are some things to worry about here - their last two H2H were draws, Chlef is at home and it was hard to find reliable information on which MC Alger players were away on AFCON. Even so, in the last 4 matches since AFCON started MC Alger has won 3 and had one draw. I just think the odds are worth it here, even with these factors this is still the top of the league team playing the 3rd lowest team. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nykg1um/"
    },
    {
      "created_utc": 1767946778.0,
      "author": "mmsportplays",
      "text": "**POTD Record:** 0-0 (0u)\n\n**Previous Pick:**   \n  \n**Event:** NBA: Rockets @ Trail Blazers 10pm EST\n\n**POTD:** Tari Eason O21.5 PR (-125), 1.25u to win 1u\n\n**Write Up:** The Blazers have two options: they will either double KD, or let him go for almost 40 once again. In the likely scenario that they double him, Eason benefits a lot. As is, he has taken at least 15 FG attempts in 3 straight without Sengun in the lineup, attempting 18 two days ago against these blazers. The volume is there, and with the fact that the blazers are not respecting him and should respect him even less when they double KD, the shots will be relatively easy to fall. Portland is giving the third most offensive rebounds which can turn into points for Eason, he racked up 6 last game and had one that turned into points called off to win the game. With 22 rebound opportunities last game and a soft matchup on both statistics, i trust Eason to come through, even more so with the added fuel of the game winner called off and his expressed anger towards the refs on wednesday.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyk8xcz/"
    },
    {
      "created_utc": 1767946434.0,
      "author": "UnusualYou6243",
      "text": "**POTD Record:** 7-4 / **Net Units:** +6.05 / **ROI:** 28.1%\n\n**Previous POTD:** LaMelo Ball O29.5pra @ -111 DraftKings / 2.3u 💰\n\n**Today’s POTD:** Michael Porter Jr. O35.5pra @ -114 FanDuel / 2.25u\n\n**Event:** NBA / Clippers @ Nets 7:40 pm EST\n\nBack to Porter as he stays hot and has cashed us both times. I still believe there is good value here. Have to say maybe I’ve become a little biased. I’ve favored watching the Nets recently as they are just a gritty team that likes to hustle and make plays for each other… think Pistons. Last game versus the magic was one of the lowest scoring games I’ve seen all season and Porter was straight up carrying. \n\nClippers have won some games recently but were torched by the Celtics, then beat the Knicks who are struggling. Clippers in their last three games:\n\n• ⁠28th in opponent points allowed\n\n• ⁠20th in opponent rebounds allowed\n\n• ⁠27th in opponent assists allowed\n\n• ⁠23rd in opponent steals per game (9) while Nets rank 4th in steals per game (11)\n\nOpposing teams are shooting 47.9% against them, while allowing an average of 41.7 3PA (26th), so the looks will be there for Porter.\n\nOver Porters last ten games he is averaging 26 points, 8 rebounds, and 3.5 assists, while toting a ridiculous 52% FG%, and 46.3% from deep. For him to be shooting that good putting up 18+ shots a night is crazy, especially when half of them are threes.\nHe has cashed this line 75% in his last eight and 61% this season. Vs bottom 50% defenses & playing 28+ minutes he is 10/11 on the season.\n\nNotable players against the Clippers in the last three games:\n\n• ⁠Jalen Brunson 36pra\n\n• ⁠Stephen Curry 37pra\n\n• ⁠Jaylen Brown 58pra\n\nBOL if tailing",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyk8ain/"
    },
    {
      "created_utc": 1767945478.0,
      "author": "donjavogosca",
      "text": "POTD Record: 37-21, +14.4u, (ROI +20.0%)\n\nPrevious Pick: Jusuf Nurkic to have 16 or more rebounds and assists, 1.98, 1u - push - DNP (last 5: ✅️❌️✅️❌️✅️)\n\nEvent: Turkey Cup Women: Fenerbahce W - Mersin W, 15:00h\n\nPOTD: Fenerbahce to win by 11 or more & Fenerbahce to score 88 or more, 1.85, 1.5u\n\nFenerbahce has 13-0 in the league and today they face Mersin in a Cup competition. It is a one game system, a semifinals, and I expect Fener to want this win, especially since they lost to Mersin last year and then won the finals too. They won as guests and by 21.\n\nWhat changed is Mersin team, they lost their best players Teaira McCowan to Fenerbahce, Bridget Carleton who went to USK Prague, Yvonne Anderson to Valencia, also Natascha Howard and Marine Johannes.\n\nThey got subs for this season, but not at that previous level when they had so many stars and played Euroleague finals and lost to Prague, they cut back significantly on expenses this year.\n\nI imagine Fenerbahce wants a revenge here. 3-4 point win is nothing for these ladies, they remember and they want 20+ win. Also in the league, fener scored 90+ in their last 5 games.\n\nEdit:\n\nAustralia WNBL: Bendigo W- Southside W postponed due to wild fires.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyk6ia8/"
    },
    {
      "created_utc": 1767944841.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 79 - 82 Profit: -6.81 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅❌❌️✅❌✅❌\n\nBarry Town vs Llaneli Town Over 3.5 goals @ 2.12\n\nThis matchup strongly favors goals. Barry attacking power and high pressing style usually lead to dominant performances, especially against weaker opposition. Llaneli tend to struggle defensively and often allow many chances. Barry are capable of scoring three or more goals on their own, and any contribution from the visitors only increases the value. With the game expected to be open and one-sided, over 3.5 goals looks like a solid and confident pick.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyk5axw/"
    },
    {
      "created_utc": 1767944266.0,
      "author": "JainaForLife",
      "text": "Record: 20-11 ✅✅✅✅❌❌✅❌ ❌✅✅✅✅✅❌✅✅✅❌✅❌✅✅✅❌❌✅✅❌❌✅\n\nLast bet: ✅\n\nNet Units: +20.75U  \nSport: Basketball  \nLeague: NCAAB  \nTime: 7:00PM EST\n\n**Yesterday's Pick:** Southern Miss -4.5 -110 vs. Texas State for 2 units✅ > I felt like the last 2 games I lost I deserved a win, but today the game I think I didn't deserve to win it cashes with an insane overtime performance. I ain't complaining but fuck me this sport is a rollercoaster; i'll take it I guess but that bet looked dead in the water for 42 minutes of that game.\n\n**Today’s Pick:** Iona -10.5 -110 vs. Niagara for 1 unit > Not many games on today, I think Niagara is just a bottom 10 team this year, and despite the fact that they don't turn the ball over, Iona's blistering pace at home is just going to make this Niagara team who plays at a bottom 10% pace super uncomfortable.  Niagara's defense gets worse the further you go out from the paint, and exceptionally terrible at defending the 3, something that Iona loves to do.  Iona is coming off maybe one of the most pathetic losses they've had in history, losing to Marist 38-83 shooting 1/14 from 3 and 24 turnovers.  If the coach didn't threaten these kids, their parents did.  I expect Iona to lock back in on their home floor, and play with energy of a team that just got clowned on.  Give me Iona to win this game by 25 points in a demanding, high energy fashion.  Model has them winning by 14.\n\nAlso gonna take the 1H -5.5 at -115.\n\nROI so far is 9.1%\n\nGL if tailing as always.\n\n[BMAC](https://buymeacoffee.com/theforecastcard)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyk47zw/"
    },
    {
      "created_utc": 1767941013.0,
      "author": "redditusernameuneak",
      "text": "Record: 7-5\n\nUnits: +8.99\n\nPrevious Pick: (WNBL) Perth Lynx (W) -17.5 ❌ game ended Capitals 77 - Lynx 74\n\nEvent: (NBL) Adelaide 36ers vs Tasmania JackJumpers\n\nPOTD: Adelaide 36ers -6.0 (1.91 on Bet365, 5 units for 4.55 units) ❌ game ended 36ers 72 - Jackjumpers 80\n\nWrite-Up: Adelaide (19-4) playing at home against Tasmania (11-13) who they have beaten twice already this season. The first on 9 October was at home, where they won 98-89. The second was on 13 November in Hobart, where they won 97-86. They have covered this spread handily both times, I think they can do it again tonight.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjxudu/"
    },
    {
      "created_utc": 1767940261.0,
      "author": "phenomenalray",
      "text": "\n\n**Record: 5-2 (+2.12U)**\n\nLast POTD: **South East -5 vs Illawara Hawks -115** (Win✅)\n\n**POTD: PBA (Philippines Basketball): Meralco Bolts vs TNT Tropang: TNT Tropang TT O94.5 (-114, 1.14U to Win 1U)**\n\nWrite up: After a sweaty Australian cash, we head over to the Philippines, backing another wagon of a TNT offense to get 95 points in their playoff matchup vs Meralco. This is a win-or-go-home situation for Meralco after losing its last two matchups 109-92 and 100-95, respectively.\n\nTNT has cleared this TT line in 9 of their last 10 matches, with the one miss being an 89-point game against the second-best team in the league. They come into this game as the 4th best offense in the league, averaging 102.2 points per game, shooting a league high 34.2 3PA, making 11 3s in the process. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjwaxi/"
    },
    {
      "created_utc": 1767939206.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 185-141\n\nSeason record: 22-18\n\nLast POTD: __Paolo Banchero O8.5 Rebs @1.71 1U__ ❌\n\nToday’s POTD: __Ivica Zubac O14.5 P @1.83 (Bet365) 1U__\n\nNBA | Nets v Clippers | 🏀  \n\nBad read, started good with 3 rebounds but Wizards just couldn’t miss and as a result Magic pulled their starters with 4 min left in the 3rd. We move \n\nNets defense has looked great this season and I’m expecting tons of pressure and blitzes on the primary ball handler, in this case Harden. Think this’ll be tough game for Harden to score, but also a good spot for Zubac who should benefit of the Nets blitzes with good looks in the paint due to the pressure. Harden and Zu have a great P&R chemistry and I think this’ll be a good matchup for him to have a good game here.\n\nJust dropped 22 on the Knicks which is a very tough matchup for bigs, now gets a softer matchup on paper against the Nets who’s top 9 in points allowed to centers this season. Hasn’t faced them this season but did have a 21 point game against them in their last meeting.\n\nWCJ 20, Sarr 19, Sengun 20 & Embiid 27 points, just a few of the centers they’ve matched up against recently..\n\nNets have allowed 4th most FGM from less than 10 ft, making it a great matchup for Zu once again as he’s taking 93.1% of his shots from less than 10 ft.\n\nOverall a great spot for him, looking like he’s back to his normal minutes again. Played 30 minutes last game and as I mentioned looked really good against the Knicks, should be in for 30+ once again with upside for more if the game stays competitive \n\n15.5 is fine, wouldn’t go higher than that tho",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyju392/"
    },
    {
      "created_utc": 1767939176.0,
      "author": "WeightShift",
      "text": "**POTD Record 137-1-73 | +78.59u**\n\n**Form:** LWLWLWLWLLWWWWWWWW\n\n**NBL: Breakers v Kings - Robert Baker under 10.5 Points 3U** $1.75 (TAB) 5:30PM AEDT\n\n  \nRobert Baker attempts more than half of his shots from beyond the arc. Sydney, whilst mid tier in defending 3's, allow the fewest attempts in the league by far. They allow the 2nd lowest PPG for opposing wings in the league per 40 minutes because they have long agile wings and good ball pressure chasing over screens and covering spot ups. \n\nRob Baker's defensive liabilities have been exposed recently and this has seen him slowly lose minutes to Carlin Davison. With Cooks out tonight, expect Kouat Noi and Jaylin Galloway to step up with bigger minutes. Noi especially, is offensively minded and will probably keep Baker on the bench in favour of Davison. \n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyju0yy/"
    },
    {
      "created_utc": 1767939157.0,
      "author": "NetLess2696",
      "text": "**Internet has been out so sorry for getting this out late**\n\n**Record: 4-2-1 (W-L-P)**\n\n**Net Units: 1.48**\n\n**Last Pick:** [Heat -5.5](https://www.reddit.com/r/sportsbook/comments/1q6tpe5/comment/nyc2wkd/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) \n\n**Ice Hockey | NHL | LA Kings @ Winnipeg Jets 8:00 PM EST**\n\n**Pick: LA Kings ML ( -130 ) 1 unit**\n\n**Last Pick Write Up:** Game is postponed, so bet is void, i won't take this line now that its no longer a back to back and who knows when/if this game is being played ( i haven't don't any reading ). Shame since the line moved from -5.5 to -7.\n\n**Write up:** Was debating on doing NHL or NBA for today, decided to go with the Kings ML. This Winnipeg team is bad although often times find themselves in close games. In their last 10 they have been with one goal 8 times and two goals 2 times ( I like taking the +1.5 spread although that is currently at -230 ). Although inconsistent, I like the Kings to come here to win after having a heartbreaker loss to the Sharks. The Kings are the better team here, its just a matter if they can convert.\n\nBOL and only bet what you can afford to lose",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjtzjs/"
    },
    {
      "created_utc": 1767937574.0,
      "author": "Maleficent-Coach4932",
      "text": "Record: 1-1\n\nLast Pick: Mark Fletcher Jr. over 9.5 receiving yards (-115) 4u ❌\n\nMy apologies everyone who tailed. Miami’s RB2 played phenomenal and took a lot of chances away. This loss is on me. Let’s get hot now\n\nToday’s Pick: Indiana vs Oregon/ Indiana ML (-178) 5u\n\nWrite up: Simple enough here. This is solid value for the best team in the country. I don’t hate the spread but I’m not playing any games w Vegas this time of year. I find it hard to believe Indiana loses this game here. Coming off last game where they flat out embarrassed Alabama I love their momentum. In order for Oregon to win this game their offense would need to be cutting edge. Last game proved that it can stall very quick against a good defense. Let’s try to bounce back after a dud I laid. My apologies again, let’s do this fellas",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjqkmd/"
    },
    {
      "created_utc": 1767937294.0,
      "author": "Money-Swimming2179",
      "text": "Record 7-0-3\nForm: ✅✅✅✅❌❌✅❌✅✅<-\n\nLast POTD: **Atl Madrid v Real Madrid: BTTS & o2.5 goals @1.85✅**\n\nTodays POTD: **Frankfurt v Dortmund: Dortmund DC & u4.5 goals @1.62**\n\nFrankfurt vs Dortmund should be a fairly controlled game rather than a crazy goal fest. Frankfurt have been a bit blunt going forward lately and are dealing with some attacking absences, which doesn’t help when you’re facing a Dortmund side that’s been pretty solid defensively. Dortmund don’t always blow teams away, but they're hard to beat, especially in games like this where they’re happy to stay compact and play smart. I like Dortmund double chance here because they should at least get something from this match, and with Frankfurt not exactly free-scoring, under 4.5 goals feels very safe. This has 1-1, 0-1, or 1-2 written all over it. Dortmund DC + Under 4.5 @ 1.62 looks like a nice, sensible play.  I know these odds are bad, but I really want to keep this run going.  If you are really willing to risk it, you can try the Dortmund DC & under 3.5 goals.  I feel that is likely also.  But let's play it safe just for today because I want to save some ammo for the weekend.\n\nBest of luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjpxva/"
    },
    {
      "created_utc": 1767936535.0,
      "author": "Next-Application-244",
      "text": "**POTD Record:** 3-1-0, Net ROI 62%\n\n**Previous Pick:** CBB - St, Francis @ Wagner, Wagner -7.5 = L\n\n**Event:** NCAAB - USC @ Minnesota\n\n**POTD:** USC +4.5\n\n**Write Up:** USC +4.5 is a strong play because the Trojans are finally moving back into their own weight class after a grueling stretch against top-tier Big Ten defenses like Michigan and Michigan State. While those blowout losses look bad on paper, they were against teams with elite physicality that most teams in the country can't match. Minnesota is a much more manageable opponent that lacks a true knockout punch on offense, averaging significantly fewer points per game than USC.\n\nThe matchup is particularly favorable for USC’s interior defense. The Gophers struggle to score consistently in the paint and aren't a high-volume threat from the perimeter, which plays right into the hands of a USC team that ranks near the top of the country in blocked shots. USC has the length and athleticism to force Minnesota into a slow, half-court game where every possession is a grind.\n\nStatistically, this game is projected by most models to be a one-possession affair, likely decided by three points or less. By taking USC at +4.5, you are getting a significant cushion that covers you even if the Trojans lose a close one. Eric Musselman is also historically excellent at getting his teams to bounce back after a loss.\n\nBOL if tailing!\n\n\\*All plays are 1U\\*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjo6v4/"
    },
    {
      "created_utc": 1767936244.0,
      "author": "Ralphjinasseater",
      "text": "Record: 27-22-2\n\nNet units: (+1.83 units)\nLast pick: Houston Rockets vs. Portland Trail Blazers — OVER 225 Total Points (-110)❌ \n\nPick of the Day: Desmond Bane “O”1.5 Made 3-Pointers\n\nReasoning:\n\nJoel Embiid is Questionable with left knee injury management, and Kelly Oubre Jr. is Out. Without their best rim protector and wing defender, Philly’s defense is forced to collapse, leaving the perimeter open.\nH2H Bane has hit this line in 67% of his recent matchups against Philly. In their most recent meetings, he exploded for 5 triples in one game and 2 in another.\n (Volume is King) Bane averages 2.7 makes per game this season. Even in a \"down\" stretch (hitting in 40% of his last 5), he is still seeing high-value looks as Orlando's primary floor spacer.\n\nScenario A: The \"Whistle-Happy\" Game (Referee Influence)\n Officials are calling fouls at a 20-year high this season (43 per game). Orlando leads the league in Free Throw Attempts (30.0 per game).\n \nImpact on Bane: Frequent whistles slow the game down into half-court sets. In these sets, Bane is the primary kick-out option when Banchero gets doubled.\n\n Outcome: Bane hits his 2 threes easily as Philly defenders are too scared to close out hard for fear of a whistle.\n\nScenario B: The \"Orlando Blowout\"\n Philly is \"gutted\" without Embiid and Oubre. Orlando recently hammered a short-handed Philly team 144-103. ,\n\nBane is still building chemistry with the Magic and usually stays in through the 3rd quarter even in blowouts. He scored 31 points in a recent double-digit win over Indiana.\n\nProp hits before the starters sit for the 4th.\n\nScenario C: The \"Maxey Takeover\"\n Tyrese Maxey (averaging a career-high 33 PPG) tries to carry the Sixers alone.\n\n  Impact on Bane: Orlando will have to keep scoring to keep pace. Maxey’s speed pushes the transition game, leading to more \"trail\" threes for Bane.\n\n Outcome: High-volume attempts lead to a clear Over.\n\nScenario D: Scenario D: The \"Bane Facilitator\" Role\n\n The Play: Bane focuses more on playmaking (averaging 4.5 APG).\n\n Impact on Bane: While his assists might go up, your data shows his 3PM average (2.7) is significantly higher than the 1.5 line.\n\n Outcome: Even if he’s passing more, he only needs two shots to fall to cash this",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjni5w/"
    },
    {
      "created_utc": 1767935989.0,
      "author": "EthicalGambler",
      "text": "#*I am tracking cappers who post in these threads and will continue to do so for the foreseeable future. [Here is the new document](https://www.potd.lol/today?utm_source=redditpost).*\n\n**My Record:** 78-65-3 (+15.37)\n\n**Today’s Pick:** Jalen Williams o1.5 steals (Grizzlies vs Thunder)\n\n**Odds:** +115\n\n\n**Units:** 1.0\n\nTip off is 5:10PM PST. I am returning to this system of J-Dub to record over 1 steals. In his previous 5 matches he is 3-0-0-2-0. This fits within our system as his longest drought, this season, without 3 steals is 3 games.\n\nShould this not hit tonight I will modify my units, based on the odds, and play it again vs the Heat on Sunday. \n\n**Previous Pick**: Cooper Flagg o0.5 Blocks (Mavericks vs Jazz)) ✅\n\n*Edit: spelling and added slight context.*\n\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/EthicalGambler-U6cnjV?utm_source=mdembed&utm_campaign=EthicalGambler) (since 09/01/25) to see how my previous systems have gone.***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjmvy0/"
    },
    {
      "created_utc": 1767935670.0,
      "author": "UserMSDGCRS",
      "text": "Record: 3-5\n\nStreak: 1L\n\nNet Units: -8.43\n\nLast Pick: Al Nassr ML (-190 DK) 5u to win 2.63u\n\nQuick write-up: Didn’t seem to be a bad pick in principle with Nassr dominating the game, but their goalie made an error which put them behind and they didn’t recover.\n\nEvent: Soccer AFCON Mali vs. Senegal (8:00 AM)\n\nPOTD (1/9/26): Sadio Mane to score or assist (+120 DK) 5u to win 6u\n\nWrite-Up: Senegal is my personal pick to win the entire tournament. Mane has scored or assisted in 3/4 games so far in the tournament, and in the one he didn’t, he had 6 shots on target and somehow didn’t score.\n\nWhile Mali has proven to be tough opponents, Morocco managed 15 shots and 4 on target against them earlier, so they are not invincible, and I think Senegal’s attack is even better.\n\nIf you want a less risky pick, go with Senegal ML, but I thought I would go riskier with the Mane play.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjm3y8/"
    },
    {
      "created_utc": 1767935597.0,
      "author": "YamalSzn",
      "text": "\nRecord 0-0\n\nEvent: Brisbane Roar vs Auckland FC\n\nPick: James McGarry 1+ shot (1.66)\n\nTime: 8am (2 hour 45 mins from posting)\n\nFirst time posting , \nReally like this spot , McGarry loves a shot having 4 in his last 5 games , he had 2 shots in his last match vs Melbourne and I expect this trend to continue, \nLet’s start off with a dub🤞🏻BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjlxn1/"
    },
    {
      "created_utc": 1767934953.0,
      "author": "Donloppa",
      "text": "Record: 20-11\n\nNet Units: +16.15 units\n\nPick: Tennis\n\nHubert Hurkacz vs Alex De Minaur \n\n Total Games OVER 23.5 Bet 365 -110 ✅️✅️\n\n1:00 am MST\n\n3 units to win 2.72 units.\n\nI have went back and forth about posting this and I finally decided I would post it as a POTD. \n\nI have enjoyed watching Hubi for quite some time. So I may be biased on this play, it may be a reason to not follow this one. \n\nThis is what I picture happening. Hubert comes out and surprises Alex in the first set. Maybe a 6-4 win, maybe a 7-6 I don't know. Next set Alex takes it in similar style as the first and than in the 3rd set they play their hearts out for the win. I hope Hubert wins but I am not playing either side, I am just hoping for a 3 set battle. \n\nEnjoy!\n\nIf you follow one of my picks and blame me for your loss, bad luck will follow you for eternity. \n\nFeel free to fade\n\nOr feel free to tip! [Buy me a beer](https://buymeacoffee.com/donloppa)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjkcek/"
    },
    {
      "created_utc": 1767932786.0,
      "author": "Section1ne0h4our",
      "text": "Record: 16-8, +7.06u\n\n*Last 5:* ❌✅✅✅❌\n\n**CFP - Indiana vs Oregon, 7:30 EST, ESPN**\n\n***Indiana -2.5 (-151) 1.5u***\n\nThe second of 5 straight football plays takes us to the other half of the college football playoff, as undefeated Indiana takes on Oregon in the Peach Bowl.\n\nWatching this line all week, seeing it drop from -165 to -150ish kinda scares me a bit, but it also gives me more value for a spread I was going to pick anyways. Word to Joe & Soggy, and much of the nation, *Indiana is the team everyone is leaning on*, but I can’t find myself to stray from the public - I’m just a bit of a pussy, and I’ll pay for the insurance.\n\nThere’s of course metrics and data and information we can dive into - but honestly, the simple and plain fact of the matter is **Indiana has already beaten Oregon this year, and made them look basic in the process**.\n\nYou can stop reading here if you want - unless you believe the old adage in college football that *”it’s difficult to beat a team twice”*\n\nFor me, when the stage is this big, I have to lean on what makes the most sense to lean on: similar to my thinking in the first college football playoff game (kinda didn’t work, disclaimer), **I think the more balanced team, with the stronger defensive unit, will win**.\n\n**Indiana are undefeated**, they’ve only **allowed more than 2 scores in 1 of their last 7 games**, they are the **number 2 overall defensive unit** in the country: they **rank in the top 3 in the country in yards against, rush yards against, scoring D & 3rd down D**.\n\nI shall not disregard the fact *Oregon have an elite level defensive unit themselves*, but Indiana have the offensive unit to match in spades: **7th in total offense, 3rd in scoring, the number 1 3rd down offense** - a lot of elite level ingredients to concoct successful playoff football.\n\nAdd to the fact that this feels like the Fernando Mendoza party - we are all just invited. The kid is a stud, and seems un-phased by the limelight. \n\nGive me Indiana by a FG minimum.\n\nLast play review:\n\n***CFP - Miami +7.5/Total u56.5 (-119) 1.5u*** ❌\n\n(Boy oh fucking boy, if that isn’t the definition of a turn, I don’t know what is - this seemed cruised for a W before 4 lead changes in the 4th quarter made it a god damn tightrope - all the what ifs to reflect over this one: Miami had 3 INTs ripe to grab, a compete and utter lack of big play containment, and the touchdown on Miami’s final drive of regulation to kill us - this one is a heartbreaker)\n\n***BOL if you’re tailing, and if not BOL in general.***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjemss/"
    },
    {
      "created_utc": 1767932096.0,
      "author": "RyanKreiner",
      "text": "Record: 2-1 +.54u\n\nLast Pick: Anthony Davis O11.5 rebounds 1.48u to win 1u (LOSS)\n\nGame: Indiana vs Oregon\n\nToday's Pick: O48.5 1.14u to win 1u\n\nTwo elite offenses, barely beat this number the first game. I think this game is a shootout.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjcpra/"
    },
    {
      "created_utc": 1767931735.0,
      "author": "planetICE",
      "text": "**Record:** 14-19-2  ||  **Net Units:** \\-6.38\n\nAvg. Odds: -147 / 1.68  ||  Avg. Units: 1.52\n\nLast Pick: Bills/Bills winner at halftime/final (excluding OT) ✅️ || 2u at -145  || NY Jets at Buffalo Bills\n\n**Today's Pick:** Rose ML || 1u at -156 on FD || Vinyl at Rose 7:30pm ET || 3v3 Unrivaled Basketball \n\nRose and Vinyl face off in the 2nd game of the season after seeing each other in the 2025 championship (Rose 62-54). Rose also won 2 out of 3 matchups in the 2025 season but there have been roster changes on both sides.\n\nRose retained 4 of their 6 with most notably Chelsea Gray returning. Rose didn't miss a beat in their first game winning 80-62 against a shorthanded (and maybe league worst) Lunars Owls. Gray had a 35 point game and fowards Azurá Stevens and Shakira Austin (new addition) stepped up enough with Reese leaving the team. Kahleah Copper was ruled out but believe she's expected to make her debut on Friday. \n\nVinyl continue to be led by Rhyne Howard and Dearica Hamby but struggled in the first game losing 58-42 against a solid veteran Laces team. Vinyl's explosive offense fueled their 2025 playoff run but they are still figuring it out. Losing 3 players (Ogunbowale, Boston, Canada) plus returning player Rae Burrell being out clearly impacted their opening performance. \n\nI think Rose continue off their momentum and win against Vinyl. Could keep an eye on injury updates for Copper or Burrell, but I think the Rose can keep their edge over Vinyl either way. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyjbp5s/"
    },
    {
      "created_utc": 1767931036.0,
      "author": "Turkey_Wrestler",
      "text": "**POTD Record:** 0 \n&nbsp;\n\n**Previous Pick:** Carolina Hurricanes ML (-222); didn’t meet POTD requirements\n&nbsp;\n\n**Net Units:** 0\n&nbsp;\n\n**ROI:**  0% \n&nbsp;\n\n**Sport | League | Event Time / Time Zone\nEvent:**  Hockey - NHL St. Louis Blues vs Utah Mammoth - 9:07 PM EST \n&nbsp;\n\n**Pick Of The Day:** Utah Mammoth ML -178 1U ( 1 unit wins 0.5882)\n&nbsp;\n\n&nbsp; \n\n**Write Up:** Thanks to @AMathTeacher for the help with clearing things up; while my Carolina pick hit, it didn‘t meet the rules of POTD.  Here’s my next pick: Utah Mammoth ML; The Mammoth are playing at home and are 4th in the Central division having won their last 2 games - they beat both the Sens (3-1) and the Rangers (3-2) and they sit just one point behind Kings for the second wild card spot; they will be playing hard to secure it. The St. Louis Blues on the other hand just suffered a 7 - 3 loss to the Blackhawks, are 7th in Central division and are on a 3 road game losing streak. While Utah isn’t a power house team by any stretch, I expect them to beat the Blues. Best of luck to those tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyj9pxi/"
    },
    {
      "created_utc": 1767930124.0,
      "author": "Synaptic_Snowfall",
      "text": "**POTD Record: 1-0**\n\n**Previous Pick: UNCW -4.5 ✅️**\n\n**Today's Event: WTA 500 Brisbane / M. Andreeva vs. M. Kostyuk / 3:30 AM EST**\n\n**Today's Pick: Total Games OVER 21.5 @ 1.83 (-120)**\n\nRecap:  Just as predicted, Northeastern was once again unable to close, and the Seahawks capitalized on the Huskies' chaotic defensive rhythm and pulled ahead quickly in the last minutes to comfortably cover the 4.5.  💰💲\n___\nMirra Andreeva is still trying to bounce back from a disappointing end to last season, and so far she's doing well.  Today she faces Marta Kostyuk who is on an impressive 4-match win streak on hard courts, coming off of a surprising upset of #3 Anisimova and determined to get into the top 10.  Andreeva is favored, but with Kostyuk being in impressive form and having high confidence after her defeat of Anisimova, I see the *possibility* of an upset, so I'm taking a different angle here.  Andreeva lately has had a tendency to get a very slow start, partly evidenced by the fact that her last 5 matches have all gone 3 sets.  I anticipate this will start as an intense, highly contested match.  Kostyuk will likely steal a set, but since there isn't much value in her set spread, and since betting over 2.5 sets carries a little extra risk, I'm instead opting for the third option and betting that we will see at least 22 total games.  This result will probably come by way of 3 sets (so no, I'm not opposed to betting over 2.5 sets at decent plus money), but the games total gives us the flexibility to also win with a potential 7-6/7-5, 6-3/6-4. \n\nNote: as a side bet, if you can find it:\n\nTotal balls hit aggressively by M. Andreeva into crowd or aimed at ball boy/ball girl OVER 0.5 is also a solid bet.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyj70kg/"
    },
    {
      "created_utc": 1767929569.0,
      "author": "criddler",
      "text": "Record: 9-6\n\nPick:: **Lukasz Bernacki ML** (+125) vs Krzysztof Hetnar\n\nTable Tennis // TT Elite Series // 4:10am GMT\n\nBit of a quick one here based on the odds as Bernacki coming off 3 wins with Hetnar losing 3 times today, Bernacki is playing far above his odds as I'm taking him all day as an underdog against a guy who has underperformed in his previous 4 games today. \n\nbest of luck",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyj5e2l/"
    },
    {
      "created_utc": 1767926814.0,
      "author": "Agitated-Ad3361",
      "text": "\n\nRecord: 3-3 (-1.02 units)\n\nPrevious pick: Aston Villa to win ❌ \n\nSoccer | Bundesliga 🇩🇪 | Eintracht Frankfurt vs Borussia Dortmund\nDate: 9 January 2026\nTime: 20:30 (Amsterdam time)\nPick: Julian Brandt 1+ Shot on Target\nStake: 2 units to win 4 units\n\nWrite Up:\n\nPrevious pick didn’t hit, so we reset and move on. Going with a player prop here.\n\nI’m backing Julian Brandt to get at least one shot on target. In his last four competitive games he’s averaging 2 shots per match, and he’s been consistently getting one on target. On top of that, he’s in great form lately, scoring 4 goals in his last 3 games, including two against Bodø/Glimt in the Champions League.\n\nHe’s also done damage against Frankfurt before, scoring against them in their last meeting in the DFB Pokal. Even though he’s listed as a midfielder, Brandt loves getting into scoring positions, arriving late in the box, and his involvement has clearly gone up recently.\n\nWhat I also like here is the matchup. In their last game, Frankfurt conceded a goal and allowed 3 shots on target from opposing midfielders, which lines up well with Brandt’s role and positioning.\n\nWe only need one on target, and at plus money this feels like a solid bounce-back spot with the stats backing it up.\n\nJulian Brandt 1+ Shot on Target\n2 units to win 4 units",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyix0d7/"
    },
    {
      "created_utc": 1767926740.0,
      "author": "ThatOneCinaGuy",
      "text": "**Record: 123-92-8**\n\n**Units Won: +10.82 (All Picks are 1U)**\n\n**Form:  ❌✅❌✅❌✅❌✅❌🅿️❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅✅✅✅❌✅✅✅✅❌✅❌✅✅✅✅❌✅🅿️✅✅✅✅✅✅❌❌✅❌❌❌❌✅✅✅✅✅✅✅✅❌✅✅✅✅❌✅✅✅✅❌❌❌✅❌❌✅✅✅❌❌❌✅❌❌❌🅿️❌✅✅❌✅❌❌✅❌✅✅❌❌❌✅✅✅❌🅿️❌❌🅿️❌✅✅❌✅❌❌❌✅✅✅✅✅✅❌❌✅✅❌✅❌❌✅✅❌✅✅🅿️✅❌❌❌❌✅❌✅❌✅✅❌❌✅❌✅❌❌🅿️✅❌✅✅✅✅✅❌❌❌❌✅❌✅🅿️✅❌✅✅❌✅❌❌❌✅✅❌✅✅✅❌✅❌✅✅❌✅❌✅✅❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌❌❌✅✅✅✅❌**\n\n**Last POTD:** Cremonese Vs Cagliari - **Cremonese or Draw (Double Chance)+Under 3.5 Total Goals @ 1.67 (Melbet) - LOST**\n\n**Football | Australia - A-League | 16:35 PM (GMT+8) - Starts in about 6 hours!**\n\n**Pick:** Brisbane Roar Vs Auckland FC - **Auckland FC Win or Draw (Double Chance)+Over 1.5 Total Goals @ 1.72 (Melbet)**\n\n**Write Up:** Brisbane Roar host Auckland FC in a match that looks more likely to produce goals than control. Both teams tend to play open football, and recent games suggest defensive discipline often takes a back seat once the match opens up.\n\nBrisbane Roar’s recent form highlights ongoing defensive problems. They have lost three of their last five league matches, conceding eight goals in those defeats. That run includes a heavy 3–0 home loss to Wellington Phoenix, who were down to 10 men, and a 2–1 defeat away at Macarthur. Even in tighter games, such as the 1–0 loss to Melbourne City, Brisbane struggled to apply sustained pressure once they went behind.\n\nAt home, Brisbane Roar’s issues have been even clearer. In two of their last three home games, they conceded three goals and failed to score in both losses. While their away win against Central Coast Mariners showed they can be dangerous on the counter, that style hasn’t translated well at home, where they’re expected to control the game instead. Over the season as a whole, Brisbane Roar have scored just 11 goals in 12 matches. Even though they’ve conceded a similar number, their lack of attacking balance often leaves them chasing games rather than dictating the tempo.\n\nAuckland FC come into this match with a stronger overall profile. They have won six of their 11 league games and scored 16 goals, showing they are more effective going forward. Recent away wins against Western Sydney Wanderers and Central Coast Mariners highlight their ability to handle pressure while still attacking with intent. Defensively, Auckland FC are not without their weaknesses. They conceded three goals at home to Newcastle Jets, and their 1–1 draw at Macarthur showed they can be exposed when teams attack them directly. Still, once games open up, Auckland often respond well and usually create enough chances to regain control.\n\nBrisbane Roar come into this match after another away defeat in the A-League, making it back-to-back league losses. Looking at their recent form, the over 1.5 goals line has landed in three of their last five matches, though that drops to two out of five at home. Despite this, Brisbane’s recent performances haven’t been very convincing, and it feels like Auckland FC could take advantage of that. Auckland, on the other hand, have seen over 1.5 goals in four of their last five games and have either won or drawn in four of those matches. They are also unbeaten in their last five away games, with the same over 1.5 goals trend continuing on the road.\n\nOverall, Auckland appear to be in much better shape in terms of form and momentum and could prove too strong for Brisbane. Their solid away form and sharper attacking play give them an edge against a Brisbane side that has struggled to assert itself at home. If Auckland take the lead, the match setup suits them, as they have the ability to stay on the front foot rather than sit back and defend.\n\n**NOTE: Please only stake what you can afford to lose; know that no picks are 100% guaranteed to hit. Stake Responsibly.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyiwruj/"
    },
    {
      "created_utc": 1767924993.0,
      "author": "Vander_chill",
      "text": "**POTD Record:**  105 – 68 - 11\n\n**Previous:**  NCAAF – Miami vs Ole Miss +3.5 - PENDING\n\n**New Event:**  NCAAF – Indiana vs Oregon\n\n**Pick:**  Indiana ML & Over 38.5 pts (Including OT) @ 1.91 (Usual 3 units)\n\nNot much to add to what already has been written on this matchup.  Both teams have top ranked offenses and defenses, but Indiana has just been a bit more impressive overall.  Statistically, Indiana ranks better in most categories as well.  They have been the best squad all year and I expect them to move on to the final.  So the moneyline part is not in question, it is about the points total.\n\nI’m expecting points from these two teams which has been the norm throughout the season.  The O/U is currently at 48.5, but we can tease it down by 10 points to get us to 38.5 and a -110 scenario when combined with the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyirbf0/"
    },
    {
      "created_utc": 1767924318.0,
      "author": "kab1218",
      "text": "PoTD 12-17-1\nLast 5: ❌ ❌❌✅✅\n\nNet: -17.5\n\nPrevious: Spain | Super Cup | 2pm Eastern | Real Madrid vs Atletico Madrid | BTTS & Over 2.5 goals\n\nWas thrilled to see a goal in the first 2’ and then laughed expecting that to be the only goal. Hit under 60’. We move on\n\nToday: England | FA Cup | 2:30pm Eastern | Preston vs Wigan | total goals Over 2 1U @ -140\n\nWrite up: checking out both Preston and Wigans home and away records, total goals, and recent performances, I see at least 2 being scored here, at worst we get a push, but I can definitely see a 2-1 scoreline here. Preston are top 4 in the Championship and Wigan are middling League One side. Debated taking the Preston ML here but there’s always the chance of heading to penalties here, so I’d rather just take the Over 2 total goals. BOL if tailing.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyip631/"
    },
    {
      "created_utc": 1767923934.0,
      "author": "Lyx97",
      "text": "Record: 27-14-5\n\nNet Units: +6.94\n\n*Prev Pick : Total Match Runs o314.5 + Total Over 2 goals (asian line) @ 2.137(1u) -> Loss*\n\nFootball | Indian Womens League | Gokulam, Kerala (w) vs East Bengal (w) | in \\~6hrs\n\nField Hockey | Hockey India League | Hyderabad Toofans vs Soorma | in \\~9.5hrs\n\nParlay : East Bengal Team Goals over 2 (Asian) + Total Match goal over 3 (asian) @ 1.88 (1u)\n\nWriteup: Unlucky with the BBL pick yesterday. Need to string some wins to get out of this 6-7u profit rut.\n\n1st Leg - East Bengal has scored 2 or more in 5/6 matches they have played, and have scored 9,5,5 goals in the last 3 matches. Their player quality is well above the rest of the field & should comfortably win here. However, Gokulam is pretty decent in defense, so going conservative & taking a 2 goal asian line for EB to score.\n\n2nd leg - THe HIL has started & most games have been pretty decent goal wise. Both these teams have seen their 2 games hit this mark. I expect the total to end at around 5 or so, but i really want to get out of this rut, so going conservative with a 3 goal asian line.\n\nHope we get the W & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyinz7s/"
    },
    {
      "created_utc": 1767923877.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 20-20-5 (Avg Odds +128)\n\n**Previous Pick:** Dominik Szoboszlai 1+ SOT (+110) ❌️\n\n**Today's Event:** England FA Cup (Soccer) | Wrexham vs Nottingham Forest (11:30AM PST)\n\n**Pick:** Taiwo Awoniyi ATGS (+195) 1 unit to win 1.95 units\n\n**Write Up:** That one hurt guys. 5 shots for Szoboszlai, including 2 free kicks, and he airmailed all of them. He had a great game too all around, and looked the most promising for Liverpool to score. I'm bordering fade territory with a couple unfortunate losses, might be best to limit your units or stay away for a few games. These plays are fun for me to back and gives me something to root for during the game, so we keep charging along. \n\nEPL goes on a bit of a break as the FA Cup comes to life this weekend. For those unfamiliar, the FA cup is a cup between pretty much ALL English professional teams, starting with over 700 teams. We are currently in the 3rd round with 64 teams, which is the first round that EPL and Championship teams join the matches. The FA cup is typically more prestigious than the EFL Cup, and the winning team earns an automatic berth in the Europa League next season. In these early rounds, you tend to see Premier League sides play a B team and lower division sides throw their all at the game to try and advance. \n\nFor this match Wrexham, aka Hollywood FC, (9th in 2nd tier) host Nottingham Forest (17th) place in the EPL. Forest are in a proper relegation battle this season, so coach Dyche is going to have to preserve his top players and hope that mostly subs can grab the win here. Worst case he will throw on the bigger names after halftime if it looks grim. Wrexham have played 4 matches since Christmas, but also have a week off after this match so I expect mostly their first team. \n\nTaiwo Awoniyi (Big T) is an easy player to root for. He is a big and powerful center forward who a high motor, great attitude, and works super hard. He has had a really tough go of it over the last year, facing a really serious head injury at the end of last season when he collided with a goalpost. He's had a slew of other injuries this year, but he's finally fit again. This game is a prime game for him to show what he can do and finally get a chance. \n\nThere is really no great data here to back up this play, because the sample size is so small. He scored a goal last season in the FA cup 4th round, but has otherwise struggled to find playing time. But with Wood out, and Kali out on loan, Big T will get his chance here as the team's 2nd striker (Igor Jesus needs a rest). I'm backing that a premier league striker can find the back of the net against a 2nd division back line. \n\nNo doubt this is a risky play, while I feel strongly that Big T will start, **lineups are always a risk in these cup games.** I personally am playing this now, as I expect the odds will go down once he is confirmed starting and lineups are out. But they'll still be plus money, so please do your own research and consider the risk. \n\nBOL and happy Friday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyinsxv/"
    },
    {
      "created_utc": 1767923514.0,
      "author": "r7465_",
      "text": "**POTD Record:** 0-0-0\n\n**Net Units:** 0\n\n**Event:** Africa Cup of Nations, Mali vs. Senegal\n\n**Pick:** Senegal win or extra time, under 3.5 goals 3u (1.36)\n\n**Write Up:** Senegal are unbeaten against Mali historically and haven't conceded more than 1 goal in any AFCON game so far. Senegal are a very organized, very sturdy team that plays as a unit, is top 10 in the world (in my opinion, FIFA ranks them #19) right now, doesn't concede many chances, and most importantly is consistent. Mali on the other hand keep games very quiet, they're okay-ish defensively, but are a team that's relatively inexperienced and capitulates at most challenges. It's not that they can't go through, but I trust Senegal to finish the job without scoring too many or conceding much.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyimo5d/"
    },
    {
      "created_utc": 1767920571.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 7-26-3 *It's going to be one of those streaks again, isn't it? Atletico played even better than I expected and overshadowed Real in pretty much every metric (22 shots to 8, 2.43 xG to 1.05, and 9 corners to 1), mental how they just couldn't get it done. And of course it wouldn't be my pick if Valverde didn't score a rocket from 30 odd metres in the second minute. That really just set the tone for the rest of the game. Also,* ***by surprisingly popular demand, I've set up a Buy Me A Coffee page,*** *linked at the bottom of the post, so you can tip me if I've helped you make some money with my (apparently) very fadeable picks. Tips would be greatly appreciated, but are absolutely not mandatory, no pressure y'all, this entertainment will remain free*\n\n**Last Five:** ❌✅❌❌❌\n\n**Event:** Scottish Championship, Ross County v Partick Thistle, 2:45 pm EST\n\n**POTD:** Ross County 0.0 Asian Handicap, +135, 1 unit\n\n**Write Up:** From the AFCON and the Spanish Super Cup in Saudi Arabia, the journey takes us to the good old second tier of Scottish football, where I've come across this very interesting matchup. We have the second placed Partick Thistle *(I could swear this team was called Patrick, immersion has just been ruined)* travelling to Ross County's ground. Ross County currently sit dead last on measly 13 points, in comparison to Partick's impressive 40.\n\n*The form, as well as H2H also favor the guests,* as Ross County are winless in over 5 league games and they've lost the last three H2H encounters, conceding 7 and scoring just 2 in the process. The home team boasts a terrible goal difference of -18, having scored at a rate of less than a goal per game (18 in 19), while conceding almost twice per game (36 in 19). On the other end, Partick aren't showing many cracks in their game, maintaining a positive goal difference with 33 goals scored and 23 conceded.\n\nSo, why on earth am I then backing Ross County if all the signs point to a Partick Thistle masterclass? Firstly, the **line just seems like a trap,** as at the time of writing, Partick's ML is sitting at +105 odds.  Surely the paper favorite in such a favorable matchup should have lower odds? Secondly, Ross County are **playing at home,** and I've observed that especially the UK teams tend to get a big morale boost on their own ground. I have already backed the team that was supposed to be the paper favorite in a similar kind of matchup before, **and they've almost always dropped points.** So, I'm not making the same mistake. Taking the Ross County 0.0 Asian Handicap at the beautiful +135 odds because I truly believe in a sneaky Ross County win, while a draw isn't disastrous. This is essentially a DNB pick, but for whatever reason, my book offers slightly higher odds on the 0.0 Asian Handicap. Make sure to check if that's the case in your book too. Going with just the one standard unit because, knowing my luck recently, Ross County are getting hammered 3-0 with all the goals coming after the 80th minute. BOL and let's enjoy another mad clash together ☘️🫡\n\n☘️ **Want to leave a tip?** [Click Here](https://buymeacoffee.com/sigmabale)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyidgnq/"
    },
    {
      "created_utc": 1767920370.0,
      "author": "major-couch-potato",
      "text": "Record: 172-139, +8.77 units\n\nLast Pick: Johannus Monday -2.5 games vs Tom Gentzsch (-138, 1 unit) ✅\n\nTennis | ATP Hong Kong | 7:10 AM EST (estimated)\n\nToday's Pick: Alexander Bublik vs Juncheng Shang | **Bublik ML at -163 (BET365). 1 unit.**\n\nWrite-up: Easy win for Monday, as he seemed to be a level above Gentzsch in that one. That brings me to 4-1, +2.54 units in 2026, and I'm looking to continue my strong form with this pick!\n\nAlexander Bublik comes in to Hong Kong ready to make an impact after an up-and-down 2025 that saw him capture four ATP titles but also win three games in a BO5 match (to be fair, it was against Jannik Sinner). He already got off to a good start against Botic, winning in just under an hour with an 8.36 performance rating, while Shang took down Sonego (7.57) and Comesaña (7.37). The market has been trending towards Shang, as Bublik opened at -200 before dropping to this price, and I completely understand why. Shang is a talented but injury-prone lefty who finally seems to be healthy again, has the crowd behind him, and has a 2-1 H2H advantage in this matchup. However, there's also a pretty simple case for Bublik: he's the better overall player, and his serve does so much damage on these courts. Shang is certainly a crafty player who demands patience in rallies, but Bublik has started to show a willingness to not bail out early with a drop-shot or slap forehand. The two matches where Shang beat Bublik came in late 2024, a low point in Bublik's career where he didn't seem to enjoy being on court, and yet Bublik was still able to keep those matches quite competitive (with one going to five sets). This is a big step up in competition for Shang, and I see Bublik coming through here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyicudi/"
    },
    {
      "created_utc": 1767920068.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 17-18 (-1.36u)\nJanuary Record 2-4 (-3.38u)\n\nThursday’s Pick - New York Islanders ML +104 (1u to win 1.04u)\n\nFriday’s Pick - St. Louis Blues vs Utah Mammoth o5.5 goals -115 (1.15u to win 1u)\n\nI’m a Blues fan. They are awful, especially defensively. The Mammoth might score 5 by themselves. Only the Anaheim Ducks have given up more goals this year. Hofer will be in goal, who has been better than Binnington, but the defense is so bad it’s hard to trust anyone in net.\n\nOn the other side, Vejmelka has started 4 games in a row, so it seems possible that they go to the backup Vanecek in this one. He’s only got 2 wins in net this year with a .879 save percentage and 2.92 GAA.\n\nGood Luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyibwfi/"
    },
    {
      "created_utc": 1767919977.0,
      "author": "dreamchasing1",
      "text": "Record: 252-235 Net Units: -23.51 59-61 on 1.5u plays, 43-41 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Italy Serie A] Milan vs Genoa\nLast pick: Asian total cards over 3.5 @ 1.85 - 1.5 Units won\n\n\nEvent: Soccer/Football, [AFCON] Mali vs Senegal\n\n\nPick: Both teams to receive 2+ cards @ 1.83\n\n\nBoth sides covered this line in the playoffs, Senegal with 2 for them and 2 for Sudan, Mali with 4 for them, 5 for Tunisia in their playoff match. In the group stage, Mali covered this vs Comoros, had 8 vs Morocco, and 1 vs Zambia. Senegal covered vs Benin in the group stage and were carded in every other game. Higher stakes should see the cards here again. Referee for this game is great for giving cards, he gave out 9 in the Mali vs Tunisia game and 6 in DR Congo vs Benin.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyibm3e/"
    },
    {
      "created_utc": 1767919176.0,
      "author": "bstilled_",
      "text": "**Record:** 3-0    \n**Net Units:** +2.05       \n**Last Pick:** ELLIPSIS - Win   \n**Australia Horse Racing, Launceston race 1 (6:08PM AEDT)** 6.5 hours from now    \n**Pick:**  1. ARISTOPOLOS $1.55         \n**Write Up:** Our pick today ARISTOPOLOS returns to the races after a month and looks primed to win again in similar fashion to his debut. We come up against a few horses from that debut race and it’s hard to see them turning the tables on our pick despite the small weight swing.    \n    \nIn that debut run, we drew barrier 1 (like we do here), but instead of using that to advantage, we stepped slowly and ended up 7/8 in the run. Despite this, we still won running away by over 2 lengths, running the fastest last 200m split of the race by a fair bit.     \n    \nTrainer has indicated that the desire is to lead this race, or at very worst be 2nd/3rd in run, which would be ideal as there’s nothing in this race that could match our last 400/200 split. Natural development and 2nd race start will help all horses, but I don’t think any horse from the debut race can reverse that result regardless, and the first starters haven’t shown much.    \n\nOdds aren’t flash here sorry. I have a couple other picks but with the heat in Aus so high I went with the safest pick in TAS. If anyone is interested in my other picks flick me a dm and I’d be happy to share",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyi90ye/"
    },
    {
      "created_utc": 1767918634.0,
      "author": "vanillaturtle",
      "text": "Record: 1-1-0 (W-L-P)\n\nProfit: -0.67U; ROI: -16.8%\n\n\\---------------------\n\n**Last Pick:** **Juncheng Shang ML** \\[2U to win 1.33u (-150)\\] **Win**\n\n**Today's Pick:**\n\n**Tennis - ATP Hong Kong - Rublev ML** \\[2U to win 1.05U (-190)\\]\n\nTime: 1:40 AM EST\n\n \n\nReasoning:\n\n2-0 H2H record, Rublev is a player with a big first serve and big forehand that's been around the top 20 for a long time. He's mentally weak in big moments - however he's just starting his season off in a small ATP 250 so shouldn't be any nerves, and beat Yibing Wu who's in good form recently (beat Medvedev, Korda late last season) and beat marozsan in straight sets. He beat Yibing Wu 6-2 and 6-1 last couple sets after dropping the first which is a steamroll, and indicates he found his groove at the end of the match.\n\n \n\nBorges is an all-around solid player, but his mobility is mid so he is prone to being hit through. His power is decent but not great - good fundamentals but no big weapons. He's playing decently right now having beat Cilic (big server, old, no mobility) and Dzumhur (short clay specialist, good mobility 0 power). I think Rublev's power will be too much for him here, as has been historically with their record. Don't see borges winning this unless Rublev completely doesn't show up or gets injured. I would give Rublev an \\~80% chance of winning this, so this line is good value. I actually got it at -220 when it first came out so getting worse odds than what you guys can get.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyi794b/"
    },
    {
      "created_utc": 1767918381.0,
      "author": "CMDVN",
      "text": "Al-Taawoun @ 1.94 - €300.00\n\nLast 5 > LWLWW // Profit: €1,879.00\n\n3rd vs 15th\n\nTaawoun 5th best home team 4-1-1 record vs Shabab 15th as away team 0-3-3 with 5-3-2 H2H for Taawoun and Shabab lost 2 players due to red previous game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyi6fkc/"
    },
    {
      "created_utc": 1767917931.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 33-22 (+7.02U)**\n\n**ROI: +10.17%**\n\nLast POTD: NCAAF 2 Pick Parlay: Miami ML + Over 36.5 Total Points -130 (1U TO WIN 0.70U)✅\n\n**POTD: NCAAF: Indiana -3.5 vs. Oregon -115 (1U TO WIN 0.85U)**\n\nWrite up: Miami Miami Miami and let's see some points tonight - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Indiana winning by 6+ points\n\n• Model projects that 80% chance Indiana ML \n\n• EV better betting 100$ = 10-11$ for this play\n\n• You just have to keep betting the red-hot Hoosiers - both teams had GREAT games in the first round, so I expect another great one here - Indiana and Oregon have already faced off once this year, with the Hoosiers finishing on top, 30-20. Indiana defense is legit, they average about 11 PPG on the defensive end, which is top 3 nationally - they get turnovers, they get after QB's, they are, in my opinion, the most complete defensive team in college football this year - On the offensive side of things, Mendoza is a dog - over 3,000 yards passing, over 35+ touchdowns, and their offense averages 41.6 PPG - Even though Oregon also has a great defense, I believe Indiana is more efficient and takes care of the ball here - Not to mention, Oregon's RB room is running low, especially after the injury to Davison last game - Indiana has a slight edge in this rematch, they are one of, if not the hottest team in college football - Give me the Hoosiers -3.5\n\nPOTD History: [https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn](https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn)\n\nBOL!\n\n**POTD: NCAAF: Indiana -3.5 vs. Oregon -115 (1U TO WIN 0.85U)**\n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyi4yt2/"
    },
    {
      "created_utc": 1767917928.0,
      "author": "Wekken",
      "text": "**Record: 1-6**\n\n**Football Record: 4-13**\n\n**Basketball Record: 0-1**\n\n**POTD Units: -11.16**\n\n**Total Units: -16.71**\n\n**Last 5** ❌️❌️❌️❌️ ❌️\n\n**Sport:** Football\n\n**Match:** Getafe vs Real Sociedad (21:00 CET) & Wrexham vs Nottingham Forest (20:30 CET) \n\n**Pick:** Getafe 1X & Wrexham o0.5 goals \n\n**Unit stake:** 3U \n\n**Odds:** 2.21 \n\n**To win:** 3.63 \n\n**Recap:**\n\nI would never have guessed starting 2026 this bad. 5 losses in a row on POTD is not great and the average Football record isn’t doing me many favors either. Might become the meme of the year, if that is the case then I’d love to be your entertainment.\n\nI am starting to believe the curse of 2026 is real. If you read this, be prepared to fade me. I have a lot of faith in turning this around but for now as long as the streak is like this, best thing to do is not listen to me.\n\nAl Nassr failed us once again. Might be better to fade the ones making us lose. Lesson learned (or not?)\n\n**Write Up:**\n\n3U bets are not looking good but I am a lot of things and stubborn is one of it. Let’s try again.\n\nThis one might be a bit riskier but maybe that is the key to breaking this terrible streak.\n\nGetafe are a menace at home. In 8 games they’ve scored 7 goals and conceded 6. Low scoring affairs are their thing and Real Sociedad with a 1-4-4 away record scoring only 9 in 9 away games are bound to walk into another disappointment.\n\nOver in England we have an FA cup game between Wrexham and Nottingham Forest. Wrexham have scored in all their home games this season and Nottingham have conceded 17 in 11 games this season away from home.\n\nAll I am asking for is 1 goal and Getafe to do their thing. Is that too much? It probably is.\n\nFade or tail, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyi4yft/"
    },
    {
      "created_utc": 1767917801.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 70-34-1 (+79.0u)\n\n__Previous Pick:__ [✅ Mark Fletcher o88.5 rush yards (-115), 3.53u](https://www.reddit.com/r/sportsbook/s/U4OBmxB9Oy)\n\n__Event:__ NCAAF: Indiana vs Oregon 7:30pm EST\n\n__POTD:__ Indiana -3 (-125), 3.75u to win 3u (*bought .5 pt*)\n\n__Write Up:__ This Semifinals matchup is a rematch from earlier this season, where Indiana won 30-20 in Oregon as an underdog. Indiana coach Curt Cignetti came into Indiana & completely changed the program. In the 3 years before Cignetti’s arrival Indiana had a 9-27 record. Since his hiring he has led Indiana to its only two 10 win seasons in school history, with a 25-2 record in 2 seasons, & they are currently undefeated playing for the national title. Cignetti was a former Nick Saban assistant so it makes sense how he has the blueprint for success. Interestingly, all 4 head coaches left in the playoffs were at one point on Saban's staff. That includes Oregon coach Dan Lanning who also has only lost 2 games in the past 2 seasons & is coming off a 23-0 win over #4 Texas Tech. Despite a 23-0 win, Oregon didn’t look great as they had a net success rate just above 5%. Lanning attempted 8 4th down conversions, converting just 4 & went 4 for 19 on 3rd downs. TT’s offense also isn’t as strong as its 39.4 ppg suggests, ranking just 41st in offense FEI. Now Oregon looks to get revenge after their previous loss vs Indiana, which was a slugfest. \n\nIndiana’s defense stole the show in the 1st game, holding Oregon to just 13 offensive points. Oregon’s offense had just a 39.7% success rate. Oregon QB Dante Moore was sacked 6 times, the 3rd most sacks taken by an Oregon QB since 2014. He was pressured a massive 20 times. Indiana’s 50% pressure rate was the highest rate Oregon had allowed since 2020. But Moore is getting the ball out much faster in the 2nd half of the season. He went from averaging 2.8 seconds throw time down to around 2.3. But that hasn’t helped much as he has thrown 3 INTs in the playoffs, including a 0-1 TD-INT ratio vs TT. He’s had at least 1 TO worthy play in 5 of his last 6 games. Indiana ranks #1 in the nation in TO margin (+18). Moore has also struggled in the red zone, owning negative EPA when passing inside the 20. Oregon ranks just 47th in TD rate in the red zone. Indiana ranks No. 1 in TD rate allowed (26%). Oregon’s biggest success in the red zone has come from RB Jordon Davison, who is tied for 13th in rushing TDs nationally. Davison averaged 7.4 ypc vs Indiana in Week 7. But he has been ruled out with a broken clavicle. Oregon also just lost RB Jayden Limar to the portal. This is a major concern for Oregon’s offense since they run the 3rd most 2RB packages in the country. OC Will Stein runs a Sean McVay inspired offense utilizing 2RB’s/2TE’s. When these teams first met 52% of Oregon’s plays were in those formations, but that rate has jumped to 65% recently. Indiana allows just 3.4 yards per run (18th) vs 2RB/2TE formations. 48% of the Oregon’s carries go to the outside, they avg 6.6 yards/run. Indiana allows just 2.6 yards/carry (3rd nationally) against outside zone concepts, with the highest stuff rate and the most TFLs. Another issue with Davison being out is he ranks #2 among Big Ten RBs by PFF on pass blocking snaps, which will be tough to replace. It’s unlikely they pressure Moore 20 times again, but Indiana does currently rank 13th in pressure rate generated. However this is a new-look defensive front for Indiana since Week 7. Indiana will be without edge rusher Stephen Daley, who was injured in the Big Ten title. Because of this they primarily went with a 3 DL look vs Bama. Oregon has averaged 5.8 ypc vs 3 DL (7th) but that number is skewed by weak defenses in James Madison, USC, & Minnesota. Texas Tech has a much more similar DL to Indiana & used 3 DL sets 17 times. They held Oregon to just 2.4 ypc & a negative EPA/play. In their last matchup Indiana went to 3 DL sets just 6 times, holding Oregon to -2.0 ypc. Indiana’s defense will look much different this time around, but their offense will as well.\n\nIndiana’s offense has been elite this season. Heisman QB Fernando Mendoza has led their offense to rank #1 in EPA/Play. They’ve lost just 8 turnovers (3rd), they rank 1st in 3rd down conversion rate (56.5%), & they’ve scored on 91.2% of their red zone possessions (17th). Ranking 8th in net drive starting field possession, every drive starts off on the right foot. Mendoza has been the most consistent QB in football. He has not been sacked nor turned the ball over on first down through 14 games. Mendoza ranks top 5 in throws of 20+ yards & leads the nation with a 13% explosion rate. Against passes of 20+ air yards, Oregon ranks 86th in EPA/play allowed & 95th in completion percentage (39.3%), without a single INT of 20+ yards. Mendoza’s depth of target has increased over the last several weeks with the emergence of Charlie Becker. Before Week 11, Becker had 8 career targets. Since then Becker is the #2 PFF graded WR with 21 catches for 399 yards, & 2 TDs. He has destroyed man coverage. Oregon runs man coverage at the 12th highest rate in the NCAA. Becker ranks 3rd in yards per route run (4.7) vs man. He has a contested catch rate of 83% (12th in NCAA). Since Becker’s breakout Indiana ranks 6th in yards per pass (11.2) & 10th in success rate (52.6%) vs man, including 2 great defenses in Bama & Ohio St who ran man on 59% of plays. Since the first matchup between these teams, Indiana has dropped back against man the 13th most times in the nation & has allowed just a 31.7% pressure rate. Indiana relies heavily on quick dropbacks & Mendoza’s ability to get the ball out quickly helps avoid pressure. Indiana uses quick dropbacks 47% of plays (20th most). When forced into traditional dropbacks Mendoza has been even more elite, averaging 12.1 yards per pass (2nd). Another factor will be Mendoza vs blitzes. Oregon ranks 31st in total blitzes & has blitzed 27 times this playoffs. Last game vs Bama, Mendoza went 9/10 for 167 yards, 3 TDs, 0 INTs, & 27 rushing yards vs the blitz. The pass success & recent emergence of Becker has made the offense more vertical, which has opened up the run. Indiana ran on 71% of snaps vs Alabama. Oregon who has stopped opposing RB’s for zero/negative yards just 15% of plays (88th). This happened in the first game as 8 of Indiana’s 11 carries gained 3+ yards. Indiana has also been incredibly disciplined this year. They committed just 50 penalties this year (8th), with 11 on defense (1st). They’ve only lost 380 yards to penalties. They’re the only team left in the playoffs with a positive Total EPA via penalties (9.21). Oregon has 71 penalties giving up 703 yards. They rank last in Total EPA via penalties at -30.19 of the remaining teams.\n\nIndiana is going to play steady efficient ball. But the difference will be in the redzone, where Indiana has shined & Oregon has struggled.\n\n__Indiana -3__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial)  [PayPal](https://paypal.me/joeinglesofficial)  [Bitcoin](https://pastebin.com/raw/GEXAsA2S)  [Cashapp](https://cash.app/$KaneZippy)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyi4jby/"
    },
    {
      "created_utc": 1767917333.0,
      "author": "damagebabee",
      "text": "**POTD** Record 129-03-101\n\n\n\nGETAFE VS REAL SOCIEDAD\n\nDate: 09 JANUARY 2026 at 21:00\n\nBET ON: Over / Under- Over +1.50\n\nOdd: 1.68\n\n\n\n\\- In their pre-match press conferences, both coaches revealed tactical insights that suggest an open game with goals likely on the horizon. Pellegrino Matarazzo, Real Sociedad's new head coach, emphasized the need for aggressive ball recovery and a high pressing game, noting that his team has struggled with creativity in the final third this season. Following a positive performance in his debut against Atlético Madrid, Matarazzo's setup with a 4-4-2 formation and vertical attacking play has shown signs of rejuvenating the team's offense, particularly through Oyarzabal and Méndez linking up with Kubo and Guedes. The coach acknowledged that Sociedad's games tend to open up after halftime, making it more likely to see goals in the latter stages. On the other hand, José Bordalás of Getafe is facing a defensive crisis, with key absentees like Djené, Duarte, and Abqar, leaving the team with no natural center-backs for the match. Bordalás, known for his disciplined defensive approach, has expressed concern over the lack of defensive solidity, admitting that his team might struggle to maintain their usual compact shape. With Getafe likely to sit deeper and look for counterattacks, Bordalás's side will have limited ability to resist Sociedad's intense attacking play. Given the injury-hit Getafe squad and Matarazzo's pressing game, goals seem inevitable, especially as Getafe's defense is weakened, and Sociedad will look to exploit the spaces left open. All signs point to a match that will likely see over 1.5 goals, with both teams adapting to their respective tactical needs but struggling to prevent goals.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyi303t/"
    },
    {
      "created_utc": 1767916824.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q7sivf/pick_of_the_day_1926_friday/nyi1cw7/"
    }
  ]
}