{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/6/25 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/",
  "target_date": "2025-11-06",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-06T11:23:54.902940+00:00",
  "comments": [
    {
      "created_utc": 1762424610.0,
      "author": "Emergency_Emu_891",
      "text": "Record: 3-0, +4.37u\n\nLast pick: Cade Cunningham o33.5 PA v UTA, Kentavious Caldwell-Pope u12.5 pts v HOU at -160, Win\n\nDidn't watch either of these games but sorta followed along with the box score, Cade started really slowly but kicked it into full gear in the second half as he became the go to guy for DET as they needed to pull away from UTA, ends up finishing with 31 pts and 10 ast to easily clear our alt line. KCP did even worse than I thought he would, playing only 24 minutes and going a laughable 1-8 from the floor to finish with 4 points. Cade made us sweat a little, but at the end of the day, we clear both lines with plenty of room to spare.\n\nToday's pick: Devin Booker o29.5 PA v LAC, Brock Bowers o4.5 rec v DEN, -147 on DK at time of writeup, betting 3u\n\nBooker is over this line in 7/8 games this year, the only miss coming in a blowout loss to LAC, a game with completely different circumstances. LAC was favored by 10.5 points, now in this game, PHX is favored by 2.5 points, playing at home against LAC who is missing Kawhi Leonard and James Harden. The game total for this one is 224.5, last time 223.5. PHX is missing Dillon Brooks, while Jalen Green is probable. Jalen Green hasn't played all year - I can't imagine him taking so many points/shot attempts from Booker. Maybe the fact that LAC has no film on how Booker/Green play together will give a couple opportunities for them to assist on each other scoring. LAC gives up the 9th most points and 3rd most 3s to point guards, as well as the 5th most assists. Since Harden is out, Kris Dunn may see slightly more minutes. He's averaged about half the game in playing time, and I can't see him playing anymore than like 2/3 of the game, especially with CP3 being a capable backup PG (and no defensive threat to Booker). I thought about taking just the points line at over 24.5, but I'll diversify a little in case Dunn does well to turn Booker into a passer, also LAC fouls at the lowest rate in the league, which might take away some of the FT attempts Booker gets plenty of. A star player who's on playing in a favorable game script against a vulnerable opponent at pretty good odds? I'll happily as this to today's ticket.\n\nI hate betting on bad teams to do anything, but Bowers is clearly on the upswing right now, and the particulars of the matchup are encouraging. Obviously Jakobi Meyers is gone, so more targets will go around. Another commentor, IndianBettor19, noted that DEN plays a lot of man coverage, and Bowers is significantly better against man than zone. DEN remains without Pat Surtain, so they can't just throw Surtain on an island and double Bowers every play. Last week, Bowers had 12 receptions for 127 yards against a decent JAX defense. Even if DEN can limit Bowers running after the catch, it's pretty clear that LV finally figured out that throwing the ball to Bowers is a good idea. This is why I am taking the receptions line instead of the yards line. Geno gets sacked at a bottom 25% rate in the league, and DEN leads the league in sack rate by a lot, so I expect LV to dial up a bunch of plays where Geno will pass the ball quickly to Bowers who's open on a fast route and LV hopes he can get some YAC in a man to man advantage over the defense. LV will be probably losing for most of this game, so a favorable gamescript of LV continuing to pass (and pass quickly so Geno doesn't get sacked every play), a schematic advantage favoring Bowers, and Bowers being really good at football is why I'm on him to get at least 5 catches tonight. Always scary betting on a bad team, but with only one NBA game, this is where I'm most confident for leg 2 of our alt line parlay.\n\nLet's get our 4th consecutive win!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nne9acm/"
    },
    {
      "created_utc": 1762423223.0,
      "author": "Vet100",
      "text": "Record: 12-4 \n\nUnits: +7.3U\n\nTotal Staked: 16U Total Returned: 23.4U \n\nPick: NBA Clippers v Suns\n\n1U John Collins 5+ 1Q Points @ $3.00 (+200 American), B365 \n\nWrite-Up: Collins is 1/7 (1x 6, 1x 4 point game) on this line this year as a bench player averaging only 4.4 minutes in a 1st quarter. Tomorrow he gets this line as a probable starter without Kawhi or Harden taking 30+ shots a game. If due to some bad coaching reason he is not a starter, he should be on the court soon enough to get 7 minutes with Batum/Dunn/Beal combos not good enough to sustain periods of play in my opinion. \n\nThis is largely a vibe based pick in that there is no trend to back it up, it’s based on injury creating opportunity + the fact that Collins has seemed like the next best scorer for the Clippers. \n\nNow I normally always take the higher odds but I also normally usually go after players who I feel are a bit more reliable on the 3 point shot. For anyone with less risk appetite, Collins O3.5 1Q points (4+) was $2 or +100, but I don’t see a world where he hits 4 and not 5 that many times - there’s just no value in the 4 point line. If you’re gonna take an alt line, going upwards one point for an extra dollar return is much better in comparison to going down for 24 cents extra (3 is $1.76). So in many ways, this is a play based on odds. \n\nCollins in his career averages 3 3pt-attempts a game @ 36% hit rate, so I’m not really banking on a 3 being included in his points. I do think he’s crafty enough to get to the FT line so I’d take 2 2FG’s (career 60% shooter on these so need him to have 3-4 shots) and a and-1 on one of those (career 80% FT shooter). \n\nAs always, these 1Q bets can be streaky at the best of times, but I do like a value spot and I think Collins getting elevated into a main role for the first time this season as an able scorer is good value. Unit management is always important though!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nne6ycc/"
    },
    {
      "created_utc": 1762418589.0,
      "author": "kanadaii",
      "text": "Record 1W-2L\n\nForm ✅❌❌\n\nUnits: -1.08u\n\nLast Pick: Benfica vs. Leverkusen 1@1.98❌\n\nToday: Midtjlland vs. Celtic 1@2.10⏳\n\nThe home team is in a stronger position, unbeaten at home since, while Celtic looks uncertain away. According to the analysis, Midtjylland is the more likely side\n\nGood Luck",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndzi6n/"
    },
    {
      "created_utc": 1762418374.0,
      "author": "solmer7",
      "text": "Record:** 46W-22L (+10.38 units)\n\n **Last 10 POTD:   ✅ ❌ ✅ ✅ ❌ ✅ ✅ ✅ ✅ ❌\n\n \\*\\* Football \\\\ UEFA Europa League\\*\\* \n\n**\\*\\*POTD\\*\\*: Viktoria Plzen vs Fenerbahçe- Both teams to score @1.59 - 1 unit ( All my picks are 1 unit)\n\n **Writeup**: Hey folks, Viktoria Plzen scored at least a goal from their Europa League games in total 6 goals. They are sitting comfortable at 5th place with 7 points. Home advantage is crucial in this tournament format. They will use and try to get at least a point for this game. Fenerbahçe won last two matches and currently sitting on 14th place with 6 points. In the league with Jhon Duran's last minute goal they managed to get 3 points from rival at derby game.Tedesco and players are getting good shape, specially Asensio contributing more to team each game, Fenerbahçe will look for a point this match. I expect a controlled game with goal from each side.Best of luck to who tails! \n\nI would be greatly appreciated, if you wish to tip.\n\nTFLCDLox65FoD7nNiZBnXmeuvJTQRvKnEn(TRC20)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndz5oy/"
    },
    {
      "created_utc": 1762416115.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 17-8-1\n\nSoccer\n\nLast Pick: Barcelona ML + Chelsea ML @ 2.09 - LOSS!\n\nLast Pick Write Up: Alright, I knew Qarabaq were tough, but I didn’t expect both of the games to draw. Political commentator voice: what is going on?\n\nNow for today..\n\nPick: Aston Villa ML + Midtjylland/Draw @ 1.6\n\nWrite Up: These Europa league games can be pretty unpredictable, but here are my thoughts. Aston Villa is the better team and playing at home. With the recent controversy, I think they will want to secure a win, and while this is not a political sub, beating Israeli teams is very good for PR these days and I think Aston Villa will work hard to secure the win. Midtjylland is also at home, and they are in very good form, no losses in their last 11, while Celtic have been very shaky and struggling, Midtjylland should at least get a draw here.\n\nLet’s turn this ship around, I’m pretty confident in this one, but like I said, these Europa games can be unpredictable.\n\n\nEdit: I see the guy who posted right before me had the same pick. Last time this happened I forced a change and it resulted in a loss, I’m sticking with my pick this time 💪",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndvh7d/"
    },
    {
      "created_utc": 1762413586.0,
      "author": "Mindless_Employee421",
      "text": "Record: 4 - 1 \n\n\nNet Units: +10.14\n\n\nROI: +10%\n\n\nSport | League | Event Time / Time Zone: Soccer | UEFA Europa League | Aston Villa vs Maccabi Tel Aviv and FC Midtjylland vs Celtic FC | 12:45 PM EST\n\n\nPick: Aston Villa ML + Midtjylland Double Chance (Win or Draw) (To win 2U) (-150)\n\n\nWrite Up: Matchday 4 of the Europa League  and for my pick today I'm picking Aston Villa to beat Maccabi Tel Aviv from Israel and FC Midtjylland to win or draw Celtic FC from Scotland. Aston Villa is playing at home and the English Premier League is levels above the Israeli league. Aston Villa have been in good form with notable wins over Manchester City, Feyenoord, and Bologna and even though they lost one of their last matches to favorites Liverpool they will be looking for a win here vs a much inferior opponent. On to the Midjtylland game now Midtjylland should be able to win or draw as they are the top team in the Europa League so far and sit in 1st place in the standings in the UEL table with a perfect 3 - 0 record with wins over Sturm, Nottingham Forrest and Maccabi Tel Aviv. They are also unbeaten in 11 straight at home and are looking to retain their position at the top of the UEL table. If you're looking for h2h these two faced off in the UCL in 2021 and Midjtylland drew the first match 1 - 1 and won the 2nd one 2 - 1. Bol.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndr866/"
    },
    {
      "created_utc": 1762413361.0,
      "author": "OliveCritical5134",
      "text": "**Record: 15-8**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌\n\n**Sport: ⚽ /** ***UEFA Conference League & Europa League / AEK Larnaca v Aberdeen & Malmö v Panathinaikos***\n\n**Net Units/ROI: +26.57u / 42.17%**\n\n**Previous Pick:** ***Galatasaray or Draw(1.36) + Barcelona to win(1.48) @ 2.01 -- 3 units❌***\n\n**Summary:** I don't know what Carlos Forbes ate for breakfast but I want some. I've never seen such lackluster defense as I've seen during the 2 goals Barca conceded 1st half . A very bad offside trap and 1 pass split their entire defense open after lost possession at their own corner kick. Second half Barca came back to 2-2 and you think they'll push for a winner but Brugge applied the same recipe, one through ball and Brugge scored a third. I don't know what Carlos Forbes ate for breakfast but I want some. Galatasaray won 0-3, so that was a good pick atleast.\n\n**Today's Pick:** ***Malmö v Panathinaikos over 1,5 total goals(1.33) + Larnaca to win(1.40) @ 1.86 -- 2 units***\n\n**Write up:**\n\nI've reduced my stake here to 2 units, since we're dealing with teams in less respected leagues here, which are always less predictable in my opinion.\n\n**Malmö v Panathinaikos (17.45 GMT)**\n\nIf we look purely at goals for and against for both teams in the Conference League, **Panathinaikos: 6:6** & **Malmö 2:6 in 3 games**. Malmö is cemented in the Swedish league which is nearly finished and rotated their team for the most part last weekend. Their players should have fresh legs and ready to put all into this game. **Over 1,5 goals has hit in all of the 6 European games both teams took part in.** This pick **hit for the last 8 games for Malmö**. It also **hit in 8/10 most recent games for Panathinaikos** this season. Also worth mentioning is that both teams are struggling collecting points against the weaker opponents so far in Europe meaning they HAVE to win this game and will most likely take risks. Malmö faced Dinamo Zagreb, Viktoria Plzen & Ludogorets so far in which they ONLY collected 1 point. Malmö's schedule is: Nottingham Forest, Porto, Crvena Zvezda & Genk after Panathinaikos today, TOUGH.\n\nPanathinaikos faced Feyenoord, Go Ahead Eagles and BSC Young Boys, collecting 3 points in a win over the Swiss champions. Panathinaikos's schedule is Sturm Graz, Viktoria Plzn, Ferencvaros & Roma. Less tough but still difficult. Both teams will want to win here. And I mean, we're talking about 2 goals here.\n\n**AEK Larnaca v Aberdeen (17.45 GMT)**\n\n**AEK Larnaca** has been in form this season and are **2nd in the Conference League** right now, where they've already won against title favorites Crystal Palace(1-0) and Dutch midtable team AZ(4-0). They drew against Pafos in the Cyprus Super Cup (won it on pens), and another draw in the league makes their recent record complete: **WDDWW**. They are exceeding expectations so far and are looking to continue.\n\nHow different is that for **Aberdeen**. Last in the Conference League with **0 points and 9 goals against in 2 games.** AEK Athens and Shakhtar Donetsk were the opponents. They haven't impressed in the Scottish Premiership either, **sitting 9th in a 12-team league**. 10 points out of 10 games there. Only picking up points against teams in the bottom of the league: Livingston (12th), Dundee FC(11th), Kilmarnock(10th) and St. Mirren(8th). I don't see them turning the tide away in Cyprus today.\n\n**Best of luck if tailing!** 🍀\n\n**PS:** If you want, you can check my record and units won on: [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndqu30/"
    },
    {
      "created_utc": 1762412894.0,
      "author": "bustlingblueberry-44",
      "text": "POTD Record: 2-2 (-.5u)\n\nStreak (first-latest) : ✅❌✅❌\n\nLPOTD: Cowboys -3 -120 (2.4u to win 2.0u)\n\nCowboys fumble 3 times. Brissett turns back the clock and cards roll in Dallas. On to the next.\n\nPOTD: R.J. Harvey O 36.5 Rush + Receiving yds -120 (3.6u to win 3u)\n\nShort week for these Broncos coming off a gutsy battle with the physical Texans defense. Dobbins is there guy, but coming off a short week I’m expecting a lighter load for him. Harvey caught 5 for 51 last game and only had two carries. I’m expecting 7-8 carries for him and a few catches out of the backfield. He should be able to expose this raiders D, also coming off an OT battle. This could be the Harvey breakout game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndq0ik/"
    },
    {
      "created_utc": 1762412603.0,
      "author": "PurpleDragonBets",
      "text": "Record: (109-69-11) \\[+18.88\\]\n\nPOTD⭐️:🏈USF -3/Broncos -3 (-185) \\[Bet365\\]\n\nStart Time & TV: 7:30 & 8:15pm EST (Amazon & ESPN)\n\nUnits: 4.5 Units\n\nReasoning: Now I know this is the most juiced play I have posted in an extremely long time and probably the most juice Ill ever take on a play but after a couple after a couple stinkers of picks I wanted to get back on track with a play I have ultra confidence in. I really like the South Florida Bulls to take this game by at least a field goal in this one as they are well rested coming off a bye week and the Bulls are amazing at home this year with a 4-0 record at home and being 4-0 against the spread at home. They also should be getting back star wide receiver back Chas Nimrod who missed their last game against Memphis. They face off against the Texas San Antonio roadrunners who had a solid home win last week but this team does not play well on the road with a 1-3 road record and they are also 1-3 against the spread on the road. I also think the Broncos beat the Raiders by at least a field goal as the Raiders have to travel to Denver on a short week. This Raiders team ranks 29th out of 32 teams in points per game with an average of 16 a game, 22nd in passing yards and 29th in rushing yards per game and they face off against a strong Broncos defense that is 4th in the league in points allowed per game and they will facing off against this stout defense after trading away Jakobi Meyers so they will have less weapons to work with on offense in this one.\n\nPrediction: 45-34 USF, 19-9 Broncos\n\nLast pick:🏈Cowboys -3💩So much for the number one passing offense in the league.\n\nBest of luck to everyone tailing and remember to bet responsibly and manage your bankroll wisely!!🍀💜🐉\n\nhttps://preview.redd.it/pncc0odi5lzf1.jpeg?width=1170&format=pjpg&auto=webp&s=0e96760e69a9383e601faf2ffaf9615c8047230e",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndphyt/"
    },
    {
      "created_utc": 1762411589.0,
      "author": "MWMM93",
      "text": "**POTD Record 41-36-1**\n\nMy god, that ending was wild. Spurs were up 10 in the 4th, Wemby & sochan fouled out, Champagnie missed 2 free throws with under half a second left down 2, and a spurs missed a tip in off the second free throw BUT THEY COVERED the 2.5. That game was stressful, and Idk if I’ve ever rooted harder for a team I bet to win, to score there at the end. I didn’t see this covering if it went to OT. \n\nBack at it, and with only one game tomorrow, I’m going to fire on it with little opinions because holy shit have I gotten lucky the last two plays, so why can’t I again tomorrow? Let’s get the streak going.\n\n**PHX -2.5**\n\nOkay, I’m not going to lie, not much to add to this, as I have not watched PHX much this season, and LAC is without their best players. There are a few things that stuck out, that make this the only side to bet IMO. \n\nFirst off, booker is having himself a season. He’s averaging 31/4/7 a game, scoring over 28 in each of his last 6 games. PHX is 4-0 at home ATS, while LAC is 1-6 ATS this season. Also, ~60% of the money is on the clippers, yet the lines moved 1pt already in favor of PHX. \n\nAgain, i do not think I’ve watched a full PHX game, so don’t know their rotations and how they look all game, however I have watched a lot of their 4th quarters and they are efficient as shit. They are shooting 50% from the field and 46% from three this season in the 4th. \n\nClippers injuries are insane, yet they still have talented players, so who knows how they will do with their limited roster.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndnonz/"
    },
    {
      "created_utc": 1762408628.0,
      "author": "fazemonero",
      "text": "OTD Record: 3-5, Previous Pick: ❌ OTT Senators -0.5 2nd Period (+130) 1u\n\n**Event**: NFL Raiders @ Broncos\n\n**POTD**: Raiders +4.5 vs Broncos (+190)\n\nGuys guys guys. These broncs aint for real. Who dey? \n\nAnyways, these broncs are an all or nothing offense. Score 13 against the Jets or 44 against the Cowboys. Scoreless for 3 quarters against the Giants at home and then 33 points in one quarter. They also have a habit this season of playing to their opponents level, and a way of keeping games close against teams they are favored against.\n\nScary, but I'm betting on the coin flip that their offense doesn't perform and they win how they often do through their defense in close low-scoring games: Broncos 13 - 9 Raiders.\n\nAnything can happen in primetime football on a short week. I think they will follow this tendency and play down to the Raiders level. Raiders might have a real problem scoring and it would be great if they could score more than 9, but I won't ask too much. Just not more than one turnover. Please.\n\nFrom most to least likely: Broncos 13 - 9 Raiders, Broncos 33 - Raiders 9 , Broncos 23 - Raiders 19, Broncos 40 - Raiders 6, Raiders 23 - 13 Broncos. +13.5 is a lot safer in some of the grey zones but I think this has the best value.\n\nOnly bet what you can afford to lose and DYOR, I have a losing record kapiche?",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndi4c3/"
    },
    {
      "created_utc": 1762408314.0,
      "author": "lalalamelo",
      "text": "Record: 1-0 (100%)\n\nForm: ✅\n\nLast Pick: /NCAA Basketball\\ Temple -17.5 vs Delaware State (FanDuel -110) 2u ✅\n\nLast Pick Recap: This one was quite a sweat. Coming down to two made free throws on the Owls last possession, Temple covers and brings us our money. Bet on teams that hit their free throws!!! \n\nToday’s Pick: [NCAA Basketball] Florida -37.5 vs North Florida (DraftKings -115) 8:00 PM EST \n\nAnalysis: There isn’t a whole lot to be said. The reigning National Champion Florida Gators are having a casual early season cupcake game for their home opener vs the Ospreys of North Florida. The Gators dropped their opener to Arizona in a hard fought battle. But, they are still loaded with talent and are expected to be one of the best teams in the country. They are playing North Florida who was picked to finish 11th out of 12 in the ASUN conference this year. Once again preseason polls mean very little, but the big number of 37.5 is telling us that this one will not be remotely close. Not to mention, the Gators beat UNF by 54 points last year. If the Gators do not win this game by at least 40, they will most likely be running suicides the next morning.\n\nI am most likely not a psychic and this is gambling at the end of the day so bet responsibly, control your emotions, and best of luck🧏‍♂️.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndhi0g/"
    },
    {
      "created_utc": 1762407873.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 8-2 (+7.7U)\n\nLast Pick: Capitals ML (-145) (1U) ✅\n\n[Capitals write up](https://www.reddit.com/r/sportsbook/s/toug8MAGgv)\n\nBlow out. Motherfucking. Winner. Way to bounce back caps! And congrats to one of the all time greats on 900 career goals. Doing it in incredible fashion!\n\nEvent: Georgia southern @ App State (6:30pm central)\n\nPOTD: Two team 7 point teaser (App state +1.5/over 54.5) (-130) (1U) \n\n-everything is bet to win unit amount-\n\n(I just want to clarify this specifically because my units up on the capper tracker is skewed, everything I do is bet to win my unit amount so for instance last night with the capitals you should’ve placed 1.45 units to win 1 unit) \n\n\nWrite up: My first teaser on POTD, I actually enjoy doing teasers in the right spot and a game like this is one where I think it makes sense to do so. It’s rivalry gametime baby! The “deeper than hate” game is here. Georgia southern travels to take on the mountaineers in what I expect to be a high scoring affair but one that ultimately ends in a victory for the boys in Boone. First of all, Georgia southern allows just an absolute cartoonish 42 points per game on the road, I mean that’s just downright fucking awful. On top of that they have allowed 25 rushing touchdowns on the year (worst in football), that’s not going to bode well against the Sun belts leading rusher in Rashod Dubinion at 94.5 rushing yards per game. The mountaineers allow 110 rushing yards compared to the 240 yards allowed by Georgia southern per game. Now let’s not sit back here and act like app states defense is all that, cause it’s not. They allow 29 points per game. Here’s gonna be the problem for Georgia southern, they’re not going to win the battle in the trenches, and app state is going to be able to do whatever the fuck they want to on offense. If app state wants to pound teh rock all game they’re gonna be able to, but the thing is they also throw the ball 42 times a game for an average of 278 passing yards a game! Thats 5th and 19th in the nation in those respective categories. So Georgia southern is going to have no answer whatsoever on defense as they also allow a 67% completion percentage (121st in fbs) and give up 240 yards through the air. Georgia southern is also 1-5 in their last 6 trips to Boone. Georgia southern also has key veteran players out on defense tomorrow. While it did not specify who, you can look it up for yourself if you don’t believe me as their head coach said today ahead of the matchup that younger guys would need to step up ahead of this rivalry in replacement of these veteran players. Georgia southern is also allowing their qb jc French to get sacked at an 8.5% clip which is yet again 119th in fbs. With all that being said let me put it simply. Georgia southern is not goung to be able to rush the ball (app state is actually 37th in opponent rushing yards, miles ahead of Georgia southern) app state is going to be able to run the fuck all over Georgia southern however they want. Whenever they decide to pass, they will be able to throw the ball wherever they want. You wanna know who’s dead last in fbs in sack percentage, you guessed it, GEORGIA SOUTHERN. This team cannot stop the run, they cannot stop the pass, that cannot get to the quarterback. They cannot win on the road. With all this being said this is a rivalry game, and the hatred is there. I expect points to come and I expect app state to get out with a win in a game where they should be able to be multi dimensional while the same cannot be said for Georgia southern. I’m sorry if this write up has been a bit all over the board, I am currently writing this on my phone while traveling back home for a bit, what a fucking run we are on boys. Looking at the potd streak I’m on could u imagine if the CJ stroud never got hurt again the broncos?!! We could be sitting at 9-1! Oh well 8-2 is great too!!!! I’m excited for this matchup tomorrow and wanted you boys to have something to throw on for a little football to change it up, nonetheless we’ll cash in every and all sports, we have now accumulated an 8-2 record with +7.7u in nba, cfb, cbb, and nhl. If you can’t get this at 7, 6.5 works too and will help your odds go to likely -120. Consider putting a side bet on Dubinion over 67 rushing yards (not an official play but if you read write up you can understand why). I really do appreciate all the support and thanks to those who have tailed and been along for the journey so far! My only wish is that I joined POTD sooner! Let’s get another on the board fellas, cheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndgm3d/"
    },
    {
      "created_utc": 1762406019.0,
      "author": "IndianBettor19",
      "text": "Record (W-D-L): 6-0-1\n\nNet Units: +9.46 Units\n\nFootball | National Football League | 8:15 PM EST\n\nPick: Brock Bowers O 61.5 Receiving Yards (-118, BetMGM, 1.18 Units)\n\nWrite Up: I'm only defending Bowers because of his stats against man coverage and zone coverage. I will also preface this by saying Geno Smith is ketchup water, and the stats do not indicate he is better against the coverage that the Broncos run. I'm solely taking this because of Bowers' advanced stats. The Broncos defense has the 3rd highest man coverage rate in the league, which is exactly what Bowers feasts against. Let's get into it.\n\nBowers stands first on the Raiders in terms of first read target share at 29.25%. Jakobi Meyers was a close second, but he is now gone from this team! He also leads the team in targets per route run at 0.27. I also really liked his aDOT of 6.23 this season, because Broncos pressure rate is amazing, meaning Geno will have to do quick passes (unfortunately, Geno probably throws a pick this game). His targets per route run against man is 0.36, whereas it is only 0.16 against zone. His yards per route run is 3.52 against man, but only 1.21 against zone. His yards per target against man is 9.69, and 7.78 against zone. \n\nGiven the Broncos' projected spread at -9.5, the Raiders should be in pass mode all game. Per PFF, Broncos run defense is ranked third in the league, meaning Jeanty should face trouble. Denver also gives up a good amount of plays per game, more than average. I didn't mention it enough, but Meyers is gone. This is very impactful. Geno Smith is going to have to target Brock Bowers often, as he's not used to this week's set of receivers. Things will look different, but Bowers will be there. Bowers had 12 receptions, 127 receiving yards with 3 touchdowns in his first game back from injury. \n\nWas a really sweaty cash on my last pick (tennis and soccer)! Wasn't expecting Barca to even tie after how horrid they were out on the pitch. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndcrau/"
    },
    {
      "created_utc": 1762405195.0,
      "author": "Flashy-Literature423",
      "text": "Record: 7-4-1\n\nUnits: +7.49u\n\nLast 10: ✅-🅿️-✅-✅-❌-❌-✅-❌-❌-✅\n\nLast Pick: [Nikola Jokic Over 9.5 Ast (-130 on bet 365) Bet 3u to Win 2.31u](https://www.reddit.com/r/sportsbook/s/HTGkUeLGzg)✅\n\nJoker did precisely what I expected and granted us a very comfortable sweat free win.\n\nNBA | LAC Clippers @ PHX Suns | 9PM EST\n\nNext Pick: **Devin Booker Over 28.5 Pts** (-105 on DK) Bet 2u to Win 1.90u\n\nClippers defense is undermanned without Kawhi and Harden. Their perimeter defense allows elite scorers to operate freely and with their top two playmakers out the Suns can run more isolation sets for Booker.\n\nBooker's scoring form has been great, 6 of 8 games above 28.5 points (75% hit rate) he's averaging 31PPG thru 8 games this season. Booker is not just performing above his season avg **he’s elevated 5.4PPG above last season’s avg thus far. This suggests he's getting more scoring opportunities with the suns current system.**\n\nAll signs point to this being a prime opportunity with significant upside.\n\nIf tailing, only risk what you can afford to lose. Best of luck family!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nndayad/"
    },
    {
      "created_utc": 1762404745.0,
      "author": "suavylocks",
      "text": "Overall Record: 9-4 [+4.15U/17.6] ROI: 23.6% \n\nForm: ✅✅✅❌✅✅✅❌❌✅✅❌❌✅\n\nRecap:\nChargers absolutely hammered the Vikings, my model really didn’t like last week and thank god for that as it was a completely unpredictable week yet again. I think we see some normalcy again this week so expect a Sunday and Monday pick as well!\n\nGame: Las Vegas Raiders @ Denver Broncos \n\nPick: 0.5U Broncos -9.5 (-110)\n\nReasoning:\nOne very very important stat: teams coming off a Sunday overtime game are just 6-25 ATS this millennia, the lack of rest after a grueling game is pretty strong argument to link causation to that correlation.\n\nThe raiders also just flat out suck, and they traded one of their best weapons. Meanwhile Bo nix, who I think is still quite overrated, has feasted against bottom 10 defenses at home, his averages are 285 pass yards per game, 2.67 td, 0.33 INT. Take this line before it shifts to 10, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nnd9yq8/"
    },
    {
      "created_utc": 1762398442.0,
      "author": "Super_DAC",
      "text": "Record: 3-2\n\nNet Units: 1\n\nPrevious Pick: Alternate Winning Margin Ball State Cardinals (7-12 points) +425 (1 Unit)\nOk so per the odds rules, this did not count as a POTD. Therefore I’m not gonna count it on my record. Sorry about that.\n\nEvent: NHL Hockey Florida Panthers (6-6-1) @ LA Kings (6-4-4) 11/6 10:07PM EST\n\nPick: Total Match Goals Over 5.5 +100 (1 Unit)\n\nWrite up: Two teams with high scoring offenses and leaky defenses meet Tuesday night, setting us up for an intriguing match. Panthers games have typically been high scoring affairs this season, with at least 5 goals total being scored in 9 of their first 13 games this season. Los Angeles has also taken part in their share of high scoring games this year, with 10 of their first 14 games featuring a combined 5 goals. \n\nFlorida has just 1 shutout win (3-0 vs Vegas) and a lone shutout loss (0-3 vs Buffalo) so far this season. Meanwhile the Kings have not been shut out so far this campaign, and they have a single shutout win so far (their most recent game being a 3-0 shutout win against Winnipeg).\n\nIn a matchup this close, the only thing I’m confident leaning on is the combined scoring prowess and defensive struggles of each team. I’m expecting a fun game full of goals. BOL to those tailing, let’s do some winning!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nncuq1e/"
    },
    {
      "created_utc": 1762397634.0,
      "author": "dantesmom1",
      "text": "**Record: 5-5 (+0.76u)**\n\n**Thursday Night Football** | **Las Vegas Raiders vs. Denver Broncos** | **8:15pm** **EST** 🏈\n\n**Pick:** Brock Bowers Over 65.5 Receiving Yards (-120 Fanatics) 2.4u to win 2u\n\n**Write Up:** After missing 5 games due to a PCL sprain and a bone bruise, Brock Bowers came back and delivered **12 receptions, 127 yards, and 3 TDs** against the Jacksonville Jaguars. Now, coming off a short week the Raiders travel to Mile High for an indivision game against the Broncos.\n\nBrock Bowers line is **WAYYY** too low. He looks back to form making some insane catches vs. the Jaguars under all sorts of coverages. Here's by I like this pick:\n\n**1.** The Broncos do have a top defense but not against Brock Bowers. Dalton Schultz last game against the Broncos had 6 receptions with 77 receiving yards.\n\n**2.** Brock Bowers was projected #1 TE by everyone for a reason. 65.5 is too low. He's looking healthy and nearly doubled that total last game.\n\n**3.** Jakobi Meyers got traded so Bowers will see a higher target share.\n\n**4.** Run game has not been working. Jeanty had 13 carries last game and 6 against the Chiefs the game prior. They will throw\n\n**5.** Raiders are 9.5 point underdogs. They will need to THROW to stay in this game.\n\n**6.** Pressure is coming from Denver. They lead the league is sacks by a mile. This means quick passes will go to Bowers.\n\n**7.** As of this edit, Draftkings has his O/U at 69.5. Fanatics + Fanduel have this MISPRICED. DK is usually sharper. Good value at 65.5 getting a 4 yard discount\n\nLet me know what you guys think about the pick! Feedbacks always appreciated. This is my first time posting the night before!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nncsjxj/"
    },
    {
      "created_utc": 1762395818.0,
      "author": "NoFilterD",
      "text": "**54-27**\n\n**$5485.92 +54 units**\n\n**Last pick 5W in a row Ceedee Lamb/George Pickens Alt rec yds -220 for 3 units**\n\nNFL Las Vegas Raiders At Denver Broncos divisional rivalry \n\n**Pick Bo Nix over 199.5 pass yds+J.K. Dobbins over 49.5 rush yds -110 Odds 4 units $400 to win $763.64**\n\n        Bo Nix at home against a Raiders defense that has given up over 200+ passing yds to Trevor Lawrence(220), Mahomes(286), Cam Ward(222), and Daniel Jones(212). \n      Nix in his last 5 games has thrown over 200 yds 3/5 games with exception he failed to get over 200 yds against Houston(173) and the New York Jets(174) both who have great Pass Defenses. In two division rival games the Raiders have not kept it close. The Chiefs smacked them 31-0 in Kansas City and the Chargers won 20-9 in Las Vegas. I expect Denver to be a tough place for the Raiders as well with the crowd and especially the high altitude. \n         As for our second leg, Dobbins has cleared over 50 yds rushing in 4/5 games with exception of 42 yds against the Jets. It should be noted that I don’t look at the jets game for much credibility because it was a London game and those games have been whack. So if we don’t even take into account the London debacle, Dobbins has been able to get atleast 50 yds every game even against the tough Houston defense, and Nix has only had trouble getting 200 vs the Houston d as well. \n       The Raiders have allowed Etienne,Pacheco,j Taylor to all go over 50 yds and only Pollard didn’t get over 50 yds and only ten carries with a dismal titans team that lost to the raiders. Denver should be able to have over 200 yds of passing and have at least 50 yds out of their great running back, let’s get 6 wins in a row. I normally worry about rival games but the raiders with their 0-2 record and very little fight don’t give me much worry, just stay away from whichever side Crosby is on Denver and you’ll be ok! best of luck everybody, let’s hopefully have very little to sweat. 😅",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nncnl7b/"
    },
    {
      "created_utc": 1762394867.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 187-141\n\nUnits Won: +92.60\n\nLast Pick: DGT U 8.5 Headshots Map 2 (-118) ✅\n\nToday's Pick: **AMKAL Map 1 ML (-122)** vs. JiJieHao 5u\n\nTournament: Nodwin Clutch Series 2  \nTime: 1:00 PM EST.\n\nWriteup:\n\n* Was gonna take a day off since no tier one/player props and ML have seemingly been cursed for me but this pick just feels like way too much value to not take and I feel quite strongly about this play overall.\n* AMKAL are taking on JiJieHao in the 0-2 match tomorrow for Nodwin Series 2. Both teams have looked horrible in their own ways which I'll go into a bit more below, however one big note about tomorrow's match is AMKAL are currently only playing in this tournament for tomorrow so they have no other match to focus on, all of their prep/game plan should be going into this match, JiJieHao on the other hand have a playoff match at 7:30 EST. against GUN5 for CCT Series 10. This will almost certainly take higher priority for JiJiehao, as they are already in playoffs and CCT has a bigger prizepool overall meaning I don't think they will care about this match at all. (Not reason for pick, but think this is a factor)\n\n**JiJieHao:**\n\n* Their form has been extremely troubling as of late, things have been looking increasingly awful for this roster, they have lost 6 of their last 8 matches only beating Metizport (2x), while going 0-12 in maps in their losses. They haven't just lost but have gotten absolutely rocked in every match. In order of least to most recent, lost to Monte 13-3/13-9, lost to 1WIN 13-3/13-9, EYEBALLERRS 13-6/13-9, and Fire flux 13-7/13-5. In their last two matches they have subbed in sinnopsyy for ISSAA. These matches were played on 11/3 and 11/4 so I am expecting this to likely continue and sinnopsyy to play tomorrow. They have looked even worse with a sub if thats even possible losing to SINNERS 13-1/13-4 in a complete stomp and losing to SPARTA yesterday 13-5/13-10 both very one sided series\n\n**AMKAL:**\n\n* Won't spend too much time on them as they are bad too, but have their moments and on paper at least have a significantly better roster. They are 6-8 in the last month in matches overall, they are 0-2 at this tournament and also have a 0-4 record and lost mostly stomps, however this is a perfect match to get a much needed bounceback win. They have been in really rough form going 1-5 in their last 6 with a 5-10 record in maps overall, however I just have way more faith in a core roster of KaiR0n/mo0n/nafany/KENSI then I do of BOROS/m1n1/osamas/bibu.\n\n**Veto:**\n\n1. AMKAL ban Nuke, JiJieHao ban Overpass\n2. AMKAL pick Ancient/Inferno, JieJieHao pick Dust 2\n\n**Ancient Stats/Inferno Stats:**\n\n* AMKAL are 53% winrate on Ancient on 19 maps played in the L3 months, they are 4-4 in the last month\n* JiJieHao are 27% winrate on Ancient on 11 maps played in the L3 months, they are 0-3 in the last month\n* AMKAL are 56% winrate on Inferno on 9 maps played in the L3 months, they are 5-2 in the last month\n* JiJieHao are 22% winrate on Inferno on 18 maps played in the L3 months, they are 1-5 in the last month",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nnckyo0/"
    },
    {
      "created_utc": 1762394756.0,
      "author": "Ascending_Saiyan",
      "text": "POTD Record: 1-3-1 \n\nNet units: -1.1u. All bets are 1u.\n\nLast POTD 3/30/2022: Dillon Brooks Under 26.5 Points, Rebounds & Assists. (-130) ❌\n\nEvent: Thursday Night Football Raiders @ Broncos 7:15pm CST\n\nToday's POTD 11/6/25: Tre Tucker 30+ receiving yards (-230) & Brock Bowers 5+ receptions (-350) 2 leg parlay @1.86.\n\nNet units: -1.1u. All bets are 1u.\n\nWrite up: Well I think I'll give this another try after a two and a half year hiatus. Hopefully, I can turn this around and get some positive returns going here.\n\nToday's TNF matchup is another interesting one that could be a defining moment for both teams moving forward for the rest of the season. The Raiders have done all but wave the white flag on the season and are teetering on the edge of completely falling out of the 2025 competition. With the Jakobi Meyers trade happening before the deadline, the Raiders will be looking to rely on Tre Tucker and Brock Bowers' production in the passing game even more than they have in prior weeks. With the combination of the Raiders' bottom 5 rushing attack, the Broncos banged up secondary and the expectation of them playing from behind for most, if not the entirety of the game, I believe these two players should clear these lines easily. Both Bowers and Tucker have cleared these lines in 4 of their last 5 appearances and I expect them to clear them tonight as well. If the Raiders want to have any chance of staying in this game they need to continue getting the ball into their two biggest threats through the air. \n\nTail or fade BOL to everyone and cheers! 🍻\n\nhttps://preview.redd.it/oxwyzx4gojzf1.png?width=1080&format=png&auto=webp&s=9d582d1baae30f841b2a8ddc75c8a59e2a2f81e8",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nnckndj/"
    },
    {
      "created_utc": 1762392206.0,
      "author": "bigtime-operator",
      "text": "Record: 49-41\n\nIndykpol AZS Olsztyn - Trefl Gdańsk 🏐 Poland Plus Liga\n\nPick: Total Points Over (177.5) @ 1.55\n\nFirst of all, it's important to note that neither team is in a position to pull off a big victory. Olsztyn started the season with a tie-break loss to JSW, followed by a tie-break victory in Bełchatów (Skra), and a decisive 3-1 away win at Barkom on November 3rd. Trefl Gdańsk has added strength to their squad with strong summer signings (Piotr Nowakowski, Joseph Worsley, Tobias Brand, Damian Schulz, etc.). They beat Barkom 3-2 in the league opener, 3-0 against Ślepsk in Week 3, and lost 1-3 away to Resovia in Week 2. Total points of AZS Olsztyn in 3 matches in 2025/26: 2-3 against JSW (23-25, 25-19, 25-17, 18-25, 11-15) = 203; 3-2 against Skra (21-25, 25-18, 17-25, 25-19, 18-16) = 209; 3-1 against Barkom (21-25, 25-19, 27-25, 25-23) = 190. Trefl Gdańsk in 3 matches in 2025/26: 3-2 against Barkom (19-25, 25-20, 20-25, 25-19, 15-8) = 201; Resovia 2-3 (25-19, 23-25, 23-25, 25-23, 13-15) = 216; Ślepsk 3-0 (22-25, 23-25, 23-25) = 143. In the Barkom-Olsztyn match, Barkom made 32 unforced errors, Olsztyn 23; errors like these are a good sign for us to extend sets. I expect the match to go at least four sets, and I expect Trefl to not give up easily.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nncdme9/"
    },
    {
      "created_utc": 1762391375.0,
      "author": "VAM89",
      "text": "Record: 18-11\n\nLast Five Predictions (Old - New): ✅✅❌❌❌ \n\nNet Units: +15.44\n\nYesterday's Pick:  Inter (-2.0) vs Kairat Almaty AND Galatasaray (+1.0) vs Ajax. 3u @ 1.91\n\u000bAt this rate, I'm actually going to start selling my picks... if you want a team to underperform, message me and I'll put them in my POTD.  \u000b\u000bReally disappointing from Inter, who won 2-1. Gala dominated and won 3-0.\n\nToday's Pick:  Roma to win or draw vs Rangers and under 3.5 goals. 4u @ $1.61\n\nRoma travel to Ibrox to face a troubled Rangers side. \n\nRoma games have been incredibly low scoring so far. They've scored 10 league goals and have won 7 games with that.... Largely because they've only conceded five goals in that time. \n\nTheir results in Europe aren't great, with losses to Viktoria Plzen and Lille... However, these are both games where they dominated the numbers. Roma created 2.28 expected goals to Viktoria Plzen's 0.16, and lost 2-1. In the Lille game, Roma created 2.61 xG and Lille created 1.13, and Lille won 1-0. \n\nSo I'm not overly concerned about their European results, because their form is good. \n\nRangers have been horrible this season and have already sacked a coach. Now, I won't sit here and back Russell Martin as a great coach, but I'll say the issues at Rangers didn't start and stop with him. \n\nI can't see Rangers winning (settling for a draw is always an option with the new league format), and I can't this being a goal-fest either.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nncbbt6/"
    },
    {
      "created_utc": 1762391352.0,
      "author": "major-couch-potato",
      "text": "Record: 157-135, -1.44 units\n\nLast Pick: Jay Clarke ML vs Stefan Kozlov (-142, 1 unit): Win\n\nTennis | Helsinki Challenger | 10:30 AM EST (estimated)\n\nToday's Pick: Otto Virtanen vs Emil Ruusuvuori | **Virtanen ML at -137 (DK). 1 unit.**\n\nWrite-up: Clarke closed at -177, and ended up getting the win in an up-and-down three-set battle. \n\nThis should be a fun all-Finnish encounter in Helsinki, but it's also one where I believe one player holds a distinct advantage. Both of these players have risen from the ashes recently (Virtanen from an injury, Ruusuvuori from a mental health break). For that reason, the market has started to like them more and more, and you can see this in their falling odds against the same tier of player from the beginning of their comebacks to now. This makes it a bit tough to do odds analysis, since the magnitude of each player's rise is hard to quantify, and it's easy to make errors comparing prices from different tournaments. However, Virtanen's comeback has been especially impressive to me, as he made it through a decent draw in Roanne to capture the title in just his fourth tournament back. This is a great time of the season for Virtanen to make an impact, as indoor hard courts have consistently been his favorite surface throughout his career. His huge serve + 1 combination and generally aggressive game allow him to blow past opponents on the surface; in fact, 5 of Otto's 8 Challenger titles have come indoors. I will note that Helsinki plays a bit slower than most indoor hard courts, but the lack of wind and natural conditions are still beneficial for someone with a low-margin game. In his first round of this tournament, the market pushed Otto from -300 to -455 against Gauthier Onclin, showing the confidence it has in him in these conditions. He also went on to take the match in straight sets (7.18 performance rating). \n\nMeanwhile, Ruusuvuori got a solid first-round win as a sizable favorite over Lukas Neumayer, who tends to prefer clay courts (7.05 performance rating). There's no doubt that Emil enjoys these conditions as well, even if his game relies more on movement and clean ballstriking and less on power compared to Otto's. However, I can't quite say that he's had a breakthrough performance yet. A lot of people will rate the performance he put in against Mpetshi Perricard in Brussels highly, but it was kind of a lottery match in a way that a lot of GMP's matches tend to be. At the end of the day, I do think Virtanen's weapons should do more damage, and it's hard not to feel that he comes into this tournament with a bit more momentum. This isn't in 2-unit territory for me, but I would probably take it down to -145 or so. \n\nNote: The [POTD Capper Tracker](https://potd.lol), which you may remember from its Google Sheet days, is finally back in a cleaner, more robust website format! If you have any questions or suggestions regarding the site, feel free to reach out to either me or u/EthicalGambler.\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/major-couch-potato-xJXnQW?utm_source=mdembed&utm_campaign=major-couch-potato) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nncb9iu/"
    },
    {
      "created_utc": 1762390924.0,
      "author": "Certain-Challenge202",
      "text": "Record: 46-33. (+0.71 tracking from 3 picks ago)\n\nLast Pick: Under 2.5 goals. Preston v Swansea\n\nToday’s Pick: Crystal Palace vs AZ. Under 3.5 goals. \n\nSport: Football, Europa Conference  \n\nReasoning: Both teams have struggled for offensive output in the Conference League, with Palace averaging just 1.5 total goals per game across their two matches and AZ at 2.5, largely inflated by a single 4-0 defeat. AZ’s poor European away record, scoring only 0.5 goals for on average, suggests a cautious, low-scoring encounter.\n\nOdds: 1/2\n\nUnits: 3-4",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nnca2l0/"
    },
    {
      "created_utc": 1762389710.0,
      "author": "dreamchasing1",
      "text": "Record: 221-206 Net Units: -20.39 46-49 on 1.5u plays, 36-38 on 2u plays, 1-2 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [AFC Champions League] Johor DT vs Shanghai Shenhua\nLast pick: Asian total corners over 9.5 @ 2.00 win\n\n\nEvent: Soccer/Football, [Conference League] Samsunspor vs Hamrun\n\n\nPick: Asian total corners over 9.0 @ 1.85 - 1.5 Units. This pick is a Push if exactly 9 corners.\n\n\nSo far both sides have cleared this line in all conference league group games - 10 for Samsunspor twice and 10, 12 for Hamrun. Both sides played qualifying games to get to this tournament - Samsunspor played two games vs Panathinaikos, covering in both with 10, 11, Hamrun played 8 qualifying games, covering this line in 6, pushed in the other two with 9 total corners. In the domestic league, both sides generate a good amount too - Samsunspor are currently one of the best corner generating teams with 6 for and 11.30 total so far, Hamrun averaging close to 10 total in Malta.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nnc6l44/"
    },
    {
      "created_utc": 1762389697.0,
      "author": "Square-Johnson",
      "text": "Record: 9-4 +6.44u\n\nForm: 💰❌💰❌💰💰💰💰💰💰💰❌❌\n\nRecent pick: Tom Ford to WIN vs Daniel Wells -178 for 2.7u to win 1.51u\n\nRecap: what an absolute SHITTER!! Tom Ford was genuinely a stronger player and “casually” put together 3 frames before he was beat 6-3. Idk what was up his ass but Daniel Wells honestly played solid and best Ford with no real resistance. WE MOVE ON\n\nEvent: Snooker International Championship @ 630AM est\n\nUNDERDOG ALERT\nPick: Zak Surety to WIN vs Stephen Macguire @ +130 for 1.7u to win 2.21u on FD\n\nYeah, this one’s got a bit of upset potential written all over it. Surety’s been quietly putting together some really tidy stuff lately…that semi…final run at the World Open, his Crucible debut, and his recent victory over 6-3 victory over Neil Robertson… in the match today Surety won all his frame with DECIDING BREAKS. This shows he’s striking the ball sweetly and building confidence frame by frame. He’s knocking in tons more centuries than before, looks calm under pressure, and has won every deciding frame he’s played this season. That tells you he’s not just potting well but he’s holding his nerve when it really matters.\n\nMaguire’s always dangerous, but he’s still a bit hit-and-miss right now. To put a little psychological aspect, coming from a non-professional, HE SHAVED HIS FUCKING HEAD MID TOURNAMENT….Sure, he lifted the Championship League earlier this year, but in the longer format knockouts he hasn’t quite looked settled. In his match today vs Jiang Jun, if he was presented with every opportunity under the sun by Jun he wouldn’t have won. His cue changes and patchy form can open the door, and if Zak gets in early and finds his rhythm, he could easily dictate the pace. With the form he’s carrying, the heavier scoring, and that bit of confidence swagger, Surety’s got every chance to nick this one. \n\nFade if you’d like, since I believe I’m 1-3 with snooker picks but I believe this is the one I get back on track.\n\nLOW unit bet since he’s an underdog but 1.7U to win to win 2.2U seems like a solid look with lower risk.\n\nAs always BOL and believe everything you see",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nnc6ju7/"
    },
    {
      "created_utc": 1762389231.0,
      "author": "Yankscot",
      "text": "Record: 1-0 \n\nNet Units: +2.6 \n\nFootball | UEFA Europa League | 07 November | 20:00 GMT \n\nPick: Stuttgart vs Feyenoord Both Teams To Score at 1.60 odds. 2u bet. \n\nWrite up: (BTTS is Both Teams To Score) Heading to the MHPArena for Stuttgart vs Feyenoord I'm liking the look of the BTTS. Both teams are off to a rough start in Europe with Stuttgart sitting 29th and Feyenoord in 25th. Taking a look back at Feyenoord and their recent away games in Europe 12 out of 14 games have seen BTTS and with Stuttgart yet to blank at home this season I think the BTTS could be right on for us. Feyenoord are also in good scoring form, they've scored 18 goals in their last five games, Stuttgart have scored 8 in five. I expect to see goals here with both teams finding the back of the net, Stuttgart and Feyenoord are also playing well in their domestic leagues, both clubs could do with a win here in Europe so they'll be right up for it.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nnc56y7/"
    },
    {
      "created_utc": 1762388804.0,
      "author": "fadedcrescent",
      "text": "Record: 0-0\n\nNCAAB | Wright St. vs California | 10:00pm EST \n\n**Pick:** California vs Wright St. **Total O152.5** (-115) 1U\n\nWrite Up: California are coming off of a 27 point thrashing where they put up 87 points to kick their season off. On that same note, Wright St. are also having a hot start to their season coming off of a whooping 49 point win over Franklin. With a 1-0 record putting up 86 points in their last game I do not expect that to stop. Wright St. on the road last season, albeit having an abysmal record, put up an average of 73.6pts a game. Cal last season put up an average of 80.47 points at home. While at home last season Cal let up an average of 75.9PPG to their opponents. I expect this to be a high scoring game with Cal coming out on top by a decent margin. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nnc3xuu/"
    },
    {
      "created_utc": 1762388576.0,
      "author": "Pefkov",
      "text": "**Record:** 9-5\n\n**Net Units:** \\+3.13\n\n**Last Pick:**   Jacoby Brissett 250+ passing yards (-103 on DK) 1U to win .97U ✅\n\n**Todays Event**: 🏈 NFL Thursday Night Football Raiders @ Broncos 7:15pm CST 🏈\n\n**Todays pick**: Troy Franklin Any Time TD Scorer (+170 on DK) 1u to win 1.7u\n\n**Writeup:** Going a little riskier today. Franklin is top five in red zone targets throughout the league, and gets the most end zone targets on his team. He has high usage for bigger plays and is trusted to get the job done. This can be seen as he shares nearly 20% of his teams targets.  Franklin has been averaging 4.1 receptions and 7.1 targets, of which around 20% of his overall targets have been within the redzone\n\nRaiders are ranked 17th in red zone defense and 23rd in overall scoring defense. With the Broncos projected to score around 27 points, with 3 touchdowns. More so, Raiders give up the 10th most passing td's to the slot, Guess who's the main star for being the broncos slot WR? Two other teams on the top 5 passing td's to the slot also include the Cowboys and Giants, who Franklin scored against twice and once respectively. With a favorable matchup into the Raiders defense, there'll be more than a few chances for Franklin to be the one to bring one of em in.\n\nBroncos are coming off a game against the Texans who have one of if not the best defenses in the league. Going into an Thursday night divisional game, I'm sure the Broncos will try to get the ball rolling real quick leading to some early TDs.\n\nBOL to anyone tailing!\n\n[Tips Greatly Appreciated  ☕](https://buymeacoffee.com/pefpef)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nnc39mt/"
    },
    {
      "created_utc": 1762388258.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1opk2mz/pick_of_the_day_11625_thursday/nnc2bye/"
    }
  ]
}