{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/16/25 (Sunday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/",
  "target_date": "2025-11-16",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-16T21:19:07.698406+00:00",
  "comments": [
    {
      "created_utc": 1763327536.0,
      "author": "NoFilterD",
      "text": "**54-29 +4785.92 +47 units**\n\nlast pick Carolina -3 L\n\nHad to take a Monday and Thursday off just to reset but back with a night play!\n\nNFL Pick St Brown 5.5 receptions+ Saquon Barkley 49.5 rush yds -150 3 units $300 to win $500 \n\nThis night game should be a great contest between the Eagles and Lions. Love both playmakers for their teams on a slightly lower less sweat lines. \n\nSaquon against a very good packers defensive front was able to grab 60 rush yd with 22 carries and the week before he ripped off 150 on the Giants. Lions are not bad on defense but the packers have a better rush defense and he was still able to go over 50. I like Barkley to get over 50 easily and sweat free.\n\n\nSt Brown despite double teams is just a beast and has been making receptions I didn’t think he would be able to! He’s 5th in the league with rec yds and 4th in receptions.  St brown finished with 5 receptions last game against their division rivals but went over 6 receptions in 4/5 of the last games and against eagles I expect them to use a healthy dose of St Brown and Gibbs. BOL EVERYBODY!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np7jdk2/"
    },
    {
      "created_utc": 1763327377.0,
      "author": "ShagRapt",
      "text": "Record 2-2 (+0.51u) Streak- 2 Losses\n\nLast P.O.T.D.- (11/7/25) NBA - R. ROLLINS (Bucks) o2.5asts.+ Den. NUGGETS HT/FT winner + Z. LAVINE (Kings) o14.5pts - LOSS\n\nRecap: Way too over-zealous on this one,  considering that I already had played the classic \"sucker's bet\" of a parlay & (essentially) added a 4th leg with the Nuggets to win HT/FT double requirement & yet, it went swimmingly with R. Rollins having the 3 asts. in the 1st & the undefeated (at home) Nuggets leading wire to wire vs the Golden State Warriors without Steph Curry & only having a clearly hurt & at half-speed Jimmy Butler.  IF I hadn't  commited one of the cardinal sins of smart or \"sharp\" betting by taking the prop line of a player who was in their first game back after missing action due to injury (or even just possible injury but I figured that with all test results negative, 4 days rest & a 23.5ppg season avg. (so far), that surely Z.Lavine could get us o14 5pts vs a team he just hit 25 points on a week before. However, after 26 minutes (which is about 10 to 12 minutes short of what he normally plays), he was pulled due to the Kings realistically standing new chance of winning the game. This, I lose & move on.\n\nTODAY'S P.O.T.D. - PJ. HARVEY TO SCORE ANYTIME TD +  9+ RUSH ATTS + OVER 2.5 RECEPTIONS (+185, HARD ROCK BET).\n\nBET AMOUNT: 1 UNIT\n\nREASONING/PROJECTED ANALYSIS - Being that it is a link parlay, I'm going to keep this simple and just say that with JK Dobbins out, and him unquestionably being Denver's rushing workhorse, there is no doubt that Harvey who is more than capable will be filling his role. Add to that, that Harvey is already the most targeted Denver Bronco when it comes to TD passes & since he already has 6TD's this season playing just 30% of their plays, I figure the TD longshot is worth it on this dual-threat rushing/receiving running back who has already caught over 2.5 passes in each of the last 3 weeks with his targets increasing weekly & him catching 4 passes along with 1 TD last week now being without the player who had been on field for  70% of the snaps. Lastly, the overnight rushes is pretty much a gimme, as well.\n\nNow, let's go cash this shyte out!!!\n\nhttps://preview.redd.it/mlkuuh2mpo1g1.png?width=925&format=png&auto=webp&s=a954c5f745324af50cab737f1a1f942c836844d8",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np7iv7s/"
    },
    {
      "created_utc": 1763323247.0,
      "author": "Odd-Management3756",
      "text": "Lost a 12 team parley cuz Josh Jacob’s got hurt smfh",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np75cvi/"
    },
    {
      "created_utc": 1763320421.0,
      "author": "MWMM93",
      "text": "**POTD Record 45-41-2**\n\nFuck me. 3 straight losers, and the unfortunate part is none of them were even close. I am way off target right now, however also very aware of how the NBA season goes. I think I started off okay, because the books weren’t adjusting to the new season, however now they seem to have caught up. Re-evaluating my strategy going forward, and hopefully we can get back to winning.\n\nTodays game is fucking gross, but those games are usually my favorite ones.\n\n**Wiz -2.5**\n\nBoth Washington and Brooklyn have been money-losers for bettors so far this season. The Wizards are just 2–10 ATS including 0–6 ATS at home in their last six in D.C. The Nets have fared only slightly better at 4–7–1 ATS and they are 1–4 ATS in the last five head-to-head meetings against Washington. In short, neither team has inspired confidence against the spread and SU up both of these teams are a horrific, 1-11. This is a battle of the bottom if I have ever seen one.\n\nIn terms of style, Brooklyn lives and dies by the three-pointer to an extent. Nearly 48% of the Nets’ shot attempts are threes (one of the highest 3PT rates in the league). The downside, they are hitting only about 33% from beyond the arc. A mediocre rate that has hurt their scoring efficiency. The Wizards are more balanced, taking ~39% of their shots from deep and they’ve actually shot the three better (37% 3PT) so far. Washington’s overall shooting efficiency (53.3% effective field goal rate) is slightly higher than Brooklyn’s (51.4% eFG%). The Wizards also generate a bit more inside scoring (57 points in the paint per game vs. 47 for Brooklyn), often through transition layups or finishes by their bigs. However, Washington’s offensive weaknesses include turnovers and a lack of free throws. They cough the ball up on 14.8% of possessions, one of the higher turnover rates, and have a low free-throw attempt rate (only 18.6% of plays result in a foul shot). By contrast, Brooklyn takes slightly better care of the ball (13.4% turnover rate) and gets to the line more often (23.2% FTA/play). This means the Nets can manufacture some extra points at the stripe an important factor given their shooting woes.\n\nIf the offenses are subpar, the defenses are outright dreadful for both teams. Like I mentioned above Washington is allowing an eye-popping 130 points per game, dead last in the NBA Brooklyn isn’t far behind, surrendering 123.3 PPG (28th). In pace-adjusted terms, Brooklyn’s defense has actually been worse: the Nets have a Defensive Rating of roughly 122.6 (meaning opponents score about 122.6 points per 100 possessions against them), while the Wizards’ Defensive Rating is about 119.1. Both marks rank at or near the bottom of the league. Essentially, these teams make even average offenses look like the Showtime Lakers.\n\nOne glaring issue for both is rebounding. Brooklyn ranks last in the NBA in rebound rate, they average only 38.4 rebounds, partly because they give up a ton of offensive boards. Opponents grab 31.9% of available offensive rebounds against the Nets an extremely high figure reflecting Brooklyn’s inability to clear the glass. Washington is also below-average, allowing a 29.6% offensive rebound rate to opponents. This means second-chance points are frequently conceded by both squads. Notably, Washington is at least a better rebounding team on their own misses – the Wizards secure 22.8% of offensive rebounds, while the Nets actually do well here at 26.5% (Brooklyn crashes the glass on offense). The net effect is we might see plenty of put-back opportunities on both ends in this game.\n\nWashington’s ultra-fast pace has been a double-edged sword. While it gives their offense more possessions (allowing them to score a modest 113.5 per game despite low efficiency), it also means their poor defense is exposed to more possessions hence the bloated 129.7 points allowed nightly. Brooklyn’s slower pace means they haven’t been lit up for 140+ as often, but their defensive efficiency is arguably even worse on a per-possession basis.\n\nWashington’s games have been track meets with huge scores on both sides, while Brooklyn’s games have been somewhat lower-scoring but still generally losses by double digits. Season-long data is the stronger indicator here small upticks aside, the Wizards remain an offense-first, no-defense team, and the Nets a low-octane team that also struggles to get stops.\n\nWhen it comes to the players on these teams, I really am focusing on Sarr, as he is the key to this game covering IMO. He has been electric this season on both sides of the ball even with Wash awful start, he is a bright side. I think the matchup between him and Claxton will decide this game, and I’m leaning toward sarr getting buckets, rebounding and keeping Nic in check.\n\nWith Cam out, the nets will rely heavily on MPJ to produce and as talented as he is, that is not a consistent formula, as he is one of the more up and down players in the league. Wash also has vets, and guys who can make shots, while BKN is full players who you can’t expect to do so. \n\nIt’s worth considering the psychological aspect. Both teams are in prolonged slumps. Washington, on a 10-game slide, will be extremely hungry to finally get a win, especially at home and against a team that is arguably the only one as struggling as they are. We could see the Wizards come out with playoff-level intensity in the first quarter, knowing this is a golden chance to break the streak. On the other hand, sometimes long losing streaks create tightness, and if the game is close in the fourth quarter, will Washington execute or will the weight of those 10 straight losses cause mistakes? Im betting that they do.\n\nOverall this game is fucking disgusting, but when I look at these rosters, and analyze this game, I just lean towards Washington heavy due to their talent from top to bottom. I think both teams play awful, and 2.5, the home crowd, and the better roster just scream to bet this. Again, I have to say this will be ugly. Make the bet, watch some football, and check the account later on for the winnings.\n\nPS: Houston -7.5 is easy money. Orlando is falling apart and may be the team from hell this season, while Houston continues to prove that they are in the top of the league this season.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np6vyh1/"
    },
    {
      "created_utc": 1763317330.0,
      "author": "Viken03",
      "text": "Record: 15-8 | Units: (+1.18) | \n\nLast pick: Both Teams to Score & Over 2.5 Goals – Paris FC vs Rennes ❌\n\n⸻\n\n📈 Pick of the Day\n\n🌍 World Cup Qualifier – Italy vs Norway\n\nBet: Erling Haaland to Score Anytime ⚽🔥\nOdds: 2.15\nUnits: 1 (standard)\n\nReasoning:\nHaaland shows up in the big moments, and Norway’s entire attacking structure runs through him — especially in crucial qualifiers. Italy’s defense is strong at home but not flawless; they’ve conceded chances against physical No. 9s, and Haaland thrives on exactly those matchups.\n\nWith Norway fighting for points and Haaland in form from club play, he should get the opportunities he needs. One clean look inside the box is all it takes.\n\nLet’s get back on the board and keep the profit rolling. 💥⚽\n\nPick: Haaland Anytime Scorer\nOdds: 2.15 | Units: 1\n\nBOL! 🍀💪",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np6lcdi/"
    },
    {
      "created_utc": 1763316030.0,
      "author": "PatientDig9022",
      "text": "Record 7-3 + 4.56 units\n\nLast pick cavs -4.5 + okc -8.5✅\n\nTodays pick Joe flacco 219+ passing yards + Jamarr chase 79+ receiving yards @ -125\n\nBet 1 unit to win 0.80 units \n\nWhat’s there to say. Old Joe flacco vs Aaron rogers for the second time. These boys don’t run they throw. It should be another battle like last time.  He’s over this line last 4/5 games threw 342 vs the Steelers last game. His # 1 receiver is chase. That’s the secret sauce get this man the ball. He’s over his line 5/5 last games with ease. Had 161 vs the Steelers. It should be a very similar game to the one they had already. I could say a lot more but what’s the point.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np6gygb/"
    },
    {
      "created_utc": 1763315355.0,
      "author": "BustyLocks29",
      "text": "**Record: 1-0**\n\n**Net Units: +4u**\n\n**ROI: 100%**\n\n**Last Pick:** Purdue +3.5 (4.6u to win 4u)\n\n**American Football** | **NFL** | **1:00pm** / **EST**\n\n**Pick:** Vikings ML (-148 DK) 2u to win \\~1.35u\n\n**Write Up:** Keeping this short since game is about to start. Vikings good defense and they are hungry for a win. Bears on the other hand are hot, they have been winning a lot of close games and I do not see them keeping this up. I see JJ McCarthy getting into rhythm against an okay Bears defense. I also see the Vikings defense doing a good job on Caleb Williams with the pressure. Let's get another win after cashing our 4u mega max lock",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np6er1v/"
    },
    {
      "created_utc": 1763312109.0,
      "author": "SoggyDatabase2348",
      "text": "***POTD Record: 5-1 (+15.27$)***\n\n*Last POTD: Alabama ML + Capitals/Devils U8.5 X*\n\n***POTD: Kareem Hunt 40+ Rushing Yards***\n\n*Write up: Hunt will see a majority of the touches today. Denver has a very big pass rush which will force KC to run the ball to help with the pass rush. In order for the Chiefs to win this game on the road, they will have to pass, so I expect them to establish a run game to open up with game for Mahomes.* \n\n* *Chiefs need a win today; Hunt is averaging about 4.0 YPC*\n* *Against the Bills, which was a close game for a majority of the game, he touched the ball 11 times for 49 yards - I believe the game script will be the same here, will be a close game throughout, and I think he gets 10-15 touches this afternoon*\n* *He is the clear number 1 back in early-downs*\n* *Broncos are top 10 in quarterback sacks, that being said, run the ball to stop the pass rush, more carries for Hunt*\n* *Denver games have gone under in almost 70% of their games this season, low scoring games, more sustained drives for both teams* \n* *Opponents RB's when facing off against the Broncos are averaging 15 rushing attempts per game* \n\n*Let's try and get back on track after the Alabama L yesterday. Enjoy the Sunday, eat some good finger foods, have a beer, and enjoy some football. GL everyone. Profit this week no matter win or lose on the Hunt play!* \n\n***Kareem Hunt 40+ Rushing Yards***\n\n*Tips are appreciated: proceeds will be going towards my student loans. (Received my first tip yesterday!! Thank you so much, I really appreciate it)*\n\nVenmo: u/claysmiith\n\nPayPal: u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np64e3f/"
    },
    {
      "created_utc": 1763311203.0,
      "author": "TheLocpickz",
      "text": "**Record:** 0-0\n\n**Net Units:** \\-\n\n**Last Pick:**  \\-\n\n**Todays Event**: Soccer/Football - Brazilian First Division/Brasileirão Série A - Red Bull Bragantino vs Atlético Mineiro - 5:00 PM ET\n\n**Todays pick**: Over 2.5 goals - 2u - @ 2.22\n\n**Writeup:** Since Sampaoli became Atlético's manager the team is playing very agressively with 10 goals scored and five conceded in the last three games. Bragantino is trying to fix their defensive issues in the last matches with its new coach Mancini, which may explain the odds being so high, nonetheless, 2 out of the 3 Mancini's matches as the Bragantino manager had more than 2.5 goals scored.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np61hyu/"
    },
    {
      "created_utc": 1763311026.0,
      "author": "Chronic_Doubt_526",
      "text": "Kincade out, Coleman out. Knox 3 catches 2.10 odds, Vegas knows something we don't",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np60xhq/"
    },
    {
      "created_utc": 1763309854.0,
      "author": "Flashy_Calendar3995",
      "text": "Record 3-4\n\n\n\n\nMinus 2 units\n\n\n\n\nNFL\n\n\n\n\nBengals vs Steelers \n\nPick Under 48.5 \n\nBet 2 units\n\nBased on the report, the Under 48.5 in the Bengals vs. Steelers game is a Tier-1 selection due to a severe mismatch between the market line and the game's powerful variables.1\n\nThere are three primary factors driving this conclusion:\n\nKey Personnel: The Bengals are without their starting quarterback, Joe Burrow, which is a major downgrade for their offense.4\n\nSevere Weather: The forecast in Pittsburgh calls for 15 mph sustained winds with gusts up to 30 mph.1 These 30 mph gusts are a \"major limiting factor\" that severely degrades passing offenses and makes the kicking game highly unreliable.\n\nOffensive Inefficiency: The Steelers' offense is already one of the league's worst, ranking 4th-worst in the NFL with just 280.7 yards per game.2\n\nThe report's model concludes that the combination of a backup quarterback (Cincinnati) facing a bottom-5 offense (Pittsburgh) in the middle of a 30 mph wind storm makes a 48.5-point total \"mathematically indefensible\".2 The expected game script is run-heavy, slow-paced, and filled with punts, pointing to a low-scoring game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np5x70f/"
    },
    {
      "created_utc": 1763308696.0,
      "author": "john_doe_774",
      "text": "Date: 11/16\nRecord: 9-5\nNet units: +2.79u\n\nPrevious pick: Zhang FTGTD / Islam fight over 2.5 rds ✅\nToday’s pick: AJ Brown over 59.5 rec yds -115\nEvent: NFL Lions vs Eagles\n\nFights both went the distance and cashed for us.\n\nI think this is going to be AJ Brown’s game and I’m laddering this up as well as hitting anytime td, but over his 60 yds is the POTD for me.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np5thvo/"
    },
    {
      "created_utc": 1763308524.0,
      "author": "oneilmatt",
      "text": "**Record:** 2-0\n\n**Previous Pick:** Nico Collins o64.5 receiving yards ✅️\n\n**Game:** NFL: Chargers @ Jaguars, 12pm CDT\n\n**POTD:** Jakobi Meyers o7.5 1Q receiving yards (-114 on FD) ✅️ \n\n**Rationale:**\n\nNot really much of a write-up on this one.\n\nThe Jaguars will be without BTJ, Brenton Strange, and Hunter Long this week, and Parker Washington left the game last week with a hamstring injury that prevented him from practicing in full this week.\n\nJakobi Meyers, after only a few days of practice and time with the play book, made an immediate impact last week, catching 3 passes for 41 yards. He would have had 4 receptions for 45 yards and a TD if not for a procedural penalty. When you consider that the Jaguars essentially did not throw the ball at all in the second half, these numbers look even better. With a full week of practice and more time to gel with Lawrence, I believe that Jakobi's role is going to grow significantly.\n\nI also believe that the Jaguars, after the humiliation ritual that was last week's loss, will come out throwing. Liam Coen said this week that he told TLaw to \"just let it rip\".\n\nGiven the routes that Jakobi has been running, the 7.5 line is essentially a single reception. I think he gets it early today.\n\n**Cashed in less than 4 minutes!** ✅️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np5sy5q/"
    },
    {
      "created_utc": 1763307764.0,
      "author": "Timely-Conclusion532",
      "text": "Record: 280-169\n\nForm: ❌❌✅✅✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅✅❌❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌❌❌❌✅✅❌✅✅✅❌✅✅✅✅❌✅✅❌ ❌❌❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌✅✅✅✅❌❌✅✅✅✅✅✅❌✅✅✅✅❌✅❌✅❌✅✅❌✅✅❌❌❌✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅✅✅❌✅✅❌✅✅❌✅✅❌❌✅❌✅✅❌❌❌❌❌✅✅✅✅✅❌✅✅✅❌✅❌✅❌❌✅❌✅❌✅❌✅✅✅✅✅✅❌✅❌✅❌✅✅✅❌❌✅❌✅❌❌❌✅✅✅✅❌❌✅❌❌✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅❌✅✅✅✅✅✅✅✅❌❌✅✅✅✅❌❌❌✅❌✅✅✅❌✅✅❌✅❌❌❌❌✅❌✅✅✅✅✅❌✅✅❌✅✅✅✅✅✅✅✅❌✅❌✅❌✅❌❌❌❌✅✅✅✅❌✅✅❌✅✅❌✅✅✅✅❌❌✅✅✅❌✅❌✅✅❌❌✅❌✅❌❌✅❌❌❌✅✅❌✅✅❌✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅❌✅✅✅✅✅❌❌✅✅✅❌❌❌❌❌❌✅❌✅✅✅✅✅✅✅✅❌✅❌❌❌✅❌✅✅❌✅❌❌✅❌✅✅✅❌✅✅❌✅❌✅ ✅❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅❌✅✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌✅❌✅✅✅❌✅❌❌❌✅✅❌❌✅✅✅❌❌✅❌✅❌✅❌❌✅❌❌❌❌✅✅✅✅✅✅\n\nNet Units: +7.95 units (All plays 1 unit)\n\nYesterday’s Pick: (NBA) Miles Bridges under 36.5 PRA + Julius Randle under 43.5 PRA (-187) ✅\n\n***POTD: (NFL) Ja’Marr Chase over 70+ receiving yards + Justin Jefferson over 40+ receiving yards (-183) (Alt Props)***\n\n\nReasoning: Today, I’m going with a couple of WR’s, arguably the best two WR’s in the game. Ja’Marr Chase is facing the 4th worst defense vs WR’s (Pittsburgh Steelers). Chase has cleared this line in 67% of his games this season and 100% H2H vs the Pittsburgh Steelers. For the other leg, Justin Jefferson is almost guaranteed to hit this line. JJetta has cleared this line in 89% of his games this season and is facing the 2nd worst defense vs WR’s (Chicago Bears). Nice win yesterday on a couple of unders making it 6 straight wins now. Lucky number 7 up next! 😤\n\n👇",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np5qkbn/"
    },
    {
      "created_utc": 1763307603.0,
      "author": "YGWYD",
      "text": "**SEASON RECORD:** 28-4-13 \n\nNet Units: (+6.41) \n\nPrevious Pick: Switzerland vs Sweden - Switzerland DNB/Slovenia vs Kosovo- Under 2.5 goals @ 1.80 ✅️ \n\n**Today's Pick:**  Albania vs England- England to win/Azerbaijan vs France - BTTS No @ 1.90 \n\n**TIME:** 6pm (BST) \n\n**Wager Amount**: 1.5 units \n\nLast 10 Matches (✅️❌️✅️❌️❌️✅️❌️❌️✅️✅️) \n\nThat Slovenia red card had me sweating a bit but another Acca hit and you know what i'm deciding to do accas this whole International break lol. \n\nEngland are on a 5 game winning streak, first to score in 10/10 consecutive matches and have won 3 of their last H2H matches against Albania without conceeding. \n\nFrance have all but qualified for the World Cup but still Dechamps will wanna test out some players which will be put to impress. France are undefeated in 6 matches, will Azerbaijan are winless in 15 matches and on a 3 game winning streak and France have had BTTS No hit in 3/5 matches and in their last H2H matches against Azerbaijan they won 3-0. BOL if you're tailing.\n\n\n\n[TipJar (PayPal) If you want to I'd highly appreciate it](https://www.paypal.com/donate/?hosted_button_id=2RRPJ4DNAKEYW)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np5q272/"
    },
    {
      "created_utc": 1763303712.0,
      "author": "ThatCherry7173",
      "text": "Record: 8-2\n\nNet units: + 6.44\n\nOdds: -192\n\nSport: American Football\n\nLeague: NFL\n\nTime: Packers 12:00 PM Central | Ravens 3:25 PM Central\n\nPick: Packers ML + Ravens ML\n\nBet 3 units to win 1.56 units\n\nWhy: Green Bay is walking into a matchup where the opponent is battered all over the roster and switching coaches mid-week, and that usually kills any momentum an already struggling team might have. Even with Green Bay’s recent issues on offense, they’re still the more complete group and should control the game just by avoiding mistakes. Baltimore feels even safer — they’ve finally settled back into their identity, and the opponent just hasn’t shown they can keep up for four quarters, especially with an offense that stalls whenever it faces a real defense. Add in the weather likely forcing a slow, grind-heavy game, and it plays directly into Baltimore’s strengths.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np5eo16/"
    },
    {
      "created_utc": 1763303543.0,
      "author": "1234unodostrescuatro",
      "text": "__Record: 14-6__\n\nForm (old to new): ❌✅✅✅❌✅✅✅✅✅❌✅✅✅❌❌✅❌✅\n\nLast pick: Daukaus ML & Machachev ML (-160)✅\n\nGame: KC@Den\n\n__Today’s pick: Chiefs -3 (-135)__\n\nAnalysis: The broncos terrible QB play and awful output every week but scraping by with a W ends today. Chiefs are in great form and I expect a beating",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np5e7bc/"
    },
    {
      "created_utc": 1763302497.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 5-1, +3.75u\n\n**Previous Pick:**: Oklahoma to win by 16 or more points, 1.89, 1u ❌️\n\n**Event:** NBA: Houston - Orlando \n\n**POTD:** Houston to score more than 11.5 threes in the game,  2.05, 1u\n\nRepeating the same play as 2 nights ago, and gonna keep repeating it until they catch up on it. Houston averages 13.4 threes per game, 14.7 in the last 3 games, and still has a limit set at 11.5. It opened with 10.5 for 1.64 odds, and I played that, too.\n\nOrlando, for example, has a limit set at 13.5, and they are 29th team with 10.9 threes scored per game.\n\nThis limit is probably due to the fact that Houston tries only 31.3, but that is also up in the last 4 games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np5be50/"
    },
    {
      "created_utc": 1763298974.0,
      "author": "bigtime-operator",
      "text": "Record: 53-44\n\n**Erlangen - Lemgo** 🤾 Handball Bundesliga ⌛in 1 Hour\n\nPick: Tim Suton Goals Over (4.5) @ 1.85\n\nThe team's leading scorer. He was named the HBL's \"Player of the Month\" for October; he carried the match with 31 goals during the month. Season average: 74 goals/11 games = 6.7 goals on 72.6% accuracy.\n\n34 goals in 5 away games; 6.8 per game.\n\nTim Suton's away games (as of November 15, 2025)\n\nSeptember 4, 2025 — SC DHfK Leipzig 29–34 TBV Lemgo Lippe: Suton 6 goals.\n\nSeptember 14, 2025 — HSG Wetzlar 21–26 TBV Lemgo Lippe: Suton 7 goals.\n\nSeptember 19, 2025 — HSV Hamburg 35–35 TBV Lemgo Lippe: Suton 6 goals.\n\nOctober 4, 2025 — GWD Minden 24–34 TBV Lemgo Lippe: 7 goals for the win.\n\nOctober 25, 2025 — MT Melsungen 28–22 TBV Lemgo Lippe: 8 goals for the win.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np52fyk/"
    },
    {
      "created_utc": 1763298855.0,
      "author": "CartPathCasher",
      "text": "**POTD Record:** 3-0 +7.92 units\n\n**ROI: 88%**.\n\n**Previous Pick:** [✅ ](https://www.reddit.com/r/sportsbook/s/ERcjDv6aT5)2 leg parlay Leg 1- **Davion Mitchell** \\- Points + Rebounds Over 9.5 Leg 2- **Tari Eason** \\- Rebounds Over 3.5 -108[u](https://www.reddit.com/r/sportsbook/s/ERcjDv6aT5)\n\n**Event:** NFL: Bengals @ Steelers 1pm EST/ Tampa Bay @ Bills 1pm EST\n\n**POTD:** Jaylen Warren over 70 alt rushing yards  + Khalil Shakir 30+ Yards-350 Khalil Shakir - Alt Receiving Yds -110 Fanduel \n\nRisk 3 units to win 2.73 units\n\n  \n**Write Up:** Power was out until early this Am so this will be a late post and short write up.\n\nThe Bengals have the worst run defense in the league and will be away this time against the Steelers. I see them taking advantage of the weak line and letting Warren get 13-16 touches. \n\nThe Bills have to win this after another embarrassing loss to a bottom team in the NFL. They will be at home and although Shakir has not been putting up crazy yardage he is averaging over 7 targets a game and is averaging 5 catches per game. I see him hitting 6 for 55 today easily in a must win game against the Buccaneers who also just came off a divisional loss. Both teams need a win and this will be a battle of who can make plays today.\n\nOnce again sorry for the late post and hope to hit 4-0 today.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np525ur/"
    },
    {
      "created_utc": 1763294506.0,
      "author": "Busy_Presentation463",
      "text": "Record: 4-0\n\nNet Units: +13.05U\n\nPrevious Pick: Ivica Zubac over 10.5 rebs (Won)\n\nInsane sweat, don't wanna talk about it but I would've crashed out if zubac couldnt get 2 rebounds in 10 mins of playing time\n\nPOTD: Lamar Jackson under 205.5 Pass YDS (-119) (Stake)\n\nEvent: Cleveland Browns vs Baltimore Ravens (NFL)\n\nBet 3U\n\nAnother NFL pick here and I always feel more confident with going with under on passing yds compared to overs I just don't know why but nonetheless great spot here as the main factor will be the winds as it is forecasted to have around 30mph in the arena which means a rush fest for jackson and henry.\n\nLamar did go over this line the last time they faced with 223 pass yds but after that domination and him only barely going over the line, yeh I'm confident Lamar won't hit this. Even if the winds don't arrive, ravens should take a very cautious approach as they can't afford to drop a game (even if its the cleveland \"WE'RE THE CLEVELAND BROWNS\" browns)\n\nIn all honesty I haven't really found a confident enough nba pick to share today and I didn't have time to post yesterday so I decided to crack into NFL once again\n\nThe last under on passing yards pick cashed in my POTD record so im running it back sorta.\n\nBest of luck, again not financial advice and always bet within bankroll limits and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np4t528/"
    },
    {
      "created_utc": 1763293230.0,
      "author": "OliveCritical5134",
      "text": "**Record: 20-13**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅✅✅✅❌❌\n\n**Sport:** ⚽ / World Cup Qualifiers - Group I / Italy v Norway\n\n**Net Units/ROI:** \\+24.43u / 29.43%\n\n**Previous Pick:** *Spain +6.5 Shots on Target + Giorgi Mamardashvili +3,5 saves @ 2.02 -- 3 units*❌\n\n**Summary:** Needed 1 more save.. So close once again like most of those misses on my record..\n\n**Today's Pick:** *Italy v Norway: over 2.5 goals @ 1.72 -- 2 units*\n\n**Write up:**\n\nI don't have much time today to do a full analysis on today's matches.\n\n**Italy v Norway (19.45 GMT)**  \nItaly's games against teams similar to Norway have been highscoring. Norway has been in form lately and have plenty of players that can score. Norway v Estonia earlier this week ended in 4-1. Moldavia v Italy earlier this week ended in 2-0 to Italy.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np4qsm1/"
    },
    {
      "created_utc": 1763292953.0,
      "author": "Vet100",
      "text": "Record: 15-10\n\nNet Units: +3.46\n\nROI: 13.9% \n\nPick: NBA Spurs v Kings \n\n1U Wembanyama O5.5 1Q P @ $1.90, B365 \n\nWrite-Up: Taking this even though Wemby can be a streaky on his FG’s just because I love his match-up v Sabonis. If anything I probably preferred Castle assists again initially - but it ended up as much a Sabonis fade as it is a Wemby pick. \n\nHe has only hit this line 4 times this year but is averaging around 8 minutes in 1st quarters. Averaging 3.7 field goal attempts. The usage is there - he just needs to get to the paint early and not just take 3’s. \n\nHad 34 in both games v Sabonis last year, with 8 & 5 in 1st quarters, but I prefer the 1Q line as I think the Kings are a blow-out risk -  the Spurs are a bit inconsistent within games but the Kings likely won’t have a Curry type performance to keep them in it (and ultimately win) unless LaVine has one of his random 40 piece games. \n\nIn terms of the Kings - 2nd worse for 2 points FG defence % at 61%. Wemby takes 13.6 2 pt FG’s a game this season, @ 55.9%, so thinking he can push this number higher tomorrow against a weak defensive side. Equal 4th worst for points conceded in the paint per game (55.2). 4th highest opponent points conceded in 1st quarters (averaging 32.5). Sabonis averages 4.2 fouls a game, had 5 in both match-ups last year v Wemby; so a good chance of FT’s. Combined I think Wemby darts to the rim early and should get an easy baskets with a solid chance of an and-1 or just free throws.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np4qaui/"
    },
    {
      "created_utc": 1763290045.0,
      "author": "Hsil18",
      "text": "POTD RECORD: 27-7\n\nPOTD TOTAL RETURNS: +28.21 Units 🤑\n\nLAST PICK: Ireland -9.5 v Australia (2U) ✅\n\nTODAYS FIXTURE: SCOTLAND V ARGENTINA (Rugby - 15:10UK / 10:10am EST)\n\nPICK: Scotland -3.5 @ 2.0 (2U)❌🥲\n\nWRITE UP: \n\nAnother routine winner yesterday. Ireland led from the first whistle pretty much and pulled away towards the back end winning by 20+ and scoring their most points against Australia in history.\n\n\nToday’s pick looks good value to me. Argentina are a strong side and can definitely run Scotland close, but I didn’t think they would have the line set at 3.5 points. \n\nScotland are arguably the up and coming force in European rugby and if not for an awful start against NZ last week would have won.\n\nI believe they get the job done at home and probably win the game by around 10 points.\n\nI know a few of you appreciate my posts and they do generate a good return. Please find my paypal link here and appreciate any tip: \n\nhttps://paypal.me/PaymePlease9937\n\nBOL to those tailing as always 🫡🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np4ledo/"
    },
    {
      "created_utc": 1763283791.0,
      "author": "medandfooty",
      "text": "Record: 0-0\n\nNet Units: -\n\nPoland II Liga (Soccer) - 17:00 EET\n\n\nPick: Unia Skierniewice to win at home against KKS Kalisz + Under 3,5 goals: 3u 2.45 odds\n\nWrite-Up: First time posting, my bookmaker had the ML a couple of hours ago at 1.67 but now I already see it’s been dropping. It’s essentially the leaders of the III polish division against the 16th team that is struggling. Unia has been winning a lot over the last few weeks building up momentum up to this game which they should win. They also have been dominant at home and have pulled off many 1/1’s meaning when they take the lead early they are likely to keep it till the end. KKS Kalisz are struggling with taking points but they are putting up a fight in most games, thats evident from the many unders in their last games. They have a great defence (22 goals conceded in 16 games) which is by far the best in the lower half of the league and joint 5th best out of all 18 teams.  In comparison, 1st place Unia have conceded 18 in total. Therefore I dont think the game will be a disaster for Kalisz, by any means I think Unia will pull through but I find the value of Under 3,5 goals to be convincing. Im not willing to add Unia to win both halfs but I suggest you look into it if you want (the odds then reach 3.95). If I had to make a correct score guess I would be 2-0. Thank you for anyone taking their time to read my post! BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np4b859/"
    },
    {
      "created_utc": 1763282175.0,
      "author": "ConversationAware836",
      "text": "**Record: 3-4 all-time**\n\n**Last Pick:** Its been awhile \n\n**Current POTD: De’Von Achane o81.5 rushing yards -112 (FanDuel)** \n\n**Wager:** 3u to win 2.68u\n\n**NFL Football - Washington Commanders @ Miami Dolphins - Time:** 9:31am EST\n\n**Write-Up:** Long hiatus - but I am coming **back with a vengeance**. So here we have another nice international game to wake up hungover to, this time the teams take the gridiron in MADRID, Spain at a wonderful 9:31am start time (EST). 🇪🇸 \n\nAnd let me tell you something - it might be early in the morning, but this guy Achane will wake up to play. This year **he averages 78 rush yards/game** and is an absolute baller for the Dolphins. \n\nWhy will Achane go over this total you ask? Well I’m quite glad you did. Let’s look at the Commanders last 5 games against running backs: \n\n* **Week 10 vs. Lions**: Gibbs 15 car 142 yds, Montgomery 15 car 75 yds\n* **Week 9 vs. Seahawks**: Walker III 11 car 42 yds, Charbonnet 8 car 22 yds \n* **Week 8 vs. Chiefs**: Pacheco 12 car 58 yds, Hunt 9 car 40 yds\n* **Week 7 vs. Cowboys**: Williams 19 car 116 yds, Blue 7 car 29 yds\n* **Week 6 vs. Bears**: Swift 14 car 108 yds, Monangai 5 car 19 yds\n\nIn short, the Commanders defense is bum hole. A real swiss cheese run defense if you will. For you communications majors out there, that’s 651 total rush yards given up to running backs playing against WAS in the last 5 games. Which averages to about 130.2 rush yds/game (just from RBs). Achane has little to no backup RB competition (unless you count ollie gordon II?) - so I think he will clear this line easily.  \n\nWe just saw Jonathan Taylor erupt like a goddamn volcano last week on the international stage (which ass fucked my fantasy team, mind you), and I think Achane rips apart a shotty commanders rush defense this week. They Dolphins will likely be playing from ahead too, Mariota is garbäge. \n\nSee u at the cash counter 🥸",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np48j10/"
    },
    {
      "created_utc": 1763281900.0,
      "author": "mistarlupo",
      "text": "POTD Record: 180.5 wins / 111 losses\n\nFootball > World Cup Qual > **Israel v Moldova** (starting in 11h)\n\nPick: **Over 2.5 goals** @ 1.70\n\nBoth teams play for nothing at this point, so no reason for defensive game here. Moldova is missing some key defenders due to inquires. Match played in Moldova for security reasons. GL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np482qk/"
    },
    {
      "created_utc": 1763278196.0,
      "author": "this_guy9",
      "text": "**POTD Record:** 4-3\n\n**Net Units:** \\+0.86\n\n**Previous Pick:** [🪝 Donovan Mitchell o5.5 Assists -125](https://www.reddit.com/r/sportsbook/comments/1oxaz8v/comment/noxrnof/?context=3)\n\nThese hooks really starting to get to me. We're due for some good luck.\n\n**🏀 Nic Claxton o1.5 Blocks +108** vs the Washington Wizards\n\nGoing for a pure numbers play to make it back with a plus money play.\n\nThe Wizards are playing at the third fastest pace in the NBA, and incredibly sloppy with it. They rank 29th in the league in getting blocked and 27th in allowing blocks to centers.\n\nClaxton has owned this matchup. He has cashed in L6/6 vs the Wizards, 4/6 of them in 30 minutes or under. He has also cashed this line in 4 of the last 5 games.\n\nAlways some variance with low line props but I'm 100% trusting the numbers here.\n\nFull Stats if you'd like to do additional research: [https://www.statpick.ai/54316701/nic-claxton-blocks](https://www.statpick.ai/54316701/nic-claxton-blocks)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np41v39/"
    },
    {
      "created_utc": 1763278187.0,
      "author": "Ralphjinasseater",
      "text": "Record 4-4 POTD.LOL - Tracking Handicappers\n\nLast pick: lamelo ball UNDER 17.5 Points (-122 FD) 🟰\n\nCategory:🏀⛹️basketball\n\n🔒 Pick of the Day: Desmond Bane UNDER 18.5 Points + Houston Rockets Moneyline (Parlay) Bet Sizing: 1.5 Units | Odds: +210\n\n🎯 Leg 1: Desmond Bane UNDER 18.5 Points The market is overvaluing Bane's scoring role in Orlando, especially without Paolo Banchero. Houston's elite defense is the perfect antidote to his inflated usage.\n\n* The Usage Trap: With Banchero out due to a groin injury, Bane's role is expanded, but it's leading to inefficient scoring. He may be averaging 15.5 PPG this season (with Banchero), but he has historically proven he can scale up (e.g., 24.6 PPG during Morant's 2024 suspension).\n* Historical Skew: Bane's career average of 20.8 PPG versus Houston is misleading, inflated by high-volume outliers from earlier seasons. His more recent matchups against current Houston schemes are closer to the UNDER (e.g., 17 points in the 10/25/24 contest).\n* Houston's Wall (Rank 4th vs. SG): The Rockets boast the 4th-ranked defense against Shooting Guards, limiting the position to just 16.8 PPG. Orlando's road offense is already stagnant (24th-ranked, 112.3 PPG), forcing Bane into his least efficient areas.\n* Amen Thompson Factor: Houston's DPOY runner-up, Amen Thompson, is an elite perimeter stopper. The shot chart shows Bane's mid-range efficiency craters against HOU's scheme (a clear -.194 efficiency in the zone). Expect Thompson to limit Bane to a projected 14-15 FGA and an estimated 15.8 points. 🚀 Leg 2: Houston Rockets Moneyline (ML) high-confidence outcome that offers fantastic value as the parlay's anchor.\n* Elite Home Advantage: The Rockets are dominating at home with a 7-2 ATS record against a tired, injured opponent.\n* Magic on Fumes: Orlando is playing a back-to-back road game as an injured squad (Banchero and Moritz Wagner are out). Their team-wide shooting efficiency ranks 18th league-wide, a poor match for Houston's top-6 pace-adjusted defense.\n* Prediction: Models project a comfortable 115-105 Rockets win (68% win probability). With their interior defense and efficient offense, they handle business easily. 💥 Final Edge: Injury-Driven Inefficiency Bane’s increase in usage is being absorbed inefficiently by the other Magic players. With Banchero and Wagner both out, the Rockets know exactly where the offensive gravity lies—on Bane and Franz Wagner. Houston's focused, elite defensive scheme, led by Thompson, will not allow Bane to shoulder the scoring burden against their 4th-ranked SG defense, making the over/under line of 18.5 a severe overestimation of his scoring potential in this specific matchup.\n\nhttps://preview.redd.it/fon9v2xank1g1.jpeg?width=2388&format=pjpg&auto=webp&s=2ea1f20137c242dfaaf02b2392ccffb4edeacd46",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np41uir/"
    },
    {
      "created_utc": 1763277029.0,
      "author": "Dear_Yogurtcloset662",
      "text": "2024-25 NBA POTD RECORD: 14-15-1\n\nNet units (24/25): -9.79\n\n2025-26 NBA POTD RECORD: 0-1-0\n\nLast POTD (24/25): Kon Knueppel rebounds O 5.5 (-120 on DK) @ 4 units ❌\n\nNet units (25/26): -4\n\n**Today's POTD:**\n\nEvent: NBA 🏀| Brooklyn at Washington 3:00 PT\n\nCJ McCollum points O 17.5 (-113 on DK) @ 5 units\n\n![gif](giphy|gCfHsvAQHtdcs)\n\nDamnit Kon, picked a hell of a time to break the rebound pattern. I suck at this. Evened out with some other Knicks bets (thanks Josh Hart!) but still hate to lose my first POTD of the year.\n\nSo with that in mind, here's one more attempt.\n\nCJ has been playing well for his new team so far this year. Though his scoring average (16.3 ppg) isn't spectacular, he has shown an ability to go off against certain opponents, scoring 42 points just a few days ago against Detroit. \n\nHis low-scoring games have largely occurred when minutes were limited due to a blow-out, against very strong defensive teams, on road games, and/or when starting at the 1.\n\nHere we have a spot in which the teams are fairly evenly matched, WAS is playing at home, CJ is starting as SG, and their opponent (Brooklyn) is dead last in terms of overall defensive rating. Their defense against the SG position in particular isn't quite as terrible, but still ranked 9th worst.\n\nCJ's last game was also crappy scoring-wise, so there is potential for a bounce-back. Plus he and the Wiz will be coming off of 3 days rest.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np3zvqh/"
    },
    {
      "created_utc": 1763275609.0,
      "author": "Flashy-Literature423",
      "text": "Record: 9-5-1\n\nUnits: +10.49u\n\nLast 10: ✅-❌-❌-✅-❌-❌-✅-❌-✅-✅\n\nLast Pick: [Scottie Barnes Over 30.5 PRA (-120) Bet 3u to Win 2.5u](https://www.reddit.com/r/sportsbook/s/wsendCP6Ge)✅\n\nBarnes was quiet on offense but his reb+ast numbers bailed us out on his last play transition layup in which coach then pulled him and the rest of the starters out on a blowout route.\n\nLA Clippers @ BOS Celtics | 3:30PM EST\n\nNext Pick: **Ivica Zubac Over 10.5 Reb** (-115) Bet 2u to Win 1.74u\n\nCeltics are one of the worst defensive rebounding teams in the NBA this season, ranking 25th and allowing opponents a high volume of rebounds off the glass.\n\nThey often deploy smaller, more perimeter oriented lineups which further escalates their rebounding vulnerabilities.\n\nZubac is currently averaging right at this line (10.5 reb) per game, with a (reb per 36 mins rate) of about 13.2, showing strong consistency.\n\n**Last season when playing 30+ mins, Zubac went over 10.5 rebs in 78% of games, averaging 13.3 rebounds in those outings.**\n\nWith a 4.5 pt spread bookies are suggesting a competitive matchup where we can see Zubac log 30+ mins here again, **his rebounding numbers tend to spike when the game remains close.**\n\nZubac’s consistent rebounding particularly against this Celtics weak defensive rebounding paired with an expected  30+ min outting makes the over 10.5 reb a decent play here.\n\nIf tailing, only risk what you can afford to lose. Best of luck family!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np3xd9p/"
    },
    {
      "created_utc": 1763270769.0,
      "author": "strugeon7",
      "text": "POTD Record: 1-0\nNFL Record: 1-0\n\nPrevious Pick: 1H under 23.5 points (Jets vs. Pats)\n\nEvent: NFL — Dolphins vs Commanders 9:30ET\n\nPOTD: Over 44.5 Total Points (-165), 3u to win 1.82u\n\nWrite Up:\nTook the over in this one, but brought it down to 44.5 to get a number I’m more comfortable with. Both defenses give up big plays, Miami can score in bunches, and Washington should still move the ball enough to help this total out. Neutral field, faster turf, no weather, it all leans toward points.\n\nI like the matchup, the pace, and the way both teams line up right now. Keeping it simple.\n\nDolphins v Commanders -\nOver 44.5 Total Points (-165)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np3nwhq/"
    },
    {
      "created_utc": 1763268812.0,
      "author": "Vander_chill",
      "text": "**POTD Record:**  94 – 60 - 9\n\n**Previous:**  Germany -1.5 & South Korea -1 – WINNING!\n\n**New Event:**  World Cup Qualification – Hungary vs Ireland\n\n**Pick:**  Ireland Over 2.5 cards @ 1.91 (Usual 3 units)\n\nThe disparity in odds between books for the cards market on the Irish is wide enough that the offer at 1.91 is too good to pass up. There is hidden value in this bet for several reasons.\n\nThis is the final matchday for Group F, where earlier in the week Ireland hosted Portugal in a must win and highly improbable match. A match where Ireland not only came through for us on our bet but also managed to win 2-0 and Ronaldo got ejected. This win marks the single most important victory in Ireland in over a decade. The stadium was simply nuts! I strongly suggest any of you with Irish blood to see the highlights on youtube as it should bring a source of pride.\n\nIreland now travel to fight in Hungary against a strong side that sits in 2^(nd) place and one point ahead. The loser of this match is eliminated from World Cup passage, while the winner will move to a playoff phase. While Hungary will be happy with a win or draw due to their 1 point advantage, Ireland not only visit as underdogs, but need a win in order to advance to the playoffs.\n\nAs evidenced by the previous match with Portugal, miracles do happen and the Irish will need another miracle to pull this off. I am betting that regardless of the outcome there will be plenty of friction leading to many cards.\n\nSome bullet points:\n\n* Ireland have received over 2.5 cards in 4 of their last 5 matches in this group stage. (1,3,3,4,5)\n* In the previous H2H with Hungary in Dublin, there were 8 yellows and a red.\n* The assigned ref is Espen Eskas who averages 4.8 cards per match in EUFA World Cup Qualification matches.\n\nOnce again Ireland have no choice but to play for all the marbles today and when it’s due or die for the Irish, fouls and cards typically abound.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np3jnon/"
    },
    {
      "created_utc": 1763268492.0,
      "author": "Statistician11223",
      "text": "**POTD Record:** 9-5 (+5.65 Units)\n\n2 Leg Parlay:\n\nEvent: UFC -- Main Event: **Islam Makhachev** over Jack Della Maddalena @ -275. Sunday 12 am est. ✅\n\nEvent: NFL -- **Green Bay Packers** at the New York Giants. @ -360. Sunday 1pm est. ✅\n\nFor **-135. 2 Units to win 1.48 units profit.**\n\nIslam Makhachev looking to achieve double champ status and make Khabib proud. Think his takedowns are too strong, all around a better fighter. --- Green Bay has been slacking and need to pick it up against a hurt NYG team with Dart out. Like both of these. Good luck if tailing!\n\n(also posted on Daily Pick Thread)\n\n**EDIT: WIN! Now 10-5 (+7.13 units).**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np3iy55/"
    },
    {
      "created_utc": 1763267068.0,
      "author": "ptrckfrnndz",
      "text": "Long time lurker\n\nBeen watching tennis for a while\n\n0 - 0 \n\nSports: Tennis\n\nPotd: Mary Stoiana ML vs. Mai Hontama 5 units @1.635\n\nTime:\n\nReasoning: I've been following Mary for a while, Mai gameplay will be outplayed by mary, weak return watched both of their last game and i can definitely say mary will take this.. i lost today on ufc and i am doubling down... Bol\n\nI dont know what else should i put but i am confident on this one, i dont know the stats or what nots, but i watched both of them last night and i can say that if they will play they way they played last night mary stoiana will definitely win..",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np3ft0c/"
    },
    {
      "created_utc": 1763265268.0,
      "author": "Dont_Tail_Me_Bro",
      "text": "Record: 7-6\n\nNet Units: +1.14u\n\nLast pick: Utah -8.5 🤑\n\nNCAAB // University of the Incarnate Word Cardinals @ Indiana Hoosiers\n\n**Pick: Indiana -26.5 (+100 ESPNBET) 1u**\n\n  \nWe head to Bloomington where the Hoosiers host one of the best named universities in DI. This is a tune up game for Indiana and the spread reflects that. Incarnate Word is 2-1 but their 2 wins were against DII opponents. In their one real game against Colorado State, they got blown out by 34 points. While Colorado State is actually a pretty good team, Indiana is significantly better. \n\nIndiana has been bulldozing teams so far this season, they are 3-0 with an average margin of victory of 34 points. Are we really expecting this trend to not continue against Incarnate Word who has already shown their ability to get blown out? Indiana has the 11th ranked offense according to KenPom against the 290th ranked defense of Incarnate Word. I don't see any universe where Indiana doesn't score at least 90 points. That means they need to hold Incarnate word to 63. Colorado State held them to 64 and their defense is expected to be atrocious. \n\nIndiana is in year one of new head coach Darian DeVries, his son Tucker DeVries might just be the Big Ten POTY, and they are on a mission early to invigorate an Indiana fan base that is ready to get back to their blue blood form on the hard wood. You can only take so much from the numbers and data this early in the season, but I see this playing out somewhere around 95-60 with Indiana in complete control the entire game. \n\n  \nIndiana: #18 in KenPom\n\nIncarnate Word: #214 in KenPom\n\nIndiana 3-0 ATS with an average margin of +14.3ppg. \n\nIncarnate Word 0-1 ATS with an average margin of -24ppg.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np3bjho/"
    },
    {
      "created_utc": 1763259935.0,
      "author": "ZackDrex98",
      "text": "**Record: (16-12-2)**\n\n**Form** : ✅✅✖️✅✅✅✖️✅✖️✖️✅✖️✖️✅✅✅🅿️🅿️✖️✖️✖️✅✅✖️✅✅\n\n**Net Units: +5.25 U**\n\nLast Pick : **Spur to win First Quatar | 1.85 | 5 U**✅\n\n**Game: Korean Basketball League | Anyang Vs LG Saker**\n\n**Pick : Anyang to win First Half | 1.8 | 5 U**✅ (Sweat Free Cashed)\n\n**Write Up:** Today, I'm going with another KBL game, just like my last KBL pick. I'll stick with Anyang to win the first half again—their first-half form has been superior, winning 11 out of 14 games this season.  \nAnyang 1H (11 ✅ - 3❌)   \nVs Sono ✅   \nVs Kogas✅   \nVs DB ❌   \nVs Sknight✅   \nVs Thunder❌   \nVs LG✅   \nVs Mobis✅   \nVs KCC ✅   \nVs KT ✅   \nVs Sono✅   \nVs Thunder❌   \nVs Sknight✅   \nVs Mobis ✅   \nVs DB✅  \nFor the LG Sakers, they're just 7-7 in the first half this season, with a 50% win rate that's even worse on the road (3-5 away starts). They have to play this road game against Anyang, who dominate early at home—Anyang will take the first-half win easily. BOL!!!\n\nDonations are completely optional, but you feel free to show support here.\n\n**Buy me a Coffeee**: [https://buymeacoffee.com/zackdrex98](https://buymeacoffee.com/zackdrex98)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np2xpqa/"
    },
    {
      "created_utc": 1763259534.0,
      "author": "ControlRoyal1768",
      "text": "Record: 24-12 (+31.77u)\n\nLast 10: 💰✖️💰✖️💰✖️💰💰✖️💰\n\nLast POTD: 🏈 Mack Hollins over 37.5 receiving yards (-115) 💰\n\nWriteup: Hollins got used early in the first half and caught some big throws to get well over this number!\n\nToday’s POTD: 🏈 DeVonta Smith over 55.5 receiving yards (-113)\n\nGame starts at 8:20pm EST. Bet 3.5u\n\nWriteup: There are two players I absolutely love for Sunday's games - Jaylen Warren and DeVonta Smith. Mr. JoeIngles has already covered Jaylen, so I'll take DeVonta.\n\nFor Sunday Night Football, we have the Super Bowl Champion Philadelphia Eagles hosting the Detroit Lions. Since week 7, Devonta Smith has taken over as the WR1 for the Eagles offense with a 40.9% target share. This is second in the NFL only behind Jaxon Smith-Njigba, a top 3 WR in the league. Over the past 3 games, Smith has gone for 69, 84, and 183 receiving yards, along with 7, 9, and 11 targets, respectively. At yet, even with all of this, his receiving prop is still below A.J. Brown's. With a total of 46.5 point in this game, and the Lions being a pass-funnel defense, this line honestly blows me away. DeVonta Smith should easily hit this line in a back-and-forth game in prime time against a soft Lions secondary.\n\nOh, and yesterday was his birthday. \n\nRemember to only bet what you can afford, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np2wnn4/"
    },
    {
      "created_utc": 1763257308.0,
      "author": "plssteppy",
      "text": "Record 0-0\n\nNet units 0\n\nLast pick N/A\n\nToday's pick Chargers vs Jaguars Oronde Gadsden over 51.5 receiving yards, 1.89 on DK 3u to win 2.67u\n\nGadsden has a favorable matchup, Jax are gonna play 3-4 4-3 and Nickel. In matchups where the chargers have played against similar packages and where they had a favorable matchup against worse than average passing defenses Gadsden has hit this line every time. Chargers offense ranks 5th in passing yards per game, Jaguars defense ranks 28th in passing yards allowed per game. Herbert should eat.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np2qiez/"
    },
    {
      "created_utc": 1763253245.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 14-6 (+9U)\n\nLast Pick: Oklahoma @ Alabama under 47 (-120) (1U) ✅\n\n[Under write up](https://www.reddit.com/r/sportsbook/s/J90Djm973v)\n\nA little flukiness in the beginning of the game with the pick 6 and explosive touchdowns, but we regressed back down to where we should be! Another sweat but who gaf, I love a good sweat that ends in a win! That’s all the fun\n\nEvent: chargers @ Jaguars (12pm central) Ravens @ Browns (3:25pm central)\n\nPOTD: Standard two leg 6.5 point teaser (Ravens -1/Chargers vs jags over 37) (-120) (1.5U)\n\n-everything is bet to win unit amount-\n\nWrite up: \n\n\nRavens -1 vs. Browns\n\nThe original line had Baltimore laying 7.5 to 8 points on the road. That’s a lot in a divisional matchup, especially with weather concerns. But by teasing it down to -1, we’ve turned this into almost a straight-up win bet. That’s a massive edge because the Ravens have been dominant ATS in Cleveland, going 13-4 ATS in their last 17 trips. Historically, John Harbaugh’s teams thrive in these spots, and sharp bettors are already backing Baltimore even at -8. Professional money saw value at that number, so at nearly pick’em, we’re sitting on gold. Baltimore’s defense has been suffocating, allowing just 14.5 points per game over their last four contests. \n\nMeanwhile, Cleveland’s offense is a disaster, ranking dead last in yards per play (4.1) and the Browns managed just 20 points against the Jets’ suspect defense, with rookie Dillon Gabriel averaging a pathetic 3.9 yards per attempt. The Ravens’ red zone defense is top-10, while Cleveland converts just 47% of their red zone trips into touchdowns. That mismatch alone makes it hard to see how the Browns keep pace. With Lamar Jackson healthy, completing over 70% of his passes and sporting a 15:1 TD-to-INT ratio, Baltimore has the firepower to control this game. At -1, it’s hard to imagine them not walking away with the win. Factor in Cleveland’s home field being essentially worthless (they’re 1-11 straight up in their last 12 games versus AFC opponents), and Baltimore’s 8-4 ATS record in their last 12 games against Cleveland and Harbaugh is 11-4 ATS when his team is coming off three straight wins as road favorites. He gets his guys ready to compete in “let down spots”. we’re taking care of business. Plus, if the weather is piss poor which it might be, this supports the more disciplined team with a legit run game against a lackluster offense in which Gabriel has not faced situations like this yet in the league.\n\n\nChargers vs. Jaguars Over 37\n\nThe second leg of our teaser is just as strong. The original total sat at 44 points, but teasing it down to 37 gives us a huge cushion. The Chargers have been on fire offensively, averaging 28.4 points per game over their last five contests. Justin Herbert is second in the NFL in passing yards, and he’s facing a Jaguars defense that has been one of the worst against the pass, allowing 252.9 passing yards per game (fifth-worst in the league). Backup QBs like Davis Mills and Geno Smith have shredded this secondary, so Herbert should have no problem lighting them up.\n\n\nJacksonville’s defense has been consistently poor. They’ve allowed 24.4 points per game (20th in the NFL) and rank near the bottom in yards allowed per play (27th at 5.8). They’ve also struggled to generate pressure, recording just 6 sacks in their last six games. That means Herbert will have time to carve them up, and with LA scoring 89 points in their last three games, the over looks extremely attainable. Even if the Jaguars chip in modestly, the Chargers alone could push this game past 37. And honestly, I expect the jaguars to come out angry after a disappointing loss to the Texans last week. Not to mention LA has traveled the most miles out of any team this year and they may be a little tired defensively having made 4 trips to the east coast! \n\nThis teaser combines Baltimore’s absolute war path toward the playoffs with LA’s offensive explosion against a weak defense, giving us two angles where the teased lines provide significant value: Ravens to pretty much win outright and Chargers/Jags to clear a modest total.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np2f6ip/"
    },
    {
      "created_utc": 1763252776.0,
      "author": "Ascending_Saiyan",
      "text": "POTD Record: 3-5-1\n\nNet units: -2.39u. All bets are 1 unit.\n\nLast POTD 11/13/25: TreVeyon Henderson 60+ rushing yards & Breece Hall 2+ receptions (-119 FanDuel) ✅\n\nThis one ended up being a major sweat, and it ended up hitting on Henderson’s final rush of the game to get the first down to lead into the QB kneel to end the game.\n\nToday's POTD 11/16/25: J.J. McCarthy 1+ Interceptions (-130 Bet365)\n\nEvent: Bears @ Vikings 11:00 AM MST\n\nWrite up: This line feels surprisingly low, considering the matchup J.J. will be facing this week against the ball-hawking Chicago defense. Although there haven’t been a lot of shining spots, the Bears' defense is the league leader in interceptions through 10 weeks of NFL action and has taken the ball away through the air in 6/9 games this season. \n\nSo far in McCarthy’s short time as the starter, he has thrown a pick in all four games. His current interception rate ranks 2nd in the league at 6%, and the Bears have already picked him off in week 1 of this season. Since then, McCarthy’s pass attempts have increased each week from 20, 21, 25, and then an astounding 42 attempts last week against Baltimore. Although I expect the Vikings to make their best effort to impose the run against Chicago, I don’t see it being sustainable through all 4 quarters, and I’m predicting the weekly improving Caleb Williams and Bears offense to keep it tight and competitive. This gives J.J. McCarthy more opportunities to air the ball out and put it in harm's way and into the hands of the Bears defenders.\n\nTail of fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np2duif/"
    },
    {
      "created_utc": 1763252117.0,
      "author": "InternationalRest542",
      "text": "POTD Record: 5 - 0\n\n\nNet Profit : +8.59 Units\n\n\nPrevious Pick: OKC -10.5 @1.83 2u to win 1.66u 💵✅\n\n\nEvent: NFL | Buccaneers @ Bills\n\n\nPOTD: Dawson Knox Over 2.5 Reception @1.70 3.3u to win 2.3u\n\n\nWrite Up:  \n \n\n\nWith Kincaid out, I think Knox could see 3–6 targets. Some of Kincaid’s volume will likely shift to other receivers, but Knox is the natural TE1. Knox has been with the Bills since 2019 ofc he knows the offense inside-out, while he understands Josh Allen reads and can adjust routes mid-snap, which is crucial when stepping into a larger role.\n\n\n\n\nP.S : Only bet what you can afford , its just gambling after all ( It can go wrong sometimes ).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np2bz17/"
    },
    {
      "created_utc": 1763252011.0,
      "author": "Pefkov",
      "text": "**Record:** 12-6\n\n**Net Units:** \\+5.76\n\n**Last Pick:**  Mack Hollins 40+ Receiving (+104 on DK) 1u to win 1.04u ✅\n\n**Todays Event**: 🏈 NFL Sunday Football Buccaneers @ Bills 12 PM CST🏈\n\n**Todays pick**: Dawson Knox 3+ Receptions (+112 on DK) 1u to win 1.12u (odds have been going down since i started writing this, started at +123)\n\n**Writeup:** Dalton Kincaid has officially been ruled out with a hamstring injury, meaning it's Knox's time to shine.  Kincaid's been hogging much of the spotlight in the TE spot, averaging 3.6 receptions on 4.5 targets, meanwhile Knox has been averaging 1.3 receptions on 2 targets, with him gone these numbers should rise. \n\nBuccaneers with their 24th ranked passing defense have been decent against tight ends this season yet still have holes, having an average of 7 targets with 5.11 receptions split among opposing tight ends. The Bills third string TE Jackson Hawes has been mainly used for blocking, which should let Knox funnel these numbers up for himself. Bucs also play zone over 70% of the time which tight ends can feast on. They've also been pretty weak in the middle of the field, where Knox should be able to take advantage of.\n\nNow the lines are these games are at -5.5, but the Bills have been looking rustier than they should, losing to the Dolphins in brutal fashion. This game will be close, and have plenty of passes. Our boy Knox will shine this game, \n\nBOL to anyone tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np2bo7w/"
    },
    {
      "created_utc": 1763250715.0,
      "author": "VAM89",
      "text": "Record: 24-15\n\nForm (old to new): ✅ ❌✅ ✅❌\n\nNet Units: +15.73\n\nYesterday's Pick: Grimsby Town to score o1.5 vs Chesterfield. 3u @ 2.02❌\n\nLooked pretty good at the half, even though we hadn't scored yet. However a straight red card to the keeper early in the second half killed this completely. \n\nToday's Pick: England to win and no for BTTS vs Albania. 3u @ 2.10\n\nWas considering Naestved in Denmark today (I have bets there) but can't go beyond England to win and keep a clean sheet here. Last chance to get on them in qualifiers.\n\nEngland are on track to become the first ever international team to not concede a goal in group phase of more than 4 teams. \n\nThey've been perfect. 7 games, 7 wins, and no goals conceded. \n\nThe English team are one of the deepest in the world. They've got plenty of players who are getting chances throughout qualifying and these guys will want to make the most of their opportunity. \n\nAnd it's not like these guys suck. Guys like Bowen (randomly picked a player who doesn't play often for England) would start for everyone else in the world besides 3 or 4 sides.\n\nAlbania are second in the group and can't drop to third. However they've only scored 7 in 7 (conceding 3), so going the u2.5 also looks good and is similar value... Only thing I don't like about that is I can see an England 3-0 being more likely than a draw or Albania win.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np284v6/"
    },
    {
      "created_utc": 1763250508.0,
      "author": "dreamchasing1",
      "text": "Record: 223-212 Net Units: -28.64 47-50 on 1.5u plays, 37-39 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [World Cup qualifiers] Turkey v Bulgaria\nLast pick: total goals over 3.5 @ 1.80 - 3 Units Lost\n\n\nEvent: Soccer/Football, [World Cup qualifiers] Hungary vs Ireland\n\n\nPick: BTTS @ 2.00\n\n\n2-2 in the previous match between the two sides with Ireland then coming from 0-2 behind to draw, now they are in a must win situation here. This year, Hungary have managed 2 clean sheets in 9 games, both those games vs Armenia. Ireland do look significantly better in recent games with currently back to back wins vs Portugal and Armenia. Ireland also struggle for clean sheets very much, despite keeping a CS vs Portugal, they allowed more than enough xG for a btts there. Ireland have 2 clean sheets in 9 games this year, with those 2 clean sheets being vs Armenia and Luxembourg. The game should eventually open up as teams chase goals, preferably an early goal should be great.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np27k8v/"
    },
    {
      "created_utc": 1763250105.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 3-2\n\n**Previous Pick:** Khvicha Kvaratskhelia 1+ SOT (-110) ✅️\n\n**Today's Event:** UEFA World Cup Quals | Portugal vs Armenia (6:00AM PST)\n\n**Pick:**  Bruno Fernandes ATGS (-120) 1.2 units to win 1 unit ✅️\n\n**Write Up:** Back in the win column yesterday. That was a tough one to root for, with Spain running circles around Georgia. Luckily our guy came through with a SOT in the 75th minute and then nearly had a goal in the 90th with a shot that went just wide of the post. \n\nToday we head to Portugal as our hosts, who sit first place in the qualifying group, welcome last place Armenia. A win here secures Portugal their guaranteed spot in the World Cup, whereas a loss or draw requires some help. Portugal will want to win here with conviction in front of their home crowd to avoid the playoff matches. \n\nRonaldo will be out for this match after receiving a red card in the last match, so Portugal will need to get creative to find their goals. Bruno will captain the team today and will likely be the team's penalty taker in Ronaldo's absence. I expect Bruno to have a lot of time on the ball and work his way into dangerous positions to take a lot of shots today. \n\nArmenia doesn't have much to play for in this one. After their 5-0 thrashing at home in the reverse fixture in September and an overall disappointing performance in the qualifiers, all they have left to play for is pride. Therefore, I don't expect them to park the bus and sit back. This could wind up being an end to end game and I don't expect Armenia to hesitate to send players forward on attacks. I like Bruno (who hates defending) to also try to exploit counterattacks in these situations as well. \n\nI tend to try to keep my picks closer to plus money, but I really like this one today and still think there's value here. \n\nBOL and happy Sunday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np26gt3/"
    },
    {
      "created_utc": 1763250050.0,
      "author": "FadeawayThrees",
      "text": "Record: 8-1\n\nNet Units: +6.55\n\nLast Pick: Nico Collins over 21.5 longest reception (-110) 1U ✅\n\nNFL | Seahawks @ Rams 4:05 ET\n\nPick: Terrance Ferguson over 12.5 longest reception (-110) 1U\n\nWrite-Up: Ever since week 5, the Rams have revolutionized their offense as well as creating notice in the analytics community with their high percentage of 2 and 3 TE sets. Since week 5, they’ve had the highest 2 and 3 TE personnel usage in the league and with this has come the emergence of rookie TE Terrance Ferguson. With so many plays using multiple TEs, Fergusons usage has increased. In the last 3 weeks, he’s run 12, 10, and 13 routes with 3, 3, and 4 targets in those games. In all the games before that he had 14 routes run and 1 target combined. \n\nThis means that he has seen a nice increase in usage and this is accompanied by Coach McVay’s positive coach speak about him. He recently said “how dumb am I to not figure out ways to get this guy involved?” He has done just that as he’s had multiple designed plays for Ferguson downfield, including on the opening play of last week’s game, which just indicates their love and trust in him.\n\nWhat I like about the longest reception prior to is that he has had plenty of downfield targets. In the last 3 weeks, he’s had 85, 56, and 88 air yards, which is insane for a 12.5 longest reception prop. He has cleared the line of 12.5 in 4/5 last weeks with catches of 21, 31, 36, and 32 yards. So we have had plenty of wiggle room as of late. The Rams are also playing the Seahawks who have been prone to giving up big plays to opposing TEs. Just last week they allowed McBride a reception of 24 yards and backup TE Elijah Higgins a catch of 12 yards. They have allowed 8 catches of 20 or more yards to TEs this year, which again is a lot of wiggle room for this line. They have also given up the 2nd most receptions and receiving yards to TEs this year, so they are just a defense overall that leaks production to the TE position.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np26beb/"
    },
    {
      "created_utc": 1763249936.0,
      "author": "NVSBETS",
      "text": "POTD Record: 6-1\n\nNet Units: +4.78u ROI: 45.14%\n\nPrevious POTD: Sinner/ADM u20.5 games -110✅\n\nSport: Tennis Tournament: ATP Finals Time: 12:00 PM EST\n\nPOTD: Jannik Sinner ML -175\n\nAnalysis: backing the true #1 here in favourable conditions. This is playable all the way up to -200. Enjoy watching history tomorrow and let’s keep our streak alive🌟",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np2605x/"
    },
    {
      "created_utc": 1763247708.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Sunday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oy5lum/pick_of_the_day_111625_sunday/np1zvc3/"
    }
  ]
}