{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/13/25 (Saturday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/",
  "target_date": "2025-12-13",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-13T04:35:48.803521+00:00",
  "comments": [
    {
      "created_utc": 1765599050.0,
      "author": "MrPunter500",
      "text": "**Record: 6-5**\n\n**Net Units: 0.09 units down**\n\n**Most recent plays**\n\n* Korpatsch vs Friedsam - Korpatsch ML @ 1.80 ✅\n* Korpatsch vs Rakhimova - Rakhimova ML @ 1.71 ✅\n* Kartal vs Pieri - Kartal Handicap -6.5 Games @ 1.71 ✅\n* Bassols vs Leonard - Leonard ML @ 2.19 ✅\n* Kartal vs Kalinina - Under 19.5 Games @ 1.85 ❌\n* Siskova vs Leonard- Leonard ML @ 1.97 ❌\n* Kalinina vs Parks - Kalinina Handicap -2 Games @ ❌\n\nAfter a good run i've been quite cold. Tail at your own risk.\n\n**Tennis** | **WTA 125 Limoges** | **10:30 AM (Eastern Time)**\n\nPlays will always be shared as 1 unit for fair record purposes\n\n**Pick:** **Bucsa vs Kalinina - Bucsa Handicap -1.5 Sets @ 1.88**\n\nExpecting a two set match here for Bucsa. She has been playing at a great level after what I saw from her this week, where she didn't give a chance to any of her opponents. \n\nKalinina already had two long 3 set matches and I'm not sure if her baseline tolerance will be enough to hold the firepower and the serve quality that Bucsa has been showing.\n\nWith this, I'm going with Bucsa to win in straight sets.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntrhk5h/"
    },
    {
      "created_utc": 1765597936.0,
      "author": "Lyx97",
      "text": "Record: 13-5-2\n\nNet Units: +3.82\n\n*Prev Pick : SFC Union Berlin vs RB Leipzig : BTTS @ 1.73 (1u) --> Win (whew, easy win. Glad that we didnt put it on Leipzig to win)*\n\nCricket | Women's Big Bash league | Hobart Hurricanes Women vs Perth Scorchers Women | in \\~4.5hrs\n\nHobart Hurricanes Women Win @ 1.622 (1u)\n\nWrite Up : For this particular Final match of the WBBL, there is no write up. Its more of an emotional bet to back the favorites, after their great regular season + it being their best chance to win their first trophy. I just want to see them win :). So, if anyone is going to tail, please be very careful\n\nBoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntrf0lj/"
    },
    {
      "created_utc": 1765597792.0,
      "author": "EthicalGambler",
      "text": "**My Record:** 70-62-3 (+0.40u)\n\n**Today’s Pick:** De’Aaron Fox o1.5 steals (Spurs vs Thunder)\n\n**Odds:** +145\n\n**Units:** 1.0\n\nTip off is 6:00 PST. Moving to a new system now for De’Aaron Fox to have at least 2 steals in the game. This season Fox has not gone more that 3 game without achieving 2 or more steals and given the game line (225.5) I suspect this will be a defensive battle. \n\nThe winner of this game goes to the NBA Cup final. Wemby is expected to return for this game which should make it closer than the spread suggests (-9.5 for the Thunder). \n\nShould this not hit I will double my wager for the next time Fox plays (likely Tuesday or Thursday).  \n\n**Previous Pick**: Jonas Valanciunas o7.5 points (Nuggets vs Hawks) ✅\n\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/EthicalGambler-U6cnjV?utm_source=mdembed&utm_campaign=EthicalGambler) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntreol5/"
    },
    {
      "created_utc": 1765596356.0,
      "author": "Superior_pT",
      "text": "Record: 21-11-1 (🚫💰🚫🚫🚫💰💰💰💰➖💰💰💰🚫🚫💰💰💰🚫💰💰🚫💰💰💰💰💰💰🚫🚫🚫💰💰)\n\nNet Units: +23.86\n\nLast Pick: NFL Chargers vs Eagles +2.5 \\[-112\\]/3.5u💰\n\nSport:  NCAAF Army vs Navy\n\nPick: Over 38.5 Total \\[-110\\]/4 units\n\nWrite Up:  \nFrom my perspective, the service academy under trend is real historically, but this specific matchup has changed enough that I am not treating it like an automatic under anymore. The Army Navy under has not hit since 2021, and the post cut block crackdown forced these offenses to evolve, especially Navy, which has leaned into a more modern spread option approach under Drew Cronic. With Horvath running the show, Navy can score efficiently without needing a fast pace, and the presence of a real vertical threat like Eli Heidenreich plus an explosive interior piece like Alex Tecza raises the ceiling in a way older versions of this game did not.\n\nThe other reason I like the over is that Navy is not a shutdown defense by efficiency, so Army does not need to be perfect to contribute. Even a couple of sustained drives or one short field scoring chance can be enough when the number is this low. And if Army struggles to consistently win up front, that actually helps the over too, because it creates more quick stops and more possessions for Horvath, and the more chances he gets, the more likely a shot play connects.\n\nI understand the hesitation because the total is relatively high compared to recent editions, and familiarity can still produce long empty drives. But at 38.5, I do not need a classic shootout, I just need Navy to look like the efficient offense it has been and for Army to chip in enough to avoid a game stuck in the teens. If Navy controls the trenches the way I expect, the over has a clearer path than the market is pricing.  \n\n\n\\--------------------- Stats----------------------\n\nMLB: 17-9-1 (2025) +18.58 units\n\nNCAAF: 2-2 (2025) -1.13 units\n\nNFL: 2-0 +6.31 units\n\nTrack my POTD Tracker at [potd.lol](https://www.potd.lol/handicapper/Superior_pT-GZdRsU). Special thanks to [u/major-couch-potato](https://www.reddit.com/user/major-couch-potato/) and [u/ethicalgambler](https://www.reddit.com/user/ethicalgambler/) for this website, which helps ensure transparency for everyone!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntrbaal/"
    },
    {
      "created_utc": 1765594638.0,
      "author": "Background_Law8395",
      "text": "**Record:** 3-0 (+6.65u)\n\n**Last picks:** France Ligue 1: Angers ML vs. Nantes (+115) 2u ✅\n\n**Event:** German Bundesliga 1: Borussia Monchengladbach vs. Wolfsburg 6:30am PST\n\n**POTD:** Borussia Monchengladbach ML (+100) 3u\n\n**Write up:**\n\nBack with yet another football (soccer) pick here. Pretty bad lines across all top 5 leagues but this one really stands out to me. Gladbach are 4-1-0 in their last 5 games in the Bundesliga, most notably winning: 0-4, 3-1, and 0-3. They have only conceded 1 goal in these last 5 and held Leipzig to 0 goals as well. In their last game winning a scrappy 0-1 away, with the goal being an own goal and losing 1-2 at home in the Pokal the game before, I see Gladbach wanting a statement bounce back at home.\n\nOn the other hand Wolfsburg have been struggling as of late, going 1-1-3 in their last 5 Bundesliga games with a goal difference of -2. Their only wins away this season have been against Hamburger (13th in the league) and Heidenheim (16th in the league). They are coming off a big home win against Union Berlin but I don't see their home form carrying to Saturday.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntr74tr/"
    },
    {
      "created_utc": 1765593832.0,
      "author": "UserQAV",
      "text": "**Record**: 2-3 ❌✅❌✅❌\n\n**Net Units**: +2.0u\n\n**Last Pick**: Over 2.5 goals and RB Leipzig team total over 1.5 goals at 2.10 (2U) ❌\n\n**Event**: English Premier League (Soccer)\n\nArsenal vs Wolverhampton\n\n**Pick**: Arsenal to win both halves at 2.0 (3U)\n\n**Write Up**: We were very unlucky with today’s result. Leipzig losing 3-1, it felt like they couldn’t hit the back of the net after their first goal. Moving on, I predict Arsenal to win both halves. They are top of the premier league, looking to extend their lead, and they can easily put 5+ past this Wolves side. Wolves currently sit at the bottom of the table and have only scored 1 goal in the last 6 games. Man United played them last week, who are a weaker team to Arsenal this season, and scored 4 goals comfortably, and could have easily scored 6+.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntr53v9/"
    },
    {
      "created_utc": 1765593198.0,
      "author": "ColdTub10",
      "text": "**Record**: 3-3 (-0.75u)\n\n**Last Pick:** Hornets vs. Bulls (NBA) Ryan Kalkbrenner O 8.5 Points (W 1.77u)\n\n**Event**: **#19 Kansas vs. NC State** (CBB) @ **5:30pm ET** \n\n**POTD**: **Kansas +2.5** | *3u to win 2.63u* | -114 on FD\n\n**Reason**: Kansas is coming off a strong performance against Missouri in which Tre White put up a double-double and Darryl Peterson dropped 17 points in his first game back from his injury. His presence on the court was missed and now that he is back, Kansas will be much more efficient on the offensive end. NC State is looking very good so far, particularly on offense - ranking 12th in offensive efficiency thus far. \n\n**My key driver in making this pick is though they are ranked top 15 in offensive efficiency, they are 7-3, which looks good, but those 3 games they lost were against P5 teams (Seton Hall, Auburn, and Texas), those are the only P5 teams they have played.** Kansas has already seen much tougher competition and hasn't played terrible, especially without Peterson who is averaging 20ppg. \n\n**Kansas has also been playing S-Tier defense, ranking 26th in the nation in defensive efficiency. They average almost 40rpg** and are protecting the rim like their lives depend on it. Kansas ML at +118 has good value as well, but the spread here is the safe route and why I am going 3 units on it here as well. \n\nBOL to all",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntr3hsx/"
    },
    {
      "created_utc": 1765592290.0,
      "author": "Substantial-Pay-4591",
      "text": "\nPOTD Record 7-5 (+2.02u)\n\nPrevious Pick - ❌ Kirk Cousins longest completing u31.5 yards -112 (1.12u to win 1u)\n\nSaturday’s Pick - Dallas Stars -1.5 vs Florida (1u to win 1.8u)\n\nThe back to back champs have just been dealing with a ton of injuries. This probably has also led to a bit of a drop off in the play of Bobrovsky. \n\nOettinger has just been the better goalie this year and the Stars have been the better team (8-1-1 in their last 10, 10-4-1 at home this season and near the top of the league in goals scored)\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntr18dv/"
    },
    {
      "created_utc": 1765590667.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 205-158\n\nUnits Won: +92.73u\n\nLast Pick:  Kanavi O 3.5 Kills Map 1 (-135) X\n\nToday's Pick: **Frozen O 7.5 Headshots Map 1(-133)** 5u\n\nTeams: FaZe vs. NAVI | 2:00 PM EST.\n\n**Frozen Overall Stats:**\n\n* Frozen is averaging .74 KPR on 50.4% in L6 months\n* Frozen is averaging a .74 KPR on 49.8% headshot overall L3 months,\n* Frozen is averaging a .76 KPR and a 53% headshot in the last month\n\n**Projected Map:**\n\n* NAVI are the higher seed meaning they should be picking their map 2nd, we want to target FaZe map pick\n* FaZe perma ban Train, NAVI perma ban Overpass, FaZe 80-85% chance pick Nuke, 20% chance of Inferno\n* If this map is Inferno, I still like the pick, Frozen has been on fire on Inferno at the major, a map NAVI struggle on and one that will likely see high rounds + T side start for Frozen\n\n**Team Nuke Stats:**\n\n* FaZe are 67% winrate on 12 maps of Nuke in the L3 months, NAVI are 50% winrate on 14 maps of Nuke\n* FaZe are 5-1 in the last month on Nuke, with their two most recent wins being MOUZ/Vitality, the two best Nuke teams in the world in my opinion\n* NAVI are 0-1 in the last month on Nuke, they are 1-5 in their last 6 matches and their losses on the map have been very ugly, losing 13-4 to Aurora, 13-3 to MongolZ and 13-8/13-2 to FURIA\n\n**Frozen Nuke Stats:**\n\n* L6 months: .74 KPR>.89 KPR on Nuke, 50.4%>56% HS on Nuke\n* L3 months: .74 KPR>.90 KPR, 49.8% headshot>55.7% headshot on Nuke\n* L1 month: .76 KPR>.95 KPR, 53% headshot>59.7% headshot on Nuke\n* Frozen 15/15 hit rate on Nuke in the L6 months on O 7.5 Headshots\n* Frozen is averaging 21.6 kills per map on Nuke with 12.05 headshots per map on average in the L6 months\n\n\\~If anyone needs help finding the pick or a place to bet esports can always reach out!\n\nBest of Luck",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqx4hh/"
    },
    {
      "created_utc": 1765590576.0,
      "author": "PurpleDragonBets",
      "text": "Record: (115-77-11) \\[+11.39\\]\n\nPOTD⭐️:🏈Navy ML/Washington ML (-133) \\[BetOnline\\]\n\nStart Time & TV: 3:00 & 8:00pm EST (CBS & ABC)\n\nUnits: 3.75 Units\n\nReasoning: Happy Saturday everyone! To kick off the bowl season well be going with a two legger in the LA Bowl and the Army-Navy game. Weve got some true American smashmouth run the damn ball down your throat football on our hands with the Army-Navy game kicking off college football action for us. For Americas game well be taking the Midshipman of the Naval Academy as Navy has put together a very impressive year sitting with a 9-2 record and they are coming off two very quality wins against South Florida and Memphis. They are facing a 6-5 Army team who started off the year rough with a loss to FCS Tarelton State but improved as the season went on. Both being service academies, the triple option is the forefront of these team’s offenses but Navys offense impresses me the most because they are 1st in the FBS in rushing yards averaging 300 yards on the ground but also they are averaging 137 passing yards a game and that may not sound like alot at all but for a service academy that doesnt drop back to pass much Navy has done a stellar job setting up the play action off of their triple option and wingback Eli Heidenreich has over 800 receiving yards and 4 receiving touchdowns to go along with his ground game. Both of these teams are pretty evenly matched with their rush defenses averaging 147 and 144 yards a game so I believe the advantage goes to Navy in this one as their ability to pass the ball opens things up and I think theyll be able to catch Army sleeping and get some chunk plays in the pass game in this one. For the nightcap well be going with the Washington Huskies out of the Big Ten over the Boise State Broncos out of the Mountain West. The Huskies have a very balanced squad as they have a top 25 scoring offense in the FBS ranking 22nd averaging 34 points per game as well as having a top 25 scoring defense ranking 21st with only 19 points allowed per game. This Huskies rush defense is also one of the best in the nation as they only allow 103 rush yards per game which is 17th in the nation. Boise States rush defense is quite the opposite as it is one of the weaknesses of this Broncos team as they are ranked 89th in rushing yards per game and I expect the Huskies to win the battle in the trenches on offense and defense and control the line of scrimmage in this one. One thing we have to look out for in bowl games is player opt outs and the Huskies have no players opting out for the this one while the Broncos have safety Ty Benefield and tackle Kage Casey opting out for this bowl game. I expect the Midshipmen and the Huskies to handle buisness in their games this Saturday.\n\nPrediction: 21-17 Navy, 30-23 Washington\n\nLast pick:🏀Weber State -4.5💩Hooked. Nothing worse than losing by a half point.\n\nBest of luck to everyone tailing and remember to bet responsibly! I am sorry to all who have been tailing during this downtrend of reddit posts. I hate losing and the one thing I hate more than losing is sharing losing picks. Once my downtrend started my mistake here on reddit was not posting my plays that were +money or spread odds as I thought some juiced plays at like -165 odds would be “safer” and that obviously didn’t work and only made things worse. I understand the frustration thrown my way and I dont blame anyone for being pissed. Lets get back to our winning ways on here and break this reddit curse, I apologize again to those who have been sticking around through the rough patch.💪🏽🍀💜\n\nhttps://preview.redd.it/apewi999nv6g1.jpeg?width=1057&format=pjpg&auto=webp&s=2cf6cb73ba9591a40ab7e83a7f74840146797841",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqww5a/"
    },
    {
      "created_utc": 1765589744.0,
      "author": "damagebabee",
      "text": "**POTD** Record 123-02-98\n\n\n\nNORWICH VS SOUTHAMPTON\n\nDate: 13 DECEMBER 2025 at 13:30\n\nBET ON: Over / Under- Over +2.50\n\nOdd: 1.60\n\n\n\n\\- Southampton’s free-scoring Championship run under Tonda Eckert is built on an aggressive 3-4-3/3-4-2-1 shape that maximises width and supports heavy forward pressure, which has helped them notch 21 goals in their last seven matches and maintain a high tempo throughout games. Their wing-back rotation and advanced midfield runners create constant transitions and sustained attacking phases, making them one of the division’s most potent attacks right now. Injury news, however, shows that wing-back Tom Fellows is battling a groin issue (though still hoped to be involved) and a few defenders like Shea Charles, Mads Roerslev, Elias Jelert, and Ross Stewart remain sidelined long-term, which could slightly weaken balance but doesn’t blunt their forward momentum. \n\n\\- Norwich’s tactical approach under Philippe Clement has been more reactive, as the Canaries have struggled to keep shape and have conceded high numbers due to defensive instability and injuries. Their planned build-up often involves direct transitions to alleviate pressure, but they suffer from a leaky back line and are missing key attackers, most notably top scorer Josh Sargent through concussion protocol, with Kenny McLean doubtful and other forward options limited. This forces Norwich into a more stretched setup when chasing games and opens space for opponents, while their inability to control the midfield has seen both teams score in most recent matches.\n\n\\- With Saints chasing promotion momentum and Norwich scrambling to stay competitive, defensive gaps and forward urgency from both sides suggest open phases and frequent transitions—a tactical recipe that historically aligns with games exceeding 2.5 goals. The combination of Southampton’s attacking shape and Norwich’s vulnerability at the back makes the Over 2.5 line a strong projection in this matchup.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqus77/"
    },
    {
      "created_utc": 1765588685.0,
      "author": "Certain-Challenge202",
      "text": "Record: 58-41 (+12.1)\n\nLast Pick: Smith -1.5 v Harrysson\n\nToday’s Pick: Gary Anderson Most 180s v Adam Hunt \n\nSport: World Championship Darts\n\nReasoning: Smith misses 6 match darts to win 3-1, only to lose 3-2. \n\nFor today I’m going to go with Anderson as he throws significantly heavier scoring darts over volume, and his 12-month 180 output is materially higher despite facing stronger opposition week-to-week. In a short set format, I do not think Hunt can generate enough sustained 140/180 pressure to consistently out-hit Anderson on maximums unless Anderson collapses badly.\n\nOdds: 7/10\n\nUnits: 2",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqs2ju/"
    },
    {
      "created_utc": 1765588532.0,
      "author": "Hey52511",
      "text": "NBA POTD 10-9 Pending Rudy Gobert over 9.5 boards $2.05\n\nToday: New York Knicks -4.5 $1.85\n\nTLDR: Magics Playstyle and current injuries should make this a lot easier for Knicks to win ideally\n\nWriteup: The Orlando Magic had a great game against the Miami Heat,  the first half the lead was down by 16 and coming back to win it. Now the issue here lies in the Magic, Franz Wagner is out who is a +53 this season, and Paolo Banchero is going to have to take over, not only this Jalen Suggs definitely hurt but is currently playing through it. NYK are also top 5 in paint defence, and Orlando Magic are bottom 5 in threes attempted and made. Now Banchero averages about 2.9 Isolation Possessions meaning a frequency rate of 14%, now 2.9 Isolation plays are the same as Gianniss, except Banchero is below the league average at 24.8% percentile in the League when it comes to isolations, now imagine OG Anonnuby on Banchero who played his first game from Injury against the heat. Additionally Miami Heat, was a great Match up for Banchero as they changed their playstyle from a defensive focused team to now recreating what the Pacers are trying to do, their Pace is 105 number 1 in the league for pace, so imagine trying to stop a 6,11 power forward driving from half court, not easy. Not only this but Miami excelled when playing Pace, but in the second half Orlando started to play slower leading to their win. The New York Knicks are bottom 5 in Pace so if they want to play that game of slowing it down, it will fit their general playstyle anyway. Now the reason I say all this is because this game will likely be focused on Bancero as if he isn't driving he will most likely be a useless body on the court. This is due to the fact that he can't shoot threes and loves to take inefficient mid jumpers. So if the game script is him driving in and seeing if he can kick it out for a three to a team mate, they better make it however the issue is they attempt the lowest threes, so my prediction is Banchero will have to be the GUY unless Desmond Bane can have another 37 point game, even then I believe teams will quickly adjust to shut down another player, especially a defence minded team like the Knicks. Just keep in mind Miles Mcbride is out and Shamat, however I think for maybe 3 minutes a quarter Jordan Clarkson, Tyler Kolek and Robinson should be able to do very basic plays to hold on until the starters come back, even then in a NBA cup I think they will be playing a lot anyway.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqro9g/"
    },
    {
      "created_utc": 1765587774.0,
      "author": "dreamchasing1",
      "text": "Record: 240-221 Net Units: -21.10 54-54 on 1.5u plays, 39-40 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Netherlands Eerste Divisie] FC Dordrecht vs FC Eindhoven\nLast pick: total corners over 10.5 @ 1.72 - 1.5 Units won\n\n\nEvent: Soccer/Football, [Israel Liga HaAl] Ashdod vs Hapoel Jerusalem\n\n\nPick: BTTS @ 1.80 - 2 Units\n\n\nAshdod are one of the best btts hitting sides. They've hit a btts in 11/13 league games, at home in 6/7. Hapoel Jerusalem are a great matchup here as they've done similarly with 11/14 games hitting btts, 6/8 away. The two teams already met this season in a game ending 2-1. A btts hit in last 7/8 games between the two teams. The guests are Slight underdogs today, however they've managed btts vs tougher teams very often, this season hit btts vs Beitar, Maccabi Haifa and more who are better at least defensively than Ashdod.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqpp8f/"
    },
    {
      "created_utc": 1765587390.0,
      "author": "nickhernandez1212",
      "text": "POTD Record: 1-1 (-0.5u)\n\nPrevious Pick: Niels Zonneveld -1.5✅\n\nNot much to say with an average over 115 Zonneveld did exactly what I thought and won in straight sets. Onto the next. \n\nEvent: PDC World Championship (Darts) : Luke Woodhouse v. Boris Krcmar 9:30am EST\n\nPOTD: Luke Woodhouse o3.5 180’s (-150), 2u to win 1.3u\n\nWrite Up: Traveling so not a big write up, but learning from my Luke Littler bet day 1, I think Krcmar is going to give Woodhouse a run for his money and this will go 5 sets. When up against harder competition Woodhouse seems to lock in on his 180’s. I expect 5+. \n\nAlt pick - Cameron Crabtree ML (-105)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqooeu/"
    },
    {
      "created_utc": 1765586796.0,
      "author": "Square-Johnson",
      "text": "Record: 10-5 +9.95u\n\nForm: 💰❌💰❌💰💰💰💰💰💰💰❌❌❌💰\n\nRecent pick: MARK SELBY TO WIN vs Judd Trump @ +110 for(all the profit) 4.74u to win 5.21u\n\nEvent: PDC World Championship 8:30am est\n\nPick: Andrew “Brown Finger” Gilding to WIN vs Cameron “I have 🦀’s” Crabtree @ -120 for 3u to win 2.5u on FD\n\nWRITEUP: Since Ned Chili Dog doesn’t want to risk his record, I’ll be the one to do it because I put my money where my mouth is…. my prison wallet.\n\nSo I’m sure there’s numerous reason the line is so close and rightfully so, Gilding has been shaky his last few matches and Crabtree popped off on multiple occasions. But honestly, experience is huge in these big PDC events, and Gilding has loads of it. He’s a seasoned campaigner on the tour, ranked way higher (around World No. 34 compared to Crabtree’s No. 74) and has played way more big-stage matches, giving him that calm-under-pressure edge at Alexandra Palace.  ￼ Plus there’s actual match history: the one time these two met in a Players Championship event, Gilding smashed Crabtree 6–1, which says a lot about his ability to assert control early.  ￼\n\nStats and vibes back him too, as we see money is quite even but some lines even slightly favor Gilding on things like 180s or set wins. I take this as he’s expected to be more consistent and aggressive on the trebles.￼ And if you’re looking at Crabtree’s recent momentum that all fine and dandy, but Gilding’s shown he can grind out wins against tricky opponents. So all signs point to “Goldfinger” using his experience and scoring to bully his way through a first-round scrap and live to see Round 2.\n\nHave no fear, Brown Finger will remain Goldfinger tomorrow morning. Best of luck if tailing and Ned if you see this, just know I’m your daddy when this hits.  I❤️🌶️’s\n\n![gif](giphy|lOiJqCjiEOcmc|downsized)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqn2so/"
    },
    {
      "created_utc": 1765586660.0,
      "author": "Square_Print_9822",
      "text": "**Pick Record: 37W - 27L    (Push: 1)**\n\n**Form: ✅ ✅ ✅✖️✅✖️✅✖️**\n\n**--**\n\n**Today's Pick: Arsenal over 2.5 Goals @ 1.72**\n\n**Arsenal VS Wolverhampton Wanderers**\n\n**3:00 PM EST**\n\n**--**\n\n**Absolutely love the odds for this and honestly surprised given how poor Wolves have been this season. We’ve got top of the Premier league Vs Bottom here.**\n\nWolves just finished conceding 4 goals at home against Manchester United, and I don't see a world where they concede less than 3 goals against an Arsenal side that is slowly coming back to full health.\n\nWolves are currently on a 9-game losing streak and haven't won a single game this season. Arsenal, after dropping points tragically last match week will not only look to recoup those points but also create a gap in goal difference this weekend. \n\n**Also, Wolves' best player this season, Bellegarde, is out for the match tomorrow.**\n\n**BOL!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqmpfl/"
    },
    {
      "created_utc": 1765586467.0,
      "author": "Dmyers9099",
      "text": "Record: 2-0\n\nUnits: +1.77\n\nPrevious: Palermo ML ✅\n\nEvent: 🏈 Army v Navy (NCAAF) 3:00 EST\n\nPOTD: Navy 210+ rushing yards +110 (DK)\n\nNavy ranks 1st in the country averaging 298 rushing yards per game while Army allows an average of 147 rushing ypg. Navy has only rushed for less than 200 yards once this season.\n\nNavy is led by senior QB Blake Horvath who ran for 204 yards against Army last year in a comfortable win where Navy totaled 277 on the ground. Both teams love to run and control the clock, but Navy has the edge on offense converting 3rd downs almost 50% of the time. \n\nAs an Army vet, I’ll be rooting for the Black Knights, but Navy has a solid team this year.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqm5x4/"
    },
    {
      "created_utc": 1765586283.0,
      "author": "No-Gift-2350",
      "text": "POTD record: 1-0 CDL\n\nPOTD: **Cloud 9 New York Map 1 spread -39.5(-120) vs. Vancouver Surge (-120)**\n\n**2u**\n\nWrite up: \n\nNice win yesterday and hit pretty easily, I maybe should have been more bullish on my pick, but G2 choked the series after that. \n\nMy main pick today is simple, Vancouver Surge look... bad, especially after what happened yesterday(or today) against Toronto. That series could have been an email with how fast it was.\n\nCloud 9 have played one match this year and lost it against G2, but in that series, they won both of their hardpoints in a best-of-five series(map 1 and map 4. Hardpoint (game mode) is a respawn game mode, and it's a race for who is the first to 250. While I don't think G2 is a great hardpoint team, I think they are average, and Cloud 9 beat them by an average of 27 points. \n\nSurge has not won a map this year yet and has a new player over from Halo, Legend, and so far he has been dukey, just like his teammates, one being Lunarz, who has a .6 KD ratio (think like a 50% completion percentage type beat). \n\nSpreads are weird and can be so incredibly hard to predict, so don't bet heavily on this. That said, I do expect it to be covered, especially after Toronto beat the Surge today, in map 1, 250-111.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqlnwv/"
    },
    {
      "created_utc": 1765586023.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 20-13, +5.32u, (ROI +12.4%)\n\n**Previous Pick:** Monaco - Fenerbahce, over 167.5 points, 1.92, 1.5u ✅️, (last 5: ✅️✅️❌️✅️✅️)\n\n**Event:** Philippines PBA cup: Blackwater Elite - San Miguel Beermen, 12:30h\n\n**POTD:** San Miguel over 108.5 points, 1.96, 1u\n\nAn early game for today, PBA is a philippino player only, 48 minutes run and gun competition where San Miguel, for some reason, plays better in away games this season. They have 4-0 and 2-2 score at home. In 3 out of those 4, they went over this limit.\n\nThe one they didn't was against top team Converge fiberxers.\n\nBlackwater has 0-4 at home and allows 103.5 points per game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqkyw4/"
    },
    {
      "created_utc": 1765585659.0,
      "author": "Bankroll_Builder",
      "text": "Record: 13-9\nLast Pick: Chelsea to win vs Leeds (-120) LOSS. \nRecap: A three win pick streak ends here. Bad read. Hands up. After a little over a week off we take the loss and move on. \n\nTodays Event: Osasuna at Barcelona 12:30 EST (Laliga) and Wolves at Arsenal (EPL) 3:00 EST \nTodays Pick: Barcelona to Win + Arsenal to keep a clean sheet (-115) \n\nRead: When healthy I think Barca is as good as a team can get. They have eight wins from eight home LaLiga games sitting on top of the table. Osasuna has zero wins and six losses from eight away games. The worst away form in the league. This should be a simple spot for Barca to win. Osasuna have been poor going forward away from home and defense is my only worry when betting on Barca. I think they can win by more than one goal but 3pts feels free. \n\nThe Wolves fade continues here. Wolves have only scored one away goal all season long. Arsenal are hosting this game with the best defensive record in the world at the moment and still sitting top of the table. Arsenal have only conceded two away goals in the EPL all season. I refuse to stop riding the wave against wolves. Sweating a clean sheet is not for the weak. Hope it takes us over the line.\n\nBOL. Happy Saturday.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqjz28/"
    },
    {
      "created_utc": 1765584528.0,
      "author": "ptrckfrnndz",
      "text": "+14.47\n\n11 - 6\n\nFORM: ✅️✅️✅️\n\nSports: Tennis\n\nPrev: mattel marie/webb stefani vs. Miyamoto ayumi/yoshioka kisa ML @1.83 5 UNITS ✅️\n\nPick: broadus/shaikh ML VS. Bartashevich/bartone @ 1.83 5UNITS\n\nTime: abt 10hr from posting \n\nReasoning: tough loss on my pick vs broadus and shaikh yesterday, hard choke by their opponent yesterday... today, we'll ride the american pair. Watched both games yesterday and can say broadus and shaikh is here to win.\n\nBol",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqgvsk/"
    },
    {
      "created_utc": 1765584427.0,
      "author": "domadilla",
      "text": "POTD record 86-4-65 (W-P-L)\n\n**UFC: Gillian Robertson to win inside the distance, 1u @ +150**\n\n38.5 year old Amanda Lemos (9-5 in the UFC) steps in on two weeks notice to take on The Savage, grappling phenom, Gillian Robertson (13-6 in the UFC). Robertson has finished 10 of her 13 wins inside the distance (which is unheard of in WMMA) whilst her opponent has been finished in 3 of her 5 losses. Lemos is weak on the ground often choosing to accept bottom position and has shown a tendency to be to passive in the grappling exchanges. I was originally going to make Robertson ML the POTD as it’s still playable at -200 but decided there’s more value going for the finish prop. As always please bet responsibly. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqgm0i/"
    },
    {
      "created_utc": 1765584372.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 21-11 (+20.89$)**\n\nLast POTD: NFL Baker Mayfield O17.5 Rushing Yards -112 (2.50$ TO WIN 2.23$) x\n\n**POTD: NBA Shai Gilgeous-Alexander Over 31.5 Points -106 (2.50$ TO WIN 2.22$)**\n\nWrite up: Damn, Baker, that was pretty bad. If Wemby play's - Model has SGA over on the points at the top of the leaderboard! Let's rock, this one is going to be close I think - I see him ending between 30-35 points.\n\n• ⁠Model has this set as 53.5% with Wemby playing\n\n• ⁠Model likes the O31.5 and not 30+ because this is the semi-final, not just a regular game\n\n• Model says his line should be at o/u 33.5 points\n\n• Model shows in higher stake games, he tends to go 35+ points\n\n• Model shows a close game going into the 4th quarter if Wemby plays = SGA crunch time takeover\n\nLet's keep rolling.\n\nBOL!\n\n**POTD: NBA Shai Gilgeous-Alexander Over 31.5 Points -106 (2.50$ TO WIN 2.22$)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqggnp/"
    },
    {
      "created_utc": 1765583387.0,
      "author": "SP7988",
      "text": "**Record:** 33-17-1 (+14.33u) \n\n**Last:** (CBB) Iowa State -11.5 (1u) - L\n\n**POTD:** (CBB) No. 1 Arizona ML at No. 12 Alabama \n\n**Start Time:** 9:30 PM ET (ESPN)\n\n**Odds:** -112 (DraftKings)\n\n**Units:** 1U\n\n**Reasoning:** There’s no doubt Arizona has arguably the best resume in college basketball thus far.\n\nThrough eight games, the Wildcats (8-0) have already picked up four non-conference wins over ranked opponents, including victories over then-No. 3 Florida, then-No. 3 UConn, then-No. 15 UCLA and then-No. 20 Auburn. With a victory on Saturday night, the team will match the school record set by the 1987-88 team. \n\nA high-flying offense has been a catalyst to the stellar start.\n\nThus far, the Wildcats rank 4th in field-goal percentage (53.1%), 23rd in offensive efficiency (1.195), 23rd in scoring (88.5 PPG) and 44th in three-point shooting (37.5%). Over its last three contests, the unit has fared even better, averaging 99.3 points per game on 58.5% shooting—both rank 2nd in the nation over that stretch. Freshman Brayden Burries has been a big part of that, as he’s averaging 17.0 points, 4.7 rebounds and 3.0 assists per game on 56.3% shooting over his last three outings. \n\nThat could present difficulties to an Alabama team that has struggled to find its footing defensively. \n\nThrough nine games, the Crimson Tide (7-2) rank 90th in opponent three-point shooting (30.6%), 98th in opponent field-goal percentage (42.1%), 121st in defensive efficiency (1.007) and 262nd in scoring defense (79.2 PPGA). Those struggles were quite evident during the team’s four contests against elite opposition, conceding 96 points against then-No. 5 St. John’s, 95 against then-No. 12 Gonzaga, 87 against then-No. 2 Purdue and 86 against then-No. 8 Illinois. \n\nBut where the Alabama defense is most vulnerable is down low, as the unit ranks just 308th in opponent points in the paint (37.1 PPG; 16th percentile). To make matters worse, dominating the interior just so happens to be a specialty for Arizona, which ranks 2nd in the category (48.3 PPG; 100th percentile). That was in full display in matchups against UCLA (38 PITP with a +18 differential), UConn (42; +18) and most recently against Auburn (60; +36). \nFortunately, the Crimson Tide has the kind of scoring that could make up for their defensive woes.\n\nNot many teams can light up the scoreboard the way Alabama can, as it ranks 3rd in scoring (95.1 PPG), 16th in offensive efficiency (1.209), 65th in field-goal percentage (48.0%) and 131st in three-point shooting (34.7%). It’ll be yet another test for a Wildcats defense that packs a punch of its own, ranking 20th in defensive efficiency (0.906), 34th in opponent field-goal percentage (39.5%), 38th in scoring defense (67.1 PPGA) and 113th in opponent three-point shooting (31.4%). That includes holding three of those four aforementioned ranked opponents to 68 or fewer points. \n\nIn what should be a track meet, look for Arizona to handle business and add yet another statement victory to an already impressive resume.\n\nBOL if tailing, and as always, please do so responsibly. One bet should not lead to a crash  out.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqdtfj/"
    },
    {
      "created_utc": 1765583240.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 12-8-1 (Avg Odds +131)\n\n**Previous Pick:** Mikel Oyarzabal to Score or Give Assist (+100)  🅿️\n\n**Today's Event:** English Premier League | Arsenal vs Wolves (12:00PM PST)\n\n**Pick:** Bukayo Saka 2+ SOT (+110) 1.0 unit to win 1.1 units\n\n**Write Up:** We have a major David vs Goliath matchup here as 1st place Arsenal host last place Wolves. This game could be ugly. I've told you guys how much I dislike rooting for Arsenal, but I do like me some Saka (and Rice of course). Saka is one of Arsenal's best players, their penalty taker, and has one of the prettiest left footed shots in the EPL. We're expected Arsenal to dominate the ball and take a lot of shots, with Saka hopefully leading the charge. \n\nSaka has hit 2+ SOTs in 5 of his last 6 EPL games. He has also scored and landed 2+ SOTs in this fixture in each of the last 3 seasons. Our guy was rested mid-week in the UCL, so I'm expecting he will see most of the game today. Not a ton to say about Wolves other than they might break the record for the fewest points in an EPL season (11)...they bad. \n\nA note as always - we're in the time of the EPL season where squad rotations get weird. All signs point towards Saka starting, but feel free to wait for lineups to lock in your picks. \n\nBOL and have a great weekend!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqdf2u/"
    },
    {
      "created_utc": 1765582464.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 62-30-1 (+70.25u)\n\n__Previous Pick:__ [✅ Kyle Pitts o58.5 rec yds (-110), 3.3u](https://www.reddit.com/r/sportsbook/s/oumQ07HIxe)\n\n__Event:__ NCAAF: Army vs Navy 3pm EST\n\n__POTD:__ Army Team Total o14.5 (-120), 3.6u to win 3u \n\n__Write Up:__ One of the biggest & most sacred rivalries in sports goes down this Saturday afternoon, on the only Saturday of the year that is reserved for Army vs Navy. This is the 126th meeting between the two & will determine the winner of the Commander-in-Chief’s Trophy. This is more than a game. It’s their Super Bowl. Both Army/Navy players have to go through brutal schedules balancing classes, military training, & football 16 hours a day. There will be more future lieutenants & pilots on the field this Saturday than future NFL players. All of that hard work & sacrifice over the past season prepared them for this game. With the insanity of the world, especially in today’s College Football, Army vs Navy is one of the only things that’s consistent year to year anymore. Just some good old fashioned military ball. It’s one of the best tradition in sports, so we’re going to support our troops by gambling our hard earned cash - __’Merica__\n\nNavy is coming off a fantastic season, going 9-2 & just missing out on the AAC Championship Game. Their only 2 losses this year were to #10 Notre Dame & #25 North Texas. This is a huge game for Navy, as if they win they will have hit 10+ wins in back to back years for the first time in program history. They are coming of 2 extremely impressive wins over #24 USF 41-38 two weeks ago & a then (8-3) Memphis team. They have a ton of veterans returning from last year, a team that pulled off a huge 31-13 upset over the #19 ranked (11-1) Army for the most lopsided result since 2019. Navy won big for one reason… QB Blake Horvath. Horvath rushed the ball 25 times for 204 yards & 2 TD’s while throwing for 107 yards & 2 TD’s through the air. In what will be his final game in this rivalry, you can expect another big game from the best service academy QB we’ve seen in years. __Last week Horvath became the first QB in Navy history to throw for 1,000 yards & rush for 1,000 yards. Horvath’s 165.1 career efficiency rating is the best ever for a Service Academy QB & top 28 nationally since 1956. His 90.1 PFSN QBi Impact Grade ranks 6th in the nation.__ Horvath is a true duel threat QB & is the best rushing QB in the nation. __He ranks 1st among QB’s in rushing yards per game with an insane 104 YPG.__ Navy OC Drew Cronic modified the traditional triple-option to have a variety of different looks for Horvath over the past year & Horvath now has the 2nd highest completion percentage for a Navy QB (61.3%) ever. __Cronin’s Wing-T variation resulted in Navy ranking 7th in offensive success rate this season.__ Horvath also has a ton of talent around him including Alex Tecza, another Navy standout playing in his final game in this rivalry, & has scored 10 times this season. As well as Eli Heidenreich, a wing back that’s a great receiving threat with a 93.8 PFF receiving grade, his 3rd year in a row with a 90+ grade. Both of those guys have known each other since first grade (cool story). __Navy has the best run game in the nation, averaging 281.8 yards per game (1st). They also are efficient on the ground, averaging 5.8 yards per carry (2nd in nation). This has led them to rank 30th in the NCAA in scoring (30.5 points per game).__ Now facing a weak Army defense that has struggled all season. __Army’s defense ranks just 79th in EPA Defense & has a success rate of a low 45.7%, 121st in the NCAA.__ Part of their problem is they have had trouble limiting big runs all season. __Army ranks just 77th in rushing yards per carry allowed (4.5 ypc). They have just a 45.2% success rate stopping the run (91st).__ But the biggest issue has been defending the pass. __They rank 128th in the NCAA in pass defense success rate at just 46.2%.__ This has led to opposing offense to have virtually no issue driving down the field on them. They simply struggle to get stops. __They stop offenses on 3rd/4th down just 46.5% of the time (125th), leading them to allow opponents to have a quality drive on 54.5% of possessions (130th). That’s going to be a problem vs an elite Navy offense that ranks 10th in 3rd/4th down success rate & 5th in early down EPA.__ Why am I talk so much about the opposing offense? Because they are elite led by a a stud at QB in Horvath, facing a weak Army defense, which is going to lead to more scoring opportunities for Army. \n\nAs for Army’s offense, they keep their weak defense off the field by keeping the ball on offense. __Army ranks #1 in the nation in time of possession, controlling the ball for an average of 35:08 per game. They run the ball down your throat & control the clock. Army leads the nation in run rate, they run the ball on 86.13% of their plays (next highest is 78%). They are averaging 254.9 rushing yards per game, 4th in NCAA.__ They’ve had success due to their elite offensive line. __Their OLine ranks 5th in PFF run blocking grade in the NCAA.__ They are led by one of the best lineman in the nation, Left Guard Will Jeffcoat, the highest PFF graded offensive lineman in the country. He is a dominant run blocker that opens up huge holes on the inside. That’s what Army does, pounds the gaps. Under Head Coach Jeff Monken, Army runs a Gap heavy run offense that likes to get downhill on defenses on the inside. They only run zone runs 27% of the time. They have a deep backfield with 3 different RB’s that all can pound the rock. But their Triple Option rushing attack is led by their QB Cale Hellums who ranks 4th among qbs in rushing yards with 1,078 on the season & 3rd in rushing TD’s with 15. He entered the season as a back up & only had 8 starts because Dwayne Coleman who was Army’s original starter has been battling injuries all year. Army‘s offense has looked a lot better with Hellums in the 2nd half of the season winning 4 of his last 6 starts. He also led their offense in their huge upset win @ Kansas St earlier this season. Navy’s defense has had run defense issues this season as well. __Navy’s run defense ranks just 114th in PFF run defense grade & have the 5th worst tackling grade in the nation. Versus Gap rushing attacks they rank 66th in yards per attempt allowed this season. Overall they have given up 156 rushing yards per game (70th), allowing 4.4 yards per carry (68th).__ They also have had major success moving the ball down field & converting first downs. __Army ranks 28th in the NCAA in 3rd/4th down conversions, converting on 47.5% of their plays. Navy has been horrible on defense at stopping opponents on 3rd/4th with just a 48.2% success rate, 120th in the nation.__ Army should be able to pound the ball & keep the chains moving. __Navy have given up 17+ points in 9 of their last 10 games & 23+ points in 8/10. Army has scored 17+ in 9 of their last 11 games & 24+ in 7/11.__\n\nWe’re not just betting on football, we’re betting on __’Merica__\n\n__Army Team Total over 14.5 points__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial)  [PayPal](https://paypal.me/joeinglesofficial)  [Bitcoin](https://pastebin.com/raw/GEXAsA2S)  [Venmo](http://Venmo.com/mackenzie-botz-1)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqbbhl/"
    },
    {
      "created_utc": 1765582420.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 28-13 (+18.1U)\n\nLast Pick: Trail Balzers @ Pelicans Over 238.5 (-115) (1U) ✅\n\nI took today off to deal with some personal things but I am back looking to extend our current streak! Let’s get it\n\nEvent: Arkansas vs Texas Tech (NCAAB) (11am central)\n\nPOTD: Arkansas ML (+110) (1U) \n\n\nWrite up:\n\nArkansas has been the more efficient team offensively, posting a stronger effective field goal percentage 54% to 52% and averaging 87.6 points per game on 47% shooting, compared to Tech’s 81.4 points on 44% shooting. Arkansas is also holding opponents to 45% eFG (35th nationally) compared to tech’s 48% eFG (81st nationally). That gap in shooting efficiency is meaningful in a neutral-site matchup where every possession counts. The Razorbacks also take exceptional care of the basketball, ranking 17th nationally with just 9 turnovers per game, while Texas Tech averages 11 turnovers per game. That discipline, paired with Arkansas’ ability to generate pressure — 8.2 steals per game compared to Tech’s 7.4 — means the Razorbacks are more likely to control the possession battle and create extra scoring opportunities.\n\nThe schedule tells the story of a battle-tested Arkansas squad. They’ve already faced a gauntlet: a tough road loss to a physical Michigan State team, a neutral-site defeat against Duke, and then a dominant win over Louisville where they poured in 89 points. Those experiences have hardened this group and revealed their ceiling when they’re clicking. Texas Tech, meanwhile, is still searching for a signature win, sitting winless against ranked opponents (manhandled by Purdue in the Bahamas by 30 points, and lost @ Illinois by 4) Outside of JT Toppin and Anderson, the Red Raiders lack consistent secondary scoring threats, and John Calipari’s game-planning should be well-prepared to neutralize their stars.\n\nSize is something that I see playing out well for Arkansas, with three players sitting a 6’10 that see significant minutes for Arkansas, Pringle, Brazille, and Ewin. I see them out muscling a tech lineup that starts one player at 6’11 in Bamgboye who is a bit a weak logging just 5 points and 3.7 boards per game shooting 38%\n\nMotivation is another factor that cannot be overlooked. Arkansas still remembers last March’s Sweet 16 heartbreak, when Tech erased a 16-point deficit and stole an overtime win. This year, the Razorbacks return key contributors who lived through that loss: Trevon Brazile, D.J. Wagner, Karter Knox, and Billy Richmond III. These players not only provide continuity but also bring the hunger to exact revenge. They are familiar with Toppin’s tendencies and will be eager to flip the script in Dallas. Add in the fact that Arkansas has momentum — winners of two straight, finally meshing together — and the emotional edge tilts heavily toward the Razorbacks.\n\nDallas will be split, with both fanbases bringing strong support, but Arkansas’s ability to control possessions, capitalize on their shooting efficiency, and lean on their revenge motivation should carry the day. With superior efficiency metrics, a deeper returning core, and a hardened mentality, Arkansas +110 is not just a value play — it’s the right side. My power ratings have this at Arkansas -1 and I believe they are the right side in this game tomorrow and have more paths to victory than the red raiders. As always, cheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntqb7at/"
    },
    {
      "created_utc": 1765581841.0,
      "author": "tennisfanatic101",
      "text": "💎POTD: Army vs Navy Under 38.5 \nOdds: -115 on FanDuel\nWager: 1.75 Units\n\nRecord: 3-3\nNet Units: -1.74\n\n🏈 Army vs Navy, 12/13/25 Sat, 3 pm Eastern Time\n\nExplanation: Both offenses are extremely run-heavy, which keeps the clock running and shortens the game: Army has 658 rushing attempts and averages 256.9 rushing yards per game while throwing for only 78.3 pass yards per game, and they average a massive 35:16 time of possession (meaning they’re trying to win by long, grinding drives).   Navy plays a similar style with 542 rushing attempts and 298.4 rushing yards per game, and they also hold the ball a lot at 32:20 TOP; even though Navy scores more overall (32.45 PPG), their scoring often comes via sustained option drives rather than quick-strike passing that inflates totals.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntq9n1y/"
    },
    {
      "created_utc": 1765581811.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Saturday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pl6dbk/pick_of_the_day_121325_saturday/ntq9k2d/"
    }
  ]
}