{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/11/26 (Sunday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1q9j47j/pick_of_the_day_11126_sunday/",
  "target_date": "2026-01-11",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-10T23:42:27.801830+00:00",
  "comments": [
    {
      "created_utc": 1768087957.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 21-21-5 (Avg Odds +129)\n\n**Previous Pick:** Chelsea -1.5 (-110) ✅️\n\n**Today's Event:** England FA Cup (Soccer) | West Ham vs QPR (6:30 AM PST)\n\n**Pick:** West Ham ML + O 1.5 Goals (+100) 1 unit to win 1 unit\n\n**Write Up:** Chelsea made that a touch sweaty, but eventually came alive in the last 30 minutes and end up winning 5-1. Match went about as expected, with the big names coming on in the 2nd half to help pull away. Fun fact, we've yet to lose a POTD play with odds less than +100. Great to be back in the wim column to start the weekend! \n\nMore FA cup action today and I'm targeting another EPL side against a Championship side as West Ham host Queen's Park Rangers (QPR). West Ham are firmly in the relegation zone at 18th in the Premier League, and they burned us a few matches ago when they got trounced by Wolves. But to me, this is their chance to right the ship. They need a win badly, in any competition, and this is a prime time to do it. They get a week off after this match, so i expect them to come out with a strong team and take out some frustration on QPR. \n\nQPR are in the packed middle of the table in the Championship (England's 2nd tier), but are only 3 points off from the playoff spots for promotion. They have the top 3 highest scoring games in the Championship, as their games average 3 goals/match. With that, they concede the 2nd most goals in the Championship behind relegation bound Sheffield. Because of that, we've seen some lineup changes for these mid pack championship teams eyeing a promotion spot - they are not prioritizing the FA cup as heavily. I do not expect them to rollover by any means, but I do expect them to lose. \n\nNot to be dramatic, but if West Ham don't grab a win here in front of the home crowd, against a team a division below them - their already bleak season will look pretty dire. This is their chance to right the ship and build some momentum to take to the EPL next weekend. This is obviously a risky play and definitely feel free to sit this out if you're weary of West Ham. \n\nBOL and have a great Sunday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q9j47j/pick_of_the_day_11126_sunday/nyvixrc/"
    },
    {
      "created_utc": 1768087601.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 34-22 (+7.84U)**\n\n**ROI: +11.36%**\n\nLast POTD: Pending: NFL: Caleb Williams Over 1.5 Passing TD’s +112 (1U TO WIN 1.12U)\n\n**POTD: NFL: Buffalo Bills +1.5 vs Jaguars -114 (2U TO WIN 1.86U)**\n\nWrite up: First ever 2U play!! Let’s get rocking, BILLS MAFIA - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Bills ML at 55%\n\n• Model projects Bills +1.5 hitting at 59%\n\n• EV better betting 100$ = 14-15$ for this play\n\n• Part of me hates this bet, the other part of me loves this bet - regardless of how hot the Jaguars have been, and how bad the Bills have been this year, Josh Allen’s record in the playoffs vs good teams/QB’s - To give Josh Allen +1.5 in a playoff game, I’m all over that - Bills have the playoff experience, and they have Josh Allen - Allen has thrown for 3.5k + this year and his running game is great (he hasn’t ran much as of late probably because of his small foot injury) - James Cook, almost 2k rushing yards this year, has been on a tear all year - While Jaguars run D is pretty efficient,  I think Cook and the Bills have the edge here on the ground - If the Bills give the ball to Cook, feed him how they should, this game is 100% their’s, let’s just hope Joe Brady does that - Jaguars are HOT, riding a 8 game win streak, with their biggest win being on the road against the Broncos a few weeks back - The Buffalo Bills have the QB edge in this matchup, and I love that - Jaguars are a good team, do not get me wrong, but their schedule was not the best this year and in my opinion, that is concerning - The Bills have gotten a lot of criticism for their defense this year, but the last two games, they have turned it up, only holding the Eagles to 13 points - Josh Allen has been very good in the playoffs - he is efficient and he turns into MVP Josh Allen - Trevor Lawerence on the other hand, does not have the eliteness that Josh has, nor the playoff experience - I am riding with Josh Allen here, give me the Bills +1.5 for our first ever 2U play \n\nPOTD History: [https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn](https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn)\n\nBOL!\n\n**POTD: NFL: Buffalo Bills +1.5 vs Jaguars -114 (2U TO WIN 1.86U)**\n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q9j47j/pick_of_the_day_11126_sunday/nyvhuuy/"
    },
    {
      "created_utc": 1768087545.0,
      "author": "Vander_chill",
      "text": "**POTD Record:**  105 – 68 - 11\n\n**Previous:**  **NCAAF – Semifinal 1 - Miami Hurricanes vs Ole Miss** \\+3.5 – LOSS,  Semifinal 2 - Indiana ML & Over 38.5 pts – WINNING\n\n**Recaps:**  It’s a wash by ½ point.  Semi 1: Miami was clearly the better team, yet Ole Miss hung in there with a little help from the refs.  As expected, the game came down to the final few plays and could have gone either way.  We lost that bet by the ½ pt hook. \n\nSemi 2: Although Oregon started with a pick 6 and then fumbled time and again, Indiana was just was the better team by far.  Indiana made few to no mistakes other than a couple of penalties and dominated both sides of the ball.  I think they win it all.\n\n**New Event:**  NFL – Buffalo Bills vs Jacksonvillle Jaguars\n\n**Pick:**  Dalton Kincaid Longest Reception Over 18.5 yards @ 1.80 (Usual 3 units)\n\nFull disclosure:  This prop was recommended by the Betting Pros and Sharp Football and I have incorporated some details from those writeups.  As of earlier today this prop can still be found on Ceasars.  The line has moved to 19.5 most everywhere else.  I would still take it at 19.5, but not too juiced and no higher.\n\nWhen it comes to the NFL wildcard playoffs, I have learned to narrow my choices and look for two types of opportunities for bets.  Overs on QB rushing yards and Tight-End receptions/yards. Normally I lean towards Unders on props but playoffs are a different animal.  Both are situational depending on how I believe the games will play out.  \n\nIn the case of QB rushing yards, we see year after year even those QB’s that never run, will do so out of desperation in a loser go-home scenario.  Brady, Manning, even Marino, characterized as statues in the pocket have gotten most of their rushing yard stats during the playoffs. I look for QB’s with a low rushing yard total offered.  In the case of tight-ends, this is where they shine the most and become key receivers in difficult situations.  Gronk, Kelce, Gonzalez, are examples of legacy favorite targets for QB’s in big games.  This year should be no different for both prop types. \n\nI was looking at the Over on receptions for Kincaid, currently at 3.5 and at plus money which seemed more than fair.  However, when looking at the data there was a lack of consistency as he barely hits this mark in half of his games.  Then I stumbled upon the Betting Pros who have that same prop recommended as a 5 star play with a +27% EV. (I have placed this bet as well)  It seemed as I was still missing something here.  So being OCD, I scoured every bit of data on Kincaid on the internet.  Then, bingo!  I found a more compelling stat driven bet thanks to the folks at Sharp Football.\n\nWorth mentioning as a preamble is that in week 16 Dalton kincaid picked up an injury against the Browns in a game where he had 0 catches on 1 target. Then he missed the following game against the Eagles in week 17 due to the injury.  But came back last week (week 18) against the Jets where he had 3 catches for 48 yards with a long of 26. \n\nBulletpoints are in order:\n\n* Dalton Kincaid (DK) has played in 12 games this season and has a catch of at least 18 yards in 11 of them.  (week 16 vs Browns is the exception)\n* He also has a 20+ yard reception in 10 of 12 games.\n* His long receptions this year per game are: 22 18 20 28 23 23 47 20 20 24 0 26\n* Kincaid leads the NFL in tight-ends with the highest average in yards per catch.\n* If his projected over 3.5 receptions with a 5 star recommendation comes to fruition, I am confident that at least one will be for over 19 yards.\n* There is a case to be made that Jacksonville’s pass defense has not faced many elite QB’s of Josh Allen’s caliber as they have had the 6^(th) easiest schedule this season.\n* Jacksonvile is 29^(th) conceding receptions to tight ends.\n* Jacksonville has the #1 ranked rush defense in the NFL.  \n* The premise for this match is that as much as Buffalo would like to run the ball in Jacksonville, they will most likely be forced to throw the ball more than usual.  \n* The Jaguars have only lost 2 home matches this season, against the Rams and Seahawks, perhaps the 2 best teams in the league. \n* Neither the Rams nor Seahawks were able to rush rush for more than 90 yards in Jacksonville.  Buffalo will most likely fail to do so as well and be forced to pass.\n\nKincaid should get his share of targets and if he has been as dependable as his numbers suggest in every game he has played healthy, then another long catch of over 18 yards is not out of the question.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q9j47j/pick_of_the_day_11126_sunday/nyvhoqz/"
    },
    {
      "created_utc": 1768087535.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Sunday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q9j47j/pick_of_the_day_11126_sunday/nyvhnov/"
    }
  ]
}