{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/5/26 (Monday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1q45a0k/pick_of_the_day_1526_monday/",
  "target_date": "2026-01-05",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-04T23:42:46.432973+00:00",
  "comments": [
    {
      "created_utc": 1767569648.0,
      "author": "Wekken",
      "text": "**Record: 1-2** \n\n**Football Record: 1-2** \n\n**Net Units: -1.16** \n\n**Last 5** ❌️✅️❌️ \n\n**Sport:** Football \n\n**Match:** Egypt-Benin (17:00 CET) \n\n**Pick:** Egypt -1 AH \n\n**Unit stake:** 2U \n\n**Odds:** 1.75 \n\n**To win:** 1.50U \n\n**Recap:** \n\nFulham scored a quick goal and even managed a draw after an amazing last minute goal \n\nMan City had a devastating last minute equaliser but Chelsea had an extremely good second half and it was, sadly, deserved but unlucky for me \n\n**Write Up:** \n\nEgypt has looked better than their results show in my opinion \n\nFirst game dominating Zimbabwe but needing a late game winner from Salah. Second game getting an early lead and having to cling on due to a red card right before halftime. Final group stage game getting a draw while resting key players \n\nI expect them to win here and I think they will want to gain some confidence going into the final stage of AFCON \n\nBenin lost twice versus Senegal and DR Congo. They did manage a narrow win versus Botswana. Botswana themselves have been extremely out of form in 2025 so a win against them doesn't say much \n\nEgypt have the star players, better form and something to prove\n\nBOL everyone!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q45a0k/pick_of_the_day_1526_monday/nxpwfmu/"
    },
    {
      "created_utc": 1767569576.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Monday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q45a0k/pick_of_the_day_1526_monday/nxpw6wo/"
    }
  ]
}