{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/5/25 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/",
  "target_date": "2025-12-05",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-05T18:48:19.272349+00:00",
  "comments": [
    {
      "created_utc": 1764959074.0,
      "author": "Jmad_WSU",
      "text": "Record: 0-0  \nNet Units: 0\n\nNorte Dame vs TCU (NCAAB)  \nPick: TCU -7 (-110)\n\nObligatory, long time follower/first time poster statement. We get a treat tonight with my Zags playing Kentucky in Nashville. While that game is going on, we’re going to be focused on Norte Dame playing TCU at Schollmaier arena. \n\nWe’ll be backing TCU here for their elite defense. TCU is ranked 15th in defensive efficiency. They force turnovers at a 23.6% (9th) while Norte Dame has a turnover rate of 17.5% (good for 173rd). \n\nI will say Norte Dame is the better offensive team. However, they are too reliant on 2 players (Burton and Haralson). Teams that are top heavy struggle against athletic defenses on the road. Go Frogs! Lets go 1-0!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsgrh8j/"
    },
    {
      "created_utc": 1764953088.0,
      "author": "Supreme_Warzone",
      "text": "POTD Record: 5-2\n\nLast POTD: CeeDee Lamb Over 82.5 Receiving Yards ✅\n\nEvent: Philadelphia 76ers Vs. Milwaukee Bucks 8:000 PM EST\n\nToday's POTD: Tyrese Maxey Over 30.5 Points\n\nOdds: -113\n\nWrite Up:\n\n1. Role + usage = true #1 option:\nWith the new-look Sixers, Tyrese Maxey is the engine of the offense. He’s averaging about 32.6 points per game this season and has cleared 30+ in 12 of his first 24 games, which is basically a 50% hit rate at a pretty big number.\nPhiladelphia is also in injury flux: Joel Embiid played the first leg of the back-to-back, and multiple preview/prop pieces are projecting Maxey to remain the clear focal point tonight, regardless of Paul George’s status.\nSo you’re getting:\nLead ball-handler\nTop usage scorer\nHeavy minutes in competitive games\nExactly what you want for a high points line.\n\n2. Dream matchup: Bucks’ defense without Giannis\nThis is the big one.\nGiannis Antetokounmpo is officially OUT with a right calf strain and expected to miss 2–4 weeks.\nThe Bucks’ defense has already been shaky; they rank in the bottom third of the league in defensive efficiency (around 20–22nd) depending on the site.\nLast season, Giannis had the best defensive rating on the Bucks; he’s still their key backline fixer. Take him away and everything gets softer at the point of attack and at the rim.\nWithout Giannis, Milwaukee has struggled badly – one report notes they’re just 1–5 in games he doesn’t play this year, which matches the eye test: the defense loses its anchor and rim deterrence.\nFrom a matchup POV:\nThe Bucks’ current perimeter group doesn’t have a true “point-of-attack stopper” for a jittery guard like Maxey.\nThey’re giving up efficient scoring overall (defensive rating in the 117–118 range), which is exactly where you want to attack with an on-ball star.\nMaxey’s profile (quick first step, pull-up 3, floater, and finishing ability) is tailor-made to punish a defense that doesn’t have its best helper and rim protector.\n\n3. Game environment: competitive, star-driven, full minutes:\nBooks have this game lined extremely tight: Sixers around -1 to -1.5 on the road, with a total in the low 220s depending on the book (221.5–223.5 range).\nWhat that tells us:\nExpect a close game deep into the 4th quarter → Maxey should be on the floor 36–40 minutes if it’s not a blowout.\nTotal is healthy enough that one side can realistically produce a 30+ scorer, especially the team with the main offensive focal point and the better defense (Philly).\nBoth teams also tend to play through their stars late in games. In crunch time, the ball naturally gravitates to Maxey for high-usage pick-and-rolls and iso possessions, which means:\nExtra late-game shot attempts\nFree throws if the Bucks start fouling or over-helping on drives\nAll of this is exactly what you want for a points over.\n\n4. Recent form + line vs production:\nProp books and sharp sites basically agree Maxey is the primary scoring threat in this matchup:\nMultiple prop sites list Maxey 30.5 points as the highest player total on the board for this game, with odds around -110 to -116 on the over, essentially implying books expect him to live right around this number.\nOne betting preview explicitly notes that 30.5 is ~2.1 points below his current season scoring average, showing how much he’s been smashing this number on volume.\nSo we’ve got:\nHigh baseline production\nLine slightly below his season average\nEven better context than usual (no Giannis, shaky Bucks defense, tight spread)\n\n5. Pace, script, and “who guards who” Pace & script:\nBucks play at a league-average to slightly above-average pace; their poor defense plus solid shooting creates up-and-down sequences rather than low-possession rock fights.\nSixers are comfortable running with Maxey, especially when Embiid isn’t dominating the halfcourt post touches. Expect a fair number of early-offense threes and downhill drives.\nWho actually guards Maxey?\nWith Giannis out, Milwaukee likely throws a mix of mid-tier perimeter defenders and drop/big help coverage at Maxey. That usually leads to:\nDrop bigs giving up pull-up middies and floaters.\nPerimeter players going under screens getting punished by step-back/side-step 3s.\nHelp rotations being a half-step late without an elite backline eraser.\nAll of that favors a high-usage ball-handler with three-level scoring like Maxey.\nWhat could kill the bet?\nNothing is “free,” so here are the main risk factors:\nBlowout risk: If the Sixers run the Bucks off the floor without Giannis, Maxey could sit late 4Q with 27–29 points and never get the last few buckets.\nOff shooting night: High-volume scorers can still brick their way to a 10-for-26 type game.\nSurprise rotation/injury news: If Philly gets unexpected rest news or foul trouble, it can mess with minutes.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsg6wq9/"
    },
    {
      "created_utc": 1764952352.0,
      "author": "deforandom",
      "text": "Record: 18-18\n\nPrevious Pick: Detroit Lions ML (-160) vs Dallas Cowboys\n\nPick: Jets ML (-130) vs Sabres - NHL\n\nWrite-Up: Easy win yesterday from the Lions, I knew the Cowboys win streak was due for an L, as they are the cowboys.\n\nAnyways, we’re going with the Jets today, they are simply the better team playing at home and I think they should come through with a win here.\n\nBest of luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsg4dnq/"
    },
    {
      "created_utc": 1764951964.0,
      "author": "giovannidm15",
      "text": "Battle of the Greens",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsg31qd/"
    },
    {
      "created_utc": 1764951887.0,
      "author": "AdAggressive6388",
      "text": "Record: 2-2\n\nSport | NHL Dallas stars vs San Jose sharks \n\nPick: Dallas Stars -1.5 (-105)\n\nWrite Up: Dallas is just the better team in this match up. The sharks give up the most shots on goal of any team in the nhl and Dallas scores when given those types of opportunities. Dallas being home with one of the best pp in the league I expect Dallas to score a lot and win by 2 easily.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsg2s1z/"
    },
    {
      "created_utc": 1764951546.0,
      "author": "1Umerchant",
      "text": "POTD record 0-0-1\n\nLast pick: O147 LSU/ Boston College (push)\n\nEvent: Gonzaga @ Kentucky (ncaamb) 6 pm central \n\nPick: Gonzaga -4.5 (1.5u)\n\nGonzaga is the #14 offense in the country, the #41st defense \n\nKentucky #41st offense #14 defense. \n\nGonzaga just got smoked by Michigan so we are looking at a bounce back game. \n\nKentucky has lost to all 3 ranked teams they have played. And Gonzaga was looking like the best team in the country up until the Michigan loss",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsg1m71/"
    },
    {
      "created_utc": 1764950836.0,
      "author": "Klutzy-Sherbet-3423",
      "text": "Record: 1–0 | +1.0 units  \nLast pick: Pelicans +12.5 (W)\n\nPOTD: NBA – Nuggets at Hawks | **Atlanta +6.5 (-110), 1.1 to win 1 unit**\n\n**Intro**  \nBack with another play from my NBA projection model after starting 1-0. The model standardizes team metrics into z scores (positive is good, negative is bad) and converts the overall rating gap into a projected spread. There is no rest advantage for either side. \n\nThe model also shows value on Memphis +1.5, but Atlanta grades stronger and is the official POTD. In similar matchups this season, the model has identified value well.\n\n**Why the model likes Atlanta +6.5**\n\n**1. Denver’s offense grades well, but not enough to justify -6.5 on the road**  \nDenver shows strong offensive z scores across efficiency and shooting metrics, but the margin tightens once the defensive side is factored in, especially away from home.\n\n**2. Denver’s defensive profile contains several below average signals**  \nKey defensive areas come in negative for Denver, including:\n\n* Opponent Turnover% (-1.9 z score)\n* Defensive Efficiency (negative overall and worse on the road)\n* L3 Defensive Efficiency (-1.5 z score)\n\nThese metrics indicate that Denver has struggled defensively recently and does not generate the disruptive plays that usually help favorites stretch margins.\n\n**3. Atlanta’s biggest weakness is not one Denver can fully exploit**  \nAtlanta rates poorly in offensive rebounding and in preventing opponent offensive rebounds. However, Denver does not show dominant strength in these categories, so the matchup disadvantage is smaller than the raw numbers suggest.\n\n**4. Denver’s slow road pace limits margin potential**  \nPace Away comes in with a z score -1.5, meaning Denver plays significantly slower on the road. Fewer possessions favor the underdog, especially at a spread this size and when the favored team does not force as many turnovers.\n\n**5. The model’s projected spread is well below +6.5**  \nAfter home court and all standardized metrics are combined, the final projected margin comes in far tighter than the posted line. The matchup consistently points to this being closer to a 1 or 2 possession game.\n\n**Official pick: Atlanta +6.5 (-110)**  \nLooking to move to 2–0.\n\nBOL, everyone!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsfz6x7/"
    },
    {
      "created_utc": 1764949518.0,
      "author": "cedarrapidsiaus",
      "text": "POTD record: 48-29 (All bets 1 Unit unless stated otherwise)\n\nLast Pick: NFL Football 🏈 San Francisco 49ers vs Cleveland Browns. Browns Money Line (+197) Betonline ❌\n\nToday's Pick: College Football 🏈North Texas vs Tulane OVER 65.5 total points. 8 P.M. E.T. USA (-130) Draft Kings.\n\nSeeing this at -135 in other spots and like the value here. Dome game so perfect weather conditions usually aides points more times than not. Wouldn't be surprised if this hits in the 80's so i obviously like over 65.5.\n\nCORRECTION! GAME IS OUTDOORS but still like the over in wet conditions or dry. Thanks Hugh for the correction.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsfuqap/"
    },
    {
      "created_utc": 1764949231.0,
      "author": "Lyx97",
      "text": "Record: 7-3-2.\n\nNet Units: +1.77\n\n*Prev Pick : Leeds vs Chelsea: Both Teams to Score @ 1.73(1u) --> Win*\n\nIce Hockey | Deutsche Eishockey Liga | Kölner Haie – Nürnberg Ice Tigers | in \\~3hrs.\n\nTotal goals o5.5 @ 1.571 (1u)\n\nWrite Up: Coming back after a small break. Nurnberg have let in a lot of goals & Kolner have a pretty good offense. Also, for some reason, Kolner games at home always become high scoring ones. 6 goals should have a good shot of hitting\n\nHope we continue our wins & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsftrnh/"
    },
    {
      "created_utc": 1764948869.0,
      "author": "pedrophysis",
      "text": "POTD Record : 1-0-0\n\nPrevious: Crystal Palace Over 2.5 Corners First-half ✅\n\nGame: Football/Soccer - LaLiga Spain - Real Oviedo vs Mallorca\n\nPick - Mallorca Over 1.5 Corners First-Half\n\nOdds @1.63x (And my picks are always 1U, unless stated otherwise) \n\nWriteup: Hello fellow subs! My first pick went good, lets try this one today! I have Mallorca over 1.5 corners at first half, in what should be a competitive game of bottom teams, coupled to the fact that Real Oviedo is the most conceding corners team at halftime of LaLiga, and has conceded this line in their 7/7 last games!!! Mallorca isn't the biggest winning corners team oriented, but in this game they should easily cover this modest line in a first half contested game!\n\nLets get this one! BOL! :)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsfsk19/"
    },
    {
      "created_utc": 1764944607.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 3-2 (+1u)\n\nPrevious Pick - ❌George Pickens TD +125 (1u to win 1.25u)\n\nFriday’s Pick - Winnipeg Jets ML vs Buffalo -130 (1.3u to win 1u)\n\nBack to the ice. The Jets have been struggling and not having Helle is certainly an issue for this team moving forward. They actually just played Buffalo on Monday in Buffalo and lost 5-1 with their now starter Comrie in goal. I’m not sure who goes tonight for Winnipeg, but they are back in Winnipeg and I’m sure have their most recent loss to Buffalo on their mind.\n\nI’ll buy the dip on Winnipeg here for tonight.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsff831/"
    },
    {
      "created_utc": 1764943383.0,
      "author": "Hefty_Night1892",
      "text": "**Yesterday's POTD**: Man U vs West Ham BTTS Yes (-140 Draftkings) [3u] 🤑\n\nBang bang boys, we did it again! Another one in the win column, even if it had the heart racing after a goaless first half. That was a serious sweat, hopefully none of you cashed out early, because West Ham’s new boy Magassa came up clutch late on and dragged us over the line. Another W secured. We go again, lads. ⚽🔥\n\n**Record**: 3W-0P-1L | **Net Units**: +3.74u | **Form**: ✅️❌️✅️✅️ \n\n⚽️Soccer | 🇫🇷Ligue 1 | Lille vs Marseille | 3:00pm EST \n\n**Today's POTD**: Pierre-Emerick Aubameyang to Score or Assist (+130 Draftkings) [2u]\n\nAlright boys, this one is a bit speculative, but the form Aubameyang is in right now is too good to ignore. The man has either scored or assisted in four straight matches for Marseille, and it’s especially worth noting that he dropped a goal and two assists in their last away outing against Nice. When a striker is this confident, you ride the wave.\n\nHis consistency lately is undeniable. Aubameyang is reminding everyone why he’s been considered one of the top strikers in world football for years. The movement, the finishing, the creativity, he’s delivering big performances week after week, and Marseille are leaning heavily on him to spark their attack again tonight.\n\nThat said, it is still a speculative play because Lille’s defense is no joke, they’ve shown plenty of structure and discipline this season. For that reason, I’d recommend keeping this to no more than 2 units, trusting the form but respecting the matchup. Let’s see if Auba steps up for us again, boys. ⚽🔥\n\n*Tail responsibly. Bet only what you can afford to lose. DM to join my soccer only betting group on Draftkings.* **BOL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsfblvq/"
    },
    {
      "created_utc": 1764943122.0,
      "author": "Present-Grab-7826",
      "text": "bam double double",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsfauo4/"
    },
    {
      "created_utc": 1764943070.0,
      "author": "Elevate203",
      "text": "Record: 5-1\n\nLast POTD: Josh Minot o7.5 points (-122) ✅\n\n**Great team win for the Celtics last night, and Josh Minot continues to consistently hit the corner three and get out in transition.**\n\nToday’s Event: San Antonio Spurs @ Cleveland Cavaliers 7:40 PM EST\n\nPOTD: DeAndre Hunter u16.5 points (+104)\n\nReasoning: Going out on a limb here with the Cavs at home against a hot Spurs team. Cleveland just had a tough loss at home to Portland, and will be looking to redeem themselves tonight. Hunter has scored over this line only 3/10. The Spurs have some length at the forward position with Sochan, I expect a big game out of Spida tonight, and think Darius Garland is out tonight, so Craig Porter Jr will get some good minutes. I still feel good about this line, but limiting to 1 unit. Spida will dominate the ball tonight, and like our chances of this going under. Tail at your own risk, and BoL!!!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsfapc1/"
    },
    {
      "created_utc": 1764942654.0,
      "author": "No-Cryptographer2490",
      "text": "Record: 8-4 ✅✅❌✅✅✅❌❌✅❌✅✅\n\nNet Units: +7.52U\n\nAll bets are 1U unless otherwise stated\n\nLast pick:  Saddiq Bey points ov 16.5 ✅\n\nSport: Basketball League: NBA Event Time: 7pm ET \n\nPick:  Norman Powell Points ov 19.5 (-125, 1.80x) 2U (ESPN BET) \n\nWrite Up: Good cash yesterday, let’s try and go 1-0 today. Taking Powell points over he’s hit this line in 8/10 previous games. He had 28 last time they played.The magic have found their footing offensively as of late with an up paced tempo that complements the heats top 5 pace this season resulting in a lot possessions and a lot of scoring. This would be easy money if not for Powell dealing with an ankle injury if he plays the full game this should be an easy cash. \n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsf9hna/"
    },
    {
      "created_utc": 1764937612.0,
      "author": "san_solares",
      "text": "Net Units: +61.40  \nROI: 18.89%  \nRecord: 38-17-9 (W/L/P)\n\nLast POTD: Manchester United -1.0 AH (L)  \nThis is what I get for believing they were a good team.\n\nAs always, full transparency, tracker at the bottom.\n\nToday's POTD: Turkish Superlig - Galatasaray v Samsunspor - 12.00 PM EST - Galatasaray -1.0 Asian Handicap (1.70) - 5U\n\nGame is played in Rams Park. For those that don't know, Turkish football is probably the most home ground heavy favorites because of the sheer madness the fan environment is. Add to this, that Samsunspor has never even tied vs Galatasaray when playing in Istanbul. (L3 matches being 3-2, 4-2, 3-1, all in favor of Galatasaray) \n\nGalatasaray is riding the hot hand at home with only one loss since may. We will be taking the Asian Handicap to protect ourselves in case they only win by one.\n\nBOL, tail responsibly.\n\n[TRACKER](https://docs.google.com/spreadsheets/d/1-PHX-U7eiB5neVpbTJVkzwquGE1KyGVQA5nfejcDT_A/edit?usp=sharing)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsewfkw/"
    },
    {
      "created_utc": 1764933458.0,
      "author": "Accomplished-Gear879",
      "text": "POTD Record: 0–1 / - 1 Unit  \nLast Pick: Manchester United ML & Over 2.5 (LOST)  \nManU had their chances, but in the end it just wasn’t enough. Still think it was a solid pick overall.\n\n**POTD: German Bundesliga - Mainz vs. Mgladbach ML @ 2.62 - 1 Unit**\n\nMainz haven’t won a match in over a month. On top of that, two of their starters are suspended after getting red cards. Yeah, Gladbach are also missing a few players due to injuries, but they should still be able to perform against Mainz. Odds were 2.75 earlier tonight and already dropped to 2.65, while Mainz went up from 2.25 to 2.55. Let’s see how it goes.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsenxr2/"
    },
    {
      "created_utc": 1764932523.0,
      "author": "20k_rpm",
      "text": "Record **:** **21** W **- 16** L\n\nForm **:** ✅✅✅❌✅❌❌❌✅✅✅❌✅✅✅❌✅❌❌❌✅✅❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌\n\nEvent **:** Counter Strike **| Starladder Budapest | Faze vs Mongolz**\n\nPick **:** **Faze to win** **|** 2 units **@ 1.9 odds**\n\nReasoning **:** most likely map will be mirage. both teams are very shaky currently. so picking faze for their experience.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsem89l/"
    },
    {
      "created_utc": 1764931138.0,
      "author": "oldpascas",
      "text": "**Record:** 2-0  \n**Last Pick:** Manchester United vs West Ham UNDER 3.5 @ 1.62 (1 unit) **W**  \n**Net Units:** \\+3,35\n\n**Soccer | 2. Bundesliga | Dec 5, 2025 | 18:30 CET / 12:30 PM ET**\n\n**Pick:** Fortuna Düsseldorf vs Schalke 04 – **Schalke ML @ 2.25 ( 1 unit)**\n\n**Write up**:  Was tempted to go with Mainz under a new head coach at home, but decided against it. \n\nMy model loves Schalke today, projecting a 48-51% win probability.\n\nSchalke is flying right now - 1st place and boasting the league's best defense (only 8 goals conceded). \n\nDüsseldorf is the complete opposite: 14th place, the worst home team in the league, and the weakest offense. It’s a nightmare matchup for them. Getting 2.25 on the league leaders against a relegation candidate feels like a gift. My adjusted numbers see an edge here. Backing the best defense against the worst offense at plus money is a no-brainer. Düsseldorf's tendency to dominate in possession when playing at home is a perfect match for Schalke's style under Miron Muslic. Solid defence and quick counterattacks! \n\nBut, it could easily be a goalless draw, so under 2.5 Goals might also be solid value @ 1.93 odds.\n\n  \n**Please only bet money that you can afford to lose. BOL to all of you!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsejrgp/"
    },
    {
      "created_utc": 1764924001.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 16-9, +6.03u, (ROI +19.8%)\n\n**Previous Pick:** Euroleague: Partizan - Bayern, under 164.5 points, 1.82, 1u ❌️, (last 5: ✅️❌️✅️✅️❌️)\n\n**Event:** Eurocup: Besiktas - Panionios, 18:00\n\n**POTD:** Besiktas to win by 19 or more, 1.84, 1u\n\nPanionios is having a terrible season, maybe the worst in club history. On top of that, one of their main players, Michalis Lountzis, injured his ACL recently, at least 6 months out. They are dead last in the Greek league and in the Eurocup.\n\nBesiktas is going nicely on both fronts. Coach Alimipijevic, the new head coach of the Serbian national team, is back. They have some really good players on their roster, nice offense, and average 91.4 points in the Eurocup. I like the big win for this one.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nse7i5i/"
    },
    {
      "created_utc": 1764922825.0,
      "author": "kicsimani",
      "text": "POTD RECORD 1W-0L\n\nUnits: +.94\n\nLast Pick: Brooklyn vs. Utah 231.5o ✅\n\nToday: Boston vs. LA 2(+6.5) @1.94\n\ntwo teams in good form meet, I understand that the home arena gives a lot of momentum to the Boston team and the atmosphere but this is not the first time James has been to Boston. LA is playing exceptionally well abroad I see more value in adding to the odds and a surprise is looming in my mind but a safer bet is +6.5. I hope for a good match when they meet and go LA \n\nBol",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nse5kje/"
    },
    {
      "created_utc": 1764920580.0,
      "author": "this_guy9",
      "text": "POTD Record: 14-10\n\nNet Units: +5.31\n\nPrevious Pick: [✅ Jordan Walsh o5.5 Rebounds +104](https://www.reddit.com/r/sportsbook/comments/1pdl7cq/comment/ns7ryqe/?context=3)\n\nWalsh has a monster game, cashes easy for us for a nice plus money winner. Big day today:\n\n**🏀 Jamal Murray o23.5 Points -110** vs the Atlanta Hawks\n\nThis line feels disrespectful for two reasons:\n\n1. Murray is coming off a 52 point game vs the Pacers\n2. Most of the Nuggets weapons are still injured.\n\nMurray has cashed in L4/5 and though Cam Johnson is back, that hasn't diminished his opportunities. He's averaging 34-36+ minutes with plenty of usage alongside Jokic.\n\nHawks are weak against PGs. They rank 27th in Points Allowed to PGs and even CJ McCollum torched them for 46 points (though that was a bizarre game).\n\nBoth teams ranked middle of the NBA in pace yet the books still have the over/under very high at 238.5. Expecting scoring and Murray to lead the charge.\n\nFull stats if you'd like to do additional research:  [https://www.statpick.ai/36268099/jamal-murray-points](https://www.statpick.ai/36268099/jamal-murray-points)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nse1qsf/"
    },
    {
      "created_utc": 1764920177.0,
      "author": "redditusernameuneak",
      "text": "Record: 1-2 \n\nPrevious Pick: (NBA) Vince Williams Jr over 11.5 RA (Rebounds & Assists) ❌ 0-2 for NBA picks now\n\nEvent: (WNBL) Perth Lynx (W) vs Southside Flyers (W)\n\nPOTD: Perth Lynx (W) -7.5 (1.87 on Bet365, 1.15units for 1 unit) ✅ game ended Lynx 98 - Southside 81\n\nWrite-Up: Lynx will play at home for the first time with their new import Han Xu, I see them putting on a show against the Flyers for the (likely sold out) crowd. Game starts in a little less than 3hrs.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nse124a/"
    },
    {
      "created_utc": 1764919645.0,
      "author": "jaysial",
      "text": "Cricket 🏏 Picks\n \nLast pick was a Win 🤘 \n\nOverall: 50💰- 27 ❌\n\n+9.69\n\nLast 10: 🥇💔🥇🥇🥇🥇🥇🥇💔🥇\n\nTodays pick\n\nAbu Dhabi Knight Riders v Desert Vipers\n\nStarts in about 7 Hours ⏳\n\nPick: Total Sixes over 16.5 @ 1.85\n\n* Small Sharjah ground\n\n* I think Hales / Livingstone / Russel / Fakhar / Hermyer / Sam Curran will do the job for us",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nse05cf/"
    },
    {
      "created_utc": 1764918576.0,
      "author": "rorymcilroy3",
      "text": "Record 0-0\n\nEvent : Hero World Challenge (Albany GC) 8:46am (PST)\n\nPOTD: Justin Rose round 2 over 5.5 birdies or better (-105)\n(1 unit) \n\nWrite Up: Other than the fact that this is Justin Rose’s home course, Albany GC is a birdie machine. Seven par 5’s and a few drivable par 4’s. Over his last 5 rounds at the Hero Rose has averaged just over 6.5 birdies per round. The wind is expected to stay calm similar to today when Rose had 7 birdies. I expect a birdie fest from Rose all round long.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdy95l/"
    },
    {
      "created_utc": 1764917341.0,
      "author": "Master-Difference951",
      "text": "POTD Record: (1-0)\n\nLast Pick: Austin Reaves 30+ points (+104)\n\nCrazy third quarter from Austin Reaves last night to cash this pick with ease!! \n\nToday’s Pick: Collin Gillespie O 2.5 threes (-160 on fanduel)\n\nThey stay sleeping, he’s been cashing this line with ease for a while now and especially with no booker should be getting more looks and minutes.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdvzio/"
    },
    {
      "created_utc": 1764916456.0,
      "author": "ProperBettor",
      "text": "POTD RECORD : 2-2 \nNet Units : -0.1U\nPrevious pick : Match sixes over 14.5✅\n\nToday's event : ILT20 league - Abu Dhabi Knight Riders vs Desert Vipers\n\nPick : Match sixes over 16.5 @1.9 1U\n\nWrite up: Easy win last time. Expecting another sixes fest here.\nWorth noting that the venue i.e Sharjah Stadium is one of the shortest grounds in cricketing venues. The usual pattern in Sharjah pitches is that it's batting paradise for the first few matches and then it becomes extremely slow and difficult to bat on later. \n\nA total of 30+ sixes were hit in the first match held here. Abu Dhabi have Russell, Hales, Narine, Rutherford and others that are known for powerful strokes and can clear ropes. Meanwhile Desert Vipers got Fakhar, Hetmyer and Sam Curran. \n\nShorter sides, powerful batsmen and early in the tournament - these factors made me go for total sixes for today \n\nGood luck if you're tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsducbx/"
    },
    {
      "created_utc": 1764914221.0,
      "author": "Famous_Reindeer_5777",
      "text": "POTD Record : 1-0-0\n\nPrevious - Midtjylland to score both halves✅\n\nGame - Tikves v Struga 🇲🇰 \n\nCompetition - 1.MFL 🇲🇰 \n\nPick - Struga o1.5 team goals\n\nOdds - 1.62\n\n5/12/25 - 12:00 GMT\n\nReasoning - Struga are flying at the minute this pick has landed in 18/19 of there last fixtures. There just a point behind Vardar Skopje who are the giants of Macedonia but Struga are putting up a fight. Was tempted to go o2.5 goals in overall match which is better odds but much prefer this pick.\n\nYour odds will most likely be better than mine so please look around, these are best odds for me due to being limited\n\nGood luck everyone",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdq287/"
    },
    {
      "created_utc": 1764914203.0,
      "author": "Sad-Appearance222",
      "text": "POTD Record : 4 - 1\n\nNet Units : +1.72\n\nLast pick : Arsenal vs Brentford Over 1.5 goals = 1.22 + Chelsea to win or draw = 1.25\nTotal odds 1.52 (1 Unit) ❌\n\nSorry about the last pick if anyone tailed. Chelsea just burnt me last day. They were off.\n\nEvent : La liga, Real Oviedo vs Mallorca + France, League 1, Brest vs AS Monaco.\n\nPick : Real Oviedo vs Mallorca Over 7.5 corners = 1.32 + Brest vs Monaco Over 7.5 corners = 1.32\n\nTotal odds 1.74 (1 Unit)\n\nWrite Up : \n\n* Mallorca conceded 42 corners in their previous 6 La Liga games, averaging 7 per game and Real Oviedo conceded 38 in their previous 6 games averaging over 6.\n\n*  Last 6 games out of 7 ended up consisting 10 corners or more in Brest vs Monaco matches. Brest conceded 27 corners in their recent 6 League 1 matches, while Monaco conceded 20. \n\n According to the statistics, It’s highly probable to cover over 7.5 corners line for both matches today.\n\nI always try to be at the safe side. But, in sports betting; anything can happen. \n\nSo, Bet responsibly. Good luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdq0x0/"
    },
    {
      "created_utc": 1764913179.0,
      "author": "Ralphjinasseater",
      "text": "\nRecord 12-12-2\n\nLast pick: Josh Giddey “U” 21.5 Points (-105)❌\nPlayed: HardRock | Bet: 1U\n\n\nPick of the day : Pascal Siakam OVER 30.5 points + rebounds (-125)\n\nReason • \nSiakam has been an absolute wagon for us this season and were going back to him here, let me break this down👇\n\nSiakam has been the clear #1 option for the Pacers this season with a lot of their players being injured he has stepped up big for them, This season Siakam is averaging 31 PR a game on 11.7 rebound chances per game and 18.2 FGA per game, compared to last season where he averaged just 25.9 PR a game on 11.7 rebound chances per game and just 14.7 FGA per game.\n\nScoring matchup breakdown👇\n\nSiakam gets an amazing matchup versus the Bulls who allow the most PPG to PFs(26.70). Siakam sees a combined 47% of his points from Transition, Free Throws and spot up where the Bulls rank (18th, 20th and 20th), this is gonna be great for Siakam as the Bulls are a bad defense against all of Siakam’s scoring types so I expect him to see high shot volume here.\n\nWhen playing teams that rank 15th or worse against transition Siakam is over this line in 5/7 games avergaing 33.1 PR per game.\n\nWhen looking at scoring zones Siakam gets a great matchup as well, Siakam gets a majority 31% of his points from the RA, a zone the Bulls allow the most PPG against, and the Bulls run a small ball lineup with their tallest player being vucevic who is just 6’9, which is gonna lead to Siakam being in the interior a lot which is gonna lead to great rebounding volume.\n\nSIakam also gets a great matchup when looking at shot types, as he gets 46% of his shots from <10 feet where the Bulls allow the most PPG against.\n\nRebounding matchup\n\nThe main reason I am leaning towards PR here is because this is a great matchup for Siakam against the Bulls who have been getting killed on the boards this season allowing the 10th most rebounds per game to PFs(10.23) and the 6th most total rebounds per game.\n\nIn Siakam’s last matchup versus the Bulls he recorded 9 rebounds on 14 rebound chances in that game.\n\nWhen seeing just 12+ rebound chances Siakam is over this line in 9/14 games avergaing 35.8 PR a game.\n\nThe Bulls struggle against forward’s/centers who are big and fast.\n\nRecent performances versus the Bulls 👇\n\nMichael Porter Jr. 43 (Line: 32.5)✅\nMiles Bridges: 30 (Line: 27.5)✅\nAlex Sarr: 27 (Line: 25.5)✅\nKel’el Ware: 34 (Line: 21.4)✅\nLauri Markanen: 54 (Line: 33.5)✅\nEvan Mobley: 32 (Line: 29.5)✅\nGiannis Antetokounmpo: 56 (Line: 43.5)✅\nKAT: 35 (Line: 33.5)✅\nWemby: 50 (Line: 38.5)✅\n\nWhen seeing matchups like this, versus teams bottom 10 against transition and bottom 10 in rebounds allowed Siakam has cleared this line with ease going over in 5/6 games avergaing 34 PR a game with.\n\nSiakam saw great usage in his last game versus the Bulls going for 24 points on 23 FGA and he saw 9 rebounds on 14 chances in that game.\n\nWhen seeing just 15+ FGA on 11+ rebound chances Siakam is over this line 9/11 games avergaing 35.5 PR a game.\n\nSiakam’s numbers go up when you look at him when playing just 32 minutes clearing this line in 11/15 games when seeing 32+ minutes averaging 33.5 PR a game, and I expect 35+ minutes here in a game that should be competitive favoring the Bulls by +5 so I’m expecting this to be a close game, as in their last matchup the Pacer’s won by 2 on a Siakam game winner.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdny2t/"
    },
    {
      "created_utc": 1764912948.0,
      "author": "2thyKing",
      "text": "Record: 4-1 (W4)\n\nNet Units: +3.73\n___\n￼￼￼Last pick:\n\nIvica Zubac 11+ reb and Jalen Johnson 8+ reb (partial win, JJ leg pushed and Zubac hit) \n____\n\n￼￼￼Today’s pick:\n\nNBA Basketball 🏀\n\nLA Lakers @ Boston Celtics | 7:00PM EST / GMT -5 (18.5 hours from time of comment)\n\n**Derrick White OVER 22.5 Points + Assists**\n\n(-112 DK) 2 units\n\n￼Write Up: Derrick White has scored an average of 22.2 PPG over his last 5, and put up his first 30 point game Thursday vs the Wizards. He paired that with 9 assists. He’s averaged 5.4 APG over the last 5 games and is definitely feeling himself right now. \n\nThe Lakers are allowing 32.1 assists to opponents over the past 3 games, *worst* in the NBA over that stretch. They gave up 39 assists yesterday to the Raptors.\n\nIt is the second night of a back-to-back for Boston, but yesterday’s game saw the Celtics leading by 30 going into the 4th so White got the 4th quarter off to sit and rest up. I expect him to easily eclipse this mark and am putting 2 units on it! \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdngrv/"
    },
    {
      "created_utc": 1764912869.0,
      "author": "EthicalGambler",
      "text": "#*I am tracking cappers who post in these threads and will continue to do so for the foreseeable future. [Here is the new document which started tracking 09/01/25](https://www.potd.lol/today?utm_source=redditpost).*\n\n**My Record:** 70-62-3 (+0.40u)\n\n**Today’s Pick:** Jonas Valanciunas o7.5 points (Nuggets vs Hawks)\n\n**Odds:** -120\n\n**Units:** 1.2\n\nTip off is 4:40pm PST. I'm continuing with this system of Valanciunas hitting 8 or more points. Jokic is yet to miss a game this season but in games where he he plays fewer than 35 mins the Nuggets have won. These two typically switch off player center. Being that they are -6.5 favorites to win today I suspect we will see mores minutes for Valanciunas today and more as the season continues. \n\nI run this system until it is productive so in the event that this does not hit I will run it again on Sunday. \n\n**Previous Pick**: Jonas Valanciunas o7.5 points (Nuggets vs Suns) ✅\n\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/EthicalGambler-U6cnjV?utm_source=mdembed&utm_campaign=EthicalGambler) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdnb1m/"
    },
    {
      "created_utc": 1764910823.0,
      "author": "Ok-Actuary-4654",
      "text": "POTD Record: 6-0-0 (+28.15 units)\n\nStreak: 6W\n\nLast 10: WWWWWW \\_ \\_ \\_ \\_ \\_ \\_ \\_\n\nLast Pick: Detroit Lions -3 (-105) 5 units vs Dallas Cowboys\n\nLast Pick Reflections: Cowboys offense came to play and as expected, one of Lamb or Pickens was going to get neutralized by Campbell. It helped that Lamb went down with an injury, but fluornoy stepped up really well in his absence and nearly took over the game. Why I don't trust the Cowboys is because of their defense, and they got absolutely gashed on short throws and Goff had his way even though his final statline doesn't indicate how dominant of a performance this was from Detroit. Glad to have gotten the win and keep the streak going!\n\nEvent: North Texas vs Tulane NCAAF\n\nPOTD: Tulane Moneyline (+115) 5 units\n\nUNT (North Texas) has a VERY explosive offense (points per game (46.8) and yards per game (512)) so I'm expecting a lot of points here tomorrow. They have a wide arsenal of weapons that makes their pass game look almost effortless at times. Tulane, however, is a proven battle-tested team and while they have not looked as good at UNT down the stretch, I see this as another classic case of overvaluing of a team that seems to be clicking at the right time, but in my perspective of watching UNT play, they feast on bad teams. They trot down the field against bad teams. They make football look easy against bad teams. Where Tulane has the advantage here based on watching their film is a highly-physical defensive line, and if they can generate pressure on Drew Mestemaker and neutralize the likes of Caleb Hawkins and Wyatt Young, then I think Tulane has the potential and talent to win this game. Their main gripe, however, is their inconsistent play so if you want to reduce your unit size, that's understandable. If Tulane can capitalize on their opportunities, I expect this to be a grind-out victory for them. This game should have a playoff-like atmosphere and I love backing home CFB teams in this spot. \n\nJust to reiterate, in conjunction with my model, I use the eye test as well as my gut feeling to play what I believe is the most-valuable pick on the slate. Cheers to a great game, and please remember to gamble responsibly and to only wager what you can afford to lose.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdivke/"
    },
    {
      "created_utc": 1764910576.0,
      "author": "NateTheGreat1004",
      "text": "Record: 26-15\n\nNet Units: +11.49\n\n**Last pick:** Drummond o12.5 rebounds L\n\nHe got injured so we will never know if he would have got 13.\n\nPick: **Austin Reaves o31.5 points** | NBA | 7:10 pm ET | (1.82 on FD) (2 units)\n\n**Writeup:** No Doncic = Reaves balls out.\nIt is not confirmed, but from the statements released, there is no clear date when he will come back. And from another source, he's welcoming his 2nd child. I dont think he plays, which makes this great value. If I lose this, I'm giving up till next year.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdib4k/"
    },
    {
      "created_utc": 1764910466.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 23-11 (+14.1U)\n\nLast Pick: Louisville -2.5 (-110) (1U)🙅‍♂️\n\n[Louisville write up](https://www.reddit.com/r/sportsbook/s/J4tCbSd5n5)\n\nTotal bad read on my end. We use the sharp square divide logic for our bet on notre dame three days ago yet totally went the square route for Louisville. They shot miserably the first half too. Bad beat but if you’ve been following you know we have never lost two in a row.\n\nEvent: Quinnipac @ Iona (NCAAB) (6pm central)\n\nPOTD: Over 163.5 (-110) (1U)\n\n-everything is bet to win unit amount-\n\nWrite up:\n\nIn a game that’s projected to already be tightly contested (2.5 spread) the over makes a ton of sense here! Both teams inside  the top 25 in Kenpom adjusted tempo and love to push the pace! They both average above 37% from downtown which both rank inside the top 60 nationally and on top of that, quinnipac is allowing almost 34% from downtown. Iona has only allowed 16% from downtown but I do believe negative regression will seep in soon. They allow almost 25 attempts from downtown per game good for 255th nationally and their schedule has been against teams who don’t usually shoot well form downtown but that will change here! \n\nBoth teams also rank below 330th nationally in opponent field goals attempted per game! Meaning they allow a shit ton due to their pace \n\nOn top of this iona is 6-2 to the over and quinnipac is 4-3 to the over\n\nThe line has moved to 163.5 after opening at 161.5 but I like it still. Over makes sense. Let’s get back on track\n\nAs always, cheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdi1vx/"
    },
    {
      "created_utc": 1764909226.0,
      "author": "PurpleDragonBets",
      "text": "Record: (115-74-11) \\[+17.64\\]\n\nPOTD⭐️:🏈Boise State -3 (-143) \\[BallyBet\\]\n\nStart Time & TV: 8:00pm EST (FOX)\n\nUnits: 3.5 Units\n\nReasoning: To kick off championship weekend well be going with the Boise State Broncos against the UNLV rebels in the Mountain West championship game. Boise State and UNLV have faced off earlier in the year and the Broncos trounced the Rebels 56-31 and the Broncos just could not be stopped on offense in that game. Runningback Dylan Riley had his best game of the year against this Rebels defense, running for over 200 rushing yards and averaging over 13 yards per rush attempt, he looked like former Broncos runningback Ashton Jeanty against this Rebels defense and I think he will have another great game against them in this conference title. The Broncos will also be getting their star quarterback Maddux Madsen back who missed that past few games due to injury and when he faced off against UNLV earlier this year he had an amazing performance throwing for 4 touchdowns and averaging 11 yards per pass attempt. These two teams are very different on the defensive side of the ball, the Broncos have a top 10 pass defense in the nation only allowing 167 passing yards per game while the Rebels are ranked 113th in pass defense allowing just about 250 passing yards per contest. Boise State also has the defensive edge in rushing yards per contest and points allowed per game. Boise State also has home field advantage in this one as the Mountain West title game isnt played on a neutral field so I see that as another huge advantage in this one. I expect Boise State to win by more than field goal again against the Rebels and take the Mountain West title for the second straight year.\n\nPrediction: 34-27 Broncos\n\nLast pick:🏀Indiana -2.5/LSU -1.5💩Indiana has no business being in the top 25 after that performance.\n\nBest of luck to everyone tailing and remember to bet responsibly! Happy championship weekend everyone lets have ourselves a great weekend!!🍀🍀\n\nhttps://preview.redd.it/vhmcmr09db5g1.jpeg?width=1170&format=pjpg&auto=webp&s=c20c0f6af058dd187d769758b7fcc6a1dec08d2b",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdf480/"
    },
    {
      "created_utc": 1764908764.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 204-151\n\nUnits Won: +122.96u\n\nLast Pick: NOVAQ Map 2 ML (-122) vs. FORZE Reload ✅\n\nToday's Pick: **Twistzz>bLitz Map 1 Kills + JT>Siuhy Map 1 Kills (+104)** 5u\n\nGame/League: Counterstrike 2 | Starladder Major | Teams/Time in screenshot below\n\nhttps://preview.redd.it/hnsdtbprab5g1.png?width=246&format=png&auto=webp&s=e8c9508b6921b6f79d8b531cd03dead85cf36304\n\n**Twistzz>Blitz Map 1 Kills (-263)**\n\n* Twistzz averaging a .78 KPR L3 months, leading FaZe and both teams in KPR by a good margin\n* bLitz averaging a .61 KPR L3 months on MongolZ, worst rated player on MongolZ since Senzu left,\n* FaZe higher seed so they will start on CT side, where both of these guys are much better on respectively\n* Maps up in the air multiple ways it can go, expecting Mirage/Inferno\n* Twistzz is averaging a .88 KPR L3 months on Mirage and a .78 KPR L3 months on Inferno\n* bLitz is averaging a .54 KPR L3 months on Mirage and a .61 KPR L3 months on Inferno\n* Expecting FaZe to take down MongolZ here, kinda suprised by the odds, FaZe have been the much more active team playing since phase 1, already beat Vitality who are a top 5 team and lost to Spirit, meanwhile MongolZ have had a cakewalk with Imperial/Liquid\n\n**JT>Siuhy Map 1 Kills (-208)** \n\n* JT is averaging a. 62 KPR L3 months for Passion UA\n* Siuhy is averaging a .55 KPR L3 months for Liquid\n* So far at the major Siuhy is averaging a .44 KPR at the major in 11 maps\n* JT is averaging a .66 KPR at the major and has been his teams second highest player\n* Passion UA ban Ancient, Liquid ban Overpass Passion UA pick Train, Liquid's weakest map by a wide margin and one of if not Passion Ua's best maps in the pool\n* JT averaging a .66 KPR L3 months on Train, a .86 KPR at the major so far on the map, and a .67 KPR in the L6 months since picking up Kvem\n* Siuhy is averaging a .45 KPR L3 months on Train, a .52 KPR L6 months and a .51 KPR in 2025",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsddzjg/"
    },
    {
      "created_utc": 1764908033.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 17-9 (+17.87$)**\n\nLast POTD: NFL Cowboys vs. Lions O45.5/Dak & Goff 500+ Passing Yards -135 (2.50$ TO WIN 1.85$)✅\n\n**POTD: 2 Pick Parlay: NBA Nuggets ML vs Hawks / CFB Boise State vs UNLV o48.5 (2.50$ TO WIN 1.91$)**\n\nWrite up: My model says this is the top play for the day. I will always try to get odds that between +100 & -120 for you all. Model is having this is the best bet today. We are back with the 2-leg parlay. I hate betting on the NBA, but trying to get plays out for you all everyday! This is what the models got!\n\n• ⁠Have been playing around with spreads and over/under with the model and we are 5-0 since parlaying both\n\n• ⁠Model is showing Hawks covering the +8.5\n\n• ⁠Model says Nuggets has a 68% chance of winning\n\n• Model is leaning o58.5 for Boise vs UNLV, but only a 53% chance of hitting that over \n\n• Last game between Boise and UNLV ended with 87 points - model isn’t projecting number, but leans the over\n\nLet's keep rolling.\n\nBOL!\n\n**POTD: 2 Pick Parlay: NBA Nuggets ML vs Hawks / CFB Boise State vs UNLV o48.5 (2.50$ TO WIN 1.91$)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\nhttp://buymeacoffee.com/claysmiith\n\nhttps://venmo.com/u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsdc4es/"
    },
    {
      "created_utc": 1764907226.0,
      "author": "schleperr",
      "text": "Record: 1-3, -2.09u\n\nPrevious Pick: USF +1.5 💰\n\nToday's Pick: NCAAB Quinnipiac +2.5 -110 @ Iona\n1U to win 0.91U\n\nWrite Up: Into the win column (on here). Getting our revenge on Iona is with this pick. Fool me once, shame on you. Fool me twice, can’t get fooled again. Let’s ride.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsda32z/"
    },
    {
      "created_utc": 1764895602.0,
      "author": "GeraltDuke",
      "text": "POTD Record: 2 - 0 \n\nPrev Pick : Jared Goff O249.5 Pass Yds @1.8 1u to win 0.8u ✅🔨\n\nNet Profit : +1.6 \n\nEvent: NCAAB |  Quinnipiac @ Iona | 8.15PM EST\n\nPOTD: Iona -2.5 @1.8 1u to win 0.8u\n\nWrite Up:  \n \n\nIona’s offense finally found rhythm the last couple games better shot selection, guards pushing pace, and they’re actually hitting their open threes instead of just pretending they might. Plus, defensively, they’re way more physical than Quinnipiac is ready for.\n\nAnd honestly, Iona only needs to win by a couple buckets. With the way they’re attacking the paint and controlling tempo lately, that’s not a big ask. Quinnipiac can hang for stretches, sure, but they don’t have the consistent scoring to punch back for a full 40.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nscdw9r/"
    },
    {
      "created_utc": 1764895330.0,
      "author": "MrPunter500",
      "text": "**Record: 2-1**\n\n**Net Units: 0.5 units up**\n\n**ROI: 16.67%**\n\nLast Pick: Parks vs Dodin - Dodin Handicap +4 Games @ 1.93 ✅️\n\nIt was amazing how Dodin was able to keep this match close, with Parks producing 26 aces. The underdog was still able to hold a decent percentage on both first and second serve and she took this one to 3 sets. Great play here, especially against the number 1 seed in the tournament.\n\n**Tennis** | **Challenger Angers (Women)** | **12:30 PM (Eastern Time)**\n\n**Plays will always be shared as 1 unit for fair record purposes**\n\n**Pick:** **Parks vs Korpatsch - Parks ML @ 1.63**\n\nAlycia Parks, currently ranked 71st in the world, is the number 1 seed in this tournament and needs to defend her title points, since she also won in Angers last season. She's one of the tallest players on tour, which gives her a big advantage on this surface (Indoor Hard), with the ability to get free points on her first serve much more frequently than most of her opponents. She produced 26 aces in the last round, which might be a good indicator that she can use her best weapon once more to increase her chances of winning the tournament. Her game does have some problems, especially when playing outdoors, as she moves a bit slowly compared to the tour average, and she hits really flat. With this, she ends up making a lot of unforced errors when outdoor conditions nullify her serve power, but the same can't be said here in Angers, where she feels much more comfortable.\n\nKorpatsch is a veteran of the circuit now at 30, always seen as an average player with a decent rally tolerance and baseline game, but a weak serve, which has prevented her from standing out from the rest of the WTA tour. Last year, she was defeated specifically by Parks in this tournament in straight sets.\n\nWith this, Parks knows that most of her ranking points need to come from Indoor tournaments, and defending this title should be a major priority. With her powerful serve, she should be to simplify each point and win the match. Keep in mind that in order to win this tournament in the previous year, Parks had to defeat Belinda Bencic in the final, the current number 11 in the world.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nscd4ix/"
    },
    {
      "created_utc": 1764895316.0,
      "author": "dreamchasing1",
      "text": "Record: 232-221 Net Units: -30.09 51-54 on 1.5u plays, 38-40 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Serbia Super Liga] Crvena Zvezda (Red Star) vs Cukaricki\nLast pick: BTTS @ 1.80 - 1.5 units loss\n\n\nEvent: Soccer/Football, [Wales Premier League] Bala Town vs Haverfordwest County\n\n\nPick: Total corners over 8.5 @ 2.00 - 1.5 Units\n\n\nThe two sides already met in October in a game with 15 total corners. In home games this season, Bala Town average 4.40 for, close to 9 total, going over in 7/10 games. In away games, Haverfordwest average 5 for and a 11 total, covering this line in 8/9 games, which makes them arguably the best away matchup for corners in the league. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nscd336/"
    },
    {
      "created_utc": 1764895257.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pegzlu/pick_of_the_day_12525_friday/nsccwwf/"
    }
  ]
}