{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 10/30/25 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/",
  "target_date": "2025-10-30",
  "timezone": "America/Chicago",
  "collected_utc": "2025-10-30T20:16:12.031349+00:00",
  "comments": [
    {
      "created_utc": 1761852256.0,
      "author": "InspirdByToxicEraBoi",
      "text": "Accidentally posted on Wednesday instead of Thursday\n\n> **Record: 2 - 1**\n>\n> **Net Units:** +1 Unit\n>\n> **Recent Form:** ✅✅❌\n>\n> **Football** | **NCAA** | **4:30pm PT**\n>\n> **Pick:**  Couldn't decide which spread I wanted to play so I ended up going with a parlay here after considerable thought\n\nTulane ML/Marshall ML to win 4U -101 on Bovada \n\n>\n> **Write Up:**\n\nThis write up is sponsored by an Adderall prescription \n\nMarshall vs Coastal Carolina\nQB Matchup\n- Marshall: Del Rio-Wilson: 90/121 (74.4%), 1,133 yds, 12 TD, 1 INT, 184.1 rating – Elite efficiency, carried Marshall to 3 wins in last 4.\n- Coastal: Tad Hudson 56/103 (54.4%), 447 yds, 3 TD, 3 INT; Morris 35/60, 304 yds, 1 TD, 4 INT – Inefficient, low volume, high INTs.\n- Extremely lob sided in the QB matchup. Rio-Wilson is a sweat.\nDef Matchup\n- Marshall: allows 413.6 yds but faces weak Coastal Off (just 306.9 yds/g – bottom of Sun Belt)\n- Coastal allows 409.7 yds/g; can’t handle Del Rio-Wilson’s precision (Marshall 388.6 yds/g ranks solid).\n- Both defenses are mid. I would say there is no edge either way.\nOn 1st glance of tonight’s college slate, I was considering Tulane to be a mega max. But after taking a 2nd look. I think the real mismatch is Marshal/CC. While the defenses are comparable, Marshal’s Rio-Wilson outpaces Coastals Tad Hudson in every sense of the word. I think Marshal drops a 30 bomb on the road and there is no way Costal can catch up.\n\nTulane vs UTSA\nQB Matchup\n- Tulane: Jake Retzlaff: 116/190 (~61%), 1,428 yds, 6 TD, 1 INT, 133.6 rating + 450 rush yds/8 TD. Precise, dual-threat\n-  UTSA: Jake McCown: 137/216 (63.4%), 1,310 yds, 13 TD, 4 INT, 130.5 rating – Volume TD machine but turnover-prone\n- While McCown is a solid, steady QB. I gotta give the edge to Retzlaff on this one. More mobility and UTSA’s defense is lacking.\nDef Matchup\n- Tulane has a top-25 def in multiple metrics (384 yards allowed per game). They held Army/ECU to low points/yards. \n- UTSA’s defense isn’t a slouch averaging 397 yds allowed. \n- Tulane has elite edge rushing, given McCowns turnover history. I give the advantage to Tulane\nBoth teams have extremely efficient QB’s. It’s always hard to mega max a play against a consistent QB at home. For that reason I would use caution on going HUGE on Tulane. However, Tulane has been lights out this year and should cover the spread. Betting big against McCown at home is my only hesitation here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm8uiqf/"
    },
    {
      "created_utc": 1761849551.0,
      "author": "Timely-Conclusion532",
      "text": "Record: 271-161\n\nForm: ❌❌✅✅✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅✅❌❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌❌❌❌✅✅❌✅✅✅❌✅✅✅✅❌✅✅❌ ❌❌❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌✅✅✅✅❌❌✅✅✅✅✅✅❌✅✅✅✅❌✅❌✅❌✅✅❌✅✅❌❌❌✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅✅✅❌✅✅❌✅✅❌✅✅❌❌✅❌✅✅❌❌❌❌❌✅✅✅✅✅❌✅✅✅❌✅❌✅❌❌✅❌✅❌✅❌✅✅✅✅✅✅❌✅❌✅❌✅✅✅❌❌✅❌✅❌❌❌✅✅✅✅❌❌✅❌❌✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅❌✅✅✅✅✅✅✅✅❌❌✅✅✅✅❌❌❌✅❌✅✅✅❌✅✅❌✅❌❌❌❌✅❌✅✅✅✅✅❌✅✅❌✅✅✅✅✅✅✅✅❌✅❌✅❌✅❌❌❌❌✅✅✅✅❌✅✅❌✅✅❌✅✅✅✅❌❌✅✅✅❌✅❌✅✅❌❌✅❌✅❌❌✅❌❌❌✅✅❌✅✅❌✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅❌✅✅✅✅✅❌❌✅✅✅❌❌❌❌❌❌✅❌✅✅✅✅✅✅✅✅❌✅❌❌❌✅❌✅✅❌✅❌❌✅❌✅✅✅❌✅✅❌✅❌✅ ✅❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅❌✅✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌✅❌✅✅✅❌✅❌❌❌✅✅❌❌✅✅✅❌❌✅\n\nNet Units: +11.09 units (All plays 1 unit)\n\nYesterday’s Pick: (NBA) Nikola Jokic o8.5 rebounds + Devin Booker u46.5 PRA’s (-186) ✅\n\n***POTD: *(NFL)* Tua Tagovailoa 1+ passing touchdowns + *(NBA)* LaMelo Ball o35.5 PRA’s (-150) (ALT PROPS)***\n\nReasoning: Tua Tagovailoa has thrown 1+ passing TD’s in 7/8 of his games so far this season (88%). Last year, he was 11/11. Today, he faces the Baltimore Ravens who rank 30th in passing touchdowns allowed (2.3 PTD’s per game) and 27th in passing yards allowed. Ravens are heavy favorites in this TNF matchup so if the Dolphins are losing throughout the game, the pass attempts and opportunities increases for Tua. Tua is also playing at home where he has passed for a TD in all 3 home starts this season. For our NBA leg, loving LaMelo Ball tonight. LaMelo has eclipsed 35.5 PRA’s in 70% of his games last year and 75% of his games so far this year. LaMelo is at home, where he hit this PRA line at a 78% clip last year. Tonight, he faces the Orlando Magic who struggle containing PG’s as they rank 29th out of 30 teams vs the point guard position this year. With that being said, let’s go for two in a row 💪",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm8l0ei/"
    },
    {
      "created_utc": 1761849210.0,
      "author": "Diamondhf",
      "text": "**Net Lifetime Units: +23.72 15-8 Record**\n\n\n\n**Last Pick: \\[Indiana -25.5\\] WIN**\n\n[*https://www.reddit.com/r/sportsbook/comments/1ofa4vy/comment/nl7xu2z/?context=3&utm\\_source=share*](https://www.reddit.com/r/sportsbook/comments/1ofa4vy/comment/nl7xu2z/?context=3&utm_source=share)\n\n*&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button*\n\n\n\n*Breaking down the last two picks: Cal +6.5 and Indiana -25.5*\n\n\n\nI can’t help but feel like my read was absolutely spot on for Cal +6.5, both teams had the opportunity to win the game by 3 points either way and 2 field goals were doinked off the field goal post in the final 2 minutes. First overtime started with a bang with Cal scoring a TD on the first play. Extremely unfortunate that tech converted a 2 point conversion to put it out of reach in the 2nd overtime. Nobody in the world could have predicted that ending.\n\n\n\nIndiana bet was over before the 1st quarter ended. Easy, sweat free win. We move onto the next pick!\n\n\n\n**POTD: Tulane -5.5 -112 3u to win 2.89**\n\n\n\n***Tulane @ UTSA, Alamodome in San Antonio, Texas, 7:30pm EST kickoff.***\n\n\n\nThursday night football on a spooky Halloween EVE evening. American Conference. Does life get better than this?\n\n\n\nTulane is better than UTSA. Tulane is better than UTSA in every Sagarin rating, every ESPN SP+ Rating, nearly every PFF rating. Sagarin has the ratings at -7.02 in favor of Tulane, and Vegas accounts for 1.5 points in favor of UTSA due to home field advantage. My biggest matchup to look for will be Tulane's pass rush vs UTSA’s abysmal O-line. UTSA has a bottom 10 pass block unit in the country with a rating of 52.9, while Tulane’s strongest unit is their pass rush, a top 10 unit in the country per PFF with a 84.7 grade. \n\n\n\nUTSA has a murderer’s row 3 game stretch, having faced North Texas last week and getting drilled 55-17, facing Tulane this week, and facing USF next week. All 3 teams have a serious opportunity to get a bid in the College Football playoff and the winner of the American will very likely be the 12th team to get a bid. Tulane is gunning for style points and trying to make their best case for a bid at the CFP.\n\n\n\nI wish this was a more difficult game to analyze, but it’s really just one-sided. I really like Tulane and think they’re a great team. One of my previous POTD was Tulane vs ECU, and Tulane covered -6.5 in that game as well. Tulane has covered a 5.5 point line in every game they were favored this season, besides one in which they only won by 3.\n\n\n\nVery simple writeup. I’ll have something a bit more detailed for Saturday’s POTD, but yeah this is pretty straightforward. \n\n\n\nAs I’m writing this, I realized that this game is TONIGHT and not Friday. Sorry for the late post.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm8jsug/"
    },
    {
      "created_utc": 1761848478.0,
      "author": "EzPickzz",
      "text": "Record: 11-5\n\nUnit record: +17u\n\nLast pick: Charlotte Hornets vs Miami Heat ( Over237.5 ) ✅\n\nPOTD 💎: Baltimore Ravens, 1st half ( -3.5) \n\nBet365: -130 (+3u)\n\nTime: 6:15pm @Dolphins",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm8h77q/"
    },
    {
      "created_utc": 1761847430.0,
      "author": "Icy-Road6438",
      "text": "PICK OF THE DAY RECORD : 3-2\n\nRECORD ON YEAR : 3-2 (+2.5 units)\n\nPREVIOUS PICK : Josh Hart over 11.5 RA\n\nSUMMARY : Didn’t play minutes I had thought. Got assists just couldn’t rebound. Took a big NBA Wednesday away and back tonight. \n\nOCT. 30 PICK OF THE DAY \n\nWarriors vs Bucks NBA 8:00 EST\n\nBrandin Podziemski over 7.5 RA (+105 Hard Rock Bet) cleared this line in his last two as he didn’t start them both. He was a starter the first 3 games and failed to clear this line. I think with the second unit the ball is in his hands way more and he’s always had a knack for the ball and rebounding and hustling so I expect at least 4-5 boards as last year he averaged 5. And for assists he averaged 3.5 last year but only 2.6 this year. First 3 games he got 3 assists. Last two finished with 10 total (4 and 6). He also cleared this line both times against the bucks with 8 and 12. He does have great rebounding numbers against the bucks too as he’s collected 7 and 9 and if that trend continues I see this as an easy cash with how he’s been dishing the ball recently. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm8dhlq/"
    },
    {
      "created_utc": 1761845045.0,
      "author": "fazemonero",
      "text": "POTD Record: 3-4, Previous Pick: ❌ Thornton 18.5+ Longest reception (-110)\n\n**Event**: NHL - Calgary Flames @ Ottawa Senators 7:00pm\n\n**POTD**: OTT Senators -0.5 2nd Period (+130) 1u\n\nOTT looks good in the 2nd period, and has won 4 of their last 5. CGY their last 5 are 2W-2L with 1 tie.\n\nThis season OTT has won 50% of their 2nd periods, CGY has lost 60% of their 2nd periods. \n\nI'll guess Senators win here 55% of the time based on these numbers. +130 implies a 44% chance of them winning this period, seems like a good deal. There is a 2nd period ML (-164) for draws to be void and push but I prefer +130 and the tie losing. Disclaimer I've watched 2 NHL games this year and probably 4 in my life.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm856n6/"
    },
    {
      "created_utc": 1761844502.0,
      "author": "ControlRoyal1768",
      "text": "Record: 18-8 (+23.84u)\n\nLast 10: 💰💰✖️✖️💰💰💰✖️💰💰\n\nLast POTD: 🏈 Jonathan Taylor under 20.5 Rushing Attempts (-114)\n\nWriteup: Gonna give myself a little credit here as this was an absolute smash pick. JT only needed 12 carries to absolutely destroy the Titans defense, and they once again pulled him for a bulk of the 4th quarter. He is your Offensive Player of the Year. \n\nToday’s POTD: 🏈 Jaylen Waddle over 63.5 receiving yards (-112). \n\nGame starts at 8:15pm EST. Bet 2.75u\n\nWriteup: Tried to find a different pick from u/JoeInglesOfficial but I don’t think there’s a better bet in this game at cost. Since Tyreek has been out for the season with injury, Jaylen Waddle has gone for 95+ receiving yards in 3 of those 4 games. He now goes up against a Baltimore secondary that has been getting burned by speedy wide receivers all season. The last time Waddle played the Ravens (while it was 3 years ago), he went for 171 receiving yards. I expect the Dolphins to be playing from behind, and with no real WR threat on the team besides Waddle, I expect him to hit 64 yards or more tonight.\n\nRemember to only bet what you can afford, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm83ap1/"
    },
    {
      "created_utc": 1761842469.0,
      "author": "Eddy1877",
      "text": "Record: 1-0\n\n\nEvent: Red Wings vs. Kings, 10:30 pm EST\n\n\nPick: Alex DeBrincat over 2.5 shots on goal\n\n\nOdds: -130 Fanatics \n\n\nReasoning: The Kings are ninth in the league in shots allowed (28.5/game), and DeBrincat has cleared this line in nine of the first ten games thus far, including all four of the Red Wings' road games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm7w8zo/"
    },
    {
      "created_utc": 1761842043.0,
      "author": "uGreatdane",
      "text": "All Time Record 67-42\n\n**Pick : Drake Batherson 2 or more points (+199)**\n\nReasoning: Drake has scored 2 or more points in 4 out of 8 games played, including his last 3 games in a row. Ottawa will be at home against struggling Calgary, who is 25th in the league giving up 3.55 goals per game.\n\nGame: NHL Hockey Calgary vs Ottawa 6pm central\n\n\nTip Jar https://buymeacoffee.com/hounddog Venmo Alex-coffman-1 Cash app $alcoffm",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm7urpi/"
    },
    {
      "created_utc": 1761836825.0,
      "author": "Redstar81",
      "text": "Record:  0-0\n\nNet Units: 0\n\nEvent: Serie A.  Pisa vs. Lazio 3:45pm EST\n\nPOTD:  Lazio ML (+110) 1 unit\n\nWrite up:  For my first contribution we go to Serie A.  The eagles fly north to Pisa to take on the black and blues.  Since their promotion back to top flight, Pisa have been struggling.  Between injuries and scoring the club still hasn’t secured a win in their first 8 matches.  The stat that stares us in the eyes today is they have not scored in their first 4 home matches.  \n\nLazio is also struggling with some injuries but as a mid table club their current form is looking good.  Coming off a win against Juventus and a draw against Atalanta both with clean sheets, I believe they will get the job done today.  A win today would propel them from 12th place to 8th and give them a whiff of the 5-7 spots.  \n\nI see great value at +110 so I’m riding with Lazio ML.  BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm7cfh3/"
    },
    {
      "created_utc": 1761836551.0,
      "author": "Flashy-Literature423",
      "text": "Record: 5-1-1\n\nUnits: +9.26u\n\nLast 10: ✅-✅-✅-🅿️-✅-✅-❌\n\nLast Pick: [Alperen Sengun Over 9.5 Reb (+105 on Bet 365) Bet 1.5u to Win 1.58u](https://www.reddit.com/r/sportsbook/s/9mw7GrH4le)❌\n\nRaps got destroyed on the glass but Sengun didn’t seem that interested to grab his share of opportunities. A miscue read but we press forward.\n\nNBA | MIA Heat @ SA Spurs | 8:30PM EST\n\nNext Pick: **Victor Wembanyama Over 28.5 Pts** (-108 on Fanduel) Bet 2u to Win 1.85u\n\nWemby averaging 31 PPG thru 4 games (40, 29, 31, 24). The 24pt outlier came in a blowout win vs Raps with limited minutes played. 75% hit rate this season so far. He’s attempting 18.3 shots per game sufficient volume to accumulate 29+ points.\n\nAfter learning the Spurs have never started 5-0 in franchise history, Wemby expressed genuine shock and immediate commitment: \n\n*“Spurs never went 5-0? I’m surprised… I’m really surprised because the Spurs have the highest winning percentage in the last 30 years or whatever. Let’s beat that record.”* **This is a potential psychological catalyst for elevated offensive volume today.**\n\nWemby (7’4”) towers over Bam Adebayo (6’9”) creating a 6+ inch height advantage. At his release point contesting shots become difficult. Backup Kel’el Ware provides even less resistance making interior scoring accessible from multiple angles.\n\nHeat ranks 12th in defensive rating this season allowing 115.8 PPG which is serviceable but not elite. However they specifically struggle defending centers allowing 14.8 PPG at 44.1% FG to that position key matchup advantage for Wemby.\n\nConcerns: A Blowout spurs route will reduce Wemby play time in the 4th thus making the over more challenging. However I do believe we’re more likely to see a competitive game here as Heat hold opponents to 42.4% FG (#4 in NBA) from what we’ve seen so far this season.\n \nIf tailing, only risk what you can afford to lose. Best of luck family!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm7bhp7/"
    },
    {
      "created_utc": 1761834584.0,
      "author": "Fonkienator420",
      "text": "Record: 0-0\n\nI've posted here a while ago but from another acc so im starting all over today. Big ups to the other handicappers in this thread helping me make some money. To thank you all, i have a very sweet odd for you today.\n\nMatch: Rijnsburgse Boys vs NEC Nijmegen (KNVB Beker - Dutch Cup) \n\nRijnsburgse Boys over 1.5 goals @ 4.20 (Unibet) ✅️\n\nAmateur teams generally perform well against professional teams in cup matches, especially teams from the top half of the second division, as they have more quality than a lot of people would presume. We've already seen a lot of upsets this week, and I wouldn't be surprised if we see a couple more tonight. Nec is playing very attacking football and so their games often see a lot of goals. They score easily, but they are vulnerable in defense. Rijnsburgse Boys, on the other hand, is one of the better teams in the second division and play at home, where they beat a couple of professional teams last season in the cup before being eliminated by Feyenoord. Since, as I said, upsets happen regularly in the dutch cup, the amount of goals that nec concedes and the success Rijnsburgse Boys had against pro teams in previous seasons, this odd is simply to good to pass up. \n\nBest of luck!\n\nEdit: Congrats to everyone who tailed! Cashed in after 65 minutes, quite a sweat free bet given the high odds. Onto the next one.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm74tf7/"
    },
    {
      "created_utc": 1761834255.0,
      "author": "SMA_intern",
      "text": "**Record:** 6–1–0 - Avg Odds: -110  \n**Net Units:** \\+4.45 u  \n**ROI:** \\+63.64%\n\n**Sport | League | Event Time (ET / CET):** Football | NFL | Thu Oct 30, **8:15 PM ET** / Fri Oct 31, **01:15 CET** — Ravens @ Dolphins.\n\n**Pick:** Miami Dolphins **+7.5 (Spread)** @ **-110** — **Stake:** **1u**\n\n**Write Up:**  \nTold my model to stop betting against the Dolphins at home and it responded by doing the Waddle.\n\nIf Tyreek hits one of those \"blink-and-he's-gone\" plays, please convert speed into upvotes.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm73pko/"
    },
    {
      "created_utc": 1761834061.0,
      "author": "SNKR_FIENDS",
      "text": "Record: 1-0 \n\nLast pick: Zack LaVine 20+points/Josh Giddey U8.5 Rebounds ✅ \n\nRecap: As expected LaVine had no issue getting to 20 finishing the game with 30, he definitely fed into the crowd welcoming him back to Chicago. Giddey finished with 8, however at one point got a rebound, missed his own shot and rebounded that. It was a very awkward play, and I think I can say had that play not happened he finishes at 6. Either way he stayed under. \n\nToday’s Pick: AJ Green +2 Three pointers/Alexandre Sarr +12 Points (+108 DraftKings) \n\nGolden State vs Bucks \nWashington Wizards vs OKC Thunder \n\nReasoning: \n\nThe Bucks play at home taking on Steph Curry and the Warriors. At this point AJ Green primarily takes 3 point shots. Taking at least 5 three point attempts per game averaging 59% from the 3. If Green gets the ball expect a 3 point attempt. With Steph Curry shooting on the other side of the court I expect it to be a game of who can make more 3’s. Sarr comes into tonight’s game averaging 19.5 points. Every game he’s built off the previous performance, last night he scored 31 against a weakened Joel and grabbed 11 boards. Without Chet in the lineup tonight for OKC I expect Sarr to have a lot of looks/opportunities down low.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm732fc/"
    },
    {
      "created_utc": 1761832547.0,
      "author": "haloline",
      "text": "POTD Record: 4–4–1 (W–L–NC)\nPrevious Pick: ✅ Alexander Bublik -2 Games (-115)\nEvent: Paris Masters 1000 – Alex de Minaur vs Karen Khachanov (10:00 AM CST)\n\nPOTD: Alex de Minaur -2 Games (-110) — 3.3u to win 3u\n\nOur resident tennis sharp El Tio Sharp is just on a roll. Here’s another one from him today:\nI like what I’ve been seeing from De Minaur lately — impressive wins over bigger hitters like Berrettini and Diallo show how well he’s handling power right now.\n\nEven with only one title this year, Alex still boasts a 71.8% win rate and is 10–2 on indoor hard courts. To beat him, you basically have to hit him off the court, and I just don’t see Khachanov doing that today.\n\nAlex is well within his prime, while Karen has seen better days. You rarely find this kind of value on De Minaur given his consistency, and I’ll take it 9/10 times here.\n\nPick: Alex de Minaur -2 Games (-110)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm6y01v/"
    },
    {
      "created_utc": 1761832132.0,
      "author": "john_doe_774",
      "text": "Date: 10/30\nRecord: 3-1\nNet Units: +1.75u\n\nPrevious Pick: Mahomes under 0.5 ints ❌\nToday’s Pick: Achane anytime td -135\n\nLast pick was probably one of my most confident and my first miss. Sometimes everything can workour exactly like you expect and your pick still misses.\n\nI was between a ton of picks for today including waddle, riley patterson, and mark andrews. But I saw most of those in this thread and I think this pick is the most game script independent. Achane almost always scores a td and ravens have been allowing rb td’s an unprecendent rate. I think our odds of hitting this are way better than -135 would imply.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm6wmbv/"
    },
    {
      "created_utc": 1761831879.0,
      "author": "Folklore_cardigan",
      "text": "Record 5-1\n\nNet: 5.08u\n\nPast Pick: Josh Giddey u8.5 rbs\n\nRecap: Wow, yet another nail bitter. The breath I took once Giddey was subbed out in the fourth quarter was amazing. Despite it being close, I’m still happy with the reasoning I had. There were 4 rebounds that was kind of mickey mouse, and he only have 1 rebound in the first 1.5 quarters. Either way, it’s fine.\n\n\nGame: Warriors @ Bucks 8:00pm EST\n\nPick: Giannis o51 PAR, -120, 2u -> 3.67u\n\nReasoning: Through the start of the season Giannis has been on an absolute tear and has smashed his PAR every game. I see this game as no difference especially given the lackluster size the Warriors have, especially with Al Horford being on a minutes restriction and them playing at Fiserv Forum. I also suspect this game will be close and Giannis will have to lock in to bring the bucks over the line, feeding AJ Green and other shooters as he draws attention.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm6vstd/"
    },
    {
      "created_utc": 1761830688.0,
      "author": "RichPickz1",
      "text": "Pick of the Day\n\nNBA 🏀| 31 Oct 2025 📅\n\nRecord: 5-8\n\nNet Units: -2.5\n\nLast Pick: Suns +10 vs Clippers (1.90) ❌\n\nToday’s Pick: MIL Bucks +2.5 vs GS Warriors (1.90)\n\nhttps://preview.redd.it/2lvkst7x29yf1.jpeg?width=1206&format=pjpg&auto=webp&s=a25c32c1c18d00b36f0f1e0781b7e856989312d6",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm6s0zd/"
    },
    {
      "created_utc": 1761830182.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Kuopio vs IF Gnistan, Over 3.5 goals @ 1.9\n\nRecord: 71 - 68 Profit: -1.51 u\n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅\n\nKuopio and Gnistan meet again in what could turn into an open match. Both sides have shown they can produce goals when given space. In their last six head-to-head meetings, over 3.5 goals were seen in three of them, suggesting some potential for a high score. KuPS usually dominate at home, but Gnistan can surprise. Still, it’s hard to be fully confident, as both teams can also play cautiously.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm6qgi3/"
    },
    {
      "created_utc": 1761828302.0,
      "author": "juscallmeCook",
      "text": "**Record: 5-1 (+9.3u)**\n\n**Previous Pick**: Jax State -3.5 1st H 🚮 \n\nBad offensive showing from State early, they never got into any offensive rhythm in this one unfortunately. The offense couldn’t find consistent tempo or extend drives bad showing, bad bet. \n\n**Pick**: Warriors @ Bucks over 231.5 -110 \n\n**Wager**: 2.2u \n\nGiven their current pace metrics, offensive efficiency, and early-season rhythm, this total looks a touch low. Expect a fast tempo, plenty of open-floor scoring, and both stars pushing the scoreboard past 231.5. \n\nBoth teams are playing with elite pace and efficiency to start the 2025 season. Golden State’s spacing and ball movement create high shot volume, while Milwaukee’s transition offense under Giannis has them averaging well over 120 PPG at home. Neither side has looked sharp defensively, and early-season tempo tends to stay high before rotations tighten.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm6ku04/"
    },
    {
      "created_utc": 1761826523.0,
      "author": "Vet100",
      "text": "Record: 8-1\n\nNet Units: +5.84U \n\nTotal Staked: 9U Total Returned: 14.84U \n\nPick: NBA Orlando Magic v Charlotte Hornets\n\n1U LaMelo Ball O6.5 1Q points @ $1.76 (-132 American), B365 \n\nWrite-Up: \nBall has gone 5, 10, 15, 15 (3/4) this year in 4 games, averaging 9.8 minutes on the court in the first quarter, averaging 7.3 FG attempts (about half from 3 point range), shooting at a fair clip too. His 1Q FG% is 55%, 3 pt 60%. He’s starting well, has no Miller so the responsibility is his. \n\nMatch-up wise Suggs isn’t listed on the injury report but missed the last B2B as he returns from knee surgery, so expect limited minutes. Anthony Black I think has great defensive potential but isn’t quite complete just yet and the Magic have not brought the hustle early this season as a unit. Against guard shooters this year Cunningham 30, Young 25, Maxey 43 have gone well v the Magic, not necessarily from the get go but all play different minutes to Ball so not meant to be a direct comparison, just acknowledging the match-up is there. \n\nBoth teams are in the top 10 in the NBA for pace (according to StatsMuse & nba.com site itself), so I like that Ball will get the opportunities here. The Hornets are averaging 128.3 PPG, good for 3rd in the league. \n\nAs always, I like to raise issues that should be considered before tailing - consider 1Q bets can be flaky as a player can have a cold 3-4 minutes easily and miss an otherwise solid prop spot. I do like this spot as I think the match-up, the pace, the usage & the team dynamics (Miller out still) - but it is still a 1Q prop.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm6fy9v/"
    },
    {
      "created_utc": 1761826352.0,
      "author": "PickleOk7231",
      "text": "Record:5-3\n\n✅✅❌✅✅✅❌❌\n\nSport: Football 🏈 \n\nPick: zay flowers over 69.5\n\nWrite Up: first of all this is basically a home game for zay and lj being that there both from florida so a lot of there family and friends definitely will be in attendance for this one. Not to mention they’ve have a strong connection being from the same county and have been working together this time lamar been recovering. zay is one of the dudes lamar depends on so much because zay is as much of hard worker as him and has the same love for the game as him so with that being said lamar wants to show case his brother hard work on the field in front of friends and family and get back rolling. \n\n(im back with real picks from now on no more plus money picks i want to see how long i can stay on a W streak)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm6fhn3/"
    },
    {
      "created_utc": 1761826306.0,
      "author": "FrozenStride",
      "text": "**Record:** 6 - 5 (+1.72units)\n\n\n*No good, fade me.*\n\n\n**Todays Pick:** Cagliari - Sassuolo \n\n\n**Cagliari Win**\n\n\n**Odds:** $2.55\n\n\n**Wager:** 3 Units\n\n\n**When:** 5 hours from post\n\n\n**Why:**\n\n\nCagliari should just about edge this one, emphasis on just. They’ve been scrappy at home, and while they’re not exactly Serie A’s goal machines, they do grind out results when it matters. Sassuolo, on the other hand, have been flatter then a pancake on the road lately, struggling to find the net in their last couple of away matches. Historically it’s been tight, most of their head-to-heads could’ve gone either way. But Cagliari’s home comfort and Sassuolo’s travel sickness tip the scale ever so slightly toward the cags favour.\n\n\nSo yeah, expect a cagey match where one goal could be enough. Not one for the neutrals, but if Cagliari sneak a 1-0 win, don’t say I didn’t warn you, they’ve been quietly making “ugly wins” look like an art form.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm6fd6r/"
    },
    {
      "created_utc": 1761823517.0,
      "author": "A13usuveDad",
      "text": "Record: 2-0 \n\nPrevious Pick: Rashee Rice O59.5 receiving yards W\n\nSport | League | Event Time / Time Zone: \nBaltimore Ravens @ Miami Dolphins; 8:15pm EST\n\nPick: PARLAY, Zay Flowers O4.5 Receptions(-196) + Derrick Henry O79.5 Rushing yards (-186).\n\nWrite Up: Back again for TNF, at first glance this looks like a bit of a stretch. But with Lamar Jackson returning both the rush and pass game will be greatly improved. With the defense showing improvement last week against a HOT Bears offense who hadn’t been held under 20 points all season, I expect the Ravens to build on this momentum. The Ravens should have the ball most of the game, and they need to get the run going if they want to make the climb to contend for the division. Expect Derrick Henry to have this line easily against an abysmal Miami run defense. Zay Flowers gets a handful of schemed touches a game in screens or jet sweeps. He is undoubtedly the guy on the outside they want to get the ball to. Despite a lack of SERIOUS production, he has been able to go over 4.5 receptions all but 1 game this season. \n\nTAIL OR FADE, BOL!!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm68lql/"
    },
    {
      "created_utc": 1761820026.0,
      "author": "dlilfan",
      "text": "Record: 3-0\n\nNet Units: +3.47U\n\nPrevious POTD : European football - Greek Cup - Panathinaikos ML vs Atromitos 1,70 odds 1,5U ✅ (+ U.3.5G for more risk at 2.05 odds ✅)\n\nPOTD: European Basketball / Euroleague / Maccabi Tel Aviv vs Crvena zvezda / Crvena zvezda to win and BTTS 80 or more points at 3.00 odds 1U\n\nGreat value here as Zvezda is the hottest team in European basketball right now under new coach Dusko Ivanovic having won 5 straight after starting the season 0-2. They should not be given outsider odds in this game so take advantage of the line before it moves. Feeling confident about the points too as the O/U line for this game is at 173,5 points and Maccabi averages 88.1 ppg while Zvezda averages 86.1 ppg. Low chance of a blow out and Maccabi pushes the pace.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm61985/"
    },
    {
      "created_utc": 1761818381.0,
      "author": "Laird87",
      "text": "POTD Record: 206-200, -64.62 Units\n\nCurrent streak: ❌\n\nLast 10: ✅❌❌✅❌✅✅❌❌✅\n\nLast Pick: Maple Leafs -1.5 ❌❌❌❌❌\n\nThese fuckers can't score on an empty net against a bad team.  Going with another Canadian team playing the Flames tonight hoping they'll get it back.\n\nToday's Pick: NHL: Ottawa Senators -1.5 vs. Calgary Flames, +160, 5 Units, 7:00 PM EST\n\nAnother risky one but this one has great odds for a 2 goal win with a high-scoring Senators team that is hot right now against a bad Calgary squad.  Too good to pass up a chance for an 8 unit win so I'm throwing big money down.  Let's go Ottawa.\n\nBOL, tail or fade! Tip Jar: [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm5y4e3/"
    },
    {
      "created_utc": 1761817395.0,
      "author": "PFLPicks",
      "text": "**Record:** 6–2  \n**Net Units:** \\+2.14 u  \n**ROI:** \\+26.8 %\n\n**Sport | League | Event Time / Time Zone**  \nSoccer | Serie A | Oct 30 — CET\n\n**Pick:** **Parlay — Over 0.5 Goals x 2**\n\n* Leg 1: **Cagliari vs Sassuolo — Sassuolo Over 0.5 @ 1.38** \n* Leg 2: **Pisa vs Lazio — Lazio Over 0.5 @ 1.30** \n* **Combined Odds:** 1.79 (Betano) | Stake: 1 unit\n\n\n**Write Up:**  \nNot a flashy play — just a small builder that relies on normal Serie A football doing normal Serie A things: someone scoring a goal.\n\n\n\nCagliari vs Sassuolo\n\nSassuolo’s away games are chaos more often than not. They press high, shoot early, and leave space behind.  \nCagliari at home aren’t sitting deep either — they attack down the wings, draw fouls around the box, and have created chances in nearly every home match this month.  \nBoth sides rank among the top half of Serie A for total shots per 90, and both have conceded in 8 of their last 10 fixtures.  \nOne goal here feels more like probability than luck.\n\n\n\nPisa vs Lazio\n\nLazio have been starting games with intensity: quick passing, early transitions, and a first goal often before the 35th minute.  \nPisa’s defense tends to bend under pressure, especially when facing pacey wide play.  \nEven if Lazio rotates a few starters, their style should still produce volume — and Pisa’s own home xG trend suggests they’ll get chances of their own.  \nAgain, we only need one to find the net.\n\n\nSummary\n\nThis isn’t about squeezing value from obscure data — it’s about trusting patterns that repeat week after week.  \nBoth matches project as open enough that a single goal is statistically very likely.  \nAt **1.79 combined**, the price is perfectly fine for a calm, low-variance parlay.\n\nIf either ends 0-0, it’ll be an xG crime scene.\n\n  \nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm5wco3/"
    },
    {
      "created_utc": 1761817140.0,
      "author": "Comfortable_Win_4927",
      "text": "Record: 16-10 Units: +8💰\n\nHistory (old->new): ✅✅🅿️✅✅❌✅✅❌✅✅❌❌✅✅✅✅✅❌✅✅❌❌❌❌✅❌\n\nLast Pick: Alexander Zverev 2:0 vs Jacob Fearnley @1.87 5U ❌\n\nPOTD: Zverev ML vs Davidovich Fokina + Zalgiris Kaunas ML vs ASVEL @1.78 5U\n\nSport: ATP Paris/Euroleague\n\nTime: 19:00 CET/GMT+2\n\nPeople are scared to bet Zverev after yesterdays match, where it looked like he was struggling against Carabelli, but he was just playing on Ugo’s pace and he looked fine to me. He dismantled Musetti and Arnaldi in his last 4 matches and put up a fight against Sinner better than anyone not named Alcaraz. Zalgiris are looking like one of the best in Euroleague and their home crowd is top notch, they should win this one.\n\nBOL and gamble responsibly",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm5vwht/"
    },
    {
      "created_utc": 1761816390.0,
      "author": "tokcliff",
      "text": "Event: Hylo Open Men's Single\n\nPOTD Record: 129w 85l 2p \n\nDate: 30 Oct SGT\n\nNet Profit = +45.525 units\n\n\n\nJonatan Christie -7.5 points at 1.91 @ 1.5 units (vs Chi Yu Jen)\n\n\n\n1/2 H2H, Chi also got better compared to the previous H2H. However, Christie is also on pretty decent form. Therefore, only 1.5 units\n\n\n\n\n\nBTW if anyone wants to follow my blog where I do some reflection about badminton betting\n\n[https://tokkidokkie.wordpress.com/](https://tokkidokkie.wordpress.com/)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm5umcr/"
    },
    {
      "created_utc": 1761813784.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 13-6-1\n\nSoccer\n\nLast Pick: PSG ML and Bayern ML @ 1.55- 1 unit - LOSS\n\nLast Pick Write Up: Annoying loss with PSG drawing. People here get pissed off when picks lose but you gotta remember this is gambling, you're not investing in bonds, picks will lose.\n\nNow for today..\n\nPick: Midtjylland to win and Paphos to score @ 1.78\n\nWrite Up: Midtjylland is playing at home, in the 2nd spot in the tables with 8W 4D 1L, versus Silkeborg in 7th spot with 5W 2D 6L. Midtjylland has won the last 4 games against Silkeborg and has won the last 7 out of 8 matches (with the one being a draw), including wins against Nottingham Forest, Sturm and Maccabi Tel Aviv. Pafos is playing at home, in the 2nd spot in the table with 6W 0D 2L while AEK is in the 5th spot with 4W 2D 2L. Pafos is tough, managing to draw against Kairat away after getting a red card within the first 10 minutes and managed to score against Bayern.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm5q9zg/"
    },
    {
      "created_utc": 1761813674.0,
      "author": "bustlingblueberry-44",
      "text": "POTD Record: 0-0 (+0u)\n\nLPOTD: Void - Norman Powell O 28.5 PRA -120 (2u to win 1.8u)\n\nI have posted twice on here so far. Zion gets scratched on Monday, and Norm gets ruled out late Tuesday. Unfortunate. No red, so no harm no foul. On to the next.\n\nPOTD: Derrick Henry O 18.5 Carries -107 (2u to win 1.9u)\n\nMiami has been torched on the ground all year. Falcons failed to get Bijan going on the ground against Miami last week, but outside of that it has not been pretty for this Miami D. Short week for both teams, and I expect Baltimore to take care of business. Lamar is back from missing extended time; I think they will ease him back in. Stick to the game plan and use Henry. That was the game plan last year, this year they have gotten away from that and struggled to find wins early. \n\nHenry has cleared this line in the past 2 games. I’m expecting another big game out of him especially with Lamar’s threat back.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm5q3em/"
    },
    {
      "created_utc": 1761812288.0,
      "author": "More_Reflection_26",
      "text": "  \nPOTD Record: 184-138\n\nUnits Won: +91.96\n\nLast Pick: KT Rolster Map 1 ML + O 29 Minutes (+100) ✅\n\nToday's Pick: **HypeX U 6.5 Headshots Map 2 (-133)** 5u\n\nTeams: GamerLegion vs. GentleMates\n\nhttps://preview.redd.it/nv1ovlkwj7yf1.png?width=773&format=png&auto=webp&s=fcf8e39dcf62ef6a4831ab9b2c8b469507eb89f3\n\nWriteup:\n\n*  Map 2 is confirmed as Inferno, picked by GentleMates, meaning GamerLegion will start on CT side, the much worse side for headshots overall, especially for AWPers\n* Inferno has been a map HypeX has struggled on heavily, his previous team perma banned the map meaning he has very little comp experience on the map, he is averaging a .58 KPR on Inferno since joining GamerLegion, well below his average of .69 KPR in the L3 months\n* HypeX is averaging a 42.6% headshot percentage in the last month with a .65 KPR, his current kill line map 2 is set to 14.5, given this he is expected around 6 headshots total on the map based on this total.\n* On Inferno, HypeX is averaging a 36% headshot percentage, a significant decrease. it would take him an average of 19-20 kills to hit this headshot line given the overall headshot percentage + side start",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm5nup4/"
    },
    {
      "created_utc": 1761808471.0,
      "author": "OliveCritical5134",
      "text": "**Record: 10-6**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌\n\n**Sport: ⚽ / Serbian Premier League / Vojvodina v Crvena zvezda**\n\n**Net Units/ROI: +16.37u / 37.20%**\n\n**Previous Pick:** ***Hearts to win @ 1.79 -- 3 units*** ❌\n\n**Summary:** Another tough pill to swallow. Sweatiest game I've come across with my picks so far, with 2 disallowed goals and what we can only call an emotional rollercoaster that didn't go as planned in the end. \n\n**Today's Pick:** ***Vojvodina v Crvena Zvezda BTTS:Yes @ 1.72 -- 3 units***\n\n**Write up:**\n\nFor today I had a full write up on Young Boys to win done, and then I stumbled upon this match. This is a match between two of the top teams in Serbia, with Vojvodina already being a team I've picked to win last week. The away team from Belgrade are favorites for the title once again but have seen their opponents score a goal against them 7/11 matches so far. Vojvodina have managed to score 23 goals in 12 matches so far. I see this as a game with two well performing teams that will see a few goals. I just think this pick has a higher likelihood of hitting then BSC Young Boys to win against Grasshoppers, and because I wanted to sway away from the moneylines for today, but it was still a close choice.\n\nBest of luck if tailing! 🍀\n\n**PS:** If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm5hoqu/"
    },
    {
      "created_utc": 1761807001.0,
      "author": "salterino_",
      "text": "POTD Record: 3–0 \n\nPrevious pick: ✅️ Medvedev ML + Khachanov to win a set \n\nBoth guys handled business in Paris — Med won by walkover, and Khachanov did exactly what we expected on these courts, grabbing his set without much drama. Nice, stress-free cash.\n\nEvent: 🎾 Challenger Bratislava — Raphael Collignon vs Stan Wawrinka\n\nPOTD: Raphael Collignon ML @ 1.53, 3u\n\nGoing with Collignon here. He’s been playing some of the best tennis of his career lately and looks super comfortable indoors — already piling up wins on fast courts this season. His confidence and rhythm are obvious right now, and he’s doing a really good job being aggressive on return, especially on second serves.\n\nWawrinka's a legend, but this version of him struggles to maintain intensity against younger players who bring pace and consistency. When Stan isn’t landing the first serve, the rallies get tough for him, and Collignon has the legs and timing to push him around in longer points.\n\nForm, energy, and matchup edge all lean Collignon today. Sticking with the in-form guy over the big name.\n\nLet’s run it up. 🍀",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm5f9oe/"
    },
    {
      "created_utc": 1761801807.0,
      "author": "IllPath7022",
      "text": "Record: 0-0\nNet Units: 30u\nFootball | NFL | 8:15PM / ET\nPick: Isiah Likely o2.5 receptions | Fanduel | \n+124 @ 4u\nWish I had more to say for my first pick but I don’t. This seems automatic to me Vegas gotta b plotting on me with this one. Isiah likely still waiting on his big comeback game and what better timing then when his qb1 finally returns. Likely and Jackson have yet to play a full game together this year and he hit this line in 56% of games last year and has yet to do it this year. The dolphins perform pretty poorly against tight ends too, in their last 3 games Kyle Pitts(9 rec.), Harold Fannin(4 rec.), Orlando Gadsden(7 rec.) I’m honestly thinking about parlaying this separately with a Likely TD in fairly confident he’s gonna have a good game",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm56g8c/"
    },
    {
      "created_utc": 1761801754.0,
      "author": "MWMM93",
      "text": "**POTD Record 36-34-1**\n\nOkay, full disclosure: my bias really got the best of me. I backed Cleveland –4 against Boston and ended up eating humble pie. I was being a little facetious when I under-played Boston’s big guys. Holy fuck. The guys I claimed to be “G-League plus” players(comment I made in the last post…) out-rebounded one of the best frontcourts in the NBA BY 10!!! (Minott & Queta). I mean, let’s just sit with that for a second. Cleveland got worked on the boards, and while I had faith in Evan Mobley and Jarrett Allen, those cats out-hustled them in a way that made me pause.\n\nI know Cleveland is talented and I love this team but I’m stepping away from betting on them for a bit. They’re playing for the playoffs, not necessarily the regular season, and I don’t want to ride hype when the book says “wait a second.” I’ve got hope for these Cavs, but I’ll sit on cash until Garland, Strus and Merrill are back and the rotation’s locked in and gets into form.\n\nAnyways, my next play, I LOVE. I’ve been waiting to get on this team for a while and the line is too good to pass up.\n\n**Bucks +2.5**\n\nWhat really convinced me to pull the trigger on the Bucks +2.5 is Giannis. We all know he grabbed a ring in 2021, and yes, that title run was special. But here’s the thing since then, the big games have been few and far between. He’s played just one complete playoff series win in the last three post-seasons and the Bucks have exited early more than once even though he’s still in his athletic prime. Giannis isn’t just playing for stats anymore. He’s deeply motivated. He knows he hasn’t been in those late-May/June playoff trenches the way he used to. That hunger matters.\n\nSo yes, I’m leaning into the Bucks tonight. With +2.5 at home, a motivated superstar and a team that’s clicked early this season. I really love the addition of Turner, and bet this teams over in win totals. I also have some $ on them to win the east and the title. I in no way put them as one of my favorite teams, however how the fuck can at team with this talented of a guy be such long shots?\n\nThe matchup versus Golden State favors Milwaukee. The Bucks’ frontcourt and length give them an edge vs whatever Warriors are trotting out. +2.5 is a spot. I’m getting points at home with a motivated roster. That’s a luxury. Giannis, Turner + help side = size mismatch vs Warriors’ front line running thinner.\n\nI do have to say, GSW looks good so far, and I know I did not break them down too much, as no data or eye test could discard them, or show any significant edge that Milwaukee has vs them. GSW is 1-1 on the road so far this season, winning against the Lakers on the first night of the season, and losing to Portland several days ago on the 2^(nd) night of a B2B. This play is purely a play with a team I am high on getting points at home, and with not many other games that stuck out to me.\n\nGiannis is pissed off and dominating right now, so +2.5 is a gift when you believe you’ll hang tough or outright win.\n\nPS: I was close to taking the Magic -2.5 at Charlotte tomorrow, and still might through a smaller bet down on it. I have bet charlotte once (lost) and faded them once (won) so far in my plays, and mentioned numerous times I like them compared to vegas, but Magic cant go 1-4 to start the season after they had arguable the biggest off-season in the NBA.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm56cry/"
    },
    {
      "created_utc": 1761801244.0,
      "author": "PDPicks",
      "text": "Record: 5-4 | +2.39 units\n\nPrevious Pick: Kejon Owens OVER 93.5 rushing yards ❌\n -3 units… 3 pick losing streak \n\nSport | NCAAF - 7:30pm EST \n\nPick: Tulane OVER 417.5 Total Yards (-114 FanDuel) \n3 units\n\nWrite Up: Going to keep it relatively short here - I simply don’t believe that UTSA has a middle of the line defense as the rankings would suggest. They have had an easy schedule outside of TAMU and North Texas. Yet they still dropped games to Temple and Texas State. The Road Runners almost allowed Colorado St and Incarcerate Word to hit this line. I have not seen their ability to stop the run or pass and unfortunately for them Tulane can do both. \n\nUTSA does have a good enough offense to stay in this. Led by Owen McCown and Robert Henry Jr the UTSA offense has the ability to chunk big plays forcing Tulane to keep their foot on the gas.\n\nOn the other side of the ball we have the 6-1 and Tulane Green Wave. Tulane has been rolling with BYU transfer Jake Retzlaf. Jake can pick up yards through the air or on his feet. They also have a plethora of supporting options in the backfield and the wide receiver room. Tulane has a very balanced offense which will keep the UTSA defense guessing all game leading to big yardage drives. \n\nPrediction: Tulane goes for over 500 total yards",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm55fg3/"
    },
    {
      "created_utc": 1761800568.0,
      "author": "AbbreviationsNeat399",
      "text": "Record: 30-17 (+12.46) 16-6 this season\n\nHistory:❌✅❌✅✅❌✅✅✅✅❌✅❌✅✅⚫️✅⚫️✅❌❌✅✅❌❌✅✅✅✅✅✅✅✅❌✅❌✅✅❌✅❌✅✅❌✅✅❌ (⚫️=injury)\n\nEvent: ravens vs dolphins\n\nPick: mark andrews over 2.5 receptions -157 (1.5u to win 0.96u)\n\nWrite up: Andrews averages 3.5 this season and is going up against a dolphins defense that allows the highest in line target rate in the league and the 3rd most tight end receptions. Furthermore, they play 4th most middle of field open, and Andrew’s has a large boost in targets per route run versus this type of coverage.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm5462k/"
    },
    {
      "created_utc": 1761799864.0,
      "author": "Ralphjinasseater",
      "text": "Record 3-1\n\nLast pick: Donovan Mitchell OVER 27.5 Points (-112 FD) ❌\n\nI want to apologize to everyone who tailed , everybody was getting double numbers while Mitchell gets double teamed force him to pass the ball to someone else ,we’ll bounce back \n\nPick of the Day: Thunder & Spurs ML \n\nboth these squads are ELITE early (OKC 4-0 champs vibes, Spurs 3-0 hot streak)Both teams are superior to they’re opponents which are wizards and heat , both teams are also on Winning streak.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm52scu/"
    },
    {
      "created_utc": 1761798862.0,
      "author": "Prince-of-Sudan",
      "text": "**Overall Record: 0-1**\n\n**Net Units: 0**\n\n**Streak:** ❌ \n\n**Last Pick:** T**exas Tech @ Utah | College Football | Totals Over 57.5 (-110)**\n\n**Write Up:** Jumping back into CFB with a Thursday night pick to pick up some momentum heading into the weekend. There are two games slated for the night, and I am evaluating Tulane @ UTSA.\n\nTulane is 2nd in the American conference, boasting an overall record of 6-1 (3-0). They are led by the BYU QB transfer Retzlaff, who finds ways to win football games. Honestly, I had a lot of fun watching him last year - and this year he is putting up impressive numbers yet again. UTSA, not much difference on their side of the ball compared to last year. McCown is back under center and is capable of energizing a high-powered offense, especially at home. Despite their overall record and conference standing, they are at home and are capable of putting points on the board. I don't foresee either defense making a huge impact in this game. With clear skies and cool temperatures at kickoff, I expect there to be great football weather and an exciting night. \n\n**The Event:** **Tulane @ UTSA | 07:30 PM EST | College Football**\n\n**Today's Pick:** **Totals Over 53.5 (-123) |** 1.5u to win 1.25",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm50s63/"
    },
    {
      "created_utc": 1761798656.0,
      "author": "billycapezzi",
      "text": "\nPOTD RECORD: 167-124\n\nSeason record: 4-1\n\nLast POTD: __Michael Porter Jr O7.5 RA @1.74 1U__ ✅\n\nToday’s POTD: __Davion Mitchell O6.5 AST @1.76__ 1U (Bet365)\n\nNBA | Heat vs Spurs | 🏀  \n\nWeak first half but picked it up in the 2nd and got the work done easily. We move\n\nPowell is still doubtful for the Heat and Davion is coming from a 9 assist performance against the Hornets where he had 20 potentials. Over in 2/4 this season but misses coming in a big blowout against the Grizzlies where he played 24 minutes and the other one where he played 21 minutes as he was dealing with foul trouble. Still ended with 6 assists in both those games and had 12 dimes in the first game of the season. He’s avg 8.3 assists per game & 14.8 potentials per game and is that guy for Heat to handle the ball.\n\nSpoelstra even praised him after last game praising his facilitating and playmaking for them\n\n“We love it because he has a great heart that he just wants to set other people up to score. And you need guys like that. He has a great skill for it. He’s an aggressive guy. We want him to play downhill.\n\nExpecting this game to be relatively close and Mitchell to get 30+ minutes here, over in 2/2 with 30+.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm50d3a/"
    },
    {
      "created_utc": 1761798369.0,
      "author": "InternationalRest542",
      "text": "**POTD Record:** 0-0\n\n**Event:** NFL & Serie A \n\n**POTD:** Dolphins vs Ravens O43.5 + Cagliari Vs Sassuolo U3 Goals ( -133 ) 3u to win 2.26\n\n**Write Up :**\n\nTeam scoring averages this season **Dolphins:** \\~**21.8** pp**g Ravens:** \\~**24.9** ppg, Baltimore’s defense has allowed a very high number of points this season (\\~**35.4** ppg in some coverage).\n\nFor Serie A pick **Cagliari** system emphasizes defensive shape and counterattacks. They average **<1.2 goals per match** and rank near the bottom of Serie A in possession and shots on target. 6 of their last 7 home matches have finished **Under 2.5**. **Sassuolo:** 7 of their last 10 away games went **Under 3 goals**. They’ve struggled to finish chances away from home, averaging under 1 goal scored.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm4zrnm/"
    },
    {
      "created_utc": 1761794343.0,
      "author": "PurpleDragonBets",
      "text": "Record: (109-65-11) \\[+28.63\\]\n\nPOTD⭐️:🏈Tulane ML/Ravens ML (-116) \\[BallyBet\\]\n\nStart Time & TV: 7:30 & 8:15pm EST (ESPN & Amazon)\n\nUnits: 2.25 Units\n\nReasoning: Going with a college football and NFL two legger for this Thursday night and well be riding with the Tulane Green Wave and the Baltimore Ravens. The Ravens will be getting back quarterback Lamar Jackson this week and this team is completely different with him under center so I am not looking into their record as they were ineffective with Cooper Rush as quarterback but last week they did find a win with Tyler Huntley as quarterback. My key factor in this Thursday night showdown focuses on the rushing offense and defenses of these teams. This Ravens rush attack is 8th in rushing yards per game with 134 a contest and averaging 5.3 yards a carry while the Dolphins are 23rd in the league averaging under 100 rushing yards per game while their rush defense is 28th in the league allowing 145 rushing yards a game so I think they will have their hands full with Derrick Henry in this one. I also like Tulane to defeat UTSA as they are a well put together squad that has two wins over power five schools, Duke and Northwestern. Texas San Antonio is coming off an ass whooping against North Texas where they lost 55-17. This weakness of this Roadrunners team is their secondary and I think Green Wave wide receivers Shazz Preston who averages 16 yards a reception and Omari Hayes will exploit this UTSA defense. Also quarterback Jake Retzlaff is dangerous on the ground and in the air as he has 1428 passing yards, a 6:1 touchdown to interception ratio and he averages 6.5 yards a carry and 8 rushing touchdowns to go along with that.\n\nPrediction: 30-24 Tulane, 27-19 Ravens\n\nLast pick:🏈⚾️Dodgers F5/Chiefs ML💰We take a small cash with the Dodgers F5 pushing but well take a little bit of profit over a loss or a push any time!\n\nBest of luck to everyone tailing and remember to bet responsibly! If you would like to send a tip shoot me a dm and Ill send over my venmo, paypal or whatever works best I would greatly appreciate it! :) 💜🐉\n\nhttps://preview.redd.it/cdije9u336yf1.jpeg?width=1102&format=pjpg&auto=webp&s=73e467a31d25961f6e854efb28ed381cc0b7d663",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm4qevr/"
    },
    {
      "created_utc": 1761790962.0,
      "author": "InconsolableBrat",
      "text": "POTD Record: 145-99 | Profit: +93.60u | ROI: 13.3%\n\nSeason Record: 5-3\n\n \n\nLast Pick: Zach LaVine (Kings) O21.5 Pts @ 1.85. 5U.\n\nThe 5 unit 💣 hits comfortably with LaVine getting to 30 pts. I’d suggested taking the Alt Line at 25+ for 1u, so hopefully some y’all tailed that as well. My last 5 streak up to 4-1, let’s keep it going.\n\n \n\nNext Pick: **Giannis Antetokounmpo (Bucks) O42.5 P+R @ 1.82**. 3U play.\n\nThe Warriors have struggled against forwards because they simply don’t have size or strength to keep up with them. Giannis is in fantastic form and is over this line in all four games this season (45, 54, 51 and 51), including against more physical teams like Cleveland and the Knicks. I just can’t see a way for the Warriors to stop him with Draymond and Horford, and he should be able to get to the basket and the FT line at will, especially as the Bucks have an effective cast of guys to space the floor.\n\n\n\n*This line is available on FD. The other books don't have his player props yet but I'd play it to 44.5.*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm4h3gv/"
    },
    {
      "created_utc": 1761789942.0,
      "author": "NoFilterD",
      "text": "**51-27**\n\n**$4638.09  +46 units**\n\nLast pick **Travis Kelce over 39.5 yds** BIG W!!\n\nWe cashed this before halftime! Glad it was no sweat folks our hearts and blood pressure need these more often\n\nPick **Zay Flowers over 49.5 yds receiving + De’von Achane over 39.5 yds rush**-120 Odds 3 units ($300 to win $550)\n\nI really wanted to hammer this as a trap game but even though I have seen a spark from Miami I worry that Lamar and Zay both from Florida are going to play this game harder for all the family and friends that will be there. Zay flowers without Lamar was able to go over 50 yds in every game without Jackson and so I feel safe with Lamar or heck Cooper throwing to him. As for Achane, Miami has really made him their number 1 especially with Hill out. He did good against two defenses that are able to stop the run including the falcons and browns and so I feel comfortable with him getting 40 yds.  Achane last game vs Falcons 67 yds rushing and 82 yds vs Cleveland despite Miami being blown out. So even if ravens do start pouring it on Miami will still be running through Achane. He has the 8th most rushing yds so far. Zay Flowers also has the 16th most receiving yards despite a transition in quarterbacks. I like both these players and have also noticed that Thursday games have been high scoring every week except for one game which was still over 30 points which isn’t a bad score either. More points means more stats and that’s good for us! Bol everybody and thanks for the coffee by the way really appreciate it! Let’s get another W!!!!\n\nhttps://buymeacoffee.com/dieselreukv",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm4e5lz/"
    },
    {
      "created_utc": 1761789631.0,
      "author": "SimpleOk5895",
      "text": "Record: 1-0 \n✅\nUnits +1.0 \n\nLast Pick: Lonzo Ball (CLE) o4.5 assists (-115) 1.15 to win 1U ✅ \n\nPick: Giannis Antetokounmpo (MIL) o11.5 Rebounds (-120) 3.6 to win 3U 🏀 \n\nBig Men feast on the glass vs the Warriors. Giannis has been having a great year rebounding surpassing his like in 3/4 with 14, 20, 14, 8. The Warriors typically play smaller with Draymond at the 5, and on top of running a fast pace offense. This creates many rebound chances for big men such as Giannis. In the previous game, Zubac crushed his line of 9.5 rebounds with 13 rebounds. Expect a big night from Giannis here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm4d93b/"
    },
    {
      "created_utc": 1761789607.0,
      "author": "milldura",
      "text": "**Record:** 14-6  \n*Win%:* 70.0%  \n*Last 10:* ❌ ✅ ✅ ❌ ✅ ❌ ✅ ❌ ✅ ❌  \n*Units:* \\+7.68\n\n\n\n**Previous POTD:** Football - Ligue 1 - Le Havre v Brest - Both Team to Score / Yes - $1.70 - 2 Units ❌\n\nStruggling to shake this up and down record. I got this one wrong though, the game was a lot scrappier and docile than I imagined.\n\nUltimately we were unlucky not to land the bet with Brest hitting the post and missing a late header but it remained 1-0.\n\n\n\n**Today's POTD:** Football - A-League - Brisbane Roar v Melbourne City - Melbourne City ML H2H - $1.90 - 5.0 Units\n\nI’m going with a big units play here in backing Melbourne City to beat Brisbane away from home.\n\nBrisbane have managed a 1-0 win at home against strugglers MacArthur and lost 2-1 to Wellington in NZ. Tbh I don’t see any of these teams making the finals.\n\nPerth drew with Wellington the first game of the season so read into that form what you will. I’d probably take every City starting player if you match them up against Brisbane other than O Shea.\n\nMelbourne have enjoyed a draw away from home and smoked Perth 4-0 in theiir last game, showing they were a class above.\n\nBrisbane have managed under 40% of possession in both games and this will be no different.\n\nMax Caputo is in scintillating form after reconnecting with the squad after the under 20’s World Cup. He has 6 goals in his last 4 games for Club and Country and with a maturing Mathew Leckie (former Bundesliga player) dominating the midfield, they are looking good for another push for the title.\n\n\n\n**14 wins in 20 bets,** well done to any followers. No pressure whatsoever, but if you are willing, any help will go a long way.\n\nBuy me a coffee! - [https://www.paypal.com/ncp/payment/K4C6AK2VCT9EJ](https://www.paypal.com/ncp/payment/K4C6AK2VCT9EJ)\n\n**Thanks, GL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm4d6jt/"
    },
    {
      "created_utc": 1761789059.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 3-0 (+4U)\n\nLast Pick: Rockets @ Raptors over 231 (-120) (1U) \n\nEnded with a total of 260 😂😏\n\nEvent: Warriors @ Bucks (NBA) (7pm Central)\n\nPOTD: Bucks +2.5 (-110) (1U)\n\n-everything is bet to win unit amount-\n\nWrite up: we got a warriors team coming playing their 3rd game in 4 nights. Moses moody is gtd and would be a big loss with the way buddy hield is playing. Either way he’s got right thumb sorness which is his shooting hand. Moses is averaging 12 points on 21 minutes a game. Giannis is GTD but always is and is likely to play. Anyways the bucks are 10th in net and the warriors are 11th. The bucks are playing solid team basketball right now and get to stay at home again, Ryan Rollins is also a breakout star. I think Gianni’s has a big game as well in sheer size advantage alone over this tired team. We are getting what could potentially be the better team right now at home, as an underdog, and in a better situational spot. Not sketchy either cause warriors carry the public on name alone. Been a great start for me so far and I’m grateful to be able to write up sports bets every day I love the game and the hustle. Let’s get another on the board.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm4bjjo/"
    },
    {
      "created_utc": 1761786974.0,
      "author": "VAM89",
      "text": "Record: 16-7\n\nLast Five Predictions (Old - New): ✅✅❌✅✅\n\nNet Units: +25.64\n\nYesterday's Pick: Roma to beat Parma and u3.5 total goals. 3u @ $2.05 ✅\n\n2-1 win to Roma.\n\nReally happy with this one. They definitely made us sweat with the first goal in the 63rd minute. \n\nHowever, Roma scored twice and looked set to run out 2-0 winners. However, Parma scored late to get it back to 2-1... Which is basically exactly why we covered the Roma to win and 3.5 line. Just in case Parma scored a jammy goal. \n\nToday's Pick: Bangkok Utd v FC Samut Sakhon. Over 3.5 Goals AND KuPS to win v Gnistan. 3u @ $2.20\n\nPick: Combining two legs here. If you're not one to do that, I like the o3.5 for the Bangkok game, or KuPS -1 handicap. \n\nFirst up, we're at the Thai FA Cup. One of the best teams in Thailand, Bangkok United, plays away to 3rd division FC Samut Sakhon.\n\nSamut Sakhon are doing well in the third tier and are sitting in second place after four games. \n\nBangkok United are second in the top division and in great form in both the league and in the Champions League 2, which is basically the Europa League of Asia. \n\nPlenty of these early cup games have crazy high scores, so I like the o3.5 and that covers us a fair bit. \n\nAlong with that, we're in Finland, where top of the table KuPS host IF Gnistan. \n\nGnistan have struggled since the league split into the championship group, going 0-1-6. \n\nKuPS want to keep winning to maintain their lead at the top. There are only 3 games left, and a loss here could see them drop to second depending on other results. \n\nKuPS should win this.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm45fit/"
    },
    {
      "created_utc": 1761786209.0,
      "author": "yeahhhhhboiii",
      "text": "Record: 10-10 +5.84\n\nLast Pick: Austin Reaves 30+ points + rebounds (-252) and Julius Randle 30+ points + rebounds (-175) [+110] 4u ❌ -4u\n\nThey took away 3 rebounds from Reaves in the 1st quarter and he ends up only getting credited with 1 for the whole game to end on the hook at 29PR. Absurd. It might be stat corrected if we’re lucky, but tough break. Doubt anyone tailed from the downvotes tho 😂tough crowd\n\n**POTD** Mboko ML vs Eala (-225) + Malik Washington 20+ yards receiving (-220) [+105] 3u\n\nWTA HONG KONG 4:30AM MST\n\nRAVENS @ MIAMI 6:15PM MST\n\nLeg 1 - Eala has been in really bad form, losing 4 of her last 5, with the only win being a walkover retirement win in round 1. Mboko has looked sharp in the past few matches, winning 3 of her last 4, with that loss being to the wrecking ball Rybakina. Both young rising stars, but Mboko is better and should win.\n\nLeg 2 - Baltimore gets torched through the air by wide receivers. Washington has cleared 20 yards in 3 straight, 30 in 2 straight, and his overall involvement has been climbing. With Tua looking great last week and Lamar returning, this should be a high scoring, competitive game. Dude will probably cash this on 1 catch vs the Ravens.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm436xm/"
    },
    {
      "created_utc": 1761785445.0,
      "author": "bigtime-operator",
      "text": "Record: 43-40\n\n**Verona - Milano** 🏐 Italy - Superlega UTC 19:30\n\nPick: **Verona -1.5 Set Handicap** @ 1.55 Betsson\n\nVerona has made a flawless start to the 2025-2026 season. Winning both of its first two matches, they share the top spot with reigning champions Trentino with 6 points. The team demonstrated its fitness by defeating Piacenza 3-1 in the first week and Grottazzolina 3-0 away in the second. One of the key factors behind this success is the appointment of **Fabio Soli**, the coach who won the championship with Trentino last season. Under Soli's leadership, Verona has built a squad that blends experience and youth. The signing of American **Micah Christenson**, considered one of the best passers in the world, has taken the team's playing style to a whole new level. At the opposite end, they feature 23-year-old Brazilian talent Darlan Souza, while the remaining outside hitters include Rok Mozic and Noumory Keita. This squad structure clearly demonstrates that Verona is aiming for the top spot this season, not just the playoffs.\n\nMilano, on the other hand, started the season with mixed emotions. They showed \"solidity and character\" by beating Modena in their opening match, but suffered a hard-fought 3-1 defeat against Piacenza in the second week. After this defeat, they are looking at the away game against Verona as a \"redemption\" match. Milano's biggest asset is undoubtedly their Belgian captain, Ferre Reggers, currently the league's top scorer. Reggers has scored a staggering 55 points in two matches, averaging an incredible 6.11 per set. His 27 points in the last match against Piacenza alone demonstrates his vital role for the team. Milano will aim to capitalize on Reggers' exceptional performance and return from their challenging away game against Verona with a point or points.\n\nWhile Milano may have a scoring machine like Ferre Reggers, Verona appears to have a more balanced squad. Christenson's passing ability and ability to effectively utilize multiple scoring options like Darlan, Mozic, and Keita will make things difficult for Milan's defense. My pick is Verona, given their chemistry with their new coach and world-class passer Christenson. I predict a 3-1 result.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm40xnl/"
    },
    {
      "created_utc": 1761785426.0,
      "author": "whidswhinners",
      "text": "**2025 NFL Record:** 16W - 7L  \n**2025 MLB Record:** 4W - 1L  \n**2025 NBA Record:** 2W - 0L  \n✅✅✅❌✅✅✅✅❌🩼✅✅✅✅  \n❌✅🪝✅✅✅❌✅✅✅❌✅❌✅  \n✅✅\n\n**Net Units:** \\+10.46 units (I only promote 1u waigers)\n\n**Last Pick:** Donovan Mitchell - o32.5 Points + Rebounds (-108 on Fanduel) (Pending\n\n**Event:** NFL: Dolphins vs Ravens (8:15pm EST)\n\n**Today's Pick:** Jaylen Waddle - o4.5 Receptions (-140 on Bet365)\n\n**Writeup:** *With Tyreek Hill out and Darren Waller on IR, Miami’s targets continue to condense to Waddle.*\n\n*He’s gone 5+ catches in 5 of 8 games (63%) this year and 3 of his last 5 (two 6-catch games; one dud vs CLE).*\n\n*The Ravens’ WR table shows they’re stingy on yardage but will concede volume underneath; multiple WRs (Odunze, Zaccheaus, Kirk) hit their reception lines.*\n\n*Waddle leads the team in targets per route and yards per route vs Cover-1 and Cover-3, with a mid-teens aDOT that pairs with Miami’s quick RPO/crosser game.*\n\n*With Tyreek out, Waddle’s career splits jump to \\~6.2 catches and \\~70 yards per game, clearing 5+ receptions in \\~67% of those games.*\n\n*In his last game against the Ravens two year ago, Waddle came down with 11 receptions off of 19 targets. Easily the most on the season by a mile and Tyreek Hill was also on the field during that game.*\n\n*On the defense side, the Ravens are top-tier in Cover-1/3 usage and tilt throws outside more than to the slot (Wide Tgt % > Slot Tgt %), which favors Waddle’s perimeter snaps.*\n\n*Even if Baltimore limits explosives, those looks force Tua to the underneath/out-breaking answers that feed Waddle.*\n\n*With a spread greatly favoring the Ravens (+/-7.5) and the 4th highest game total of the week (+/- 50), expect the Dolphins to throw to their #1 option early and often as they attempt to stay in this game.*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm40vkx/"
    },
    {
      "created_utc": 1761784980.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 48-23 (+51.75u)\n\n__Previous Pick:__ [✅ Kennesaw St -9.5 (-120), 3.6u](https://www.reddit.com/r/sportsbook/s/HL8ubZctMr)\n\n__Event:__ NFL: Ravens @ Dolphins 8:15pm EST\n\n__POTD:__ Jaylen Waddle o62.5 rec yards (-115), 3.75u to win 3.26\n\n__Write Up:__ A couple of struggling AFC teams kick off Week 9 of the NFL as the (2-5) Baltimore Ravens travel to South Beach to take on the (2-5) Miami Dolphins on Thursday Night Football. Baltimore snapped a 4 game losing streak as they took down the Bears 30-16 at home on Sunday. This week they get back star QB Lamar Jackson who has been out since Week 5 with a hamstring injury. As for the Dolphins they destroyed my Atlanta Falcons on Sunday 34-10 after losing their 3 previous games. Their offense was rocking, which was much needed as it started to get scary in Miami.\n\nMiami lost star WR Tyreek Hill for the season after his knee exploded in Week 4. WR2 Jaylen Waddle stepped into the WR1 role, & he has absolutely dominated. Waddle had a huge game last week, catching 5 of 6 targets for 99 yards & a TD. He had a 43 yard TD which he had 30+ yards after the catch. He had the 3rd highest air yard share Jaylen Waddle, 73% air yards share in Week 8. __Since Hill’s injury, Waddle has had at least 95 yards in 3 of those 4 games.__ Excluding the game against the Browns (horrible weather), he has been on fire:\n\n24% target share\n\n101 yards/game\n\n4.1 YPRR\n\n31% first read\n\nHe has had a huge amount of air yards as of late. __He leads all wide receivers in share of air yards (53%). Waddle has had receptions of 46, 45, & 43 yards in those games. In his last 11 games without Tyreek, Waddle has 70 catches, 919 yards & 7 TDs for an average of 6.4 rec & 84.5 yards. He's also averaging 8.4 targets/game & he's scored in 7 of those 11 games.__ His Yards After Catch has been insane. __Waddle is averaging 9.9 YAC, most in the NFL.__ He runs 10 yard slants & just takes off at lightning speed. __He was clocked last week at 21.35 mph on his 43 yard TD, 3rd fastest speed in Week 8. He has averaged 16.8 yards per reception (268 yards/16 catches) since Week 4, 6th best of 41 qualified NFL WRs (League Avg: 12.7.)__ Now, Waddle gets his easiest matchup since Tyreek went down. \n\nThe Ravens have had a really bad defense so far this season. __Baltimore ranks 30th in the NFL in EPA/Play allowed (0.148). Their pass defense has been poor ranking 28th in EPA/Dropback allowed (0.21) & they have the 6th worst Dropback success rate allowed. Baltimore ranks 31st in turnover margin (-6).__ Last week the Ravens got torched by a pair of Bears WR’s. __Rome Odunze had 7 catches for 114 yards, DJ Moore had 73 yards on 4 catches. Both going over Waddle’s receiving line this week.__ But wasn’t the first occurrence of WR’s doing well vs the Ravens. __Baltimore has been getting lit up by WR’s all season, allowing the 3rd most receptions per game (14), the 9th most receiving yards per game (159), the 8th most yards per target (9.0), & the 3rd most TD’s (10).__\n\nThe biggest reason their defense isn’t doing well is because QB’s are getting tons of time in the pocket. Baltimore has has a tough time generating pressure. __The Ravens rank 29th in pressure rate (27.1%).__ A key change they have made over the past 2 weeks to help with pressure is they are now deploying 3 safeties as part of their base defense. They are using Kyle Hamilton as a Swiss Army knife alongside Alohi Gilman & rookie Malaki Starks. Hamilton has been all over the field. He played 18 snaps in the box on Sunday, playing linebacker on 19 snaps. He played another 24 snaps at slot corner & 2 snaps out wide at corner. Hamilton rushed the passer on a season high 8 snaps. This was all to fix their pressure issues. But doing created a lot of space out wide for Bears receivers as evident by Odunze & Moore’s stats. The Dolphins Defensive Coordinator Anthony Weaver actually came from the Ravens last year. He & Ravens Defensive Coordinator Zach Orr coached together as assistants, so Weaver will know Orr’s gameplan & schemes very well. As bad as Tua’s been this season, the Dolphins are going to actually be able to pass on this weak pass defense. But Tua wasn’t that bad this past Sunday.\n\nTuaturndaballova bounced back from a nightmare outing in Week 7, connecting on 20 of 26 passes (76.9%) for 205 yards (7.9 Y/A) & a season high 4 TD’s Sunday in Atlanta. Now Tua gets to go back to Miami off a good game, & he is a much better QB at home. Tua’s biggest thing is he is a first read guy. He focuses on that read & struggles if he has to make a 2nd read. __Tagovailoa is averaging 8.3 yards per pass attempt on his first read throws compared to 6.4 yards per pass when he is moved off his first look.__ This is why Tyreek Hill had so many big games. Now Waddle is his 1st read guy. __Since Hill’s injury Waddle has been targeted as the 1st read on 31% of Tua’s dropbacks.__ But it’s not all Tua’s fault, Miami has one of the worst offensive line’s in the league. Their line has been so bad added a 6th offensive lineman last week, & it actually worked. This shouldn’t be an issue this week vs a Ravens DLine that has had trouble pressuring QB’s. The Ravens may have had defensive issues, but Miami has had just as much. \n\nMiami has had major defensive troubles. __The Dolphins are currently 27th in the NFL in EPA per play allowed (0.114).__ They also have had trouble getting to the QB. __Miami ranks just 22nd in pressure rate (33.7%) even though they blitz at the 5th highest rate (33.1%). Only 40% of their blitzes generate pressure (22nd). When Miami has failed to get pressure, they have allowed a 79.3% completion percentage, worst in the league. Even when the Dolphins have gotten pressure, they have allowed a 58.3% completion percentage (30th) & 7.5 yards per pass (31st).__ That’s going to be a problem vs the Ravens offense now that Lamar is back. Jackson’s return is a significant boost for the offense. __Baltimore was averaging 6.5 yards per play (best in NFL) when Lamar was on the field at the start of the season. Without Lamar they avg just 5.1 yards per play (24th in NFL).__ He is coming into the game with a hamstring injury, but if he doesn’t have any restrictions he’s going to run all over them. __The Dolphins have allowed a league high 4 rushing TD’s to QB’s & 180 rushing yards on the season.__ The Ravens are going to score a lot of points this game. As bad as the vibes are surrounding Miami in bulk, they have found a way to score 21+ points in 6 of their last 7 games, with that performance in the rain in Cleveland being the exception. It’s also worth noting that the Over is 26-6 since 1983 in games with totals of 49.5 or higher involving a team that has lost 4 or 5 of its last 6 games & 2 teams with winning percentages between 25% & 40%. The average total points scored in that betting system is 60.8 points per game.\n\nWith the Ravens favored by 7.5 points, Miami should be trailing, which means a pass heavy game script, & plenty of chances for Waddle to break one deep.\n\n__Jaylen Waddle over 62.5 receiving yards__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial) - [PayPal](https://paypal.me/joeinglesofficial)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm3zjsw/"
    },
    {
      "created_utc": 1761784359.0,
      "author": "BukChicken",
      "text": "**2-1 | +12 units**\n\n💰—>😭—>💰—>\n\n+10u | -2u | +4u |\n\n**Previous Pick** - Valentin Vacherot ML vs Arthur Rinderknech + over 22.5 games (+200) (2 units) 💰\n\nWent about how I expected it to. I was slightly worried that Vacherot would smash him in 2 after watching the first couple games, but Rinderknech recovered well. The first set went to tiebreak, and Vacherot choked it away. In the end, he was the better player though, like in their first encounter, and won a deserved, tough-fought match (6-7), (6-4), (6-3).\n\n——————————————————\n\n**Today’s Pick** - Malik Washington 25+ receiving yards (-136) + Marshall -2.5 vs Coastal Carolina (-194) | (**+162**) FD | (**3 units**)\n\n**Marshal @ Coastal Carolina 19:30 EST**\n\n**Ravens @ Dolphins 20:15 EST**\n\nAll my picks so far have been exactly +200 odds. I’ll continue to share plus odds picks that I’m confident in, as I have the most success with this method, and it’s going well so far on here. This one is a bit lower at +162.\n\n——————————————————\n\n**Malik Washington 25+ receiving yards (-136) write up**\n\nWashington’s role has expanded in recent weeks, clearing 30 receiving yards in each of his last two games while his snap share has surged from 44% three weeks ago to 64% and 62% in the past two.\n\nLast week: 4/5 for 36 yards. Prior: 5/8 for 30. Trend’s clear — more targets, more opportunity.\n\nBaltimore is not good vs the pass and has a problem with slot receivers in particular—which I’ll expand on more.\n\nMarlon Humphrey was once a great cornerback. Just last year he was elite. He was a feisty lockdown corner that could shadow top receivers and hang with the best of them. A Gandalf corner as I like to call them: “THOU SHALT NOT PASS!”\n\nNowadays, he’s more like Santa, and Malik Washington might be the primary beneficiary of his generosity tomorrow. \n\nHe plays 63% of snaps as the scb. While he is “only” targeted on 17.8% of routes run, which is high, but not egregious, he is at the bottom of the barrel statistically in most of the productivity coverage stats. He gives up a lot of production. The stats don’t lie, this year has been a major regression season.\n\nHe’s allowing 52 ypg, 9.8 YPT, and ranks bottom-10 in most coverage stats (PFF grade 45.4, #109/113). \n\nWashington runs 52% of routes from the slot, so he’ll see plenty of Humphrey.\n\nThe rest of the Ravens corners and secondary as a whole are nothing to write home about either. They’re the 2nd worst defense against WRs in terms of fantasy points allowed and they give up the 9th most yards to WRs.\n\nNotable primary slot Wide Receiver lines against the Ravens:\n\nAmon-Ra St. Brown - 7 / 77/ 1 (pre-game O/U 72.5) ✅\n\nKhalil Shakir - 6 / 64 (pre-game O/U 47.5) ✅\n\nChristian Kirk -  4 / 64 yards (pre-game O/U 36.5) ✅\n\nDJ Moore - 4 / 73 (pre-game O/U 42.5) ✅\n\nJuJu Smith-Schuster - 4 / 36 / 1 (pre-game O/U 14.5) ✅\n\nJordan Whittington - 3 /23 (pre-game O/U 12.5) ✅\n\nThat’s a clear rate in 6/7 games. I couldn’t find exactly who the primary was for the Browns so it could be 7/7.\n\n——————————————————\n\n**Marshall -2.5 @ Coastal (-194) write up**\n\nI don’t bet CFB often, but I stumbled across this game while browsing the ESPN app looking for my next victim, and it jumped out. Right off the bat, just looking at the previous games for both teams, Marshall seems to have much more impressive results despite both being 4-3. \n\nFor instance, they beat Old Dominon 48-24 two weeks ago, and Coastal Carolina got absolutely dog walked, 47-7, by Old Dominion the week before that. Maybe the Old Dominion players partied all week, drunk off their victory against CCU, and got smashed by Marshall because of that, but more likely it’s a sign that Marshall is a cut or two above Coastal, I would think.\n\nLooking at the stats of the QB for Marshall: Carlos Del Rio-Wilson, he looks really good. 1,131 yards passing with 12/1 TD/INT and a team high 347 yards rushing with 4 TDs. He’s a transfer and didn’t even start the first game of the season too.\n\nCoastal Carolina has had some major quarterback problems this season. They benched their starter in week 2 after he threw 3 picks and then benched their replacement quarterback last week after he filled in with 447 passing yards and 3/3 TD/INT since then. Their latest quarterback, Samari Collier, will start this game. Maybe the third time’s the charm. \n\nHe had a pretty good debut start in their win last week vs Appalachian state, but this guy’s a senior, 2 year JUCO transfer, who’s mobile but very much unproven.\n\nMarshall’s QB Del Rio-Wilson is elite through the air and elite on the ground. He didn’t have a single interception until last game, and he’s averaging 293 total yards and 3.2 TDs per game since becoming the starter.\n\nBig advantage for the Thundering Herd.\n\nMarshall’s top wide receiver, Demarcus Lacey, has 35 / 484 / 4 on the year. Coastal’s top WR has 19/158. Lacey has more yards receiving than any of Coastal’s quarterbacks have passing.\n\nPretty primitive analysis, but compelling to me nonetheless. I don’t think home field advantage will make up for the deficit in quality between these two teams. My gut tells me Marshall will win on the road here and maybe stomp them. \n\nTeased down from -6.5 to -2.5 for extra safety, as Marshall has had 2 of their last 3 games decided by exactly 3 points (both in 2OT). They’ve had 12 days off since their last game though, and will be well rested and ready to lay a beatdown on their enemy.\n\nMy pick is combining these two alts to fit with my high odds strategy, but you can of course pick to just tail one or the other, and the standard lines for both picks also seem good to me.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm3xr06/"
    },
    {
      "created_utc": 1761784071.0,
      "author": "major-couch-potato",
      "text": "Record: 153-134, -4.23 units\n\nLast Pick: Dylan Dietrich ML vs Jay Clarke (+135, 1 unit): Win\n\nTennis | Charlottesville Challenger | 11:30 AM EST (estimated)\n\nToday's Pick: Rinky Hijikata vs Mats Rosenkranz | **Hijikata ML at -153 (DK). 1 unit.**\n\nWrite-up: The odds movement before the match was pretty wild, as things even swung in Clarke's favor at one point. However, Dietrich closed at around +110 and played a very strong match. \n\nFor today's pick, I'm sticking with Charlottesville and going with Rinky Hijikata to defeat Mats Rosenkranz in the second round. Hijikata is one of those guys who never really looks to be dominating his opponent, but always manages to score enough wins throughout the season to stay in the Grand Slam main draw range. He tends to perform fairly well indoors, as a strong net game makes up for a lackluster serve and fairly standard baseline game. His first-round match against clay-courter Matias Soto was tougher than expected, but he actually didn't play badly, earning a 7.04 performance rating.\n\nMeanwhile, Mats Rosenkranz has a more traditional indoor game - he's a big lefty server that likes to take it to his opponent in rallies. However, he doesn't really have the same consistency from the ground as Hijikata, and I feel that his approaches to the net can be a bit too lumbering when facing a speedster like Rinky. He got a decent first-round win over Andres Martin, but I still don't feel that he's in quite the same weight class as Hijikata. Looking at some common matchups, they both played Patrick Kypson indoors recently; Hijikata closed at around even money, while Rosenkranz was a 3.10 underdog. Rosenkranz was also priced similarly to this match in the first round against Martin, but I don't feel that Andres is at the same level as Hijikata, as he's more of an outdoor player and hasn't scored any big wins recently. Teelo's model supports the idea that there's a gap in form between these two players, as it gives Rinky a 70.3% chance of winning this one (60.47% implied). \n\nOverall, I think Hijikata should be a bigger favorite here. This won't be pretty, but he's the more consistent player by far, and I simply see a bit of a level gap here. Some books have a worse price on this, but I would take it down to around -165. \n\nNote: The [POTD Capper Tracker](https://potd.lol), which you may remember from its Google Sheet days, is finally back in a cleaner, more robust website format! If you have any questions or suggestions regarding the site, feel free to reach out to either me or u/EthicalGambler.\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/major-couch-potato-xJXnQW?utm_source=mdembed&utm_campaign=major-couch-potato) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm3wwhm/"
    },
    {
      "created_utc": 1761783450.0,
      "author": "Pefkov",
      "text": "**Record:** 7-4\n\n**Net Units:** \\+3.27\n\n**Last Pick:**  Isaiah Pacheco U60.5 Rush+Receing (-112 on DK) 1u to win 0.89 U✅\n\n**Todays Event**: 🏈 NFL Thursday Night Football Ravens @ Dolphins 7:15 pm CST 🏈\n\n**Todays pick**: Isaiah Likely o22.5 Receiving Yards (-109 on DK) 1u to win 0.92 U\n\nshould've taken it when it was o21.5 yesterday oh well\n\n**Writeup:** Its been a while since Likely and Lamar have both been healthy and playing together. Last time it happened was week 4 for a whole 2.5 quarters until Lamar was taken out of the game. Now Likely did get 0 receptions that game but as mentioned, Lamar was not in the whole time and it was Likely's first game back from  a fractured foot from over the summertime.\n\nAs Tyler Huntley clearly does not care much for Likely given he has 26 yards from 5 receptions over the 3 games they've played together, we'll be looking at 2024 stats. Leaving out playoffs (which would make all these stats better mind you), Likely has been average 3.5 targets with 2.6 receptions, 29.8 receiving yards, and 11.4 Yards Per Reception per game. It's clear that he's got some good chemistry with Lamar.\n\nAnother aspect I want to look at is offensive snap share percentages. Aside from week 4 (where he played 45% of all snaps) and week 7 where I could not find data, Likely has played over 50% of the offensive snaps in each game.\n\nNow let's look at the Dolphins. They've given up the most fantasy points to Tight Ends this season. Opposing TEs have an average of just under 11 yards per reception (450 yards from 41 receptions). Dolphins also play zone nearly 70% of the time vs man, which Likely seemed to do better in last year. All these factors add up to what should be an explosive game to get Likely really going this season\n\nBOL everyone tailing!\n\n[http://buymeacoffee.com/Pefkov](http://buymeacoffee.com/Pefkov)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm3v1ve/"
    },
    {
      "created_utc": 1761783289.0,
      "author": "dreamchasing1",
      "text": "Record: 217-203 Net Units: -18.44 46-49 on 1.5u plays, 36-37 on 2u plays, 1-1 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Bulgarian Cup] Sevlievo vs CSKA Sofia\nLast pick: total goals over 3.5 @ 2.10 - 1.5 Units. Lost\n\n\nEvent: Soccer/Football, [Serbia Super Liga] Vojvodina vs Crvena Zvezda (Red Star)\n\n\nPick: BTTS + Over 2.5 goals @ 2.05\n\n\nZvezda have averaged 4.4 total goals per game, they are usually very attacking and score plenty, however they allow in almost all games, they just need a decent opponent. Vojvodina currently sit in 3rd place and have scored in all home games played, although against much weaker sides. The previous league meeting between them that Vojvodina hosted ended in a 3-5 defeat. Zvezda this season have kept 4 league clean sheets in 11 games, with those being against significantly weaker teams.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm3ukhq/"
    },
    {
      "created_utc": 1761782503.0,
      "author": "BrokenClock9",
      "text": "8-7-0\nUp 5.15 Units \n\nLast POTD: NCAAF, Jacksonville State -6 v MTSU -110. ❌\n\nUgly game, they won by 3 but never really came close to covering the 6. 4 pick heater ends there. New streak starts today! \n\nToday’s POTD: Lamar Jackson over 35.5 rushing yards -114\n\nUnits 2.28 units to win 2\n\nLamar is back and you know he’s going to be ready to go. \n\nBefore he was hurt, he hit 36 yards in 2 of 4 games. \n\nThe dolphins rank 28th in rush yards allowed per game. Cleveland and Detroit were the 2 that held him under. They rank 9th and 4th against the run respectively. \n\nThe dolphins let Fields go off for 81 yards on 7 carries. Maye had 31 yards on 10 carries. Indiana Jones had 26 on 7. \n\nLamar has hit 36 rush yards in 5 of 7 career TNF games. \n\nI also really like the value of Lamar ATTD at +160 so I’ll be on both. Have to pick 1 though so give me the rush yards. \n\nRavens 42-24",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm3s6xz/"
    },
    {
      "created_utc": 1761782095.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ojkraf/pick_of_the_day_103025_thursday/nm3qyua/"
    }
  ]
}