{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/27/26 (Tuesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qnw7zw/pick_of_the_day_12726_tuesday/",
  "target_date": "2026-01-27",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-26T23:46:47.633626+00:00",
  "comments": [
    {
      "created_utc": 1769469799.0,
      "author": "SP7988",
      "text": "**Record:** 41-20-1 (+22.02u)\n\n**Last:** (CBB) Arizona -2.5 (1.5u) - Pending\n\n**POTD:** (CBB) No. 7 Michigan State (-13.5) at Rutgers\n\n**Start Time:** 6:30 PM ET (FS1)\n\n**Odds:** -110 (DraftKings)\n\n**Units:** 1.5U\n\n**Reasoning:** Death. Taxes. Vegas disrespecting Sparty.\n\nIf that Washington line was disrespectful, and if that Oregon line was downright blasphemous, then this line is straight up unforgivable. Especially given that we just got a good look at the disaster of a runaway train that is the Rutgers men’s basketball team when fading them for Friday’s POTD. \n\nBut mostly, it’s because Michigan State has been playing some of the best basketball in the country right now. \n\nSince a 58-56 loss at Nebraska back on Jan. 2, the Spartans (18-2) have reeled off six consecutive victories. All have come by 10 or more points with all but one by 16+. Even more impressive, is the fact that the team has done so by an average margin of victory of 22.7 points, including a 91-48 thumping of Maryland on Saturday. Not surprisingly, Michigan State’s recent form has helped it soar up to 4th in the KenPom rankings. \n\nAs is the case with most Tom Izzo-led squads, the defense has been the backbone. \n\nThrough 20 games, the unit finds itself among the nation’s elite, ranking 4th in scoring defense (62.8 PPGA), 6th in defensive efficiency (0.910), 7th in opponent field-goal percentage (38.8%) and 23rd in opponent three-point shooting (29.7%). But it’s the Spartans’ tendency to take it up a notch away from home that makes them a tough out, ranking 1st in defensive efficiency (0.901), 2nd in scoring defense (61.9 PPGA), 6th in opponent field-goal percentage (38.8%) and 31st in opponent three-point shooting (29.7%) on the road. Furthermore, ever since an uncharacteristic showing against lowly Cornell on Dec. 30—97 points allowed on 46% shooting—the unit has been in something of a flow state, conceding just 56.9 points on 37.8% shooting from the field (25.9% from beyond the arc) in seven outings. \n\nThat all adds up to what should be yet another lackluster offensive effort from the suddenly reeling Scarlet Knights (9-11). \n\nFollowing a 82-59 beatdown at the hands of Indiana last Friday, the team enters as losers of three straight and four of its last five. And while Rutgers already ranks among the worst in the country offensively—258th in offensive efficiency (1.010), 270th in three-point shooting (31.9%), 277th in scoring (69.7 PPG) and 330th in field-goal percentage (40.7%)—things only take a turn for the worse against stiffer competition. In six contests against opponents that rank Top 75 in defensive efficiency, the team averages just 59.2 points on a porous 37.5% shooting (29.8% from the perimeter). That includes being held to 37% shooting or worse in all but one of those games. \n\nUnfortunately for the Scarlet Knights, things don’t get much better defensively. \n\nOn the year, the team ranks 170th in scoring defense (74.5 PPGA), 196th in opponent field-goal percentage (44.8%), 239th in defensive efficiency (1.079) and 332nd in opponent three-point shooting (37.2%). Over the last three games, things have gone from bad to worse, as Rutgers has conceded 82.1 points on 48.5% shooting from the field (40.5% from beyond the arc). Not the kind of run of form you’d like to have when hosting a surging Michigan State offense that enters ranked 41st in field-goal percentage (47.9%), 47th in offensive efficiency (1.147), 71st in three-point shooting (35.8%) and 95th in scoring (79.1 PPG). \n\nBut while those numbers won’t jump out of the page at you, take a look at what the team has managed to do in its last six meetings against opponents that rank outside of the Top 200 in defensive efficiency:\n\nOregon (208): 68 points on 57% shooting (35% from beyond the arc)\nMaryland (278): 91 points on 61% shooting (47% from beyond the arc)\nToledo (286): 92 points on 51% shooting (43% from beyond the arc)\nPenn State (306): 76 points on 46% shooting (56% from beyond the arc)\nOakland (333): 79 points on 46% shooting (27% from beyond the arc)\nCornell (351): 114 points on 55% shooting (46% from beyond the arc)\n\nNot only did the Spartans go 6-0 in those contests, but they did so while averaging 86.7 points on 52.7% shooting (42.3% from long range). That includes shooting 51% or better in all but two games and shooting 43% or better from deep in all but two as well. \n\nIt will be the intangibles that will play an X factor in this one. \n\nMichigan State topped 30 fast break points against Maryland on Saturday, marking the third time this season the team has accomplished the feat—the rest of the Big Ten has only done so twice. Not surprisingly, the Spartans rank 7th in fast break points (17.3 PPG; 98th percentile). That’s an area the team should continue to thrive in against a Scarlet Knights team that ranks 156th in opponent fast break points (9.8 PPG; 57th percentile). But where the team truly struggles is in conceding second-chance opportunities to opponents, ranking 222nd in the category (11.7 PPG; 39th percentile). This is another area Michigan State should be able to take advantage, as the team ranks 28th in second-chance points (14.3 PPG); 92nd percentile). \n\nForget looking ahead. Expect Sparty to put together another dominant performance to springboard themselves into Friday night’s massive showdown with in-state rival Michigan. \n\nBOL if tailing, and as always, please do so responsibly. One bet should not have you crashing out all over Reddit.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qnw7zw/pick_of_the_day_12726_tuesday/o1wznlc/"
    },
    {
      "created_utc": 1769469506.0,
      "author": "stevienick8",
      "text": "Record: 6-3 (+2.7 U) \n\nLast POTD: Shelton (-2.5) ✅ \n\nPOTD: Alexander Zverev (-3.5 Games) over Learner Tien 2.56 to win 2U\n\nTime: 8:30 PM CT (Tuesday in Aus) \n\nThis pick hurts my soul as an American tennis fan. Tien has had an awesome run this tourney and has taken the next step. With that being said, taking down Zverev is a tall task. \n\nZverev is 38-1 in his career against lefties, and this is his 40th Grand Slam quarterfinal. It will be Tiens 1st. Zverev has a penchant for blowout sets. Even if this match goes 4 sets, I expect Zverev to win a set 6-2 or 6-1. \n\nZverevs stronger stroke is actually his backhand, and Tien will not be able to dictate points from his left handed forehand like he did against Meddy. I expect a close start to the match and Zverev to pull away.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qnw7zw/pick_of_the_day_12726_tuesday/o1wyp1e/"
    },
    {
      "created_utc": 1769469031.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 45-24 (+15.81U)**\n\n**ROI: +19.05%**\n\nLast POTD: [Rams vs Seahawks Parlay](https://www.reddit.com/r/sportsbook/s/Fnon8uLMGp) ✅\n\n**POTD: NCAAMB: Nebraska +11.5 vs. Michigan -110 (0.50U TO WIN 0.40U)** \n\nWrite up: Half a unit bet for me on this one because of the injury concern for Nebraska & Frager - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Nebraska covering +11.5 at 56% (with Frager)\n\n• Model says Michigan ML is at 62% (shows me that they are 11 point favorites with only a 62% chance of winning, might be a closer game than expected) \n\n• EV better betting 100$ = 10-11$ for this play\n\n• I can’t wait for this game - Nebraska has been rolling this season & Michigan is such a fun team to watch (still mad Cadeau left my Tarheels) - Nebraska is 6-0 ATS in L6 while Michigan is actually trending in the other direction, not covering the spread in their L6 - In the month of January, Michigan has dropped off significantly when playing at home, partially because they are playing conference games now, and not non-conference - the biggest concern here is obviously the pace of Michigan, and the fact that Frager is questionable - regardless, Nebraska is a great team in terms of defense, and I think they will be able to slow down Michigans offense just enough to cover the +11.5 - they have depth, and they really do play team ball - they have enough firepower to cover a bigger spread without Frager - Michigan is fast, Nebraska is not - because of this, the game might not be as fast as Michigan would like, leading to a closer matchup - Michigan will go on runs in this game, they are one of the best teams in the country, and I expect them to have a few good runs in this game - on the flip side, Nebraska is battled tested, they have proven to be resilient - I think they will be able to overcome those dangerous runs of Michigan - Nebraska ranks top 10 in the country in turnovers PG, and I really like that stat against this Michigan team because the less time Michigan can have the ball, the better chance Nebraska has - just like any sport, if you don’t turn the ball over, you have a chance to win - Nebraska is a high effeicent, low turnover team, who is 20-0 - you have to give them their flowers - Now do I think Nebraska is better then Michigan, no, but as you all know, I look for value, just like my bet Duke +1.5 vs Louisville - to get a great team like Nebraska, 20-0 at double digit underdogs, while Michigan hasn’t been great this month against the spread, you have to play it - Rolling with Nebraska here for 0.50U because of the injury questionability \n\nPOTD History: https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn\n\nBOL!\n\n**POTD: NCAAMB: Nebraska +11.5 vs. Michigan -110 (0.50U TO WIN 0.40U)**    \n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\nhttp://buymeacoffee.com/claysmiith\n\nhttps://venmo.com/u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qnw7zw/pick_of_the_day_12726_tuesday/o1wx54r/"
    },
    {
      "created_utc": 1769468738.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Tuesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qnw7zw/pick_of_the_day_12726_tuesday/o1ww6fk/"
    }
  ]
}