{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/12/25 (Wednesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1ouqr3f/pick_of_the_day_111225_wednesday/",
  "target_date": "2025-11-12",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-12T01:55:15.226938+00:00",
  "comments": [
    {
      "created_utc": 1762908777.0,
      "author": "VAM89",
      "text": " Record: 22-13\n\nLast Five Predictions (Old - New): ✅❌ ✅❌✅\n\nNet Units: +17.17\n\nYesterday's Pick: Merthyr Town vs South Shields BTTS and o2.5 3u @ $1.80✅\n\nCovered before half time, which is always good. \n\nToday's Pick: Atletico MG to win vs Fortaleza 3u @ $1.61\n\nAgain, not a lot on today (midweek during international breaks can be grim... to the point where I'm even backing Bahamas to win) but I don't mind this...\n\nMid-table Atletico MG hosts second-last Fortaleza in Brazil. Both teams are actually in decent form considering their league positions. Atletico are 3-1-1 in their last five, winning their last two games. This puts them second in the form table in the previous five games. Fortaleza are 1-3-1 in their last five, drawing three in a row. \n\nAtletico are a far better side at home, with 30 points at home compared to 13 away; They've also got a +10 goal difference at home compared to an even one away. \n\nFortaleza are one of the worst teams in the league away from home this season, with 9 points in 15 away games and a -15 goal difference. Compare this form to 21 home points in 17 games.\n\nFortaleza will also be without Matheus Pereira, who got a red card late last match. He's been in and out of the team, but if he's not starting, is usually one of the first off the bench and will be missed. \n\nAll in all, while there's not a lot on - I think Atletico should win this at home and the $1.61 price works for me.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ouqr3f/pick_of_the_day_111225_wednesday/nodmj92/"
    },
    {
      "created_utc": 1762907847.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Wednesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ouqr3f/pick_of_the_day_111225_wednesday/nodjw84/"
    }
  ]
}