{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/3/26 (Saturday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/",
  "target_date": "2026-01-03",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-03T14:10:12.710979+00:00",
  "comments": [
    {
      "created_utc": 1767448544.0,
      "author": "Section1ne0h4our",
      "text": "**13-5, +7.22u**\n\n*Last 5:* ✅❌✅✅❌\n\n**NFL - Seattle @ San Francisco, 8 PM ET**\n\n*San Francisco +2.5 (-110) 1.1u*\n\nSaturday night in San Francisco, division title on the line, home field advantage on the docket as well, it gets no better than this, so I have to get involved.\n\n**The Niners beat the Seahawks 17-13 on the road in week 1**, although we don’t take much stock in that right now, the cycle of an NFL season changes a team, but there’s some history to at least dive into that week 1 benchmarked, as *Seattle only went on to lose 2 more games after that week 1 match up*. \n\nSince 1990, this will be just the second last week divisional matchup in which both teams have a 75%+ win percentage. Who played in the other you ask?\n\nIt was just last year, Week 18, Vikings vs Lions, also featuring Sam Darnold, won by the Lions with ease, but the result isn’t the focus as much as the performance. **In that game Darnold went 18-41 with a season low 166 yards**. *Might he want some personal redemption?* Sure, but I trust the other guy more.\n\n(The other guy) Brock Purdy has already played in the biggest games: **At home he is 11-3 in December or later, & 5-0 in January or later. Purdy & the Niners are also 7-1 in their last 8 against Seattle.**\n\nSan Francisco also have their weapons hitting stride: **Jauan Jennings has a TD in 5 straight games, Christian McCaffrey also now has a TD in 6 straight games, & it appears George Kittle is “absolutely” reported to play despite his own injury.**\n\nAdd all this to the fact that ***if San Francisco win this game, their home field advantage carries all the way to Super Bowl LX which will be hosted by the Bay Area.***\n\nI have to take the team with experience tonight.\n\nLast play review:\n\nCristiano Ronaldo Goal (-125) 1u ❌\n\n(Struck by Penaldo, what a game - but quite possibly his worst of the season - invisible in large portions, and basically played out by the opposition’s structure, should have listened to my own concerns - but I trusted the old fella. Now, watch him score 3 next week)\n\nBOL if you’re tailing, and if not BOL in general.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxfsuwv/"
    },
    {
      "created_utc": 1767447926.0,
      "author": "Willing-Bee9434",
      "text": "**POTD Record: 0-0 (+0 Units)**\n\n**Event:** EPL - Bournemouth v Arsenal @ 17:30 UTC\n\n**Pick:** Asian Handicap: Arsenal -1.0 @ $1.79 (2 units)\n\n**Reasoning:**\n\nArsenal are coming into this game top of the table, while Bournemouth sit down at 15th. Bournemouth have gone 5 draws and 5 losses in their last 10 PL games, while Arsenal are 7 wins, 2 draws and 1 loss in their last 10 PL games. Arsenal need to start increasing their goal difference to get away from Man City, with Man City playing a nil all draw, this is a great chance to that against a team that allows 1.84 goals per game. Arsenal should just be too strong in this one.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxfr442/"
    },
    {
      "created_utc": 1767446541.0,
      "author": "Ralphjinasseater",
      "text": "Record : 26-19-2\n\nNet units:(+2.09 units)\n\nLast pick: Chet holmogren O 1.5 block(-138)FD ✅\n\nPick of the day : Dylan Harper Over 13.5 Points (-110) Hard Rock Bet\n\n\nReason • :\nAgain overthinking this because I was going with castle O 6.5 assists but the books (Vegas)changed it 7.5 which is his ceiling I got a pivot to another prop second was Donovan Clingan since Wemby gone he should take advantage and go over his points + rebounds (20.5)  \n\nMassive Usage Bump: With Victor Wembanyama (OUT) and Devin Vassell (OUT), the Spurs are missing their two top scorers, vacating nearly 40 points and 30+ shots per game. Harper is the primary beneficiary of this offensive vacuum.\n\n• The \"Hot Hand\" Factor: Harper is coming off a season-high 22-point performance.\n• Favorable Matchup: Portland ranks 25th in defense against opposing backcourts. They lack the perimeter speed to keep up with Harper in transition, where he does his best work.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxfnbi6/"
    },
    {
      "created_utc": 1767441318.0,
      "author": "Churchyyy",
      "text": "**Record:** 5-2\n\n**Net Units**: +2.79\n\n**ROI:** 39.9%\n\n**Last 5 (Most recent on the right):** ✅✅❌✅✅\n\n**Last Pick:** Lens win or draw ✅\n\n**Last Pick Reaction:** Early red card for the hosts helped massively in this one ultimately allowing our pick to cruise to victory and they won the game as well if you did end up taking that. FT Toulouse 0-3 Lens\n\n**Event:** Ligue 1 (Soccer) - Lille vs Rennes (20:05 GMT)\n\n**Today's Pick:** BTTS @ 1.70 (1 unit)\n\n**Write Up:** After yesterday's success we are staying in the French league for a clash between **4th place Lille** and **6th place Rennes**. Both teams are in great form going into today's game and due to injuries, suspensions and players lost to AFCON on both sides, I'm backing both teams to find the net tonight.\n\nThe hosts tonight Lille, sit in a nice **4th place** in Ligue 1, chasing European football as they are level on points with 3rd place Marseille. They ended 2025 with **4 consecutive league victories** and have **won 5 of their last 6** only losing 1 to **7th place Strasbourg**. At home they have been **4th best** this season, recording **6 wins** from their **8 games** whilst **scoring 16 goals** and **conceding** an impressive **6**. On average Lille score **2.06 goals per game** this season which lowers ever so slightly to 2.00 when they play at home. They have been defensively sound conceding **1.25 goals per game** which drops to an **impressive 0.75 when playing at their home ground**. The important part of today's pick comes from the team news of both sides. Lille come into this game missing centre backs Mandi and Mbemba who are away on international duty as well as defensive midfielder Mukau who is also away at AFCON. On top of this, left back Perraud and centre back Ngoy both received red cards in their previous game so will also be missing from the lineup today. As a result, I expect their impressive defensive numbers to take somewhat of a hit as their manager is forced to rotate, enough at least to allow the visitors to find the back of the net once.\n\nAs for today's visitors they sit in a similarly promising position in **7th place**, 5 points away from their opponents today and also chasing the European finish. Rennes have also been in great form coming into the new year, having **won 5 of their last 6 league outings** only losing to **2nd place PSG**. Across these games they have **scored 13 goals** whilst **conceding 8**, so scoring themselves hasn't been hard to come by of late. On average this season they are scoring **1.69 goals per game** which does drop to **1.13** when playing away from home but as mentioned previously, I'm hoping this number gets a bit of a boost against a makeshift Lille defense today. Defensively speaking the visitors **concede 1.5 goals** per game which rises to **2 per game** when playing away from home. In terms of their away performances this season they are **6th best**, but have only picked up **2 wins from their 8 away games**, drawing 4 of them. Once again we return to the team sheet for some important context in today's game. Rennes come into this game without centre back Boudlal and left back Nagida who are away at AFCON, both of which have been used as important rotation options this season. Finally they lose veteran midfielder Seko Fofana also to AFCON.\n\nFor today's pick we are essentially banking on the fact Lille **will** score and are betting on the fact Rennes can also find the net due to Lille essentially having an entirely makeshift defense which will almost certainly include some youngsters who will be under pressure to perform. On top of this, **Rennes have scored in 9 of their last 10 league games** only failing to score **away at PSG** which is hardly an easy game.\n\nBoth teams want to finish in the European spots come the end of the season, and both teams are in impressive form which is why I see this one finishing around the 2-2 mark or maybe a 2-1 win to Lille.\n\nLet me know your thoughts and suggestions below and comment if you are tailing. BOL for all of your bets today and enjoy the vast amount of games that are on!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxfba8g/"
    },
    {
      "created_utc": 1767441270.0,
      "author": "criddler",
      "text": "Record: 8-4 \n\nPOTD: Jauan Jennings O5 Receptions (+240) \n\nNFL // 49ers vs. Seattle, 8pm EST\n\nJennings needs 7 catches for a **666k bonus**; they are playing for the 1 seed and with Kittle being questionable, I expect him to be primarily utilized blocking vs running routes which should give some prime options off the flats and slants for Jennings. \n\nO4+ is sitting at -160 if you wanna play it safe as Jennings to be fair hasn't been utilized at all the last couple games, but with the bonus on the line I can see him getting a few quick catches to start the game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxfb6ph/"
    },
    {
      "created_utc": 1767438729.0,
      "author": "Longjumping_Dance801",
      "text": "POTD Record: 0-1\n\nNet units: -5U\n\nPrevious pick: Shuai Zhang + Anastasia Zakharova ML 5U @1.88 (-114) - Tennis ❌\n\nPOTD: Aston Villa ML 5u @1.9 (-110) - Soccer\n\nNo value today in the tennis, yesterday the only pick with >10% ev was at odds 3.25 (+225) so couldn’t post, it ended as a winner so maybe from now I’ll tip those outsiders to just win a set. \n\nToday’s bet have Villa at home coming up again a Forrest side in bad form. The sports books use algorithms to make their odds which explains why Villa are being offered at such a great price. They have consistently been out performing their Xg all the year, which I don’t believe is due to luck at all. Taking on bet365 in hopes of early payout. Watkins is in great form so can always add props with him if you after better returns. \n\nFeel free to ask any questions below, these are simply the best value plays of today. BOL if tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxf61v0/"
    },
    {
      "created_utc": 1767434022.0,
      "author": "yungguardiola",
      "text": "POTD Record: 0-0\n\nEvent: Scottish Premiership - Celtic vs Rangers - 12.30 GMT+0\n\nPick: Rangers DNB @ 2.75 - 1u\n\nWrite Up: Despite getting their first couple wins under Nancy, Celtic still look far from convincing. They are far too open and weak on set pieces, giving their opponents far too many chances to score. That isn't to mention the fact that the atmosphere around the club is poor with fans unhappy at the board, managerial choice and underperforming players. It's coming to a bit of a boiling point. While Rangers are on the upswing since sacking Russell Martin. There is much more optimism that they're on the right path forward than at Celtic and an early goal for Rangers (Celtic have conceded 5 goals during the opening 15 in Nancy's 7 in charge) could well and truly set the tone for a bad night for The Bhoys and possibly spend the end for Nancy's time in charge. This game is being priced as if this is a typical Celtic vs Rangers. It's not and bettors should look to take advantage.\n\nAdditional Thoughts: I wasn't going to start doing this yet but I've decided to say fuck it, why wait? I've gotten my last few bets correct and I'm feeling in form. And this bet I feel could be particularly good value I'm afraid to say as someone who does not have any appreciation for Rangers Football Club.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxewqy5/"
    },
    {
      "created_utc": 1767433284.0,
      "author": "Crypto_Kreator",
      "text": "Day 1 of Tailing one of the Best of the Day in this sub reddit. Not promising I’ll do one everyday, just jumping in and out as I see opportunities. I’m also prolifically shit at betting so this may encourage me to improve, while also assisting for others so they can lay me.\n\nAlso proving I am able to be profitable while leaching off the success of others.\n\nTail 1  - Villa @ 1.93 vs Forest (6 Units)\n\nPlease look to other sub redditors for reasoning… Self explanatory, Record home vs away team, Odds are down as Villa lost to Arsenal\n\nRecord 0-0 - Profit $0.00",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxevaeh/"
    },
    {
      "created_utc": 1767432857.0,
      "author": "Wekken",
      "text": "**2026 Record: 0-1**\n\n**Football Record: 0-1**\n\n**Net Units: -1** \n\n**Last 5** ❌️\n\n**Sport**: Football\n\n**Matches:** Wolves - West Ham (16:00 CET) & Bournemouth Arsenal (18:30 CET)\n\n**Pick:** Wolves o0.5 goals & Arsenal ML\n\n**Unit stake:** 2U\n\n**Odds:** 1.92\n\n**To win:**  1.84U\n\n**Write Up:**\n\nWest Ham their last game without a goal against them dates back to august 31st. Which is also the only game this season in which they've kept a clean sheet\n\nWolves are scoring recently despite their awful record. Even vs top 6 teams in the league like Arsenal, Liverpool and Man Utd\n\nThey even beat West Ham 3-2 earlier this season at home in the EFL cup so a surprise win for Wolves here wouldn't even be a huge shock to me \n\nArsenal are amazing right now and are beyond in-form. With an incredible, balanced midfield, structured backline and depth in the squad they are currently the team to beat\n\nBournemouth their last win dates back to october 26th which does not give them the confidence to expect a win today\n\nBOL everyone!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxeugg3/"
    },
    {
      "created_utc": 1767428415.0,
      "author": "pppmew",
      "text": "POTD Record: 0-0-0 (+0.00U)\n\nLast Pick: First pick today\n\nEvent: Serie A, Como - Udinese  \n\nPOTD: Oumar Solet o0.5 shots, 5U @1.90\n\nWrite up: The only reason this odd is this high is because he's a defender. He's a pretty big guy (192cm), so he rushes up the field whenever there's a corner or freekick, to go for a header. But he also tries a long shot pretty frequently. We only need one shot, it doesn't even have to hit the target. \nIn his last 4 games he made 1-4-1-2 shots, and 2 games ago he even scored. This will raise his self esteem to try more shots. Should be an easy win.\n\nEdit: forgot to add the odds",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxem1ei/"
    },
    {
      "created_utc": 1767427011.0,
      "author": "redditusernameuneak",
      "text": "Record: 6-4\n\nUnits: +9.64\n\nPrevious Pick: (WNBL) Perth Lynx (W) -19.5 ✅ game ended Lynx 106 - Venom 78\n\nEvent: (WNBL) Southside Flyers (W) vs Geelong Venom (W)\n\nPOTD: Southside Flyers (W) -6.5 (1.87 on Bet365, 5 units for 4.35 units) ✅ game ended Southside 94 - Geelong 52\n\nWrite-Up: Flyers (6-8) take on the Venom (3-12) at home today, and come into this in good form. The last game they played they scored 113 points, the season highest for the WNBL. Granted, that was against the Sydney Uni Flames (4-12), but it shows they’re clicking as a team. Venom on the other hand have lost 8 games in a row, with their last victory being on 14 Nov against our Southside (game ended Venom 66 - Flyers 54). \n\nThese two teams have met once between 14 Nov and today, on 16 Dec with the game ending Flyers 86 - Venom 58. This displays the rising form of the Flyers, and I think they win tonight to get 4th rank of the WNBL against the UC Capitals (who will be playing against Perth Lynx tomorrow afternoon, who are just completely dominating with the addition of Han Xu.)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxejb92/"
    },
    {
      "created_utc": 1767426494.0,
      "author": "Money-Swimming2179",
      "text": "Record 5-0-2\nForm: ✅✅✅✅❌❌✅<-\n\nLast POTD: **Toulouse v Lens: Lens Draw No Bet @1.95** ✅\n\nTodays POTD: **Aston Villa v Forest: Villa DC & o8.5 corners @1.85**\n\nA fast paced Premier League matchup awaits as Aston Villa welcome Nottingham Forest in a game that profiles extremely well for pressure football and sustained attacking phases.\n\nVilla’s recent form has been excellent, especially at home, where they control territory, push their fullbacks high and spend long spells in the attacking third. That style consistently drives corner numbers. Even in matches where Villa do not score early, they continue to apply pressure through wide overloads, cutbacks and recycled possession, forcing defenders into blocks and clearances rather than clean exits. This repeated pressure is exactly the type of game state that produces steady corners across both halves.\n\nForest also play a key role in supporting the corner line. While they are less efficient going forward, they actually generate a healthy volume of shots and attacking moves, particularly in transition. Those attacks often end in deflections, saves or blocked efforts rather than clean finishes, which adds to their own corner output. Defensively, Forest tend to concede territory and invite pressure, especially against top half sides, leading to sustained waves of opposition attacks and corner concessions.\n\nWith Villa expected to dominate possession and Forest still capable of contributing corners of their own, the over 8.5 line is well supported by both teams tendencies. The double chance on Villa adds protection against match variance while aligning with their strong form and control at home, making this a well balanced bet builder built on game flow rather than a single outcome.\n\nBest of luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxeiaw5/"
    },
    {
      "created_utc": 1767426306.0,
      "author": "RlFFRAFF",
      "text": "Record: 3-1 (+8.21 Units)\n\nHistory: ❇️💢❇️❇️\n\nPrevious Pick: Washington Wizards -3.5 (-108) 5 Units\n\nRecap: Bang! As predicted, Nets shoot 20% from three and the Wizards cruise to a 20pt win. No sweat.\n\nToday’s Pick: Ivica Zubac Under 9.5 Rebounds (-105) 1 Unit\n\n1/3/2026 7:30pm PST / NBA / Boston Celtics @ Los Angeles Clippers\n\nNarrative: Dec. 20, 15 days ago, Zubac was diagnosed with a Grade 2 ankle sprain and expected to be out 4-6 weeks. In today’s NBA, rarely do you see early returns from injury which makes this odd… Especially for a 7 footer pushing 250lb. I’m glad he’s healthy, as I am a big fan of his, and he is a rebounding machine, but I’m banking on the fact here that he’s not cracking the 20min mark in this game and for that reason alone will stay under. Clippers are on a 7 game win streak with Zubac out, after a rough start to the season, and shouldn’t be motivated to rush him back. Along with that, BOS is not a big team, their starting center averages 24min a night, also influencing less minutes needed of Zubac as they opt for a smaller line up. Zubac on the season is averaging 32min played and 11.1reb, which equates to 0.346 rebounds per minute. I don’t see Zubac surpassing 25min played here, which 25min would yield 8.67reb, which keeps us under the 9.5. I expect sub 20min played here for Zubac which is why I like this wager. Tempted to hammer this, but keeping it at one unit in case for whatever reason he plays his 32min.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxehxt2/"
    },
    {
      "created_utc": 1767421257.0,
      "author": "Cautious_Assist836",
      "text": "Record: 4-2 (+10.10U)\n\nLast Pick: Bryce Cotton (ADE) u26.5p, $1.87 ✅ (Only 16pts and sweat free!)\n\nEvent: Australia Basketball - Illawarra Hawks vs Cairns Taipans, 1.30 AM EST (Starting in 20min, had to confirm lineups sorry!)\n\nPOTD: William Hickey u6.5a, $1.75, to win 5.00U ✅ (1 at HT and finishes with 6!)\n\n(Wanted to get this out earlier but just needed to double check the lineup and NBL socials wouldn’t post them until 15min prior to tip)\n\nHas been a very good assister as of late but now finds himself coming from the bench. First game all season starting from the bench last game and only managed 22 min and 3 assists. Coming from the bench again tonight, due to Illawarra opting for the double big lineup. Is also under in L5/6 and was averaging 30+ min during that period. All in all, a minutes play and lack of volume to have 7 assists.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxe7xws/"
    },
    {
      "created_utc": 1767419900.0,
      "author": "Dmyers9099",
      "text": "Record: 3-3 (-0.43)\n\nEvent: 🏈 Panthers v Buccaneers 4:30pm EST\n\nPOTD: Panthers +3 -120\n\nPlayoff hopes on the line for both teams in a game that should be tightly contested. The Panthers are back and forth with wins and losses, and their last win was against the Bucs on 12/21 (23-20). \n\nMeanwhile, the Bucs have lost 4 straight and only won one game since October (Cardinals on 11/30). Baker Mayfield is somewhat banged up dealing with shoulder and knee injuries. He’s also thrown at least one interception in 6 of his last 7 games. \n\nIn a tight divisional matchup, I’ll lean toward Carolina keeping this close.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxe52yu/"
    },
    {
      "created_utc": 1767419737.0,
      "author": "kab1218",
      "text": "PoTD 9-14-1\n\nwhew just on a downwards spiral\n\nNet: -17.5\n\nPrevious: Arizona ( ALT -2) vs SMU Holiday Bowl 8PM Eastern\n\nArizona could’ve easily covered if they did ANYTHING AT ALL in the first half. Moving on\n\nToday: Aston Villa ML vs Nottingham Forest 5U @ -114\n\nAston Villa are 11-1 in their last 12. I see them looking to redeem themselves after being shown up by Arsenal and continuing their climb to the top. Nottingham Forest haven’t played well in their last 5 Premier League games going 1-4. Away they are 2-3 in their last 5 away premier league games. Aston Villa ML\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxe4q73/"
    },
    {
      "created_utc": 1767417669.0,
      "author": "mouse_that_runs",
      "text": "POTD RECORD: 12-4-1\n\n✅️✅️✅️✅️✅️➖️✅️✖️✅️✅️✅️✅️✖️✖️✖️✅️✅️\n\nLAST POTD: \n\nRugby\n\nUlster vs. Munster (Ulster -3.5) @1.52 ✅️\n\nTODAY'S POTD:\n\nRugby\n\nBenetton vs. Edinburgh (Benetton -3.5) @1.50\n\n17:30 GMT\n\nBenetton sits 8th in the URC table with four consecutive wins in all competitions, whilst Edinburgh sits 13th in the URC table with three consecutive losses in all competitions. The last six results of this fixture have gone the way of Benetton when facing Edinburgh at home, and with the latter losing their last six away fixtures, the odds will be in favour of Benetton to win by four points or more.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxe052o/"
    },
    {
      "created_utc": 1767417563.0,
      "author": "Seventh__Place",
      "text": "POTD RECORD: 1-0\n\nNet units: +0.8\n\nForm: ✅\n\nLast POTD: Giannis Antetokounmpo O34.5 PA -114 1U\n\nToday’s POTD: **UNC Asheville +5.5** **-118 (FanDuel) 1U**\n\nEvent: CBB | UNC Asheville @ Charleston Southern (2 pm EST) | 🏀\n\n*Recap: What a sweaty POTD debut! Giannis clears the line on a walk-off lob dunk with four seconds to go. Milwaukee trailed by as many as 16, but the Greek Freak made the most of his 29 minutes -- oh, and how about 8-for-8 from the charity stripe!*\n\nIf you don't like low mid-major college basketball, you don't like degenerate sports betting! UNC Asheville has won nine straight against Charleston Southern. During that stretch, UNCA's winning margin is 12.2 points per game. In fact, the last Chuck South win was a 1-point upset in the first round of the Big South Conference tournament in 2022. So why am I taking a team that hasn't won on the road this season (0-5) against a team that hasn't lost at home (3-0)? Easy. Strength of schedule. Throw out the records. UNCA's Pomeroy strength of schedule is 151. CSU's is 338. The Bulldogs (6-9) also have Big South Preseason Player of the Year in fifth-year senior Toyaz Solomon, and were picked to finish second in the league. When it comes to these one-bid leagues, the conference slate is everything. That's why I raised an eyebrow when I saw CSU (10-6) needed a 55-point second half to erase a 12-point halftime deficit against a 2-14 Gardner-Webb squad that was picked to finish below them. For context, Pomeroy has just six teams ranked lower than Gardner-Webb in all of Division 1. *That's* Charleston Southern's lead-in to UNCA?\n\nFun fact: CSU's Buccaneer Fieldhouse is one of the smallest arenas in Division I with an 881 capacity, but students don't return to classes until January 12. I'm not saying it won't still feel like playing in a raucous bandbox, and it *is* a unique atmosphere. But the Bulldogs are battle-tested, and they have the better coach. Eighth-year coach Mike Morrell comes from the Shaka Smart tree, and CSU's Saah Nimley is navigating his second year at the helm after going 10-22 last season.\n\nThe danger for UNCA will be the deep ball. CSU ranks second in the NCAA with 13.2 made threes per game. Their style is run and gun. But if the Bulldogs - and Solomon - can avoid foul trouble, dictate the pace, and limit 3s, I'll gladly take 5.5 points in a matchup that has been entirely one-sided in recent years.\n\nGood luck and godspeed!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxdzw4e/"
    },
    {
      "created_utc": 1767414619.0,
      "author": "lordestros",
      "text": "Last 5 POTD : ✅️✅️❌️❌️❌️\n\n**Previous pick** : Adam Fox over 0.5 points (-130) ❌️ (guess he wasn't pissed enough, finished with a +2 but no points)\n\n**POTD Record** : 10-7\n\n**Today's pick** : Montreal Canadiens vs St. Louis Blues at 4:00pm EST (NHL/Hockey)\n\nMontreal Canadiens ML (-125)\n\nCanadiens are beasts on the road this season with a 12-3-5 record. Blues meanwhile will play a 2nd game in less than 24 hours and Binnington will start in net where he's been atrocious lately with 4 losses in a row and allowing 18 goals in those last 4 games. Jacob Fowler will probably start for the Canadiens and will look to bounce back after his close loss against Tampa. Last time he lost a game, he answered right back with a shutout in the next one so I expect him to be solid in net for this game.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxdsrxh/"
    },
    {
      "created_utc": 1767411478.0,
      "author": "Pefkov",
      "text": "**Record**: 20-14\n\n**Net Units**: +4.01\n\n**Last Pick**: Kenneth Gainwell o29.5 Receiving Yards  (-108) 2u to win 1.85u ❌️\n\nEnded 2025 with 3 straight losses let's change it up in 26\n\n**Todays Event** 🏈 NFL Saturday Football Panthers @ Buccaneers 3:30 PM CST 🏈 \n\n**Todays Pick** Bucky Irving u81.5 Rush + Receiving yards (-115 on DK) 1u to win 0.87u\n\n\n**Writeup:**\nPanthers go to Tampa for the deciding spot on who gets in (well Falcons could screw over the Bucs). Tampa has been looking disastrous lately and panthers, well they've been the panthers. The Bucs are favored and I don't understand why, they've lost the last 4, with all the losses being to mid to bad tiered teams. I understand its a divisional match up for basically a playoff spot but I don't think Irving will have his time to shine here, as I feel panthers will easily cover the spread, and likely take the lead forcing more passing\n\nIrving has been doing good since he came back in late november from injury but not putting up amazing numbers akin to other rbs. He is only averaging 2 receptions with 14.3 receiving yards in his last 5 games (since he came back from injury), and he's been averaging 15.2 carries for 53.2 yards.  Bucky didnt get a single target in the last game against them. While only being a single yards off twice (against Cardinals and New Orleans), he hasn't hit this once in his last 5 games. TB also has Rachaad white who gets limited carries yet seems to get more consistent targets compared to Irving\n\nAnother thing to think about Panthers give up a low number of yardage to RB, being the 9th best in the league in that area\n\nBoL everyone tailing, hope those incentives for other players don't screw anyone over this week!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxdkkcx/"
    },
    {
      "created_utc": 1767410966.0,
      "author": "Chance-Shake-240",
      "text": "Record  1-0\n\nLast pick - Sporting Lisbon under 2 goals ✅\n\nEvent - Feirense vs unia de leiria (Portugal - Liga pro ) \n\nBet - Corners under 11 ( 1.52 ) \n\nWrite up - Feirense and de leiria plays very defensive, and uses counter attacking a lot as I seen them play a lot . Even through Feirense is 17 in table they conceded less goals . They need to draw or win this game inorder to escape relegation. So this might be low scoring and low corners game .",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxdj6v4/"
    },
    {
      "created_utc": 1767410285.0,
      "author": "FitSignificance2100",
      "text": "Where’s joe?? Stopped after Christmas 5u special",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxdhc3r/"
    },
    {
      "created_utc": 1767407193.0,
      "author": "Lyx97",
      "text": "Record: 25-11-4\n\nNet Units: +7.77\n\n*Prev Pick : Brisbane Heat vs Melbourne Stars : Total Match runs over 323.5 @ 1.7 (1u) -> Win*\n\nFootball | EPL | Aston Villa vs Nottingham Forest | in \\~10hrs\n\nFootball | EPL | Wolves vs West Ham | in \\~12.5hrs\n\nParlay : Neco Williams o0.5 Shots (1.71) + Mateus Fernandes o0.5 Shots (1.57) @ 2.68 (1u)\n\nWriteup: Going to try luck at football again. Hope it works out today :)\n\nFor the 1st Prop: Neco Williams has had a shot in each of his last five Premier League appearances, taking his overall tally to 20 for the season. Williams played as a wingback in the most recent head-to-head meeting between these sides & had three shots in that game, with Forest having 19 overall. Even if Williams lines up as a conventional fullback here, his shot numbers from right back and left back have been strong, as displayed by his average of 1.29 shots per 90 in the Premier League. \n\nFor the 2nd Prop: Mateus Fernandes has had 11 shots across his 16 Premier League starts (0.74 per 90) with this tally returning two goals. Fernandes is the most likely to get forward out of West Ham’s midfield trio, and should have more chances than usual to get a shot away here against a Wolves side that have conceded 23 (2.55 per game). \n\nGoing a little greedy here & taking the parlay for these 2 bets :)\n\nHope we continue our wins & BoL\n\nhttps://preview.redd.it/ryhtp4pvo1bg1.jpeg?width=1084&format=pjpg&auto=webp&s=a069715ec2193bb615f31ab107ff6276fae9ad12\n\n*Attaching a pic from my bookie as proof of the odds (pls note that 1+ here means over 0.5)*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxd8n64/"
    },
    {
      "created_utc": 1767405625.0,
      "author": "Jazzlike-Arugula-958",
      "text": "Record: 2W2L Net Units: +0.26u Previous Bet: Al Nassr to win vs Al Ahli ❌\n\nGame: Western Sydney Women vs Canberra Women\n\nPick: Canberra Women to win (1u to win 1.62u on Pinnacle) \n\nWriteup: Canberra United is currently 1st in the league (17 pts) while Western Sydney is 11th (4 points). Canberra is unbeaten in their last five (W4, D1) whereas WSW has lost four of their last five. WSW has conceded 18 goals in 8 games, meanwhile, Canberra, led by Michelle Heyman, is playing with elite structure and clinical efficiency.\n\nHence, in my humble opinion, Canberra United to win at 1.62 odds is a good value play",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxd460o/"
    },
    {
      "created_utc": 1767404238.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 15-14 (+1.02u)\nDecember POTD Record 15-12 (+3.02u)\n\nFriday’s Pick - Minnesota Wild ML -122 (1.22u to win 1u)\n\nSaturday’s Pick - Sam Darnold o240.5 passing yards -114 (1.14u to win 1u)\n\nReally exciting game tomorrow night with the 1 seed on the line. The 49ers offense has really been clicking recently and it’s going to make it a challenge even for the difficult Seahawks defense. Since the Seahawks bye in week 8, Darnold has been over this line in 6 of 9 games.\n\nAs good as the offense of the 49ers has been, their defense, specifically the pass rush, has been equally as bad. Caleb hit 330 yards and Rivers hit 277 yards in their last 2 games. Even Cam Ward, who only threw for 170, was able to score 24 points against this team.\n\n\nGood Luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxd05vp/"
    },
    {
      "created_utc": 1767403589.0,
      "author": "nigerianPriince0",
      "text": "**Record: 100 W  - 86L**\n\n**✅ ✅✖️✅✅✖️✖️**\n\n**-----------------**\n\n**Today's Pick: Arsenal Over 4.5 Shots on target @ 1.65**\n\n**Game: Bournemouth VS Arsenal**\n\n**Time: 12:30 PM EST**\n\n**---**\n\n**Gonna keep this one shorter**\n\n**Bournemouth haven't won a single game in 10**.\n\nArsenal are coming into this today as the only big six side to play, and after City dropped points. Considering they beat third-placed Aston Villa in a dominant 4-1 fashion on the weekend we ride the good form into this game. I've held off a bit on overloading Arsenal selections but I see the front line clicking a lot better with Oodegard slowly sliding back into form again. Zubimendi allows Odegard to be more free-flowing attacking-wise, and if it's not working a slight reverse.\n\nUsually Arsenal are bit more pragmatic away from home but that was down to the injuries to Saliba and Gabriel, when you want to dominate possession and put pressure on an opponent away from home those 2 are equally as important as any forward as they collect and redistribute to continue play.\n\nArsenal have not hit this line for 3 games straight and now with an away fixture against one of the worst teams in the league in form - I see them going for another goal drive to seperate themselves from City even more\n\n**Expecting 6 SOT tomorrow, BOL.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxcybew/"
    },
    {
      "created_utc": 1767402430.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 6-21-3 *I stay winless in the new year. In the usual fashion, I managed to identify another freak match that saw a very early red card for the team I backed, and that pretty much sealed their fate. They also nearly conceded from the halfway line. We move though, and today we head over to an equally as exciting matchup that's bound to throw some fun our way (but most importantly, a win). I've been eyeing this match since before the new year and I truly believe I'm ending my winless streak today*\n\n**Last Five:** ❌❌❌❌❌\n\n**Event:** LaLiga, RCD Espanyol v FC Barcelona, 3:00 pm EST\n\n**POTD:** RCD Espanyol +1.0, +1.5 Asian Handicap -115, 2 units\n\n**Write Up:** It's safe to say Espanyol have been one of the surprise packages in the Spanish league, perhaps the whole of Europe. After finishing 14th last year in their regular midtable languishing season, they've made significant strides, collecting 10 wins, three draws and just four defeats from 17 matches. Their recent form has been outstanding, with **five consecutive league victories** over Sevilla, Celta Vigo, Rayo Vallecano, Getafe and Athletic Bilbao (all very respectable sides). Perhaps even more impressive are their **home performances** as Espanyol have taken **19 points from the possible 27** at their ground.\n\nNow take into consideration this is a Catalan derby and Espanyol REALLY don't like Barcelona. They're always ready to turn up and despite the fact their *recent H2H has been disappointing,* they **don't usually get blown out by the paper favourites**, notching up a respectable amount of draws. While it’s easy to see Barcelona as the favourite based on table position and firepower, there’s value in backing Espanyol to avoid a heavier defeat. First off, Espanyol enter this match with confidence and momentum. As I said, they’ve won **five LaLiga matches in a row**, a run that highlights how well Manolo Gonzalez’s side are playing, especially considering none of the teams they beat in that stretch are pushovers. At home, Espanyol’s record looks even stronger. They’ve taken points in **five of their last six matches at RCDE Stadium** and kept multiple clean sheets there this season. That defensive resilience matters when taking an Asian Handicap, where even a narrow defeat still yields a winning bet and I think that's a smart play to take today. **Espanyol are good at grinding out results** when needed, so that also gives me confidence heading into this.\n\nMeanwhile, Barcelona’s away form isn’t as bulletproof as the headlines suggest. Though they’re top of LaLiga and score plenty of goals, their away matches often involve **multiple goals conceded,** with **Barcelona averaging nearly 2 goals conceded per away game** this season thanks to their **ridiculously high, dysfunctional defensive line.** This goal conceded number is far higher than the elite visitors normally allow and it's why I truly believe Espanyol can stay in the game longer than the odds imply.\n\nFinally, the rivalry cannot be underestimated. Espanyol historically rise to big occasions in front of their diehard fans, and with the +1.0, +1.5 line, I'm essentially backing them to stay competitive even if Barcelona edge it. Besides (and that's a small consideration that hasn't really influenced my decision behind this bet by a great deal, but still made me even more sure of it), this is **the first LaLiga match after the holidays** and players like **Lamine Yamal** are for sure going to be feeling the effects of all the partying. On the other side, the Espanyol players probably felt like they could have an edge if they just stayed disciplined during the holidays - I'm sure the management would've made that known. The underdog is always going to try to take such things into consideration to level the playing field in one way, because let's face it, technique wise, they're not touching the Blaugrana.\n\nI also like the BTTS Yes angle, as well as an Under 2.5 goals line *(feeling like Espanyol are going to keep Barcelona relatively quiet),* but we're just going to focus on the match result. All in all, fading Barcelona when I really need a sure win perhaps sounds counterintuitive, but if I win, I want to do it in style (and I do believe in the pick I've made, that goes without saying). We've waited far too long for my win, just to achieve it by betting on some heavyweights to score more than 0.5 goals and have more than 4 corners against a relegation threatened side or something. BOL whether you tail or fade, let's enjoy this heated derby, which is for sure going to be even crazier now that I've placed a bet on it ☘️🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxcuyzk/"
    },
    {
      "created_utc": 1767402407.0,
      "author": "cedarrapidsiaus",
      "text": "POTD record: 50-35\n\n\\+16.63 units\n\nLast Pick: NFL 🏈 Denver Broncos vs Kansas City Chiefs 8:15 P.M. E.T. U.S.A. OVER 34.5 (-150) BetOnline ❌\n\nToday's Pick: NFL 🏈Carolina Panthers vs Tampa Bay Buccaneers vs  4:30 P.M. E.T. U.S.A. OVER 43.5 (-112) Draftkings\n\n5Units\n\nFully healthy offenses and the Bucs are effing due! Injuries on defense on both sides of the ball! Gorgeous weather projected tomorrow. LETS GO!!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxcuwlk/"
    },
    {
      "created_utc": 1767402085.0,
      "author": "dreamchasing1",
      "text": "Record: 249-232 Net Units: -24.18 58-59 on 1.5u plays, 41-41 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Israel Liga Alef North] Ironi Baka El Garbiya vs Hapoel Tirat Karmel\nLast pick: total goals over 2.5 @ 1.95 win\n\n\nEvent: Soccer/Football, [Spain La Liga] Elche vs Villarreal\n\n\nPick: Elche total shots over 11.5 @ 1.90 - 2 Units\n\n\nElche are a great team for goal attempts. At home they average very close to 14 per game, covering in 7/9 games, a very notable hit is when they had 15 vs Real Madrid. Now they get an amazing matchup vs Villarreal who allow the 3rd most shots when playing away - 15.30 per game. Villarreal allowed 12+ in 5/7 away games this season. Elche have managed to hit this line vs teams that allow much less such as Rayo Vallecano (18), Athletic Bilbao (15) and ofc Real Madrid.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxctylf/"
    },
    {
      "created_utc": 1767402042.0,
      "author": "OneStopProp",
      "text": "**POTD Record: 14-7 (+20.28 Units)**\n\n**E-Sports 9-1 | Darts 3-3 | NBA 2-1 | NFL 0-2**\n\n**Previous Pick:** Gian Van Veen ML vs. Gary Anderson ✅\n\n**Event:** Pro Dart World Championship @  3:15 PM EST\n\n**Pick:** Luke Littler -1.5 sets vs. Gian Van Veen @ 1.61 (5 units)\n\n**Reasoning:**\n\n* Odds found at Bodog / Bovada\n* Although Van Veen has played great, Littler is literally the best Dart player in the world and it’s not even close.\n* He is the most consistent player, with the higher 180 rate and higher checkout rate. I expect nerves to get to Van Veen here due to his inexperience\n* Littler has only dropped 3 sets THIS ENTIRE TOURNAMENT\n\n**BOL to anyone who tails.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxctu4k/"
    },
    {
      "created_utc": 1767400727.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 77 - 78 Profit: -4.63 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅\n\nEspanyol vs Barcelona, Over 3.5 goals @ 2.02\n\n\nThis match has chaos written all over it, over 3.5 goals is the smart call , promises goals, attacking football from both sides, expect open play, weak defenses, and over 3.5 goals easily.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxcpvux/"
    },
    {
      "created_utc": 1767400716.0,
      "author": "Addictedtopc",
      "text": "**Record: 0-0 (**\\+0.00u**)**\n\n**Event: NFL - Panthers @ Buccaneers 4:30 EST**\n\n**POTD: SGP 2 Leg - Emeka Egbuka 15+ Rec Yards, Rachaad White 5+ Rush Yards (-130 at FanDuel)** \n\n**Write Up:** \n\n**Emeka Egbuka:** Emeka Egbuka has had quite a downfall in the middle of the season, but with the Buccaneers playoffs hopes dying, Baker Mayfield will have to air the ball out a little more than usual against a sufficient Panthers team. In Week 16 against the Panthers, Egbuka reached 40 receiving yards despite having only 1 reception. He has reached 15+ receiving yards in every game this season despite his downfall. \n\n**Rachaad White:** Ever Since Bucky Irving has taken over for RB, Rachaad has been making more use of his carries, averaging 8.46 yard per carry. White has also hit this mark in every game this season, even after his usage declined. In Week 16 against the Panthers, Rachaad White rushed for 45 yards, with a long rush of 39 yards. The Panthers' defense this season allows 4.48 yards per carry to opposing RB's this season. With Rachaad now averaging 4.2 carries per game, I have no doubt he will reach this mark.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxcpull/"
    },
    {
      "created_utc": 1767400264.0,
      "author": "bigcocklockzz",
      "text": "Record: 17-16\n\nNet Units: -5.77u\n\nLast Pick: PSG ML + Brentford ML +126❌\n\nPOTD: **Rachaad White o11.5 Rushing Yards -110 5u (Bet365)**\n\nRachaad White is over this line 14/16 on the year. He is the Bucs backup RB, and has played roughly 50% of the snaps all season. In the Bucs last game vs the Panthers, they ran the ball 33 times. Despite the loss, coach Todd Bowles defended the Bucs’ run-heavy game plan against Carolina, saying they beat the Panthers last year with 41 and 38 rushes. “We did everything we wanted to do.” Bucs OC Josh Grizzard says that \"Rachaad White has been “even keel” and has taken the opportunities he’s been given very well.” He says that his “ability to blitz pickup makes him a true three-down back. “ I expect the Bucs to run the ball at least 25+ times tomorrow, and if so Rachaad should get at least 3+ carries. In 6/16 games he has a carry of 12+ yards, and in 14/16 he has a carry of 7+ yards. This bet very well could cash on 1-2 rushes, but I do expect the Bucs to run the ball a ton tomorrow and that gives plenty of carry attempts for Rachaad White. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxcoh5e/"
    },
    {
      "created_utc": 1767400111.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 29-20 (+5.92U)**\n\nROI: +9.40%\n\nLast POTD: Pending: NCAAMB: Michigan-21.5 vs USC -110 (1U TO WIN 0.90U)✅\n\n**POTD: NFL: Seahawks ML vs. 49ers -136 (1U TO WIN 0.64U)**\n\nWrite up: Hit the 100 followers mark this afternoon so THANK YOU guys for the love and support - definitely brought a smile to my face today when I saw 100+ followers, so thank you - Let’s go Michigan, big spreads + Michigan = cash money - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Seahawks winning this game by 5+ \n\n• Model projects a high scoring Seahawks offense \n\n• EV better betting 100$ = 12-13$ for this play\n\n• Please Darnold, show up in a big game for once… Seahawks have one of the best offenses in the NFL - on the flip side of this, they have one of the best defenses in the NFL - I think the Seahawks DL has what it takes to disrupt Purdy’s game tomorrow - Although the 49ers have McCaffery, which ALWAYS scares me, the Seahawks are one of, if not the best team in the NFL when Darnold has a good night - Seahawks have a small edge in the amount of playmakers they have on their team and I expect them to utilize JSN right from the start - Betting on Darnold to have a DECENT game here, and willing to roll the dice on that - I think the Seahawks are a better team overall, and I see them walking away the W tomorrow. \n\nPOTD History: https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn\n\nBOL!\n\n**POTD: NFL: Seahawks ML vs. 49ers -136 (1U TO WIN 0.64U)**\n\nTips are greatly appreciated, PayPal link in bio. Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\nhttp://buymeacoffee.com/claysmiith\n\nhttps://venmo.com/u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxco08i/"
    },
    {
      "created_utc": 1767400104.0,
      "author": "bstilled_",
      "text": "**Record:** 0-0    \n**Net Units:** 0    \n**ROI:** 0    \n**Australia Horse Racing, Eagle Farm Race 3 (2:28PM AEDT)** 3 hours from now    \n**Pick:**  1. WARWOVEN $1.60     \n**Write Up:** Horse debuted last start at Randwick and posted a monster win/rating that is far superior to anything in this race. Lobs perfectly behind the leaders from gate 2 and runs right past in the straight.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxcnzhp/"
    },
    {
      "created_utc": 1767399344.0,
      "author": "BL_ATS",
      "text": "POTD record: 14-14-1\n\nDarts, 2026 World Championship 🎯\n\nLast POTD: Gian van Veen -1.5 sets vs Gary Anderson @ 1.90 ✅\n\nPOTD: Luke Littler vs Gian van Veen under 37.5 180s @ 1.81\n\nThis one takes a bit longer to write. First of all, the under 37.5 bet means everything from 37 and below is considered a win for this bet. 38 and above means a loss. \n\nTo me, the total of the 180s on here feels off. If we compare it to yesterday's matches; Littler’s match had 14 180s while playing 7 sets. Van Veen's match had 25 180s while playing 9 sets. Due to this 37 180s at most already feels quite high. Keep in mind it’s first to 7 sets to win, compared to first to 6 sets yesterday.\n\nIf we compare it with the finals of the previous years, we see:\n\n2025: 10 sets, 25 180s (Littler vs van Gerwen)\n\n2024: 11 sets, 36 180s (Littler vs Humphries)\n\n2023: 11 sets, 37 180s (Smith vs van Gerwen)\n\n2022: 12 sets, 41 180s (Smith vs Wright)\n\n2021: 10 sets, 23 180s (Anderson vs Price, covid year)\n\nI can keep it going but in 2020 it didn’t hit either. \n\nWe can conclude that this bet only went over the total of 37.5 once in the past years. With the recent stats of the semi-finals and the previous finals, I’m confident in taking the under 37.5 180s @ 1.81\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxclo18/"
    },
    {
      "created_utc": 1767399338.0,
      "author": "tennisfanatic101",
      "text": "💎POTD: 🏈 Bucs ML\nOdds: -148 on DraftKings\nWager: 2 Units\n\n🏈 Panthers at Bucs , 4:30 pm ET 1/3/25\n\nRecord: 13-12\nNet Units: +0.22 Units ✅\n\nExplanation: For starters, The Buccaneers are at home. You’ll always take that whenever you can get it. \n\nPanthers have been hot yes, but Carolina’s offense has been one of the league’s least efficient at turning plays into points. By 2025 efficiency metrics, Carolina sits near the bottom in EPA per play (about -0.05). I argue that matters in a divisional game where the spread is tight and you’re basically asking who can produce two or three scoring drives without self harming themselves.\n\nIf Baker Mayfield can stay protected in the pocket, he’s dangerous. And we already know he’s dangerous on the run. He’s not Lamar, but he’s so hard to knock down.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxclndd/"
    },
    {
      "created_utc": 1767398811.0,
      "author": "MelloJello4",
      "text": "POTD Record: 0-0 \n\nLast pick: KAT to have 12+ rebounds (-142) 2 units VOID ⛔️ (KAT has a random sudden illness of course and is out tonight, Saturday is now my true first POTD)\n\nEvent: Tennessee @ Arkansas 2 pm CT, NCAAM\n\nPick: Arkansas ML (-156) 2 units \n\nAlright, you either loved or hated my last write up. I’m a storyteller with my POTDs and it will stay like that. I find entertainment in writing these and love to throw some amusement towards y’all. But don’t worry, this write up will be short and sweet. Shoutout KevDog, the only man to verbally support me, you’re a King my friend. The pick today is Arkansas to win outright against the Volunteers. Oh man, I love me some John Calipari. He puts his players in the right position to succeed and stand out for the NBA scouts. And I’m sure his players are fired up after he stood up against the weird NCAA/NBA transfer situation going on. These are the types of games John has to win to keep his recruiting alive, I believe in him fully. \n\nArkansas comes into this with a 8-0 record at home this season with two wins against ranked opponents (Texas Tech and Louisville). They have also played stiff competition all year with quality losses to Duke, Houston and Michigan State. They will be more prepared and mentally tougher than Tennessee in this matchup. I’ve been watching a lot of Arkansas basketball and they have two absolute studs on their team. Brazile and Acuff Jr have been a deadly duo heading into conference play and the leadership they provide will only intensify as the season progresses. Not much stats on this one as these two teams matchup pretty evenly. I just believe Arkansas is the better coached and more mature team coming into this coin flip game. And I always side with the home momentum in these types of matchups. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxck1c7/"
    },
    {
      "created_utc": 1767398642.0,
      "author": "Doyouevensam",
      "text": "Record: 0-0 (I made two predictions on here about a year ago that turned out good, but I’ll never be able to find a record of it so I’m technically 2-0, if you want to trust me)\n\nNet Units: 0\n\nROI: 0\n\nSoccer - EPL - Aston Villa v Nottingham Forest - 12:30 PM GMT\n\nPick: Aston Villa ML (-125): 3U\n\nWrite Up: Aston Villa is 3rd in the league; NF is 17th.  Aston Villa are the home team, and have won 11 of their last 12 games, only losing to away to Arsenal on Tuesday (who are top of the league).  Aston Villa has two important players back from suspension.  Aston Villa has been overperforming a lot during their run of wins, but they are still far superior to NF, and have home advantage.  Anything can happen, but based on recent results, Villa should be heavy favorites here.\n\n I’m making my first prediction here in a year, if that says anything about how confident I am",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxcjiw5/"
    },
    {
      "created_utc": 1767398036.0,
      "author": "T_bone323",
      "text": "POTD Record: 5-3 (+3.43u)\n\nLast Pick: ❌ cunha 2+ SOT (-130, 2.6u)\n\nEvent: NFL - Seahawks @ 49ers, 8pm est\n\nPOTD: Jaxon Smith-Njigba 90+ receiving yards (-136, FanDuel) 5U\n\nWrite up: first career 5unit bomb. JSN has hit this prop in 13/16 and expect him to show up on the big stage as Seahawks look to grab the 1 seed and bye. 49ers defense has huge holes in the secondary - they’ve won some shootouts lately but since the bye they’ve given up 24 to the titans, 27 to the colts and 38 to the bears. JSN has an insane 44% of the teams receiving yards and put up 138 against the niners last time they played. Weather is ok, some rain but not much wind and mid 50s. \n\nLast but not least, 49ers CB Deommodore Lenoir was asked about JSN this week and said “I hope he’s ready, man to man coverage, me and him. That’s what I want.” This is the same corner who earlier this year said on a livestream: \n\n“Njigba, he be crying all day. That’s all he do is cry … crybaby … I’m not worried about JSN.”\n\nJSN 90+ in prime time",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxchpir/"
    },
    {
      "created_utc": 1767397815.0,
      "author": "Reasonable-Quit-3177",
      "text": "Record: 2-1  \nNet Units: +0.53  \nAll my picks are 1 unit.\n\n[Last pick: Al Ahli vs Al Nasr BTTS & Over 2.5](https://www.reddit.com/r/sportsbook/comments/1q1j2dr/comment/nx82qa3) ✅\n\nToday's pick:  \nFootball - Saudi Professional League  \nAl Ittihad vs Al Taawon BTTS & Over 2.5 @2.11\n\nI'm going for a riskier pick today but I think there is some serious value here.   \nSo first of all their last H2H was 2-1 but that was February 2025 so take it with a grain of salt.  \nRecent form in the last 5 games in terms of goal difference for Al Ittihad is 17-1 and 11-3 for Al Taawon respectively and this is where the value comes in. Al Ittihad's numbers are pumped by 2 friendly games versus bad teams. They did play a 1-0 vs Nasaf Qarshi but that was an AFC Champion's League game and they shot 19 times while Nasaf shot 16 times so there was plenty of attacking even though the shots were not converted.  \nAl Taawoun achieved these defensive numbers vs mostly mid/lower table teams but they did score vs Qadsiah and NEOM who are both good teams and they are on a pretty good run. If we take a look at their whole season in the Saudi League, Al Ittihad have 22-16 goal difference while Al Taawoun have 27-13 in 11 games. This paints a completely different picture.\n\nI think the odds overvalue the defensive aspect of the teams' recent games, especially for Al Ittihad. They are good defensively but I expect both teams to push and score goals. Al Ittihad want to climb back up the table where they feel they belong and I expect them to score first but Al Taawon is fighting to keep their 3rd place. I think both teams' offensive power can overwhelm the defenses.\n\nThis is a higher risk pick anyway, so take that into account.\n\nKeep in my mind I'm a random nobody from reddit, so tail with caution. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxch20g/"
    },
    {
      "created_utc": 1767397800.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 18-16-5 (Avg Odds +128)\n\n**Previous Pick:** Milan ML + Pulisic 1+ SoT (+100) ✅️\n\n**Today's Event:** English Premier League (Soccer) | Wolves vs West Ham (7:00 AM PST)\n\n**Pick:** Jarrod Bowen 1+ SOT and West Ham DC (+124) 1 unit to win 1.24 units\n\n**Write Up:** The Milan game played out about as expected, low scoring but ultimately with Milan coming through. Despite Pulisic not starting, he came through with a SOT anyway after he subbed on around the 78' mark. Great plus money cash to start the weekend!\n\nEPL is back today and we've got the game of the week here as 20th (last) place Wolves host 18th place West Ham. Let's be honest and get out there that both of these teams stink. Wolves are historically bad, as they may be looking at the fewest points ever by an EPL team. West Ham have been spotty, but I think they are a better team than their record states and have shown signs of life. \n\nBowen is the best attacking player for West Ham, the game goes through him. He has 6 of the club's 20 goals this season (30%) and has been in great form lately, scoring in 3 of his last 5 matches. He also has 8 SOTs in his last 6 matches, only failing to land an SOT in one of these games against Man City. I love the odds we're getting for Bowen here. \n\nLets talk about Wolves. They are winless this season, going 0-3-16 so far. They lost at home to Burnley (19th place team), at home to Forest (17th place team) and at home to Leeds (16th place team) just to name a few notable results. They are on track to earn 6 total points this season at the halfway point, which would be firmly the worst EPL season ever, with the current honor of that award is held by Derby County with 11 points. Their stats back up their record, attacking wise they have the fewest SOTs (53) fewest goals scored (10 - the 2nd fewest is 18), fewest shots, fewest goals/shot, we could go on. Defensively, they've conceded the 2nd most goals (36) and 3rd most SOTs (90).\n\nWest Ham are not a great team and do not have the best defensive record themselves, but they really need a win here to start to work out of the relegation zone. This is a team they need to beat, and I suspect Bowen will take it on himself to make that happen. This pick is more about fading the Wolves than anything, but I do think West Ham are a much better team. \n\nBOL and happy Saturday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxch0fm/"
    },
    {
      "created_utc": 1767397754.0,
      "author": "CMDVN",
      "text": "Last 5 > WWLWW // Profit: €1,517.80\n\nAston Villa @ 1.79 - €280.00\n\nThis one should be self explanatory. 3rd placed Aston Villa against 17th placed Forest. When talking about home form Villa are one of the best with a 7-1-1 record. Away from home Forest are 2-2-5 and coming into this game they are on a streak of 2 losses away from home and 3 losses overall. Villa on the other hand have won their last 5 home games but just came from a defeat against Arsenal.\n\nLet me say it one more time again, fuck Sean Dyche. I hated how he played at Burnley and I will never rate him as manager. And it shows, Emery is 6-1-1 in managerial H2H while Villa are also 6-2-2 in the club H2H. At home Villa are on a streak of 5 home wins against Forest.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxcgvem/"
    },
    {
      "created_utc": 1767397613.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Saturday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q2en8z/pick_of_the_day_1326_saturday/nxcgg2k/"
    }
  ]
}