{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/7/25 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/",
  "target_date": "2025-11-07",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-07T11:22:33.840452+00:00",
  "comments": [
    {
      "created_utc": 1762508253.0,
      "author": "kanadaii",
      "text": "Record 2W-2L\n\nForm ✅❌❌✅\n\nUnits: -.0.1\n\nLast Pick: Midtjylland vs. Celtic 2.07✅\n\nToday: Pisa vs. Cremonese x@3.15⏳\n\nPisa is having a very difficult season: after 10 rounds, 6 draws, 4 losses, and they have not won yet. \nThey have not been able to score much at home in the league. \nCremonese, on the other hand, is more balanced: with better attack indicators (about 1.2 goals/game), and their record is relatively more stable. \nThe two teams against each other: Pisa has a slight advantage in previous meetings. Since they are playing in front of the home team's fans, I can imagine a draw for the meeting.\n\nGood Luck",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnkjl0b/"
    },
    {
      "created_utc": 1762508247.0,
      "author": "Geluksspook24",
      "text": "Record: 7 win - 13 loss - 1 push ✅✅❌✅️✅️❌❌❌❌✅️❌❌❌❌❌✅️❌🔁❌❌✅️\n\nProfit: -8.23 units\n\nLast pick: Under 10.5 corners at Utrecht - Porto (1.51) ✅️\n\n\\---------------------------------------------------------\n\nCompetition: Eredivisie\n\nMatch: Twente - Telstar\n\nStart time: 14pm EST / 20.00 CET\n\nPick: Twente to win + under 5.5 match goals (odds 1.57)\n\nUnits: 4\n\nTwente have not won in their last three Eredivisie games and should bounce back here with a comfortable win over Telstar, who lost five of their last seven Eredivisie games. Twente at home with a way superior squad have no excuse to not win tonight.\n\nThe under 5.5 goals is to boost the odds from 1.39 to 1.57. Telstar usually have high scoring matches at home, but when they play away they always take a more cautious defensive approach leading to less goals. All 5 of Telstar's away matches have seen under 3.5 goals happen. The 5 home matches for Twente have seen under 5.5 goals happen in all of them.\n\nQuite confident in this one, good luck if you're brave enough to tail after all those losses haha 🍀\n\nI share all this research for free so everyone can benefit. If you want to leave a small tip for the time and effort I put in, I’d really appreciate it :) [https://buymeacoffee.com/xgenius\\_betting](https://buymeacoffee.com/xgenius_betting)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnkjko2/"
    },
    {
      "created_utc": 1762501116.0,
      "author": "Vet100",
      "text": "Record: 12-5 \n\nNet Units: +6.3\n\nTotal Staked: 17U Total Returned: 23.3U \n\nPick: NBA Pistons v Nets \n\n1U Duncan Robinson O2.5 3s made @ $1.80, B365 \n\nWrite-Up: Robinson in a good spot here form wise (hit this line in his last 4 games), usage (averaging 6.5 3s a game this year, so on average should go over considering he’s an approx 40% shooter), and the Nets are a league worst 3 point defence team (teams averaging 42% 3pt shooting on them). He hit this in 2/3( games against the Nets last year. \n\nCunningham should be dominating at guard and kicking it out to the corner for Robinson to make his mark. A similar player in DiVincenzo went 6-13 from 3 just a few days ago v the Nets. Harris is still out, as is Ivey, and LeVert is questionable so his minutes & usage should be solid. \n\nWould be happy to get back on the winners board after 2 losses in a row chasing bigger value odds and feeling like both could have easily hit. \n\nAs always, if this bet interests you it’s reasonable to discuss the antithesis. 3 point bets can be unreliable, and there is a solid blow-out risk in this game (Pistons won all 3 games by 10+ last year v the Nets). However I think there’s a strong chance that if the blowout occurs Robinson hasn’t completely blown it from 3.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnk814j/"
    },
    {
      "created_utc": 1762499177.0,
      "author": "No-Improvement7435",
      "text": "Record 1-1 😴\nLast pick : Vacherot Ml ❌\nToday’s pick : Illawarra hawks -2.5 vs cairns taipans \n— Hawks -2.5 alt spread the line is currently -5.5 on dk , match starts in 1 and half hours . 3:30 am EST . \nI don’t see anyone on the taipans stopping javale McGee 🤘 BOL 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnk4r7d/"
    },
    {
      "created_utc": 1762498248.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 18-8-1\n\nSoccer\n\nLast Pick: Aston Villa ML + Midtjylland/Draw @ 1.6 ✅✅\n\nLast Pick Write Up: A comfortable cash after two very frustrating losses, we’re so back.\n\nNow for today..\n\nPick: AEL Limassol win + Odense/Silkeborg O1.5 goals @1.81 \n\nWrite Up: Not many interesting games going on, but I’m posting this pick for fun (and I think it will hit). Now, AEL Limassol is nothing special, sitting at 9th place with 3W1D5L. However, their opponents, E.N Paralimni are absolute dogshit, sitting at the bottom of the table with 0 wins, 1 draw and 9 losses, having scored only 2 goals and conceded 20.  \n\nOdense has had O2.5 goals in their last 9/10 and BTTS last 5/6, Silkeborg has had O2.5 goals 8/10 and BTTS in 5/7, their last H2H went 2-1. We should probably have at least O1.5 goals here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnk33vk/"
    },
    {
      "created_utc": 1762496476.0,
      "author": "OliveCritical5134",
      "text": "**Record: 15-9**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌\n\n**Sport: ⚽ /** ***Scottish 1st division & Czech 2nd division / Airdrieonians v Partick Thistle & FC Silon Taborsko v Vysocina Jihlava***\n\n**Net Units/ROI: +24.57u / +37.80%**\n\n**Previous Pick:** ***Malmö v Panathinaikos over 1,5 total goals(1.33) + Larnaca to win(1.40) @ 1.86 -- 2 units❌***\n\n**Summary:** Panathinaikos missed an early pen and Larnaca couldn't score once against a weak Aberdeen. Very unlucky, first double where both picks didn't hit. We move onto the weekend.\n\n**Today's Pick:** ***Partick Thistle to win(1.57) + FC Silon Taborsko to win(1.61) @ 2.53 -- 2 units***\n\n**Write up:**\n\nRegular tailers know why we stay with 2 units on a Friday, not that we've had wrong picks but simply because the supply in football games isn't as big as your regular Saturday/Sunday. Adding onto my motivation on keeping our bet at 2 units is because I've picked lower leagues here.\n\n**Airdrieonians v Partick (19.45 GMT)**\n\n**Partick is 2nd in the table** and they are looking to get straight promotion to the Scottish Prem. They've **won 5 out of their last 8** Premiership matches. They **smashed 9th place Queen's Park 5-0** last weekend, in case you want to measure how they perform against lower teams.\n\n**Airdrieonians is in last place(10th)** and have **lost in 9 of their last 14** matches. 3 out of the other 5 matches were draws against teams in 8th and 9th. They've lost 3-0 against first place St. Johnstone last weekend if you want to measure how they perform against teams that are placed high in the league table.\n\n**Taborsko v Jihlava (16.00 GMT)**\n\n**2nd place Taborsko** are hosting **11th place Jihlava**. Taborsko have **won 10/15** games this season. They have an unbeaten streak in the league thats going on for 12 matches, with 9 of them wins and **only 3 draws against 4th, 5th and 3rd.**\n\nJihlava have **only grabbed a point or more in 4 of their 10 recent matches**, and they were **against teams in 14th, 12th, 8th, 16th.** Bare in mind that this league only has 16 teams. I don't see them standing a chance against the team in second here.\n\n**Best of luck if tailing!** 🍀\n\n**PS:** If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjzyc2/"
    },
    {
      "created_utc": 1762496104.0,
      "author": "Ralphjinasseater",
      "text": "Record 4-3 POTD.LOL - Tracking Handicappers\n\nLast pick:  Austin Reaves UNDER 25.5 Points \\[=\\]\n\nCategory:🏀⛹️basketball\n\nPick of the Day: aj green o 8.5 points\n\nStart time & TV: bucks vs Bulls 8 PM\n\nReason: • he is a 3 Point Streak and point streak as well let’s hop on the train before it disappears people\n\nhttps://preview.redd.it/0uh9oyvs1szf1.jpeg?width=1170&format=pjpg&auto=webp&s=609e628a6f7c2bcfe560bc5e66d3d360325c4548",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjzabs/"
    },
    {
      "created_utc": 1762495471.0,
      "author": "Impasta123",
      "text": "Record 1-1 \n\nPick: Townsville Fire Women -3.5 vs Geelong United \n\nThis match starts at 5:30pm AEST so 30 minutes from this post. \n\nTownsville is currently top of the league with Geelong being placed 2nd from the bottom. Townsville I believe are far more skilled than Geelong, although at home, I feel this line is lower than it should be. The last 3 games Townsville has dominated Geelong, averaging a win of 19 points. \n\nAll the best to those who tail!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjy4fn/"
    },
    {
      "created_utc": 1762495429.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 167-126\n\nSeason record: 4-3\n\nLast POTD: __Jaylen Brown O5.5 Rebs @1.80 1U__ ❌\n\nToday’s POTD: __Jalen Johnson O25.5 PA @1.86__ 1U (Bet365)\n\nNBA | Raptors vs Hawks | 🏀  \n\nTrae still out for the Hawks and increased usage on Jalen Johnson, for obvious reasons Jalen’s role in running the offense has gotten bigger and playmaking duties aswell. Since Trae has been out he’s over in 2/3 games with the sole miss being last game where he had 22 PA, he was dealing with foul trouble and didn’t get the volume he has had previously as a result, 30 & 28 PA in the other two games and over in 5/7 this season (4/L5).\n\n30 PA in the earlier matchup this season against the Raptors WITH Trae playing, with this being a cup game his minutes should be even higher and as I mentioned his role in the offense aswell. Has had 9+ potential assists in every game without Trae and assist numbers has gone up, Hawks need Jalen to do both in this one which is why I like the PA.\n\nRaptors ranked top 5 in most points allowed to PF’s & top 10 in assists.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjy1ni/"
    },
    {
      "created_utc": 1762495322.0,
      "author": "Super_DAC",
      "text": "Record: 4-2\n\nNet Units: 2\n\nPrevious Pick: Total Match Goals Over 5.5 +100 (1 Unit) ✅\nWon this one courtesy of a Lundell goal for the Panthers in the 3rd period. As expected, the goals were plentiful.\n\nEvent: MLS Cup Playoff Soccer Game 3/3 (series tied 1-1) #5 NYCFC (17-5-12) @ #4 Charlotte FC (19-2-13) 11/7 7PM EST\n\nPick: New York City FC ML +180 (1 Unit)\n\nWrite up: The first of 5 different winner take all playoff games happening this weekend in the first round of the MLS Playoffs kicks off tonight when New York travels to Charlotte, North Carolina. Game 1 was a narrow 1-0 victory in the same building for NYC, while Charlotte emerged victorious via a penalty shootout following a 0-0 draw in game 2. The winner advances to face the #1 overall ranked Philadelphia Union.\n\nThis match will be the 5th one between these two sides this season, and NYC has held the edge as of late. Charlotte won their first game 2-0 back in July, however New York avenged that loss with a 2-0 win of their own in September. And in the first 2 games of this playoff series, NYC has registered 22 shots (10 on target) compared to Charlotte’s 14 (7 on target). Additionally, NYCFC held 55% of possession in both playoff games. Excluding the penalty shootout, CFC has not scored against NYC since July, while New York has scored 3 goals against them.\n\nNYCFC seems to be a puzzle that Charlotte FC can’t solve lately, and I don’t see that changing tonight. CFC may have extended the series to game 3 via penalties, but I don’t think they’ll pull that off this time. I’m backing the away side to pull off a close win. BOL to those tailing, let’s do some winning!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjxui6/"
    },
    {
      "created_utc": 1762494646.0,
      "author": "fadedcrescent",
      "text": "Record: 0-1\n\nNet Units: -1U\n\nLast Pick: California vs Wright St. **Total O152.5 ❌**\n\nThat was a misinput. What I expected to see the whole game only came about in the last 5 minutes with Wright St. finally showing their teeth however it was too little too late. Its unfortunate but teams often play down to their opponents level which Cal showed last night.\n\nSoccer | EFL Championship | Watford vs Bristol City | 3:00pm EST \n\n**Pick:** **Watford ML** (+110) 1U\n\nWrite Up: Moving swiftly on, we see Watford host Bristol City for their 15th game of the season. Watford, coming off a hard earned draw away from home, face off against a cold Bristol. Bristol have won just two of their last 8 games against Watford, the Hornets are used to this. Having taken down third place Middlesbrough earlier this month with a commanding 3 nil wi, they look to extend their November unbeaten run. A key factor in this fixture is Watford playing at home, Watford at home have won their last 3 matches in commanding fashion. Bristol coming off two tough losses from Stoke and Blackburn look to bounce back away from home. Watford are heading into this match with momentum and a great record at home, facing a side plagued by injuries and recent defeat.\n\nWatford at home boast an impressive 4-1-1 record where Bristol sport a 2-2-2 record away from home this season. Watford have scored at least one goal in their last 13 matches against Bristol when they play at home, scoring is not an issue for Watford. Watford have not lost a match in 7 of their last 8 home games this season. Both teams are fighting to secure 3 points in hopes of finishing within the top 6. I expect a close match with Watford having a slight edge against a weakened Bristol side.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjwl3w/"
    },
    {
      "created_utc": 1762493985.0,
      "author": "MWMM93",
      "text": "**POTD Record 42-36-1**\n\nMan, that Suns game was IMO the best type of game to bet on. They trailed 48-51 at the half against the Clippers, then exploded to dominate the second half and walk away with a 115-102 win. Jalen Green looked like he was unleashed in his Phoenix debut, dropping 29 points in 23 minutes and raining threes. The Clippers tried to hang around, but once Phoenix flipped the switch, the cover was locked and I could continue on with my evening.\n\nBack at it. Now we slide right into the Battle of Texas with my next play.\n\n**Spurs +3**\n\nHere’s the thing: I know Houston is slick, and their defense has been legit, but they may be down a key piece in this matchup. Steven Adams. and that changes everything when you’re facing a 7’4″ freak like Victor Wembanyama. Wemby’s last two nights were rough. Fouled out in one, barely 9/9 in the other. You know what that means (and one of my favorite theories in sports)? He’s due. He’s pissed. Even if adams does play, I still love getting them + money at home.\n\nLast game, Wemby fouls out in the 4th. Six fouls, rhythm never really there, and he’s on the bench when it matters. Brutal. Game before that, 9 points, 9 rebounds. So you’ve got box scores that make him look mortal, fouls piling up, and people complaining about how bad he was his last two games. comments like \"overrated. I’m not buying it. What I am buying is that this is the exact kind of game where a guy like Victor absolutely loses his mind in a good way (I know I have said that the last few days). Yeah. This is a “statement game” spot if I’ve ever seen one (again said that last game - doubling down). I am so high on this guy, and I know thats not a bold statement, but when a player comes in doing things youve never seen before, it usually ends with changing the game completely, and a a decade of championship runs.\n\nOkay back to the game. Houstons backcourt / creation is where they have the edge. So far this season, without FVF, the Rockets move the ball pretty well, and make a lot fewer dumb decisions than San Antonio’s young backcourt. The Spurs’ guards are talented, but they turn it over more and go through stretches where the offense just… dies. If this comes down to pure guard play in the final three minutes, I do lean Houston. But that’s also why you’re getting +3 and not Spurs as favorites. The line is telling you that they know Houston is the more stable team, but we also know Wemby might flip the board, which when he does, he does it unlike anyone has since Curry.\n\nHouston’s defense is physical, disciplined, well-coached. They close out, they rotate, they make you hit jumpers. Houston’s bigs however, are where I think the advantage can be had for SA. They are more mobile than muscle; that’s exactly Wemby’s zone. No one is more mobile than him. He feasts when he doesn’t have to wrestle. Meanwhile, the Spurs have length, mix, and a slowing-down game plan that hurts the Rockets’ motion. Yes, Houston still has guard strength and creation (and KD), but the number gives you breathing room.\n\nYou’re not betting a hoop-shot win, you’re betting a bounce-back statement by a young core that doesn’t want to play backup in the division, at home. I mean, this matchup could be a rivalry for the next few years. Neither of these teams are going anywhere.\n\nOverall, you all know my most weighted angle is a bet on Wemby, but I also like the way this team battled in LA in their last game, even with the countless mistakes, and missed opportunities, they stayed alive. I am not claiming a 50 point game in this one, but rather and exciting game where the Spurs get back to the domination they did to start the season.\n\nPS: Detroit -10.5. BKN Sucks, and Detroit has covered 4 straight and are 2-0 ATS in games -7.5+. Also did I mention BKN sucks?",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjvb9g/"
    },
    {
      "created_utc": 1762492670.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 8-3 (+6.4U)\n\nLast Pick: Two team 7 point teaser (App state +1.5/over 54.5) (-130) (1U)  🙅‍♂️\n\n[Teaser write up](https://www.reddit.com/r/sportsbook/s/64vPML0fsF)\n\nSecond half great effort by app state, should’ve chucked the ball against that sorry secondary all night, not sure what the thought process was in the first half. Whatever.\n\nEvent: Wild @ Islanders (6pm central)\n\nPOTD: over 6.5 goals (-110)\n\n-everything is bet to win unit amount-\n\nWrite up: If you’ve been rocking with me on POTD for the time I’ve been on here, you know I don’t lose two in a row. This POTD thread loves to build you up when you win and tear you down when you lose, that’s the way life goes. I love it. Wild just lost to the hurricanes 4-3 tonight and now head up to New York to take on the islanders on the second leg of a b2b. We will see both backup goalies in (although the islanders backup has been slightly better). In the past 10 games the islanders have found some offensive rhythm, posting 28 goals! The Wild have only put up 20, yet have actually been expected to put up 34 in that stretch! The Wild have one of the best power play percentages in hockey right now as well at 30% which is unreal. That doesn’t bode well against an islanders team that has had an absurd 147 penalty minutes on the year! The Wild also have been expected to allow 36 goals over that stretch! The islanders will be rested and hungry after dropping two straight and losing in ot to the bruins 4-3 in a so! The Wild are 8-6 to the under and the islanders are 10-3 to the under! Both of these teams are top 13 in expected goals for per 60 mins and both are bottom 8 in the league in expected goals against per 60 minutes! I like the fact that we can get an islanders team that should be able to find a groove against a tired legged wild team and I certainly expect the Wild to get a few in there after coming off a close loss in Carolina and going up against an islanders team allowing they’re oppenents almost 3.7 power plays per game! That’s terrible, not to mention they have a penalty kill percentage of under 75%!! Hockey has been hot for us this year and I expect another sub on the board for us before we get ready for a big football weekend, strap in, and let’s ride baby! Cheers fellas 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjsq48/"
    },
    {
      "created_utc": 1762492457.0,
      "author": "RealityOtherwise8676",
      "text": "🏀 NBA | Hornets +5 @ Heat | 1u (-110)\n\nEveryone’s hammering Miami (75–80% of bets), but I think that line’s a little too high. Hornets usually play the Heat close, and this feels like a good bounce-back spot. Just need them to hang around.\n\nRecord: 0-1 (-1u)\nPick: Hornets +5 (1u)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjsagu/"
    },
    {
      "created_utc": 1762491882.0,
      "author": "Mindless_Employee421",
      "text": "Record: 5 - 1 \n\n\nNet Units: +12.84\n\n\nROI: +12%\n\n\nSport | League | Event Time / Time Zone: Soccer | France - Ligue 1 | Paris FC vs Stade Rennais| 2:45 PM EST\n\n\nPick: BTTS & Over 2.5(To win 3U) (+102)\n\n\nWrite Up: Found this interesting match up on a Friday here in France's Ligue 1 between Paris FC and Stade Rennes. These teams are separated by just one spot in the standings with Rennes sitting in 10th and Paris FC 11th and separated by just one point. They've both scored 18 goals so far and Paris FC has conceded three more than Rennes. I think due to no previous h2h match ups the books are pricing the Over 2.5 and BTTS a little lower than it should be however the statistics support an open match because the previous 10 matches for Paris FC have had BTTS & Over 2.5 in 8/10 and for Rennes 8/10 as well. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjr3g0/"
    },
    {
      "created_utc": 1762491418.0,
      "author": "lalalamelo",
      "text": "Record: 2-0 (100%)\n\nForm: ✅✅\n\nLast Pick: [NCAA Basketball] Florida -37.5 vs North Florida (DraftKings -115) 8:00 PM EST ✅\n\nLast Pick Recap: Like I predicted, Florida wins comfortably by 40. Slight sweat on the spread but the Gators get it done nonetheless.\n\nToday’s Pick: [NCAA Basketball] Wisconsin -27.5 vs Northern Illinois (FanDuel -110) 8:30 PM EST\n\nAnalysis: Similar situation to Florida yesterday. Wisconsin will be taking on the Northern Illinois Huskies in an early season tune up game. A little bit about the Huskies is that they went 5-25 last season finishing dead last in the MAC and are picked to finish dead last in the MAC this year as well. Long story short, this team is inexperienced and not supposed to be competitive this year. \n\nOn the other side, the Badgers are led by Preseason Naismith Trophy Watchlist member John Blackwell, as well as 7’0 Nolan Winter in the paint and should dominate the Huskies all night with their size, athleticism, and overall talent level advantage. Also I should note that the #24 Badgers punished Campbell 96-64 on Monday and Campbell is a much better team than NIU. I expect a 30+ point domination from the Badgers tonight.\n\nThank you to everyone who has tailed so far and let’s get us a streak going🦾🦾\n\nOnce again this is gambling at the end of the day so bet responsibly, control your emotions, and best of luck🧏‍♂️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjq3v1/"
    },
    {
      "created_utc": 1762491321.0,
      "author": "darce-choke",
      "text": "**Record:** 9-1   \n**Net Units:** \\+10.04U \n\n**Previous Pick:** India ML (vs Australia) @ 1.85 ✅\n\n**Sport:** Mixed Martial Arts (MMA)  \n**Event:** LFA 221 and ONE Fight Night 37 \n\n**Pick:** Richard Martins ML (1.17x) + Elbek Alyshov ML (1.37x)  \n**Parlay Odds:** 1.60 (1xBet)  \n**Units:** 5U to win 3U\n\n**Write-up:**  \nFirst leg, Richard Martins. This is a layup fight for him. He lost a decision to Daniil Donchenko in TUF, but Donchenko turned out to be legit. His earlier loss to Manuel Sosa also aged well since Sosa got signed to the UFC. UFC is clearly still keeping an eye on Martins, and he probably gets another DWCS shot soon, so he just needs a few highlight wins on his record. His opponent is a can crusher and cherry-picked for Martin. Martins should get this done.\n\nSecond leg, Elbek. Carlo is explosive early, but his only loss showed the  hole in his game, once he gets taken down, he can be controlled. That’s exactly what Elbek is good at. I see him getting Carlo down early and looking for a finish in round 1 or 2, but to stay safe, we’re taking the ML. As long as he avoids that early chaos, he should win and keep his undefeated record.\n\n**Time:**  \nLeg 1 (Martins): 8:00 PM EST  \nLeg 2 (Elbek): 9:00 PM EST\n\nTail responsibly.\n\nhttps://preview.redd.it/2zxzhsjujrzf1.png?width=488&format=png&auto=webp&s=2b5efa582f6f42a53cff7f855d22e26b3f87d131",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjpw86/"
    },
    {
      "created_utc": 1762491214.0,
      "author": "Significant_Pass_955",
      "text": "Record 3-3\n\nNet Units -2.6U\n\nLast Pick: Brewers ML vs Dodgers\n\nPick: UCF ML -108 3U( CFB Big 12 / 19:00 Central / FS1)\n\nWrite Up: Trust the oddsmakers in this one. No way 4-4 UCF should be pick em odds against a 7-2 Houston team. This is a classic public fade spot, and I feel confident the sharp money will start pouring into UCF come tomorrow.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjpnt6/"
    },
    {
      "created_utc": 1762485342.0,
      "author": "Dont_Tail_Me_Bro",
      "text": "Record: 3-1\n\nNet Units: +2.32u\n\nLast pick: Louisville -37.5 🤮 Louisville up 40 with 15 seconds left, Jackson State player chucks up a 3 and hits it while getting fouled, Louisville wins by 36. They slid through our back door no lube.\n\nNCAAF // Tulane Green Wave @ Memphis Tigers \n\n**Pick: Memphis -3.5 (-110) 1u**\n\n  \nLet's head to Memphis, TN where the Tigers play host in a night game to the Green Wave whatever that is supposed to be. \n\n\n\nAfter an inexplicable loss to UAB, Memphis is back in form with a convincing win over Rice and a very quality win against #18 South Florida. The first iteration of the CFP bracket came out this week, and they slotted Memphis into the #12 spot. The pressure is on Memphis the remainder of the season, they absolutely cannot drop another game, and I don't think they will. Outside of their 1 score loss to UAB they have been flexing all season long even going toe to toe with the big bad SEC and beating Arkansas. \n\n\n\nTulane's playoff hopes died last week at the hands of 4-4 UTSA when they got beat handily 48-26. They did have some quality wins before that but a loss like that puts a major damper in their momentum. They allowed over 500 yards to the Roadrunners and tossed 3 interceptions in the process.\n\n\n\nNow of course teams sometimes just have a bad game, and I still think Tulane is a well above average group of 5 team, but I'm just not convinced they will be able to contend with Memphis, especially in what will be a tough road environment. \n\n  \nLet's look at the numbers:\n\nMemphis Total Offense- #35 (430 ypg)     Tulane Total Offense- #56 (408 ypg)\n\nMemphis Scoring Offense- #12 (37.7ppg)     Tulane Scoring Offense- #80 (25.9ppg)\n\nMemphis Total Defense- #48 (347ypg allowed)     Tulane Total Defense- #103 (402ypg allowed)\n\nMemphis Scoring Defense- #24 (19.22ppg allowed)     Tulane Scoring Defense- #79 (25.5ppg allowed)\n\n  \nMemphis is the statistically superior team which we can take a little bit from because they are in the same conference and have faced similar competition so far this year. I think the scoring opportunities will be there for Memphis.\n\n  \nAnother thing to consider with Memphis is they simply do not beat themselves. They sit at 10th nationally in turnover margin 17-8 while Tulane has a turnover margin of 11-10 on the year. \n\nMemphis sits 27th nationally with 45 penalty yards per game, while Tulane is all the way down at 122nd nationally racking up 67.88 penalty yards per game. \n\nMemphis is a fundamentally sound, disciplined team who I think understands the position they are in now after seeing their names on the TV for the final playoff spot. \n\n  \nMemphis has been an absolute cash cow this year sitting at 8-1 ATS, 4-0 ATS at home. Tulane is at 3-4 ATS and 1-3 ATS on the road. \n\n  \nI fully expect this line to creep all day long and end around 5.5. This is a primetime game on ESPN and them boys from Memphis are ready for the spotlight!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjbekj/"
    },
    {
      "created_utc": 1762485017.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 188-141\n\nUnits Won: +96.70\n\nLast Pick: AMKAL Map 1 ML (-122) vs. JiJieHao ✅\n\nToday's Pick: **FURIA -2.5 Rounds Map 2 (-120)** vs. The MongolZ 5u\n\nhttps://preview.redd.it/bidbt8xkjqzf1.png?width=575&format=png&auto=webp&s=8ae5fc1fbb569775ab5d5d8c7596e6f57882943c\n\nTournament: IEM Chengdu  \nTime: 4:45 AM EST.\n\n**Writeup:**\n\n* FURIA are picking their map 2nd in this series, they have been on fire with their new roster, this team in my opinion is a dark horse for the upcoming major and they are in great form at the moment. Not only is their roster been great and hitting extremely hard but their map pool is also tremendous with all maps being above 50% winrate and not really having any \"weak\" maps in the pool that are exploitable as a punish pick against them like many teams do have\n* MongolZ are in a bit of a weird spot, they are coming off of benching their best player by far in Senzu, they have a 3-1 record at this tournament so far despite looking pretty shaky at some points throughout the tournament. New pickup Controlez has had a decent tournament so far for how fast he was thrust in to tier one and has had his moments of looking good. MongolZ map pool still seems relatively the same as before with a slightly higher priority on Inferno, but still strong on Ancient/Mirage\n* MongolZ have won the h2h overall against FURIA lifetime but in the last few months (Since FURIA picked up molodoy) the h2h has flipped in FURIA favor, MongolZ were 5-2 with a 9-3 map record against FURIA in early 2025, but in the last 3 months, FURIA are 2-0 in matches with a 5-2 overall game record against MongolZ. \n\n**Veto:**\n\n* MongolZ ban Train, FURIA ban Ancient\n* MongolZ pick Mirage/Inferno, FURIA pick Overpass\n\n**Overpass Stats:**\n\n* FURIA are 83% winrate on 12 maps of Overpass in the L3 months, they are the best Overpass team in the world in my opinion, they have been on an absolute rampage. They are on a 9 map winstreak on Overpass with huge wins over teams like MOUZ/Aurora/Vitality/G2 and more, who are some of the best teams in the world. So far at this tournament they are 2-0 on Overpass with wins against G2/MOUZ. Overpass is a historically very CT sided map which makes it a bit scary to bet on in the traditional sense since mongolZ would start CT side but FURIA have averaged a 58% T side winrate \n* MongolZ are 60% winrate on 5 maps played on Overpass in the L3 months, this is their least played map and despite them jumping out to some strong results with wins vs. TYLOO/GamerLegion/TYLOO, they have lost their last two maps on Overpass losing to HOTU 13-8 and losing at this tournament to HEROIC 13-10\n* FURIA are 3-0 on their own map picks so far this tournament \n* MongolZ are 1-3 on their opponents map pick so far this tournament",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnjakc2/"
    },
    {
      "created_utc": 1762479777.0,
      "author": "Initial-Tank-9424",
      "text": "POTD RECORD 10-4 ( +11.6 Unit ) \n\nPrevious POTD : Football - UCL - Totenham Vs Copenhagen - Under 8.5 Shot On Target - Odds : 1.81 ( 4 Unit ) - Time 20:00 ❌\n\nToday's POTD : Football - Serie A - Pisa Vs Cremonese - Under 8.5 Shot on Target - Odds : 1.61 ( 2 Unit ) - 19.45 UK Time\n\nBoth Pisa and Cremonese are fairly average Serie B sides that tend to cancel each other out. Neither team creates a high number of clear chances, and their games are often cautious and tight. Betting on draw in this game might be good but to damn risky. Low odds so going for 2 unit only.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nniw5hw/"
    },
    {
      "created_utc": 1762478109.0,
      "author": "InconsolableBrat",
      "text": "POTD Record: 147-101 | Profit: +93.70u | ROI: 13.1%\n\nSeason Record: 7-5 | Profit: +6.44u | ROI: 15.3%\n\n \n\nLast Pick: Jamal Murray (Nuggets) O30.5 PRA @ 1.89. 3U. ❌\n\nMurray has been an excellent shooter all season but went just 1/8 on 3s, many of which were good looks. He still ended with 25 PRAs, so I don’t think it was a terrible read, just a bad shooting night.\n\n \n\nNext Pick: **Kristaps Porzingis (Hawks) O6.5 Rebs @ 1.84**. 4U play.\n\nReturning to a Porzingis prop for the 3^(rd) time this season because I still believe the Hawks are being careful with his minutes (<27 in each game) and he’s had poor shooting to start the season. Despite that he has put up decent numbers. With Trae out, and him adjusting to life as a Hawk, I expect him to take on more offensive responsibility and play bigger minutes. The Raptors will have Poeltl and Barnes so Porzingis will need to be more aggressive on the defensive glass, similar to the Cleveland game. Also, with Poeltl who operates entirely in the paint, he’ll be near the basket more than usual. He’s over this line in 4/L5 games against the Raptors. This is expected to be a close game, so with big minutes and a 3 day break, I will back Porzingis to cover this line.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnirlxl/"
    },
    {
      "created_utc": 1762477892.0,
      "author": "damagebabee",
      "text": "**POTD** Record 117-02-94\n\nWATFORD VS BRISTOL CITY\n\nDate: 07 NOVEMBER 2025 at 21:00\n\nBET ON: Match odds- WATFORD\n\nOdd: 2.16\n\n\n\n\\- Watford look well placed to win against Bristol City, with Javi Gracia’s return restoring structure and belief. The Hornets’ recent home form — including wins over West Brom (2–1) and Middlesbrough (3–0) — highlights their growing attacking cohesion and defensive solidity. Bristol City, on the other hand, arrive depleted, missing around ten players including both first-choice wing-backs Neto Borges and Mark Sykes. The visitors’ morale is low after consecutive defeats and a heavy 5–1 loss to Stoke. With Watford motivated to push into the top eight and tactically sharper under Gracia, they look primed to capitalise on City’s injury crisis and fragile confidence.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nnir0jt/"
    },
    {
      "created_utc": 1762477795.0,
      "author": "dreamchasing1",
      "text": "Record: 221-207 Net Units: -21.89 46-50 on 1.5u plays, 36-38 on 2u plays, 1-2 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Conference League] Samsunspor vs Hamrun\nLast pick: Asian total corners over 9.0 @ 1.85 - 1.5 u lost\n\n\nEvent: Soccer/Football, [Denmark Superliga] Odense vs Silkeborg\n\n\nPick: BTTS + Over 2.5 goals @ 1.83 - 2 Units\n\n\nA great meeting for goals as both teams top the table in total goals per game. Odense have managed to cover this line so far in 11/14 games, at home in 6/7. Silkeborg have covered in 8/14, and in 5/5 away games. The two sides already met earlier in a 2-1 win for Silkeborg, they also met earlier this year in a 2-2 draw. Both sides have no struggle to score either as they've scored on all kinds of teams, even on the strongest ones in the league.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nniqr1n/"
    },
    {
      "created_utc": 1762477632.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1oqgsvr/pick_of_the_day_11725_friday/nniqb6n/"
    }
  ]
}