{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/1/25 (Monday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/",
  "target_date": "2025-12-01",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-01T17:17:03.830372+00:00",
  "comments": [
    {
      "created_utc": 1764608296.0,
      "author": "Mysterious-Career938",
      "text": "**POTD Record: 4-5**  \n**POTD Unit Count: -1.6u**  \n  \n**Last POTD: Vince Williams O 11.5 Rebounds & Assists -1u**  \n**Today’s POTD: Jalen Johnson O 15.5 Rebounds & Assists -130 2u (Onyx)**  \n  \n**NBA | Hawks @ Pistons | 7:00 PM EST**  \n  \nJalen Johnson O 15.5 Rebounds & Assists -130 (Onyx)   \nJalen has gone over this line in 9 of the last 9 where he has played 32+ minutes without Trae Young!\n\nThose games included:  \n18/18/32/17/17/19/20/19/19/24/21 \n\nThis line is possibly the worst-placed line on the market and has been for 9 straight games. Please take advantage of it before it bumps! ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrqiup6/"
    },
    {
      "created_utc": 1764608264.0,
      "author": "T100022",
      "text": "Parley ML Jets & Devils",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrqiqzo/"
    },
    {
      "created_utc": 1764605182.0,
      "author": "prismaticground",
      "text": "POTD Record: 0-0\n\nNet Units: 0\n\nROI: N/A\n\nHockey | NHL | 7 pm | CST\n\nPick: DUCKS ML +140\n\nWhy: This opened a pick ‘em. Ducks are 15-9-1 and Blues are 9-10-7. So why the sudden line movement? Could it have something to do with today being the first day Missourians can bet on the Blues legally? Value is on the Ducks.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrq8ewx/"
    },
    {
      "created_utc": 1764602648.0,
      "author": "aryastark94",
      "text": "Record: 10-3-1  \nLast POTD: Alexis Lafreniere over 1.5 SOG (-140) ✅️  \nToday's Pick: Anaheim Ducks TT over 2.5 Goals (-145)\n\nWhat an emotional roller coaster with that last pick as Laf does jack shit in the 1st period, then rips a shot 10 seconds into the 2nd. On his very next shift, he has a backhand that hits the post and then gets another shot that I swore live was on net but at the time was ruled to have been blocked by his own guy.  Watched him dick around the rest of the game, as he is apt to do, and get looked off multiple times in OT and wondering why that 2nd period shot wasn't counted.  Then a couple days later, get paid out for that because NHL stats looked at it and realized it was indeed a shot on goal.  Gambling is insane.\n\nAfter a couple weeks off spent doing family stuff for Thanksgiving and partying in Miami, I'm back for tonight with one of my favorite standard plays: Ducks TT over.  For the life of me I cannot figure out why this is so damn low as the Blues are for my money one of the worst teams in the league. Yes, they are coming off a shutout of the Mammoth in their last game but before that they had given up 3 or more to opponents in 7 of their past 8 games.  I actually can't believe the Ducks are underdogs and am sprinkling liberally on their ML and various props, but the over 2.5 goals seems the safest to me.\n\nBOL if you tail.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrq030t/"
    },
    {
      "created_utc": 1764600622.0,
      "author": "20k_rpm",
      "text": "Record **:** **20** W **- 16** L\n\nForm **:** ✅✅❌✅❌❌❌✅✅✅❌✅✅✅❌✅❌❌❌✅✅❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌\n\nEvent **:** Counter Strike **| Nodwin Clutch Series | Nuclear Tigeres vs Fire Flux**\n\nPick **:** **Nuclear Tigeres to win** **|** 2 units **@ 1.65 odds**\n\nReasoning **:** just backing the team in red hot form.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrptwaq/"
    },
    {
      "created_utc": 1764599493.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 10-6-1 \n\nStreak: 2W ✅\n\nNet units: +2.56u All bets are 1 unit.\n\nLast POTD 11/30/25: Keenan Allen 03.5 receptions (-125 Bet365) ✅\n\nToday's POTD 12/1/25: Brian Burns to record a sack (-103 Draft Kings)\n\nEvent: Giants @ Patriots 6:15MST\n\nWrite Up: Patriots are going into this game without their star tackle Will Campbell. Going into this game New England has the 6th worst sack rate in the NFL with 9.4% and 7th in sacks allowed with 37.\n\nBrian Burns is second in the league this year with 13 sacks and has sacked the QB in 9/12 games this season. Overall the giants pressure rate has been below average but Burns has been a shining star in this lack luster defense. \n\nAlthough the Giants have basically the worst run defense in the NFL, New England hasn't necessarily been very effective in imposing a quality running game. I predict this game to be a fairly close contest without Will Campbell on the O-Line. The Patriots will be required to utilize their passing game to come out on top, giving Brian Burns more opportunities to take the quarter back down. \n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrpqlk3/"
    },
    {
      "created_utc": 1764599341.0,
      "author": "Elevate203",
      "text": "POTD Record: 2-0\n\nLast POTD: Amen Thompson o6.5 rebs (-138)✅\n\nEasy 💰. Also took his RA o12.5 (-138) which was sweat free 💰 \n\nToday’s Event: Rockets @ Jazz 9:10 EST\n\nPOTD: Kevin Durant o8.5 RA (-122)\n\nReasoning: I was debating between this and running it back with Amen o12.5 RA, but decided to switch it up because this line is too low to pass up. He had 11 RA yesterday vs Utah, and has went over this line 7 out of the last 10 games. Utah is a top 5 rebounding team, but the way the Rockets play defensively there will be a lot of missed shots so plenty opportunities for everyone to eat on the glass. I like Amens line too for anyone looking for added value, but I’m going to stick with if it’s not broke than no reason to fix it. Let’s get this 💰!!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrpq5ts/"
    },
    {
      "created_utc": 1764598391.0,
      "author": "Hefty_Night1892",
      "text": "Long time viewer, first post!\n\nSport League: ⚽️ Soccer | 🏴󠁧󠁢󠁥󠁮󠁧󠁿EFL Championship | 3:00pm EST \n\nToday's POTD: Birmingham City Team Total Goals - 1st Half  o0.5 (-125) \n\nWrite Up: Alright lads, here’s one I’m jumping on. Birmingham come into this one absolutely flying at home. Three straight wins at St. Andrew’s, four goals bagged in each, and most importantly for us they’ve hit the net in the first half every single time. They’re starting fast, they’re pressing high, and they’re not waiting around to get on the scoresheet. \n\nNow look at the visitors: Watford have been shaky on the road. They’ve conceded at least one first-half goal in four of their last five away matches, and they just haven’t shown they can tighten things up early. \n\nPut those trends together and it’s hard not to fancy Birmingham to find one before halftime again.\n\nTail responsibly. Bet only what you can afford to lose. Odds are from Draftkings. DM to join my soccer only betting group on Draftkings. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrpngrp/"
    },
    {
      "created_utc": 1764589901.0,
      "author": "lagambapeligrosa2",
      "text": "POTD record: 15-13 -0.68u\n\nlast pick: broky under 15.5 kills map 1 at 1.82\n\nCS2 Budapest Major | Parivison - NIP\n\ntoday’s pick: NIP to win map 2 at 1.80 3u (bet365)\n\nMap 2 will be NIP’s pick and they most likely go with Train. Parivision perma bans Nuke, but Train is probably their 2nd worst map,  They are 3-4 on this map in the last 3 months, but mostly played T2 opposition. Nip beat them 13-2 the last time they played each other in September. Parivision also hasn’t played this map in over a month, while NIP already played it twice in Budapest with a 13-5 win over Fluxo and 13-2 win over Lynn Vision!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrp2rp5/"
    },
    {
      "created_utc": 1764587311.0,
      "author": "san_solares",
      "text": "35-15-9\n(W/L/P)\nNet Units: +59.8U \n\nToday’s POTD: Bologna TT O 1.5 Goals - (-150) - Serie A - Bologna v Cremonese - 5U to win 3.33U\n\nBologna is still undefeated at home this seaaon, scoring over 1.5 goals in their last 4 out of 5 games. On the flip side, Cremonese is really solid defensively, but I firmly believe Bologna is a strongly superior team. \n\nBOL and tail responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nroxw91/"
    },
    {
      "created_utc": 1764586341.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 14-7, +5.87u\n\n**Previous Pick:** Turkey to win by 14 or more points, 1.83, 1.5u ✅️, (last 5: ❌️✅️❌️✅️✅️)\n\n**Event:** World Cup qualifications: Cyprus - Germany, 18:00\n\n**POTD:** Germany to win by 35 or more points, 1.92, 1u\n\nDefending World and European champion has to play qualifications for the new World Cup; once again, FIBA outdid itself.\n\nAfter a first round in this group, it is clearer who brought what to the table: Croatia won big as expected against Cyprus, 40 points; they added Hezonja from Madrid for this window. Germany beat Israel 89-69, and one can say they struggled there, 7/28 for three points, but still won by 20.\n\nTheir coach is back from illness, and obviously, this mixed new group hasn't played a lot together. Still some very good players here, from Bayern, Alba, Madrid, Partizan, Ulm...\n\nWith 3 more days of training, it should look much better today, and I like everything: the halftime spread, Germany's total points, and the spread, but conservatively going with the spread. Back to the standard 1 unit for this one.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrow6nb/"
    },
    {
      "created_utc": 1764585935.0,
      "author": "Dangerous-Ad4255",
      "text": "Record:  \nPlay of the Day: **11-3-1**  \nNet Units:  \nPlay of the Day: **+7.31**\n\nWrite-Up:\n\nYesterday’s Villa play ended in a push — close, but we move on.\n\nFor today’s POD, I’m rolling with a spread I really like. Detroit is in a strong spot, and the scheduling advantage should be strong.\n\n**Play of the Day**  \nNBA | Detroit Pistons vs. Atlanta Hawks  \n**Pick: Pistons -9.5 @ 1.94 (-106) | 1 Unit**\n\nThe Pistons are playing really well right now. That win over Miami was a big one — cutting their two game losing streak. They had back-to-back losses before that Heat win (on the road at Boston and then at home vs. Orlando), so I like the idea of them coming out strong in front of their fans tonight, trying to reset things on their home floor.\n\nAtlanta is simply in a brutal spot. They’re coming off a double-overtime game where their starters logged huge minutes, and now they have to travel. Even though the Hawks have been playing well and might want payback after losing 112-120 to Detroit earlier, this is the exact kind of scheduling spot where tired legs show up — especially late in games.\n\nDetroit, meanwhile, is fresh and getting healthier, with Jalen Duren listed as probable and the Pistons rested, motivated at home, and catching a Hawks team that just emptied the tank last night, I think Detroit should be able to pull away as the game goes on.\n\nI’m laying the points with the Pistons. The momentum, the rest advantage, and the spot should be enough for them to have a double digits win.\n\nhttps://preview.redd.it/1iwiyow5nk4g1.png?width=313&format=png&auto=webp&s=f168ee6e7a295477084c97f7f95ce4b4bd051a90\n\nLet’s see if we can cash this one.Good luck",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrovh7p/"
    },
    {
      "created_utc": 1764585882.0,
      "author": "1234unodostrescuatro",
      "text": "__Record: 17-12__\n\nForm (old to new): ❌✅✅✅❌✅✅✅✅✅❌✅✅✅❌❌✅✅❌✅❌✅❌❌✅✅❌❌❌\n\nLast pick: CMC O37.5 rec yds (-110❌\n\nGame: HOU@UTAH\n\n__Today’s pick: Steven Adams O6.5 reb (-125)__ \n\nAnalysis: Big man grabs boards",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrovdwu/"
    },
    {
      "created_utc": 1764583121.0,
      "author": "Much-Scheme",
      "text": "Record: \nNet Units:\nROI:\nFootball | NFL | 8:15 / EST\nPick: NEW ENGLAND -7 @ -110\nWrite Up: Giants are 0-7 straight up and 0-7 ATS on the road this year with a -8.6 margin of victory (MOV) and -1.9 against the spread (ATS). On the flip side the Patriots are 4-1 at home ATS with a MOV of +11.0 and +4.4 ATS. This spread is more reflective of each teams MOV and not the ATS.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nroqrwo/"
    },
    {
      "created_utc": 1764583072.0,
      "author": "livebreathefootball",
      "text": "**Record:** 26-34 (2 push)\n\n**Net Units:** -2.71 units\n\n**Soccer | Serie A | Bologna vs Cremonese**\n\n**Pick:** Bologna -1 Asian Handicap win @ 1.76 [1 unit]\n\n**Reason:** Bologna are unbeaten at home this season (4 wins, 1 draw), and they are currently on a 9 game unbeaten run in the league (6 wins, 3 draws).\n\nAfter a decent start to the season, Cremonese have lost their last 3 league games.\n\n**Tips:** Always appreciated but not required\n\nhttps://ko-fi.com/livebreathefootball\n\nBTC:\n3BuxnXuMfJFDg7owCTaJNEykiBX8kAri4Y\nETH: 0x379448d48Fc6e3954DE03B52cfC5FcB288506AB8",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nroqp2o/"
    },
    {
      "created_utc": 1764582370.0,
      "author": "Lumpy-Dentist3891",
      "text": "POTD Record: 3-1-0\n\nLast POTD: **Total Corner Over 10 @ 2.37 1.5U (Bet365)** ❌\n\nSorry about this loss. The game script didn't go as predicted. They played at a slow pace, had narrow defending, no chase, an early red card, and a shorter time interval between goals. I'll take corners next time when there is more on the line. We move on.\n\nToday's Pick: **Cade Cunningham Double Double - Yes @ 1.8 2U (Bet365)**\n\n**NBA | Hawks v Pistons**\n\nFirst of all, I like this kind of match-up. Pistons are on top of the Eastern Conference right now, and Hawks are competing against their conference top rival and would love to win them. Both teams will have to make use of their star players. So, rest assured, Cade Cunningham is gonna have high usage and full minutes. \n\nAs Detroit's lead guard and main creator/scorer, Cade will have heavy touches and will lean on him to set the tempo and offense. Detroit also has one of the top 5 FG% in the league right now in their last 10 games (They are scoring with more than 50% -> good for assist).   \n  \nCade's home split with 30+ min, this has hit 5/6 times.  \nCade vs Dyson Daniels: 6/6 hit rate.  \n  \nGL 🍀.\n\nMy bets are being tracked [here](https://www.potd.lol/handicapper/Lumpy-Dentist3891-T7Acgq). Thanks to the tracking team.\n\nhttps://preview.redd.it/o10dr3rh8k4g1.png?width=448&format=png&auto=webp&s=b62d5f81c2c80a956fafe5123be3685e768ec0bd",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nropkh9/"
    },
    {
      "created_utc": 1764575196.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 176-132\n\nSeason record: 13-9\n\nLast POTD: __Cade Cunningham Double Double @1.86 1U__ ❌\n\nToday’s POTD: __Ryan Kalkbrenner O6.5 PA @1.74 1U (Bet365)__\n\nNBA | Hornets vs Nets | 🏀  \n\nPaced first quarter with 4 and continued to set up his teammates that kept bricking, finishes at 8 assists after a very strong start. Hope some of yall tailed the picks in the props channel. We move\n\nNets have been a funnel for players who do their work in the RA where they’ve allowed 4th most points this season, perfect for the Hornets center who scores 90% of his buckets from that area. Has smashed this line this season, with 16+ minutes he’s over in 10/L10 games avg 10.3 PA with a 82% hit rate over the course of the season with the same filters avg 9.9 PA. This includes a game against the Nets where he had 11 PA with 4 potentials in 26 minutes.\n\nOn the road he’s over in 6/6 games with 23+ minutes, something he’s seen in every road game except once which was a big blowout win against the Wizards. Expecting close to his season avg in minutes here which should be 25+. With 25+ min he’s over in 11/12 games this season avg 11.1 PA.\n\nGreat spot for Kalkbrenner here to continue his streak, would run 6.5 points alone if 6.5 PA isn’t available as the read is ultimately for him to score against a good matchup. \n\n\n🫡 https://ko-fi.com/billycapezzi",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nroe009/"
    },
    {
      "created_utc": 1764574787.0,
      "author": "this_guy9",
      "text": "POTD Record: 13-8\n\nNet Units: +7.23\n\nPrevious Pick: [✅ Amen Thompson o6.5 Rebounds -125](https://www.reddit.com/r/sportsbook/comments/1pa3lqk/comment/nriu34h/)\n\nAmen cashes with ease on a good read. Starting to get on a roll here... Let's get three in a row.\n\n**🏀 Evan Mobley Double-Double -130** vs the Indiana Pacers\n\nMostly a rebounds play, double-double for some extra juice. \n\nPacers absolutely bleed rebounds to PFs and Cs as a bottom tier rebounding team. Mobley specifically dominates this matchup. He's cashed in L5/6 vs the Pacers, recording 12+ rebounds 4 times.\n\nRecently, Mobley has cashed in L4/5 averaging 11 rebounds a game in that time span over a very solid 34.6 minutes / game.\n\nJarrett Allen out is huge, with no other viable C or PF on the roster, expect rebounds to filter down to Mobley.\n\nRest splits add a benefit as well. Over all rest days, on back-to-backs, Mobley averages more rebounds than other days of rest.\n\nSome blowout risk but Pacers have been playing decently well, and at home, I expect Mobley to cash.\n\nFull stats if you'd like to do additional research (rebounds):  [https://www.statpick.ai/65280917/evan-mobley-rebounds](https://www.statpick.ai/65280917/evan-mobley-rebounds)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrodbkm/"
    },
    {
      "created_utc": 1764571620.0,
      "author": "Supreme_Warzone",
      "text": "POTD Record: 2-1\n\nLast POTD: Dalton Shultz Over 41.5 Receiving Yards ✅\n\nEvent: New York Giants Vs. New England Patriots 8:15 PM EST\n\nToday's POTD: Tyrone Tracy Jr. Over 2.5 Receptions\n\nOdds: -115\n\nWrite Up:\n\nRole & usage:\nTyrone Tracy isn’t just a random RB2:\nOn the season he has 103 carries for 398 rushing yards and 21 receptions for 206 receiving yards – about 20.6 receiving yards per game.\nESPN’s outlook notes that when he’s the lead guy, he plays around 67% of the snaps with roughly 13.2 carries and 3.5 targets per game, which is solid passing-game usage for a RB.\nSince returning from his recent injury, he’s had at least 3 receptions and at least 4 targets in 3 of his past 4 games.\nSo 2.5 receptions is below his realistic involvement when the Giants are in “normal” and trailing game scripts.\nOn top of that, team beat coverage highlighted that in the recent loss to Green Bay, Tracy had 4 receptions as part of 88 all-purpose yards, and the coaching staff has talked about his versatility and importance to the offense.\n\nMatchup: Patriots force RB targets\nThis is the big one.\nThe Patriots defense this year:\nIs one of the best overall units in the league – allowing just 18.8 points per game and ranking top 10 in both yards allowed and scoring defense.\nHas not allowed majority of RB’s to rush for more than 50 yards in a game all season.\nSo running straight at them is a bad plan. Teams adjust by throwing to their backs:\nNew England has allowed the second-most receptions to running backs in 2025: 65 catches heading into this week.\nCBS’ positional stats have RB vs Patriots averaging 6.58 targets and 5.42 receptions per game for 34.2 receiving yards, which ranks them as the #1 easiest matchup for RB receiving production.\nSo structurally, this is a defense that:\nShuts down rushing efficiency,\nPlays solid coverage downfield,\nBut willingly gives up underneath throws and checkdowns to backs.\nThat’s exactly the profile you want when you’re betting a RB receptions over.\n\nGiants’ situation & game script:\nThe Giants are in full “we’re outgunned” mode:\nThey come in 2–10, scoring 22.0 PPG but allowing 27.8 PPG, with a bottom-tier defense by yards and points.\nThe Patriots are 10–2, scoring 26.5 PPG and allowing just 18.8 PPG.\nThe line: Patriots -7.5, total 46.5, with NE about -410 ML and NYG +320.\nEverything points to New England playing from ahead at home:\nCovers’ preview leans Patriots early and often, even making their best bet Patriots -4 1H, expecting NE to jump out in the first half.\nVSiN also notes that New England is undefeated straight-up as a mid-range favorite and consistently handles weaker teams.\nFor Tracy, that’s gold:\nIf the Giants are behind, Jaxson Dart (their mobile QB) will be forced to operate in pass-first, shotgun-heavy sets.\nAgainst a front that stonewalls traditional runs and brings pressure, the natural counter is quick checkdowns and designed RB routes – dump-offs, angle routes, screens.\nYou don’t need the Giants offense to be good; you just need them to be behind and trying, which is exactly what this spread implies.\n\n“Who guards who” & how the Pats defend it:\nThe Patriots’ coverage philosophy under Vrabel/McDaniels this year has been:\nTake away your primary explosives (WR1/WR verticals, big tight-end seams)\nMake you play patient, underneath football\nRally and tackle with disciplined LBs and safeties\nThat shows up in:\nVery strong overall defensive efficiency and points allowed, but\nA ton of RB receptions allowed (second-most in the league).\nSo you’re not betting Tracy to win 1-on-1 vs a shutdown corner; you’re betting him to be the safety valve against zone looks and pressure, drifting into the flat or settling over the middle for easy 3–7 yard catches. That’s a role, not a matchup you can “take away” with one DB.\n\nPace & play volume:\nBoth teams play at fairly normal NFL tempos; this isn’t a clock-killing slugfest like 38 carries per side.\nWith New England’s offense humming (top-10 in yards and points) and the Giants’ defense among the worst in the league, we can reasonably expect New York to face a lot of drives and pass plenty in the second half.\nMore drives + more dropbacks = more chances for Tracy to pick up cheap receptions, even on 2nd-and-long or 3rd-and-medium when Dart checks it down.\n\nWeather:\nFoxborough tonight is classic late-season New England: cold but not extreme, mostly dry, no crazy snowstorm scenario.\nCold weather can push teams slightly more toward the short passing game and runs – again, helpful for RB reception props, and not a major concern for catching 3 dump-offs.\n\nWhat could go wrong?\nAlways important to be real about the ways this can lose:\nGame script flips: If the Giants somehow jump out early and they are the ones protecting a lead, you’d see more traditional runs and fewer checkdowns.\nUsage fluke: If Devin Singletary or another back unexpectedly takes most of the passing-down work, Tracy’s routes and targets could dip.\nUltra-low volume game: If New England absolutely smothers the Giants and NYG has like 40 total plays with Dart imploding, even good roles can come up short.\nInjury: Any in-game injury to Tracy obviously kills the prop.\nBut given his recent usage (3+ catches in 3 of last 4), the Pats’ defensive profile vs RBs (second-most RB receptions allowed), and the likely trailing script for a 2–10 Giants team, those feel like risks, not the base case.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nro7sov/"
    },
    {
      "created_utc": 1764570424.0,
      "author": "Ralphjinasseater",
      "text": "Record 10-11-2\n\nLast pick: Miles Bridges U 24.5 Points (-125)❌\n\n\nPick of the Day: Anthony Davis o 2.5 Assists \n (-120 DK)\n\n- AD has quietly become a steady playmaker over the past two seasons. He cleared this line in 63% of his games last year and is off to a strong start again, going over in 4 of 5 while averaging 3.2 APG on 6 potential assists. He draws a great matchup against the Nuggets, who have struggled to contain PF playmaking. Over their last seven games, Denver ranks 26th in assists allowed to PFs (5.5 APG) with a 77% hit rate on the season for the position.\n\n- Recent PFs to beat this line vs. Denver include Harrison Barnes (5), Jaren Jackson Jr. (4), Zion (5), and Julius Randle (8).\n\n- AD consistently creates easy looks because of the defensive attention he commands. Opening up cuts to the rim and corner threes, two areas where Denver has been vulnerable lately, ranking bottom-10 in points allowed at both spots over the last five games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nro5li9/"
    },
    {
      "created_utc": 1764570236.0,
      "author": "Sad-Appearance222",
      "text": "POTD Record : 2 - 0\n\nNet Units : +1.48\n\nLast pick : Aston Villa ML = 1.50 + Chelsea vs Arsenal total Over 1.5 goals = 1.31\nTotal odds 1.96 (1 Unit) ✅\n\nEvent : La Liga, Rayo Vallecano vs Valencia + Italy Serie A, Bologna 1909 vs Cremonese.\n\nPick : Vallecano vs Valencia Over 7.5 corners = 1.23 + Bologna vs Cremonese Over 7.5 corners = 1.42\nTotal odds 1.74 (1 Unit)\n\nWrite Up : \n\n* Rayo Vallecano has over 7.5 corners in last 5 games, 4 of them were over 10.5 corners match. Valencia has over 7.5 corners in their previous matches except 2. So, today I'm going for over 7.5 total corners.\n\n* Cremonese has history of high corners matches. Both Bologna and Cremonese covered over 7.5 corners in most of their pervious matches. There is a high probability of over 8 corners in this match.\n\nGood luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nro58yu/"
    },
    {
      "created_utc": 1764567245.0,
      "author": "Full-Strawberry-437",
      "text": "Record: 0-0\n\nGame: Giants @ Patriots\n\nPick: Demario Douglas O14.5 Rec Yds (-118) 3U\n\nWrite Up: Demario has gone over this line in 8 straight weeks and on the season he has gone over his line 7/11 times. He can easily clear this line in one play like he did last week.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrnzatr/"
    },
    {
      "created_utc": 1764567052.0,
      "author": "Business_Platform_63",
      "text": "Record 0-0\n\n(I'm either taking a long hiatus or we grow the bankroll)\n\nEvent: Giants vs Patriots 8:15pm EST\n\nPOTD Demario Douglas Longest Reception Over 11.5 -115\n\nHe has hit this in 5/5 🎯 of his last games and I think the line is super low. Maye loves the passing game and it always seems like Pop makes the big plays.\n\nHis recieving yards are also at great value.\n\nhttps://preview.redd.it/tqouxjo23j4g1.jpeg?width=1206&format=pjpg&auto=webp&s=8f9952e8fd76329e6c00b21b55780d565f64c677\n\nI did a large straight bet and combined it with others.\n\n(I also like Hooper over on receiving yards. He came out strong after coming back from concussion protocol. Sprinkled a little with a Dart rushing td since he has a streak going)\n\nLet me know if you decide to tail. Can't promise a win but I'm putting all my chips on it.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrnyw4i/"
    },
    {
      "created_utc": 1764566301.0,
      "author": "No_Lack_505",
      "text": "Record: 0-0\n\nNet Units: 0\n\nROI: 0\n\nSport: NFL\n\nEvent: Patriots vs Giants\n\nEvent Time: 8:15 pm EST\n\nPick: Patriots -6.5\n\nReason: Basing this off of gut and stats. Drake Maye looks very promising this year and the giants are in a downward streak this season bc of injuries. Give me the Patriots -6.5",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrnx9im/"
    },
    {
      "created_utc": 1764566058.0,
      "author": "D0N_L0U1S",
      "text": "Record: 29-15 Record on YT (in bio)\n\nPOTD Record: 3-0\n\nRecap: We took Ayton to go over his Rebounds at 8.5 easily cashed with 12 Rebounds and also went 5-1 on my picks on YT to continue my 13-5 run.\n\nPOTD: Giannis O 46.5 PRA (-114)\n\nReasoning: Giannis is going up against the worst defence in the league i dont need to say much more than that. The only risk of him going under if its a blowout but i dont see that happening plus he went over this against the wizards about a month ago with 56 PRA on only 27 mins of gametime. I have more picks on YT if interested.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrnwqbl/"
    },
    {
      "created_utc": 1764564514.0,
      "author": "Flashy-Season4183",
      "text": "Record: 0-0 (Just starting out posting on here. I have a good following on X @bc3putts because of my handicapping record/history)\n\nNet Units: 0.00\n\nROI: 0%\n\nSport: NCAAM Basketball\nEvent: Iona @ Delaware \nTime: Monday December 1st 7pm\nTime Zone: EST \n\nPick: Iona -2 +100 (ProphetX) can get -1.5 on DK for -115 Risking 1U to win 1U\n\nWrite Up: This game is very intriguing to me. It’s a\ncomplete contrast of the tempos. Iona ranks 18th in adjusted tempo compared to a Delaware team that ranks 258th in the country. I also like the average offensive possession length differential between the two. Iona ranks 52nd and Delaware ranks 356th in the country. Iona likes to run, Delaware likes to slow it down. Iona won’t be slowed down. Delaware will be playing catch up all game long and have to cave to Iona’s style of play. \n\nIona scores 85ppg\nDelaware only scores 69ppg\nIona averages 8 more shot attempts a game than Delaware.\nIona averages 5 more made free throws a games and 5 more rebounds a game than Delaware. These are all more scoring opportunities in Iona’s favor. \n\nIona (5-2) has beaten a lot of good teams including Hofstra, Fordham, Princeton, and Oregon State. With losses to a stout Akron team and a gritty Green Bay squad. Iona = battle tested. \n\nDelaware on the other end comes into this matchup 2-4 on the year including a loss to a non D1 opponent. Their best win is vs a 1-7 UNC Greensboro team and that was their last game. Delaware = not battle tested. \n\nThis spread of -1.5 doesn’t make much sense to me. I have this game handicapped at Iona -5.5. \n\nI simply don’t think Delaware has the offensive fire power to keep up with Iona. \n\nMy prediction for the game is Iona 82 Delaware 73\n\nLet’s rock",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrnt13c/"
    },
    {
      "created_utc": 1764561223.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 57-28-1 (+63.95u)\n\n__Previous Pick:__ [✅ Courtland Sutton longest reception o20.5 yards (-120), 3.6u](https://www.reddit.com/r/sportsbook/s/FyAuHbkuyQ)\n\n__Event:__ NFL: Giants @ Patriots 8:15pm EST\n\n__POTD:__ TreVeyon Henderson o63.5 rushing yards (-115), 3.45u to win 3u\n\n__Write Up:__ Great matchup this week against the Giants who allow 157.2 rushing yards per game, LAST in the NFL. The Giants are allowing a league-high 6.2 yards per carry to running backs. They are also allowing a league high 2.23 yards before contact per run. They have given up the most explosive runs this season allowing a 15+ yard run on 9.6% of runs & have given up the most 20+ yard runs in the NFL (15) and 40+ (6). The Giants are last in defensive EPA against the run (-50.5). Last week Jahmyr Gibbs went off for 219 rushing yards on just 15 carries, averaging 14.6 yards per carry. TreVeyon is averaging 5.4 yards per carry in his 5 starts & Vegas has his rush total at 14.5 carries, which would equate to around 75 rushing yards. Henderson the last 3 weeks: 330 total yards, 252 yards after contact, 10 rushes for 1st down, 12 missed tackles forced. He has had 20+ Touches in consecutive games. Had a 72.4% backfield share last week, even after Stevenson returned. Stevenson had just 6 rushes for 5 yards. This is Henderson’s backfield. \n\nPats favored by -7.5 at home. They have trailed at halftime just once this season, fewest in the NFL. The Pats will play with the lead & feed TreVeyon.\n\n__TreVeyon Henderson o63.5 rushing yards__\n\n*Official write-up coming in the morning*\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial) - [PayPal](https://paypal.me/joeinglesofficial) - [Bitcoin](https://pastebin.com/raw/GEXAsA2S)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrnl27a/"
    },
    {
      "created_utc": 1764560387.0,
      "author": "Ok_Understanding9607",
      "text": "Record 0-0\n\nPOTD: TreVeyon Henderson (New England Patriots)\n\nProp: Over 60.5 Rushing Yards (BET365)\n\nOdds: ~ -115 (Implied 53.5%)\n\nTrue Probability: ~75%\n\nInvestment Strategy:\nThis prop should be the foundational piece of any Week 13 portfolio. The margin for error is significant; Henderson could perform well below his recent averages and still clear this number simply due to the Giants' defensive efficiency (or lack thereof).\n\nIf Lawrence is ruled out or limited, the confidence in this prop moves from 95% to near-certainty, as the interior of the Giants line would collapse entirely. Bettors should monitor the inactives list 90 minutes before kickoff, but the recommendation stands regardless of Lawrence's status due to the perimeter weakness caused by Thibodeaux's absence.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrnixhn/"
    },
    {
      "created_utc": 1764556491.0,
      "author": "Lyx97",
      "text": "Record: 5-2-2.\n\nNet Units: +1.37.\n\n*Prev Pick : B8 Map handicap +1.5 @ 1.55 (1u) --> Loss (just going to say, sorry & im not going to bet on CS2 this stage. the teams are too damn inconsistent).*\n\nCricket | BBL Women | Hobart Hurricanes Women vs Melbourne Stars Women | in \\~5.5hrs.\n\nMelbourne Stars Women win @ 2.15  (1u).\n\nWrite Up: Now onto the match, i think the Stars have a decent chance of getting a win here, especially considering the form their players are in + they beat Hobart quite convincingly just 5 days ago.\n\nHope we turn around & BoL\n\nEdit : Real sorry guys. Didn't expect this match to go south this fast. Will surely bounce back, but don't know what to say about this bad run",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrn8n4w/"
    },
    {
      "created_utc": 1764554979.0,
      "author": "Substantial-Pay-4591",
      "text": "I wanted to see how well I could do taking my best pick for a month, so let’s start tomorrow. Giants +7.5 would’ve been a great one, but I’ll throw something else out there. Technically I made a terrible Thanksgiving pick, but want to start the slate clean\n\n0-1 (-1u)\n\nDarius Slayton longest rec o17.5 yards -115\nRisk 1.15 u to make 1 u\n\nIn the last 4 games Slayton has played, he has hit this in each of those games. 3 of them being with Dart and last week with Jameis. With lots of attention being paid to Wan’Dale last week and with the possibility that New York throws a lot (Dart 30.5 pass attempts), I think there’s a good chance Slayton hits this again.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrn4i65/"
    },
    {
      "created_utc": 1764554232.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 14-8 (+14.60$)**\n\n\nLast POTD: 2 Pick Parlay: Buffalo Bills ML/Houston Texans +14.5 -112 (2.50$ TO WIN 2.24$)✅\n\n**POTD: 2 Pick Parlay: New England Patriots -2.5/Total Points Over 40.5 -135 (2.50$ TO WIN 1.85$)**\n\nWrite up: My model says this is the top play for the day. I will always try to get odds that between +100 & -120 for you all.\n\n• ⁠Have been playing around with spreads and over/under with the model and we are 2-0 since parlaying both - let's keep the train rolling \n\n• ⁠Model is showing Giants should be 4–5-point dogs\n\n• ⁠ Model says Patriots has a 69% chance of winning - New England should be able to win by more than a field goal\n\n•  Model is projecting around a 50-point game, indicating that the Patriots will score, and we put the trust in Dart to get some points on the board for NYG\n\n•  Model's final score estimate is set at Patriots 30 - 24 Giants \n\nBOL!\n\n**POTD: 2 Pick Parlay: New England Patriots -2.5/Total Points Over 40.5 -135 (2.50$ TO WIN 1.85$)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\nhttps://venmo.com/u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrn2gqg/"
    },
    {
      "created_utc": 1764552227.0,
      "author": "2thyKing",
      "text": "Record: 1-1\n\nNet Units: -0.22u\n\n￼Last pick: Raptors @ Hornets Moussa Diabate OVER 7.5 reb ✅\n\nMoussa balled out and put up 9 boards in 25ish minutes. I think his minutes share is going to increase going forward as he’s consistently outplaying and outhustling Kalkbrenner. Something to watch for 👀 \n\n￼Today’s pick:\n\nNFL Football 🏈 \n\nNew York Giants @ New England Patriots | 8:15PM EST / GMT -5 (24 hours from time of comment)\n\n2-leg parlay \n\nPatriots -6.5 alt line + TreVeon Henderson OVER 50 rush yards alt line\n\n(+116 DK) 2 units\n\n￼Write Up: The Giants are terrible, and the Pats should have no problem beating them soundly. Although they haven’t been especially sharp in the last couple games, the Giants lack any cohesive strategy, have a QB returning from injury and have a couple new coaches. They are utterly rudderless and probably have no motivation to dig deep in ice cold windy conditions at Foxboro. I think the one touchdown differential is pretty safe here.\n\nThe weather and game script will call for plenty of ground and pound with emergent RB TreVeon Henderson. Due to the timeshare with Rhamondre Stevenson I’m opting for his alt line of 50+ rush yards. Should be easy as the Giants rush defense is currently Swiss cheese.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmx0v9/"
    },
    {
      "created_utc": 1764551832.0,
      "author": "pubsubpounder",
      "text": "POTD Record: 2-2\n\nPrevious pick: **Tampa Bay Bucs ML ✅**\n\nToday's Event: **Pittsburgh Penguins vs. Philadelphia Flyers**\n\nPick: **Penguins +1.5 -185**\n\nWrite Up: Backing the penguins who are 17-7 ATS this season. Pittsburgh’s history of competitive games vs. Philadelphia, their recent record in close games, and relatively even recent scoring/defense rates..betting on them staying within 1.5 goals is a statistically defensible expectation. Pittsburgh still has Sydney Crosby who is always a threat. The flyers are not good enough to keep this one clean. Plain and simple.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmvyjk/"
    },
    {
      "created_utc": 1764551697.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 201-151\n\nUnits Won: +104.66u\n\nLast Pick: NicX U 9.5 Headshots Map 1 + Staehr>INS Map 2 Kills (+113)✅\n\nToday's Pick: **HexT>SkullZ Map 1 Kills + Nota>Ewjerkz Map 1 Kills (+152)** 5u\n\nTeams/Times: Imperial vs. M80 (11:30 AM EST.) | Ninjas in Pyjamas vs. PARIVISION (9:00 AM EST.)\n\nhttps://preview.redd.it/g4srjpparh4g1.png?width=240&format=png&auto=webp&s=0248b9fcc5f0277e6a6a44e79381641ad46dc274\n\n**HexT>SkullZ Map 1 Kills (-147)**\n\n* Imperial are the higher seeded team coming in, this should mean they pick their map 2nd\n* M80 very likely to pick Mirage, their is a world I could see them go for Train but its really hard to see them going for a punish pick with how good/dominant their Mirage has been (100% winrate L3 months 12 maps)\n* SkullZ is averaging a .63 KPR L3 months for Imperial, HexT is averaging a .69 KPR L3 months for M80\n* SkullZ is averaging a .59 KPR L3 months for Imperial on Mirage, with a .58 KPR in the L6 months\n* HexT is averaging a .91 KPR L3 months for M80 on Mirage with a .78 KPR in the L6 months\n* Model gives this line \\~85% chance of hitting if map is anticipated map of Mirage\n\n**Nota>Ewjerkz Map 1 Kills (-200)** ✅\n\n* Ninjas in Pyjamas are the higher seeded team coming in, this should mean they pick their map 2nd,\n* PARIVISION are very likely going to pick Dust 2 as a punish pick, this was their previous first pick and still is % wise their highest first pick map\n* PARIVISION are 83% winrate on Dust 2 in the L3 months, NIP are 25% winrate\n* Nota is averaging a .69 KPR L3 months for PARI and a .71 KPR in the last month\n* Ewjerkz is averaging a .63 KPR L3 months for NIP and a .61 KPR in the last month\n* Nota is averaging a .84 KPR L3 months on Dust 2\n* Ewjerkz is averaging a .52 KPR L3 months on Dust 2\n* Model gives this line \\~90% chance of hitting if map is Dust 2\n\nOverall getting \\~90% ROI from this parlay, model projecting a 77% chance of hit rate on this parlay, with \\~70% if you factor in other maps, very good value and getting at +150",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmvl81/"
    },
    {
      "created_utc": 1764551306.0,
      "author": "damagebabee",
      "text": "**POTD** Record 121-02-96\n\nFENERBAHCE VS GALATASARAY\n\nDate: 01 DECEMBER 2025 at 18:00\n\nBET ON: Match odds- FENERBAHCE\n\nOdd: 2.19\n\n\n\n\\- Fenerbahçe come into this match with momentum and a relatively healthier squad, while Galatasaray are under serious strain. According to recent previews, several of Fenerbahçe’s summer signings are settled in and ready — giving their coach the flexibility and depth to field a competitive, balanced XI. Meanwhile, Galatasaray face significant injury and suspension issues: their star striker Victor Osimhen is sidelined with a thigh muscle problem and won’t be available; key defender Wilfried Singo is also out with a serious hamstring injury; and due to red-card suspension, winger Roland Sallai will miss the derby. Additional doubts linger over others: defenders like Kaan Ayhan, midfielders such as Berkan Kutlu, and attackers like Yunus Akgün or Ismail Jakobs reportedly could be unavailable or not match-fit. \n\n\\- Tactically, this works heavily in Fenerbahçe’s favor. With Galatasaray missing so many defenders and offensive weapons, their usual structure will likely be disrupted — making them vulnerable at the back and less dangerous up front. Meanwhile, Fenerbahçe’s relative squad unity, fully fit attacking options, and stable back-line (despite some absentees) give them both balance and creativity. With the derby played in Fenerbahçe’s favor and their motivation high — chasing supremacy in Istanbul and eager to capitalize on their rival’s fragility — the conditions are ideal for a confident, dominant performance.\n\n\\- Given the contrast in fitness, depth and tactical readiness, Fenerbahçe appear significantly better placed to control the match and secure a victory.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmuizs/"
    },
    {
      "created_utc": 1764550468.0,
      "author": "derfderf00",
      "text": "Previous Pick: Jags- 6.5 ✅️\n\nRecord: 1-0\n\nA great win by TLaw.\n\nOn to MNF.\n\nPick: Patriots v NYG, under 46.5, 8:15 EASTERN.\n\nIm always an under guy and this game is screaming under from the rooftops.\n\nGiants getting Dart back, most people will bet over because think he wil bring spark to offense, but I think he'll be rusty plus offense was doing well without him so dont think bump will be as much as people think. \n\nBut the real bet is the injuries on the Pat's offensive line. Just dont think the Patriots will be able to build margin with thier injuries. \n\nAll picks about -110.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrms8fq/"
    },
    {
      "created_utc": 1764550135.0,
      "author": "dreamchasing1",
      "text": "Record: 231-218 Net Units: -27.32 50-52 on 1.5u plays, 38-40 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Bulgaria First League] Levski Sofia vs Septemvri Sofia\nLast pick: Levski Sofia team total over 2.5 goals @ 1.80 - 1.5 Units win\n\n\nEvent: Soccer/Football, [Turkey Super League] Samsunspor vs Alanyaspor\n\n\nPick: Samsunspor team corners over 4.5 @ 1.72\n\n\nSamsunspor have been one of the best corner generating sides in Turkey, they've cleared this line in 11/13 games this season, at home in 6/7 games. Alanyaspor have allowed allowed 5 or more in 5/13, in away games in 4/7, they've allowed vs other high corner generating sides - 6 vs Konyaspor, 8 vs Fenerbahce, while Samsunspor cleared vs other very tough matchups such as vs Fenerbahce (6 corners), Kocaelispor (7 corners), Gaziantep (7 corners).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmrb18/"
    },
    {
      "created_utc": 1764548934.0,
      "author": "Ok-Actuary-4654",
      "text": "POTD Record: 2-0-0 (+7.4 units)\n\nStreak: 2W\n\nLast 10: WW_ _ _ _ _ _ _ _ _ _ _\n\nLast Pick: Panthers +10.5 (-110) 4 units vs Los Angeles Rams\n\nLast Pick Reflections: panthers played em tough and came out with the win, thought this was a great spot for them to rebound after last weeks performance and they came through and balled out! Glad to get the win!\n\nEvent: Washington commanders Vs Denver Broncos NFL\n\nPOTD: commanders +6 (-110) 5 units\n\nFeel like it’s been the story of the dogs in the nfl this week. I for one don’t believe the broncos to be nearly as good as their record indicates, their defense is solid but their offense leaves much to be desired which could cost them if they continue to get out to slow starts. Once again I feel like Vegas is overvaluing a favorite here. I anticipate the commanders to pick apart this broncos defense and keep it close in the end. Loving that we're getting 6 points with the commies on the spread and I wouldn't be shocked to see them win outright here. Once again, will be doing 5 units on the spread and 0.4 units on the moneyline at +240.\n\n\nJust to reiterate, in conjunction with my model, I use the eye test as well as my gut feeling to play what I believe is the most-valuable pick on the slate. Cheers to a great game, and please remember to gamble responsibly and to only wager what you can afford to lose.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmnvo9/"
    },
    {
      "created_utc": 1764548598.0,
      "author": "ControlRoyal1768",
      "text": "Record: 27-16 (+29.89u)\n\nLast 10:💰✖️💰✖️✖️💰✖️✖️💰💰\n\nLast POTD: 🏈 Bills vs Steelers under 47.5 points (-108). 💰\n\nWriteup: The Steelers just gave up the most rushing yards at home since 1975. Game script ended up being exactly what we expected and more, great pick for us.\n\nToday’s POTD: 🏈 Giants +7.5 (-115).\n\nGame starts at 8:15pm EST. Bet 2U\n\nWriteup: For Monday Night Football, we have the New England Patriots hosting the New York Giants. I don’t have a ton of statistics in this one as this is more of a play using the eye test and game scenario, but I like the Giants to cover the spread. \n\nThe Giants have covered the spread in each of their last 3 games and are now going up a Patriots team that barely squeaked by against the Bengals last week, who have one of the worst statistical defenses in the history of the NFL. The Giants are getting their starting QB back in Jaxson Dart, who despite not winning many games, has been well above an average QB according to many statistical measures.\n\nOn top of this, it was expected that this offense would completely fall off the rails after their star WR Malik Nabers was out for the remainder of the season with an injury. Surprisingly, many of the Giants’s offensive weapons have stepped up in a big way in Nabers’s absence. On the other side of the ball, the Giants have a very underrated defensive front thanks to players like Brian Burns and Kayvon Thibodeaux. I expect them to get lots of pressure on the Patriots QB Drake Maye, as the Patriots starting left tackle is out with an injury.\n\nI expect the Patriots to win this one, but I also expect it to be an ugly win. Giants will keep this one within a touchdown.\n\nRemember to only bet what you can afford to lose, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmmwl5/"
    },
    {
      "created_utc": 1764547498.0,
      "author": "ptrckfrnndz",
      "text": "+1.99\n\n6 - 4\n\nSports: Tennis\n\nPrev: Linda vs tiantsoa +1.5set @5units @1.833 PENDING\n\nPICK: LINDA VS TIANTSOA +1.5SET@5UNITS @1.83\n\nTime: \n\nReasoning: when i dont post here i am winning, when i post pick i cant hit anything so maybe you should fade me but this shit will hit. I will not put anything cause if i put something it always lose. The only thing i should note here is that linda is having a hardtime vs lefties.. a lefty french playing in france we should be fine...\n\n\nYoull regret not tailing this one 😈😈😈",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmjpeo/"
    },
    {
      "created_utc": 1764546285.0,
      "author": "Square_Print_9822",
      "text": "**Pick Record: 34W - 24L    (Push: 1)**\n\n**Form:  ✅  ✅**\n\n**Previous Pick:  Crystal Palace Over 11.5 Total Shots @ 1.80 ✅**\n\n**8 shots first half, 14 total. Once again, onto the next.**\n\n—\n\n**Today's Pick: Bologna Over 5.5 Shots on Target @ 1.64**\n\n**Bologna VS Cremonese - 2:45 PM EST**\n\n—\n\nBologna are unbeaten in their last 10 games and could jump up to 3rd tmr if they increase their goal difference. Cremonese away from home simply concede too many chances and when facing top 5 opposition, this is the story of the game.\n\n—\n\n**In Cremonese's last 5 games, their opponent has covered 3/5:**\n\n**6, 6, 5, 4, 6 SOT conceded**\n\n**In Cremonese's last 6 away games, their opponent has covered 5/6:**\n\n**6, 1, 9, 6, 9, 6 SOT conceded**\n\n**—**\n\nComing up against a Bologna side that are looking to extend that unbeaten streak to 11, I see another busy day for the Cremonese keeper!\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmg3u7/"
    },
    {
      "created_utc": 1764545802.0,
      "author": "marinTAVI",
      "text": "**POTD Record: 28-11**\n\n**POTD: Miami Heat vs LA Clippers: Miami Heat most assists in a game (1.65) - Betano**\n\n* The Heat are the second team this season with the most assists per game, averaging 30 assists per game. They are also among the top nine teams that allow the most assists to their opponents, averaging 27 assists per game. The difference is +3, making them one of the top five teams in this category.\n* The Clippers are among the top 2 teams in assists per game, averaging 24 assists per game. They are among the top 12 teams that allow the most assists to their opponents, averaging 27 assists per game. The difference is -3, making them among the top 5 worst teams in this category.\n* The Heat average 30 assists per game in home games, as well as in November. The Clippers pass less on the road than at home, averaging 22 assists per game. The Clippers' assist ratio has decreased compared to October, averaging 23 assists per game in November.\n* Heat vs. other teams that struggle in this area: 31-22 (vs. Hornets), 34-26 (vs. Hornets), 32-28 (vs. 76ers), 37-29 (vs. Blazers).\n* Clippers vs. other teams that perform well in this area: 19-30 (vs. Hawks), 28-22 (vs. Nuggets), 19-24 (vs. Grizzlies), 26-28 (vs. Thunder), \n* This season, the two teams have met, and the score was 33-25 in favor of the Heat.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmeovs/"
    },
    {
      "created_utc": 1764545581.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Monday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrme207/"
    }
  ]
}