{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/1/25 (Monday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/",
  "target_date": "2025-12-01",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-30T23:41:00.885456+00:00",
  "comments": [
    {
      "created_utc": 1764545802.0,
      "author": "marinTAVI",
      "text": "**POTD Record: 28-11**\n\n**POTD: Miami Heat vs LA Clippers: Miami Heat most assists in a game (1.65) - Betano**\n\n* The Heat are the second team this season with the most assists per game, averaging 30 assists per game. They are also among the top nine teams that allow the most assists to their opponents, averaging 27 assists per game. The difference is +3, making them one of the top five teams in this category.\n* The Clippers are among the top 2 teams in assists per game, averaging 24 assists per game. They are among the top 12 teams that allow the most assists to their opponents, averaging 27 assists per game. The difference is -3, making them among the top 5 worst teams in this category.\n* The Heat average 30 assists per game in home games, as well as in November. The Clippers pass less on the road than at home, averaging 22 assists per game. The Clippers' assist ratio has decreased compared to October, averaging 23 assists per game in November.\n* Heat vs. other teams that struggle in this area: 31-22 (vs. Hornets), 34-26 (vs. Hornets), 32-28 (vs. 76ers), 37-29 (vs. Blazers).\n* Clippers vs. other teams that perform well in this area: 19-30 (vs. Hawks), 28-22 (vs. Nuggets), 19-24 (vs. Grizzlies), 26-28 (vs. Thunder), \n* This season, the two teams have met, and the score was 33-25 in favor of the Heat.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrmeovs/"
    },
    {
      "created_utc": 1764545581.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Monday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pawzk2/pick_of_the_day_12125_monday/nrme207/"
    }
  ]
}