{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/17/26 (Saturday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qev3qq/pick_of_the_day_11726_saturday/",
  "target_date": "2026-01-17",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-16T23:43:35.733568+00:00",
  "comments": [
    {
      "created_utc": 1768606816.0,
      "author": "vanillaturtle",
      "text": "Record: 4-5-0 (W-L-P)\n\nProfit: -3.5U; ROI: -23.3%; Total Units Wagered: 15U\n\n\\---------------------\n\n**Last Pick:**  ATP Adelaide  **- Fokina ML vs Vacherot** \\[2U to win 1.21U (-165)\\] **Win**\n\n \n\n**Today's Pick:**\n\n**Tennis -** Australian Open R1 - **Etcheverry ML vs Kecmanovic** \\[2U to win 1.54U (-130)\\] \n\nTime: 7:00pm EST\n\nEtcheverry hits relatively hard on his forehand side and has great movement and an above average serve. Kecmanovic is in very bad form right now losing to Muller and Vacherot in straights - I don't think he'll be able to handle etcheverry in Bo5 format even if he was in good form. Etcheverry took musetti to 3 so hes in decent form",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qev3qq/pick_of_the_day_11726_saturday/o00luw4/"
    },
    {
      "created_utc": 1768605301.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 39-22 (+12.62U)**\n\n**ROI: +16.83%**\n\nLast POTD: Pending: NCAAB: Kansas -6.5 vs Baylor -120 (1U TO WIN 0.80U)\n\n**POTD: NFL 2 Pick Parlay: Bo Nix 15+ Rushing Yards + Dalton Kincaid 25+ Receiving yards -125 (1U TO WIN 0.75U)**\n\nWrite up: My Buffalo Bills and Josh Allen got a chance to make a damn statement here - Denver may be 5,000 feet in the sky, but Wyoming was 7,000... MVP JOSH LOADING - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Kincaid at 35+ set at 52% \n\n• Model projects Bo Nix going over 25+ rushing yards at 54%\n\n• EV better betting 100$ = 9-11$ for this play\n\n• Oh boy, the day is FINALLY here - the city of Buffalo has been rocking all week - we got the Sabers having an insane run in the NHL right now, and we have Josh Allen Quarter Backing our Football Team - My Buffalo bias aside, I am not sure if superman Josh can do it tomorrow - Denver is better all around, at home, week's rest, and their defense is legit, but once again, I have said this once and I will say it again, it is very hard to bet against Josh Allen, regardless of the scenario - Alright time for the good stuff - Bo Nix has ran for rushed for 40+ the last two games, averaging 8.5 runs per game - Earlier in the season, he was hitting this line a lot, and then right in the middle of the season, he stopped rushing as much and he barely hit 10+ rushing yards - The Bills rank in the bottom 10 in rush defense, and allow around 136 YPG on the ground - in last week's W over the Jaguars, Lawrence, who I think is very comparable to Nix, rushed for 31 on 6 attemtps - Dalton Kincaid - Bills only have 3 WR's for this game, and one being Keon Coleman - Who's that, never heard of him? - Broncos rank in the bottom 15 in defensive TE stats - In all 18 games the Denvor Broncos have played this year, every TE has gone above 25+ receiving yards except for two, just TWO - and it happened to be the Jets and Bengals - Model has Kincaids line at 37.5 o/u - and as much as I would love to play his props, I have a gut feeling that it seems to easy, so I am staying away from his orginal line, and playing the ALT - This is it - please stay away from the comment section if my Bills lose, I won't be able to handle it - it'll be killing two birds with one stone if the bet loses and the Bills... - Jokes aside, I like this bet, I hope you all like it too - Be Good, Do Good, God Bless, and GO BILLS - give me the 2 pick parlay for the W\n\nPOTD History: https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn\n\nBOL!\n\n**POTD: NFL 2 Pick Parlay: Bo Nix 15+ Rushing Yards + Dalton Kincaid 25+ Receiving yards -125 (1U TO WIN 0.75U)**\n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\nhttp://buymeacoffee.com/claysmiith\n\nhttps://venmo.com/u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qev3qq/pick_of_the_day_11726_saturday/o00hcks/"
    },
    {
      "created_utc": 1768604936.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 82 - 86 Profit: -7.05 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅❌❌️✅❌✅❌❌✅✅✅❌❌️❌️\n\nRB Leipzig vs Bayern Munich, over 4.5 goals @ 2.8\n\nRB Leipzig vs Bayern Munich Over 4.5 Goals looks strong given both sides’ attacking profiles. Bayern consistently create chances at a high tempo but remain vulnerable defensively, especially away from home. Leipzig play aggressively, press high, and rarely sit back against big opponents. With quality attackers on both sides and a history of open, end-to-end meetings, this matchup has clear potential for a goal-heavy contest.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qev3qq/pick_of_the_day_11726_saturday/o00g88s/"
    },
    {
      "created_utc": 1768604774.0,
      "author": "Vander_chill",
      "text": "**POTD Record:**  106 – 70 - 11\n\n**Previous:**  Nigeria Win/Draw vs Morocco + Scottish Premier – Hearts ML vs St. Mirren – WINNING!\n\n**Recap:**  Hearts played like champs!  Early red card doen to 10 men, and found a way to win 2-0.  Nigeria managed to draw in regular time and bring us the win, only to lose in penalty kicks.  The final of AFCON is set between Senegal and Morocco. on Monday.\n\n**New Event:**  NFL – Buffalo Bills at Denver Broncos\n\n**Pick:**  Khalil Shakir Over 5.5 receptions @ 1.86 (3 units)\n\n**Full disclosure:**  This prop was recommended by the Sharp Football and I have incorporated some details from those writeups. \n\nThe Buffalo Bills starting go-to receivers have been decimated with injuries.  They have lost Joshua Palmer, Gabe Davis and Tyrell Shavers.  That leaves the team with only 3 receivers the best option of which is Khalil Shakir.  Last week vs Jacksonville he had 12 targets for 12 receptions.  All we need is 6.\n\nAs for tight-ends, apparently Dalton Kincaid has been in a walking boot this week which explains why we did not hit on our over for his yards/receptions last week.  Dawson Knox got a lot of action instead.  Regardless, Josh Allen is up against an elite pass defense.  One one which tends to pressure quite a bit.  However, Allen is a master against blitz defense and can get rid of the ball quickly. \n\nApparently 39% of Shakir catches come behind the line of scrimmage.  That is the highest for any receiver in the NFL, and is almost impossible to stop.  Besides, defenses don’t care much if a pass is caught behind the line of scrimmage as it usually does not result in more than just a couple of yards.  This is where Shakir eats and lives.  The more pressure Allen gets, the more receptions Shakir will have and we know that the Broncos defense will be coming after Allen.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qev3qq/pick_of_the_day_11726_saturday/o00fq4i/"
    },
    {
      "created_utc": 1768604756.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 24-24-5 (Avg Odds +128)\n\n**Previous Pick:** Werder/Frankfurt Over 3 goals (-110)  ✅️\n\n**Today's Event:** English Premier League (Soccer) | Leeds vs Fulham (7:00 AM PST)\n\n**Pick:** Dominic Calvert Lewin ATGS (+145) 1 unit to win 1.45 units\n\n**Write Up:** Started the weekend off with a big Friday cash as our Bundesliga match ended 3-3. Everything went about as expected and honestly the game could have easily been 4-4 or even 5-5 with the misses chances. \n\nPremier League is back after a week off and we're revisiting a past play from a few weeks ago where we cashed a big +185. Odds are a bit lower here, but I like it all the same. After his 6 game goalscoring streak and winning Premier League player of December, DCL rested most of one match and then finally came back to Earth and failed to score in the next. But I really like him in this spot as he's coming off a match with another goal last weekend in their 4-3 loss at Newcastle, and he's well rested after not playing at all mid week in the FA Cup match. \n\nDCL has scored 8 goals in his last 9 matches. To reiterate some stats from my last play, what makes this so impressive is that he's scoring against top EPL teams and top EPL defenses, not bottom tier leaky defenses. He netted against Chelsea, Liverpool, Man City, and Palace in this stretch. Leeds have also found themselves in some shootouts recently, having scored 11 goals in their last 4 home matches (DCL scoring in 3 of those 4). They've been continuing to play in fast paced, high scoring games which helps us here as well.\n\nLets talk Fulham. Fulham play much better at home than they do away. They have only kept one clean sheet on the road this season (vs West Ham). They are a middly of the pack defensive team, but are bottom 5 on the road. 19 of their 28 goals conceded this season have been in their travels, an average of 1.8 goals conceded per away game (pretty much 2 if you exclude West Ham). \n\nAll signs point towards goals in this one and I'm backing Calvert Lewin to be one of the ones that find the back of the net. BOL as always and I hope you all have a great weekend!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qev3qq/pick_of_the_day_11726_saturday/o00fo3d/"
    },
    {
      "created_utc": 1768604446.0,
      "author": "bigcocklockzz",
      "text": "Record: 19-16\n\nNet Units: 2.23u\n\nLast Pick: Ka'imi Fairbairn Over 1.5 Made Field Goals -145 (Bet365) 5u ✅\n\n**POTD: Demarcus Robinson Over 24.5 Receiving Yards -110 5u**\n\nDemarcus Robinson had a breakout performance last week in Philadelphia, catching fire for 111 receiving yards and a touchdown on six receptions while stepping up amid multiple injuries in the 49ers receiving corps. Ricky Pearsall is still dealing with injury concerns, and I like this bet whether he plays or not. Robinson’s snaps have increased with Pearsall limited or out — in Week 18 he logged his highest offensive snap share of the season (88%) filling in for Pearsall.\n\nIn his last three games, Robinson has seen 11 catchable targets and is averaging 9.20 yards per target. Over his last five games, he’s averaging 14.2 yards per reception and has recorded a 22+ yard catch in four of those five games.\n\nRobinson also profiles as a downfield option. He owns a 13.5 average depth of target, leading all active 49ers wide receivers. Over the last three games, he’s tied with Jake Tonges and Jauan Jennings in target share, and last week he led the team with a 38.89% first-read target share (Jennings/CMC at 16.67%).\n\nHe’s cashed the over 24.5 receiving yards in three of his last five games and appears to have built real rapport with Brock Purdy, asserting himself as a reliable and trusted option in the passing attack. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qev3qq/pick_of_the_day_11726_saturday/o00epak/"
    },
    {
      "created_utc": 1768604404.0,
      "author": "SP7988",
      "text": "**Record:** 37-18-1 (+18.82u) | L5: 4-1 (3W)\n\n**Last:** (CBB) Kansas -6.5 (1.5u) - Pending\n\n**POTD:** (CBB) Michigan State (-3.5) at Washington \n\n**Start Time:** 6:00 PM ET (BTN)\n\n**Odds:** -110 (DraftKings)\n\n**Units:** 1.5U\n\n**Reasoning:** There’s disrespect, then there’s making Michigan State just a -3.5-point favorite over Washington.\n\nYes, the Spartans (15-2) have only played two true-road games on the year. Sure, the team previously saw a 13-game win streak snapped by going 0-2 during a West Coast road trip last season. I know it, now you know it, and you can bet your damn ass that head coach Tom Izzo knows it. And if there’s one thing we can count on, it’s Izzo making all the necessary adjustments before Saturday’s contest. \n\nIt certainly helps that the Michigan State defense has taken up the mantle of road warriors. \n\nThrough 17 games, the unit finds itself among the nation’s elite, ranking 7th in opponent field-goal percentage (38.6%), 11th in scoring defense (64.2 PPGA), 13th in defensive efficiency (0.921) and 48th in opponent three-point shooting (30.4%). Believe it or not, the Spartans have taken that defensive intensity to an even higher level as of late, conceding just 58.7 points on a meager 36.2% shooting over their last four outings. But even more impressive is the fact that over the team’s four contests away from home, the defense ranks 2nd in scoring defense (63.3 PPGA), 2nd in defensive efficiency (0.906), 4th in opponent field-goal percentage (37.5%) and 61st in opponent three-point shooting (30.8%). That should make points difficult to come by for the Huskies (10-7), who enter this matchup ranking 75th in scoring (81.1 PPG), 81st in offensive efficiency (1.113), 154th in field-goal percentage (45.0%) and 269th in three-point shooting (31.5%). \n\nConversely, while the Michigan State offense might not wow you statistically, don’t make the mistake of underestimating the unit. \n\nThus far, the team ranks 61st in offensive efficiency (1.133), 85th in field-goal percentage (46.7%), 92nd in three-point shooting (35.5%) and 105th in scoring (79.0 PPG). And although the Spartans typically prefer to rely on their defense, the team’s offense has proven it can score in bunches when necessary. Just last time out against Indiana, Michigan State used a 20-0 run to break a 53-53 tie with just a little over 10 minutes to go to put the game out of reach. In the outing before that, the team put together a 48-point second half outburst to overcome an eight-point deficit against Northwestern. Fortunately, things should come a little easier against a reeling Washington defense that ranks 92nd in opponent three-point shooting (31.7%), 99th in defensive efficiency (1.011), 106th in opponent field-goal percentage (42.9%) and 148th in scoring defense (73.6).\n\nLook for rebounding to be the X factor on Saturday.\n\nNight in and night out, the Spartans have made a living dominating the glass. The team ranks 9th in defensive rebounding (27.3 per game), 9th in total rebounding (42.4) and 12th in offensive rebounding (12.2) while ranking 2nd in opponent total rebounds per game (28.4), 4th in opponent offensive rebounding (6.4) and 12th in opponent defensive rebounding (18.9). Although the Huskies hold their own in terms of their own rebounding—41st in offensive rebounding (11.2), 43rd in total rebounding (38.8) and 62nd in defensive rebounding (24.7)—the team has struggled to limit the opposition’s success on the glass, ranking just 108th in opponent total rebounding (33.9), 123rd in opponent defensive rebounding (21.7) and 187th in opponent offensive rebounding (9.1). \n\nWith the Seattle Seahawks hosting an NFL playoff game just two hours after tip-off, don’t expect home-court advantage to play much of a factor in this one. Trust Sparty to handle business comfortably. \n\nBOL if tailing, and as always, please do so respectfully. One bet should not have you crashing out all over Reddit.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qev3qq/pick_of_the_day_11726_saturday/o00ekla/"
    },
    {
      "created_utc": 1768604363.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Saturday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qev3qq/pick_of_the_day_11726_saturday/o00eg0v/"
    }
  ]
}