{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/20/26 (Tuesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qhkbzf/pick_of_the_day_12026_tuesday/",
  "target_date": "2026-01-20",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-19T23:44:13.737043+00:00",
  "comments": [
    {
      "created_utc": 1768866219.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 24-27-5 (Avg Odds +128)\n\n**Previous Pick:** Kaoru Mitoma TSOA (+135) ❌️\n\n**Today's Event:** Champion's League (Soccer) | Bodo vs Man City (9:45 AM PST)\n\n**Pick:** Haaland ATGS and (Game Total) Over 3.5 Goals (+116) 1 unit to win 1.16 units\n\n**Write Up:** Well we've gone ice cold, sorry guys. Definitely fade me for a bit while we retarget, but I'm going to continue posting and right the ship.\n\nChampion's League is back and I'm hoping the change will get us back on track. Bodo (Norwegian side) host heavily favored Man City as they battle for their Champion's League lives. A loss for Bodo here elimates them from playoff contention, whereas a win inches them closer to a spot. Bodo are 0-3-3 in the Champion's League. They concede a lot but also score a lot. All of their matches other than 1 (5/6) have had 4 goals or more, their most recent home match against Juventus ended 2-3. Being in Norway, winter is their off season so the team has not played a match in over a month. This means they'll have fresh legs, but may be a bit rusty. \n\nMan City are currently sitting 4th in the table and will desperately want a win here to progress towards locking up a top 8 spot and avoiding the playoffs. Man City very much need a palate cleanser after some rough EPL matches. Haaland especially has been cold and needs a goal, I'm expecting him to put in 1-2 goals here in his home country to help his team stay in the top 8. \n\nBOL and happy Tuesday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qhkbzf/pick_of_the_day_12026_tuesday/o0kkvom/"
    },
    {
      "created_utc": 1768865980.0,
      "author": "59bxbby",
      "text": "![gif](giphy|vtt9sFebFe98tSaxTJ)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qhkbzf/pick_of_the_day_12026_tuesday/o0kk57d/"
    },
    {
      "created_utc": 1768865267.0,
      "author": "Alexandre_Lopes2",
      "text": "**Record: (5-3) (+9.06u)**\n\n**Form:** ✅✅✅❌✅✅❌❌\n\n**Last POTD:** Hapoel Beer Sheva ML ❌\n\n**Event/Match:** Football | Champions League — Copenhagen vs Napoli (20:00 WET)\n\n**POTD:** Napoli ML @1.90 (4u) \n\n**Write-Up:**\n\nHoly hell, Beer Sheva goalkeeper was just atrocious last game. After only 4 minutes, he made a mistake that not even my local league keeper would make, giving Tel Aviv the chance to sit back and play far more conservatively. As the game went on, Beer Sheva created lots of chances but only managed to convert one. Then, almost in the final minute, Tel Aviv had their only shot of the entire second half. The goalkeeper was perfectly positioned, yet somehow let it in with a poor touch. With any decent goalkeeper they would have won the game, but it is what it is. Hopefully today we get a fairer outcome. Now, onto the Champions League.\n\nBoth teams come into this level on points, sitting 23rd and 24th with 7 points.\n\nNapoli are the stronger side overall, despite their inconsistent Champions League campaign so far. They sit 3rd in Serie A, competing week in and week out against a much higher level of opposition. FC Copenhagen are currently 5th in the Danish league, which already says a lot about the gap in quality between the two teams and their domestic environments.\n\nCopenhagen have picked up some important European results recently, but context matters. They are coming off a long competitive break, with no official matches since mid-December, and have only played friendlies since. Against a well-structured Conte side, that lack of match sharpness can be costly, especially early on.\n\nNapoli’s away form in the Champions League has clearly been an issue, but they’ve shown in Serie A that they can manage tough road games, recently taking points against Inter and winning away at Lazio. \n\nEven acknowledging Copenhagen’s strong home atmosphere, this is a matchup where Napoli’s superior squad quality, tactical discipline, and experience at a higher competitive level should prevail. I’m backing Napoli to get the job done and take a crucial three points in a tight but controlled away performance.\n\nhttps://buymeacoffee.com/alexandrelopes",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qhkbzf/pick_of_the_day_12026_tuesday/o0khxvr/"
    },
    {
      "created_utc": 1768865096.0,
      "author": "SP7988",
      "text": "**Record:** 39-18-1 (+22.32u) | L5: 5-0 (5W)\n\n**Last:** (CBB) Michigan State -3.5 (1.5u) - W\n\n**POTD:** (CBB) Michigan State (-10.5) at Oregon\n\n**Start Time:** 9:00 PM ET (FS1)\n\n**Odds:** -110 (DraftKings)\n\n**Units:** 1.5U\n\n**Reasoning:** “Hey, babe, wake up. Michigan State plays tomorrow.”\n\nAfter a 58-56 defeat at then-No. 13 Nebraska, the Spartans (16-2) have been on quite a roll. The team has reeled off four consecutive victories—all by double-digits—with an average margin of victory of 19.3 points. That includes our last POTD on Saturday when Michigan State delivered an emphatic 80-63 victory as just 3.5-point favorites. \n\nBut if Saturday’s spread was disrespectful, Tuesday night’s line against Oregon is just downright blasphemous.\n\nIn what is quickly becoming a season to forget, the Ducks (8-10) enter this matchup as losers of four-straight. That includes losing three-in-a-row by double-digits with an average margin of defeat of 18.3 points. In fact, after a 4-0 start, Oregon has mustered just four wins over its last 14 outings. To make matters worse, the team will also be down its two leading scorers in big man Nate Bittle (16.3 PPG) and guard Jackson Shelstad (15.6 PPG). \n\nHere’s hoping the Spartans defense is bringing its appetite to Eugene, as a feast may be in order. \nThrough 18 games, the unit ranks 8th in scoring defense (64.2 PPGA), 11th in defensive efficiency (0.920), 11th in opponent field-goal percentage (39.0%) and 30th in opponent three-point shooting (29.8%). Following an uncharacteristic performance against Cornell—97 points allowed on 46% shooting—Michigan State’s defense has been absolutely lights out, conceding just 59.6 points on 38.5% shooting (25.0% from beyond the arc) over its last five games. Furthermore, as we highlighted in Saturday’s post, the team has performed even better away from home, ranking 1st in defensive efficiency (0.951), 2nd in scoring defense (64.2 PPGA) and 5th in opponent field-goal percentage (38.8%). That all makes for absolute nightmare fuel for a shorthanded Ducks offense that ranks just  155th in offensive efficiency (1.066), 174th in scoring (75.2 PPG), 203rd in three-point shooting (33.5%) and 239th in field-goal percentage (43.2%) while averaging just 62.7 points on 38.7% shooting (26.8% from the perimeter) over its last three contests. \n\nOn the other end of the floor, the offensive emergence of sophomore guard Jeremy Fears Jr. should help the Spartans stay hot.\n\nThus far, the team ranks 60th in offensive efficiency (1.133) 83rd in field-goal percentage (46.8%), 99th in three-point shooting (35.3%) and 100th in scoring (79.1 PPG). Although known mostly for his knack for distributing the ball—he ranks 2nd nationally in assists (8.6 per game)—Fears has scored almost at will as of late, averaging 17.8 points over his last six outings. That added firepower should help Michigan State expose a reeling Oregon defense that enters Tuesday night’s matchup ranked 120th in opponent field-goal percentage (43.4%), 158th in opponent three-point shooting (33.4%), 173rd in scoring defense (74.6 PPGA) and 191st in defensive efficiency (1.058). Those numbers have only free-fallen over the team’s last four games, dropping to 82.8 PPGA on 47.8% shooting (41.6% from deep). \n\nLook for the battle on the glass to once again play a crucial role.\n\nIf the Ducks have one strength, it’s their ability to grab offensive rebounds, ranking 27th in the category (11.5 per game). Unfortunately, limiting such opportunities happens to be an area where the Spartans excel. On the season, the team ranks 1st in opponent offensive rebounding (6.2), 1st in opponent offensive rebounding percentage (18.5%), 1st in defensive rebounding percentage (81.5%) and 10th in defensive rebounding (27.2). It’s actually Michigan State which should have the advantage in the category, as the team ranks 8th in offensive rebounding percentage (38.3%) and 15th in offensive rebounding (11.9) as opposed to Oregon’s rankings of 164th in opponent offensive rebounding (9.0) and 181st in defensive rebounding (22.4%). \n\nHowever, it will be the fast break that dooms the hosts.\n\nIt’s no secret that the Spartans love to play fast. So it comes as no surprise that the team is quite elite when it comes to fast break points, ranking 8th in the category (16.9 PPG; 98th percentile). On the other hand, this is yet another area of concern for the Ducks, as the team has ranked just 232nd in fast break points allowed (10.9 PPG; 37th percentile). \n\nAnd if you’re weary of the large spread, don’t be.\n\nOn the year, Michigan State has squared off with seven opponents outside of the Top 100 in NET rating—Oregon ranks 101st. Not only is the team 7-0 with an average margin of victory of 20.0 points in those contests, but each of those victories have come by nine or more points. That includes all but two coming by 17 or more points. \n\nIn what should be yet another home road contest, trust Sparty to get the job done by 15+. \n\nBOL if tailing, and as always, please do so responsibly. One bet should not have you crashing out all over Reddit.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qhkbzf/pick_of_the_day_12026_tuesday/o0kheo9/"
    },
    {
      "created_utc": 1768864996.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Tuesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qhkbzf/pick_of_the_day_12026_tuesday/o0kh3fb/"
    }
  ]
}