{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/30/25 (Sunday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/",
  "target_date": "2025-11-30",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-30T16:17:00.795178+00:00",
  "comments": [
    {
      "created_utc": 1764518712.0,
      "author": "ptrckfrnndz",
      "text": "+1.99\n\n6 - 4\n\nSports: Tennis\n\nPrev: adriana vs sofie jannika hrdinova ml @1.79 5units ❌️\n\nPick: Linda vs tiantsoa +1.5set @5units @1.833\n\nTime: \n\nReasoning: when i dont post here i am winning, when i post pick i cant hit anything so maybe you should fade me but this shit will hit. I will not put anything cause if i put something it always lose. The only thing i should note here is that linda is having a hardtime vs lefties.. a lefty french playing in france we should be fine...\n\n\nYoull regret not tailing this one 😈😈😈",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrk032v/"
    },
    {
      "created_utc": 1764517802.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Psv vs volendam, OVER 4 GOALS @ 1.7 LOSS\n\nRecord: 76 - 75 Profit: -3.05 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrjxaay/"
    },
    {
      "created_utc": 1764513330.0,
      "author": "pubsubpounder",
      "text": "POTD Record: 1-2\n\n**Previous pick: Nebraska +7.5 ❌**\n\nToday's Event: Tampa Bay Buccaneers vs. Arizona Cardinals \n\nPick: **Buccaneers ML -190**\n\nWrite Up: Going back to tampa for this play. If this Bucs team has any hope of being taken seriously, they absolutely can not afford to drop this game. They’ve dropped 3 straight to decent competition but I think this is the one they get the tires back rolling. Arizona has probably the most one dimensional offense in the league and speaking truthfully this buc defense has been all but impressive this season. Also, Carolina is playing a tough game against L.A this week, so this is a perfect spot for tampa to make some cushion in the division. I have to back tampa here in a somewhat must win game to get back on track. They also tend to play better at raymond james and the weather here is perfect for football today. As long as the buccaneers play a sound game today and don’t let Brissett dissect that secondary, I have them covering up to -2.5. Take Tampa.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrjkqlc/"
    },
    {
      "created_utc": 1764513051.0,
      "author": "lagambapeligrosa2",
      "text": "POTD record: 15-12 +1.32u\n\nlast pick: broky under 15.5 kills map 1 at 1.90\n\nCS2 Budapest Major | Faze - NIP\n\ntoday’s pick: broky under 15.5 kills map 1 at 1.82 2u (bcgame/stake)\n\nSince we have taken the under on broky he has gone under in the next 3/4 maps. He has been terrible and form and isn’t looking comfortable on the server at all. Faze are only slight favorites and Map 1 will be NIP’s map pick, which favors the under, as there is a decent chance NIP win their pick.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrjk0t5/"
    },
    {
      "created_utc": 1764508153.0,
      "author": "CMDVN",
      "text": "Today's pick: Chelsea @ 3.60 (Unibet) - 3.5 hours\n\nLast pick: Tottenham @ 2.25 (CircusNL) - L\n\nProfit: +€922.50\n\nToday's is more of a bet for my own record so I can keep track of my (degen) bets. Tail at own caution here and make your own decision.\n\nAnyway, as Arsenal are one of the best teams right now this pick seems diabolical. Well... it is not.\n\nYeah, I know they have been on a crazy winning streak as of late, but against which teams? Out of all those teams only City, Atletico and Bayern were sort of tests. Against City they could only manage a draw, whereas City are very inconsistent themselves. Atletico might be a test, but at the end of the day that is a game where Arsenal would have to win it easily. Now the only interesting one is Bayern, which they did manage to win against. I actually thought Bayern would win it, but they played very bad that night. Lots of individual errors led to that outcome and I think if this match would repeat itself for more games that is where Bayern would statistically come on top. This game was just a 50/50 game where individual brilliance would decide the result between a loss or a win, and for Arsenal it was certainly their night in the Emirates.\n\nNow back onto Stamford Bridge where Chelsea haunted Arsenal for a long time, but now? They have struggled for 7 years to put any result against Arsenal there. If there is any time for that to change, it is certainly now. With them just winning the Club World Cup there is not a better time to put a good result up against Arsenal than today. I also think that the win against Barcelona was way more impressive than Arsenal did against Bayern.\n\nBoth teams are in form and Chelsea have been picking up theirs right on time. Today all Arsenal fans will think this will be a walk in the park. But I have seen Chelsea turning up big against giants and especially this season.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrj89av/"
    },
    {
      "created_utc": 1764506470.0,
      "author": "YGWYD",
      "text": "**SEASON RECORD:** 31-4-21\n\nNet Units: (-2.06)\n\nPrevious Pick:  Bayer Leverkusen vs Dortmund - BTTS Yes @ 1.52 ✅️\n\n**Today's Pick:**  Aston Villa vs Wolves - Aston Villa to Win @ 1.50\n\n**TIME:** 3 pm (BST)\n\n**Wager Amount**: 1.5 units\n\nLast 10 Matches (❌️❌️❌️❌️❌️❌️✅️❌️✅️✅️)\n\nGood game yesterday now lets hope to carry momentum as we head to the PL.\n\nWolves def look relegation bound at this point, only 2 points in the league, no win so far even the new manager boost wasn't available. On a 6 game losing streak, i could go on with hiw shit they are.\n\nAs for Aston Villa they are on a 4 game winning run, scoring 1st on 5/7 games and they olay at home where they have a 7 game winning streak.\n\nIn H2H matches Aston Villa have won 2/5 games with 1 draw, on a 2 game winning run at Home against Wolves and 2 draws. I think Aston Villa demolish Wolves here. BOL if you're tailing or fading given my current form lol.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrj4qzm/"
    },
    {
      "created_utc": 1764502886.0,
      "author": "livebreathefootball",
      "text": "Record: 26-33 (2 push)\n\nNet Units: -1.71 units\n\nSoccer | Ligue 1 | Strasbourg vs Brest \n\nPick: Strasbourg -1 Asian Handicap win @ 2.35 [1 unit]\n\nReason: While Strasbourg’s form has been inconsistent as of late, they have been formidable at home, having won 5 of their 6 league games. Their last 3 home league wins have also been by multiple goals.\n\nBrest have one of the worst away records in the league (1 win, 1 draw, 4 losses). 3 of those losses have been by multiple goals.\n\nTips: Always appreciated but not required\n\nhttps://ko-fi.com/livebreathefootball\n\nBTC:\n3BuxnXuMfJFDg7owCTaJNEykiBX8kAri4Y\nETH: 0x379448d48Fc6e3954DE03B52cfC5FcB288506AB8",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nriy7je/"
    },
    {
      "created_utc": 1764502805.0,
      "author": "Uneasiestwig",
      "text": "Record: 7-13\nNet units: -14.65\nLast pick: raman to win vs sparidaans @2 ❌️\n\nToday's pick:\n\nEnglish premier league 🏴󠁧󠁢󠁥󠁮󠁧󠁿⚽️\nWest ham vs Liverpool 14:05 GMT\n\nTotal goals +3.5 @2.33 (betmgm) 3u\n\nThis match up has had lots of goals between them in recent times, some of them games have had scorelines of 5-0, 5-1, 2-2 and another 5-1.\n\nWith the quality of attacking players and the poor form of the defenders for both teams, I see another big scoreline happening again.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nriy2j4/"
    },
    {
      "created_utc": 1764501345.0,
      "author": "Remarkable_Nebula116",
      "text": "**1-0**\n\n**+2 Units**\n\n**MIN Vikings @ SEA Seahawks** | **4:05PM EST** |\n\n**Last Pick:** Tyquan Thornton 5+ 1st Half Receiving Yards (-103) 2u ✅\n\n**Pick: Max Brosmer OVER 0.5 Pass TDs (-166) 2u**\n\n**Quick Notes:**\n\n* Been on a little POTD hiatus, but I'm back and ready to win!\n* The undrafted rookie QB will be making his first career start for the Vikings today after JJ McCarthy was ruled 'out' after failing to pass concussion protocol.\n* Brosmer was the FCS passing TD and passing yards leader at UNH before he transferred to Minnesota his senior year.\n* This is a must win game for Minnesota.\n* Seattle ranks #14 in passing defense and #4 in rushing defense.\n* Minnesota ranks #24 in rushing offense and #29 in passing offense.\n* Minnesota LT Christian Darrisaw currently has a 'questionable' tag with a foot injury.\n* Seattle S Ty Okada currently has a 'questionable' tag with an oblique injury.\n\n**Write Up:** JJ McCarthy has been pretty abysmal for the Vikings and even HE can throw OVER 0.5 pass TDs more often than not. I think this is beyond achievable against a mid Seattle defense that we've seen give a lot of big plays up this year. While the rankings say Minnesota’s run game is more efficient than its passing attack, I don’t expect them to run a lot or run efficiently. The Vikings still have one of, if not the best receiving corps in all of football and I think Kevin O'Connell will dial up a good amount of passing plays to exploit this Seattle secondary and put Brosmer in a great position to clear this line. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrivmv7/"
    },
    {
      "created_utc": 1764500405.0,
      "author": "this_guy9",
      "text": "POTD Record: 12-8\n\nNet Units: +5.63\n\nPrevious Pick: [✅ Pascal Siakam o0.5 Blocks +140](https://www.reddit.com/r/sportsbook/comments/1p99hqb/comment/nrfi1un/?context=3)\n\nPerfect read on the big plus money play. Siakam ends with 2 blocks vs the Bulls.\n\n**🏀 Amen Thompson o6.5 Rebounds -125** vs the Utah Jazz\n\nAmen's usage continues to be off the charts at 39.4 minute average over the last 5. In that time, he's averaging 9.4 rebounds, including 14 against the Warriors last game.\n\nHe's dominant against the Jazz, having cashed in L6/7 vs them including 10+ rebounds 4 times.\n\nThe Jazz play at an incredibly fast paced, third fastest in the NBA. Combined with Houston's top tier defense, I'm expecting a lot of missed shots and rebound opportunities.\n\nAmen is also averaging 12.4 Potential Rebounds / game, half offensive half defensive, offering a good balance to get boards on both ends of the floor.\n\nFull stats if you'd like to do additional research:  [https://www.statpick.ai/72516145/amen-thompson-rebounds](https://www.statpick.ai/72516145/amen-thompson-rebounds)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nriu34h/"
    },
    {
      "created_utc": 1764498857.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 13-7, +4.62u\n\n**Previous Pick:**Guinea to score 35 or more in the first half, 1.90, 1.5u ✅️, (last 5: ✅️❌️✅️❌️✅️)\n\n**Event:** World Cup qualifications: Switzerland - Turkey, 17:00\n\n**POTD:** Turkey to win by 14 or more points, 1.83, 1.5u\n\nTurkey obviously has a serious federation and still very good control over their clubs as they managed to assemble a very decent team for this window.\n\nMore than that, a team that would probably fight for a medal on Eurobasket. They beat Bosnia 20+ in Istanbul, and now they face a Swiss team that managed to almost win against Serbia.\n\nI don't think Switzerland can repeat anything similar here, Turkey scanned their game, they are going to close 3p attempts early on, Serbia allowed 9/12 in the first half, mostly open shots. This stopped on the second half, and the result came.\n\nI also expect full home court for Turkey, and at least 60% of fans cheering for them, a big emigration in the part of Switzerland where they play. In the small arena of 3500, it will definitely be a factor.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrirko2/"
    },
    {
      "created_utc": 1764496892.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 25-15-1\n\nSoccer\n\nLast Pick: PSG ML @ 1.62 - LOSS\n\nLast Pick Write Up: Just a very boring 1-0 loss. On the next one.\n\nNow for today..\n\nPick: Real Madrid ML + O1.5 goals\n\nWrite Up: Keeping it simple. 2nd place Real Madrid (10W2D1L, 28:12 goals ratio) takes on 18th place Girona (2W5D6L, 12:25 goals ratio). Last 4 H2H went 2-0, 3-0, 4-0 and 3-0 for Madrid. Let’s get it.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nriofpf/"
    },
    {
      "created_utc": 1764494254.0,
      "author": "Dangerous-Ad4255",
      "text": "**Record:**  \n**Play of the Day:** 11-3  \n**Net Units:**  \n**Play of the Day:** \\+7.31\n\n**Write-Up:**\n\nYesterday’s Bayern play didn’t get there, finishing 3-1. It just wasn’t their day — hit the post three times and piled up shots that refused to go in. On most days that match ends 6-1, but we move on.\n\nToday, I’m heading to the Premier League — a matchup where one team is simply rolling while the other is falling apart.\n\n\n\n# Play of the Day\n\n**Soccer | Premier League | 30 Nov, 16:05 SAST**  \n**Aston Villa vs. Wolves**  \n**Pick: Aston Villa -1 (AH) @ 1.89 (-112) | 1 Unit**\n\nThis is a classic case of a top-four contender firing on all cylinders against a side in freefall. Aston Villa at Villa Park has been really good — unbeaten at home in the league and winners of their last four here, often comfortably.\n\nThe midweek Europa League game doesn't really concern me . Villa have been good at home after European fixtures this season, winning all of them. Meanwhile, Wolves arrive in absolute shambles: six straight losses, looking every bit a relegation-bound side, and they’ve been blanked in five of those six away defeats.\n\nThis should be a perfect storm. Wolves’ tendency to open up will play right into Villa’s hands, allowing their dynamic attack to exploit the space. At a rocking Villa Park, against the league’s worst travelers, I’m backing a comprehensive, multi-goal victory.\n\nhttps://preview.redd.it/yosoce6g2d4g1.png?width=329&format=png&auto=webp&s=37d335d911282957b0ad24a53bbf0467ae6520a1\n\nLet’s see if we can bounce back.Good luck",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrik8kf/"
    },
    {
      "created_utc": 1764493276.0,
      "author": "quietchurl",
      "text": "11/30/25, 10 am PST, NFL\n\n\nTitans +6 -112 at DK\n\n\nTitans looked good last weekend and Ward was impressive. Jacksonville is average and not a TD better than Titans at this point",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nriio9o/"
    },
    {
      "created_utc": 1764490867.0,
      "author": "OliveCritical5134",
      "text": "**Record:** 28-19\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅✅✅✅❌❌✅✅✅❌✅✅❌❌❌✅✅❌❌✅\n\n**Sport:** ⚽ / German Bundesliga / Hamburger SV v VFB Stuttgart (14.30 GMT)\n\n**Net Units/ROI:** \\+24.18u / 19.66 %\n\n**Previous Pick:** *Bayer Leverkusen v Borussia Dortmund: Both teams to score @ 1.80 -- 3 units*✅\n\n**Summary:** Nobel stopped Leverkusen from winning but couldn't stop them from scoring in the end.\n\n**Today's Pick:** *VFB Stuttgart to win or draw + over 1.5 total goals @ 1.57 -- 3 units*\n\n**Write up:**\n\nAnother matchup in Germany this weekend. We're travelling to Hamburg!\n\nI simply reckon Stuttgart will win this one, but we're playing it fairly safe here based on previous stats.\n\nHamburger SV is having a rough season to say it mildly. They've only managed to pick up wins against FSV Mainz and Heidenheim (17th,18th) so far. You can tell Stuttgart are having trouble following their European campaign. I still see don't see them losing today though. Goalswise, both teams have averages above the 2.00 goals mark. HSV have an average of 2.36 goals in their matches this season, with Stuttgart exceeding that by averaging 3.18 goals per match this season. Stuttgart have scored in every single match so far as well, and we cover a 1-1 draw with this pick.\n\n**Best of luck if tailing! 🍀**\n\n**PS:** If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nriervk/"
    },
    {
      "created_utc": 1764490636.0,
      "author": "CitoelBonito",
      "text": "🔥 Day 1 — Let’s Start Cooking\n\nPick of the Day – 11/30/25 (Sunday)\n\nPOTD Record: 0–0–0\n\nToday's Pick: Russell Westbrook 2+ Made Threes (-140) – 1.5U\n\nNBA | Grizzlies @ Kings\n\nWestbrook’s been quietly solid from deep this season, sitting right around 2 made threes a night on 5+ attempts and shooting it way better than people think. The volume is consistent and the confidence is there — he’s been letting it fly.\n\nMemphis has been one of the softer perimeter defenses this season. They allow a high number of opponent threes and guards get clean looks on them pretty regularly. Late closeouts, bad rotations, and shaky perimeter discipline make them a great matchup for shooters.\n\nThis spot lines up well for Russ. Both teams play at a pace that creates extra shot opportunities, and Sacramento’s spacing gives him clean kick-out looks. If he gets his usual 4–6 attempts, 2 makes is very realistic here.\n\nTrust the volume, trust the matchup, trust the pace, trust Russ. \n \nRocking Westbrook 2+ threes to kick off the POTD run. 🔥🙏🏼💰",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrieefb/"
    },
    {
      "created_utc": 1764488986.0,
      "author": "deforandom",
      "text": "**Record**: 16-18\n\n**Previous Pick**: Corentin Moutet ML (-105) vs Alex Michelsen\n\n**Pick**: Josh Allen Anytime Touchdown +120\n\n**Write-Up**: It's been a while since I've posted a pick, as it's been brutal since starting off strong here on the POTDs... That will end tomorrow tho, as Josh Allen will bring us our 17th win, I'm liking this pick because Allen didn't score any rushing TDs in the Texans game last week, and I think Bills ML at -165 is solid value, I think they'll be coming back stronger tomorrow, there's no way James Cook/Josh Allen don't get at least 1 rushing TD in. I know the Steelers have a great defense, but Josh Allen will find a way to score at least 1 rushing.\n\nBest of luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nribqn5/"
    },
    {
      "created_utc": 1764488220.0,
      "author": "RetiredBookie",
      "text": "Record (2-2) -0.74 units\n\nPrevious Pick: Como to score and DC + BTTS Leipzig vs Borussia… horrible game\n\nToday’s pick: Villa to win either half (-334) + Brighton and Forest over 1.5 (-409) at -162 odds Bet365\n\nStake: 2.5 Units\n\nEvent: Premier League\nKickoff: 8:05 AM US central\n\nReasoning: \n\nI think the odds are super undervalued for villa at -200 on the ML, but I’m going to be extra cautious and just take them to win one of the half’s which I think they should get done. They have been jn exceptional form at home, and continue to score goals. For Brighton game, I see goals coming. Forest have scored 3+ in the last 3, Brighton is in okay form, and I seen them scoring a goal as well, so all that leads to goals, let’s turn this around, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nriahm7/"
    },
    {
      "created_utc": 1764486106.0,
      "author": "Sad-Appearance222",
      "text": "POTD Record : 1 - 0  (+.52 unit)\n\nLast pick : Manchester City ML = 1.22 + Barcelona Over 1.5 goals = 1.25.\nTotal odds 1.52 (1 Unit) ✅\nWas very sweaty, but won anyway.\n\nEvent : EPL Aston Villa vs Wolverhampton Wanderers + Chelsea vs Arsenal.\n\nPick : Aston Villa ML = 1.50 + Chelsea vs Arsenal total Over 1.5 goals = 1.31\n\nTotal odds 1.96 (1 Unit)\n\nWrite Up:\n\n* Aston Villa have 21 points to their name this season and occupy 5th position in the table. At home, Aston Villa won seven consecutive games. Wolverhampton Wanderers have collected just two points from twelve league fixtures, currently 20th position on point table. So, I'm going with Aston Villa in this match.\n\n* Chelsea scored 16 goals in their last 7 matches, 3-0 against Barcelona last week. They have the confidence of scoring, and they are playing at home. While, Arsenal scored 17 goals in their last 7 matches, 3-1 against Bayern Munich last week. So, It has high probability of total goals over 1.5 in this match.\n\nGood luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nri6z6o/"
    },
    {
      "created_utc": 1764485980.0,
      "author": "tokcliff",
      "text": "Event: Syed Modi International Men's Single\nPOTD Record: 141w 94l 2p \nDate: 30 Nov SGT\nNet Profit = +49.1775 units\n\nSrikanth Kidambi -4.5 points at 1.74 @ 1.25 units (vs Jason Gunawan)\n\n2/2 H2H, which is pretty good, Kidambi is higher ranked than Gunawan, although at this level, it really doesn't matter much. Kidambi is getting old so I'm not expecting too much, but good handicap and good H2H. -5.5 works too\n\nBTW if anyone wants to follow my blog where I do some reflection about badminton betting\nhttps://tokkidokkie.wordpress.com/",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nri6rd7/"
    },
    {
      "created_utc": 1764485352.0,
      "author": "cedarrapidsiaus",
      "text": "POTD record: 48-28 (All bets 1 Unit unless stated otherwise)\n\nLast Pick:  NBA 🏀 Los Angeles Clippers vs Golden State Warriors 11:00 P.M. E.T. OVER 223.5 (-110) Draft Kings ❌\n\nToday's Pick: NFL 🏈 San Francisco 49ers vs Cleveland Browns 12 P.M. E.T. \n\nBrowns Money Line (+197) Betonline (can grab this at +215 on bovada but this thread has a +200 limit so i couldn't make that the pick)\n\nBrowns have a Defense i really like. 49ers at home struggled against a less talented defense in the Carolina Panthers last week. Browns defense is better than them. Offensively Shedeur have another needed week to mesh and create chemistry with the number 1 offense. I do think the Browns have their QB of the future in Shedeur. He played behind the worst offensive line in the nation in college and managed to throw a 64-13 TD INT with well above a 70% completion rate playing behind one of the worst olines in the nation during his Colorado tenure running for his life every game. \n\nThe Browns have a good Oline capable of protecting him and guiding him with a good running game. A 49ers defense without Nick Bosa and Fred Warner will be missing their top 2 guys in the department. Even if there is bad weather i think the browns O can create some problems for the 49ers D still.\n\nI feel like this pick has great value and is great opportunity for a Browns win. Cleveland and the Ohio Area will surely be hung over from the Ohio State celebration finally defeating Michigan, but they are no stranger to hangovers and know how to rally hungover or not. Their stadium will just get juiced up once again on Sunday with a lot of enthusiasm from the Buckeyes and now that the Browns are showing life and they are praying Shedeur will answer their prayers of finally having a franchise Quarterback imo.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nri5nys/"
    },
    {
      "created_utc": 1764481053.0,
      "author": "20k_rpm",
      "text": "Record **:** **19** W **- 16** L\n\nForm **:** ✅❌✅❌❌❌✅✅✅❌✅✅✅❌✅❌❌❌✅✅❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌\n\nEvent **:** Counter Strike **| Dreamhack Knockout Stockholm | OG** vs **Monte**\n\nPick **:** **Monte to win** **|** 3 units **@ 2.41 odds or +141**\n\nReasoning **:** OG recently made 2 roster changes. monte should realistically have a good map pick advantage here. So at this + odds should be comfortable to close this game.\n\nhttps://preview.redd.it/i2f5f6f20c4g1.png?width=384&format=png&auto=webp&s=7dc832d1953161fd0d7d5632c16de13c4d598c1e",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhxsdb/"
    },
    {
      "created_utc": 1764480873.0,
      "author": "D0N_L0U1S",
      "text": "Record: 24-14 on YT\n\nPOTD Record: 2-0\n\nRecap: Duncan robinson saw alot of 3s attempts and cashed his 2.5 3s made line sweat free, also cashed another 4man Parlay (+355 odds) on my YT\n\nTodays POTD: Deandre Ayton O 8.5 Rebounds (-114)\n\nReasoning: Hes going up against a Pelicans team thats going to be a on b2b which means tired legs. This pelicans team also lack size and i love big centers like Ayton against teams that lack size. He had 16 Rebounds 2 weeks ago against this pelicans team. I dont expect much to change in this game soo im going with Ayton over his Rebounds for that reason, im also waiting to see at what odds his DD drops at because ill very much play that if i see any value.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhxfs7/"
    },
    {
      "created_utc": 1764480583.0,
      "author": "Dull_Oil3397",
      "text": "POTD Record: 2-0 (+2.65U)\n\nLast Pick: Minnesota ML (+110) (1.5U)💰\n\nGame went how I thought it would. Run-heavy, bad weather, and the Gophers came out on top 17-7. They had control the whole game and the pick was once again quite sweat-free.\n\n[***Yesterday’s Write Up***](https://www.reddit.com/r/sportsbook/comments/1p99hqb/comment/nrcfuc8/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nEvent: Vikings @ Seahawks\n\n**POTD: Jordan Mason Over 27.5 Rushing Yards (-114) (1U)**\n\n\\-minus odds is to win unit amount-\n\n\\-plus odds is bet unit amount-\n\nWrite up: Has cleared this line 3/L4 since Jones returned from IR, with the only under being 25 against Baltimore. Vikings are starting Brosmer at QB and will have to rely on the ground game to stay in the game. If they slow the pace, they have a chance against the high-powered Seahawk offense. Mason should get 8-10 carries from the split and I can see the Vikings running the ball A LOT, so there’s a chance for more. If they are winning, they are going to run it. If the game is tied or one possession down, they are going to run it. If it gets ugly, they are going to run it. The only kicker would be if the game is 10-17 point deficit right out of the gate and stays there for the remainder of the game. \n\nBOL!!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhwv3m/"
    },
    {
      "created_utc": 1764480133.0,
      "author": "Supreme_Warzone",
      "text": "POTD Record: 1-1\n\nEvent: Houston Texans Vs Indianapolis Colts 1:00 PM EST\n\nToday's POTD: Dalton Shultz Over 41.5 Receiving Yards\n\nOdds: -114\n\nWrite Up:\n\nWhy I like this spot:\nThis is a classic “volume + matchup + cheap line” tight-end prop.\nLine: 41.5 yards\nSeason average: 45.2 yards per game on 52 catches for 497 yards in 11 games.\nHe’s already gone over his receiving yards prop in 8 of 11 games this year (72.7% hit rate).\nIn 5 of his last 7 games, he’s been over 50 yards.\nBooks are basically hanging a number below his average in what’s arguably his best matchup of the season vs tight ends.\n\nUsage & role in the Texans offense:\nSchultz is not a part-time guy; he’s a core piece of this passing game:\n72 targets → 52 receptions, 497 yards, 45.2 yds/game.\nThat’s roughly an 18–18.5% target share in this offense.\nHe averages 6.55 targets per game.\nMultiple fantasy/DFS outlets basically have him circled as the TE streamer / TE1 play of the week, which is just another way of saying: he’s going to be on the field, he’s going to be involved.\nEven when Houston’s QB situation has wobbled (Stroud vs Mills), his role as a middle-of-the-field safety valve has stayed consistent. WSN notes he’s cleared 50 yards in 5 of his last 7 and remained a key part of the offense regardless of who’s under center.\n\nThe matchup: \nColts vs tight ends is ideal. This is the real reason this prop jumps out. Tight ends are averaging 72.2 receiving yards per game vs the Colts, one of the very worst marks in the league for TE coverage.\nFantasy/analytics sites keep repeating the same thing: “Second-most receiving yards per game and third-most fantasy points per game allowed to tight ends”. They’ve allowed six double-digit TE games and are “one of the best matchups in all of fantasy for tight ends.” They struggle in the middle of the field, especially when linebackers and safeties get stressed by play-action or spread looks. That is exactly where Schultz eats — hooks, seams, crossers, and option routes off play-action.\nOn top of that, the Colts’ overall pass defense gives up 245.4 passing yards per game, fifth-worst in the NFL. So it’s not just a TE issue; this is a defense that can be attacked through the air, and TEs in particular have been punishing them.\n\nGame script & environment:\nGame: Texans at Colts, Sunday 1 p.m. ET\nSpread sits around Colts -3.5, total 44–45.\nThat screams competitive game, not a blowout. Competitive games = QB has to keep throwing into the 4th quarter. Colts’ offense should be functional enough at home to force Houston to keep the gas on. Whether it’s Stroud (most likely back) or even Mills, Houston will need sustained drives and actual passing volume. DraftKings’ capsule literally suggests Houston should “spread the field” and hunt matchups for Nico Collins and Dalton Schultz against a defense allowing 64% completions and 2,900+ pass yards.\nSo we’re projecting:\nPlenty of dropbacks,\nColts defense that bleeds TE yardage,\nSchultz running a full-time route load.\nThat’s how you want it set up for a mid-40s receiving line.\n\nAdvanced / consistency angles:\nAs a fantasy asset since Week 5, Schultz has been TE11 in fantasy points per game with 53 receiving yards per game in that span and a ~18.2% target share. He’s been a “start every week” guy and is being called a “strong TE1 again this week” specifically because of the Colts matchup.\nFor betting, we care about that because it tells you his production level is not a fluke: he’s been consistently in the 45–60+ yard window, and now he’s facing one of the softest defenses in the league vs his position, with a line below his season and recent averages.\n\nWhat could go wrong?\nYou always want to know the downside:\n1. Re-aggravation of the shoulder / snap count hit:\nHe had a shoulder thing earlier, and in last week’s game he put up just 1 catch in a defensive struggle. If that flares up or Houston limits him, the usage assumption breaks. \n2. Texans D dominates again / low-volume pass game:\n Houston’s defense has been good; if they force a rock-fight with short fields or get scores via defense/special teams, total pass attempts could drop.\n3. Spread-the-wealth game:\nIf Collins, Dell, and backs soak up most of the volume and Schultz gets 3–4 short catches, you land in the 25–35 yard zone and miss.\nBut relative to the line (41.5), matchup, and his historical usage, those feel like risks, not the base case.\n\nYou’re getting:\nA full-time, high-target TE,\n\nIn a dream matchup vs one of the worst teams against tight ends,\n\nAt a line below his own average output,\n\nIn a game with a tight spread and solid total.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhvypg/"
    },
    {
      "created_utc": 1764479563.0,
      "author": "Elevate203",
      "text": "Record: 1-0\n\nLast POTD: Jaylen Brown o9.5 RA (-138) ✅\nJB w/ the 1st half cash💸💸💸\n\nToday’s Event: Houston Rockets @ Utah Jazz\n\nPOTD: Amen Thompson o6.5 Rebs (-134) FD\n\nReasoning: Amen has cleared this line in 5/5 games and 8-2 in the last 10. Coming into this game well rested I like his over here. Also a fan of o11.5 RA (-146). He’s been hovering around 40 mins a game the last 5, so ample opportunity to cash this for us. Keeping it simple here…wanted to get this pick in early because I was late yesterday. Let’s get this 💰",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhut1r/"
    },
    {
      "created_utc": 1764478060.0,
      "author": "derfderf00",
      "text": "Pick: Jags- 6.5 (1:00 eastern)\n\nRecord: 0-0\n\nBeen betting nfl for a couple weeks and getting lucky, so want to share picks here\n\nSo no one wants to bet on Tlaw. I dont want to bet on tlaw. \n\nBut the titans suck. And if vegas really though titans gonna cover, they would make this line 9.5\n\nJags on winning streak keep it going.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhrnhh/"
    },
    {
      "created_utc": 1764477988.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 13-8 (+12.36$)**\n\nLast POTD: 2 Pick Parlay: Alabama ML/Under 56.5 -125 (2.50$ TO WIN 2.00$)✅\n\n**POTD: 2 Pick Parlay: Buffalo Bills ML/Houston Texans +14.5 -112 (2.50$ TO WIN 2.24$)**\n\nWrite up: My model says this is the top play for the day. I will always try to get odds that between +100 & -120 for you all. \n\n• ⁠I mean if Josh Allen loses this game, I don’t know what to say - I know the Bills aren’t as great as they should be and they are banged up but boy do they need this win\n\n• ⁠Model is showing Texans should be 1-2 point underdogs \n\n• ⁠ Model says Buffalo has a 62% chance of winning\n\n•  Model is projecting a 40 point Texans/Colts game, indicating it will be a close matchup \n\n•  Model's final score estimate is set at Bills 27 - 20 Steelers \n\nBOL!\n\n**POTD: 2 Pick Parlay: Buffalo Bills ML/Houston Texans +14.5 -112 (2.50$ TO WIN 2.24$)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\nhttp://buymeacoffee.com/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhrhw3/"
    },
    {
      "created_utc": 1764477653.0,
      "author": "Ok-Actuary-4654",
      "text": "POTD Record: 1-0-0 (+3.8 units)\n\nStreak: 1W\n\nLast 10: W \\_ \\_ \\_ \\_ \\_ \\_ \\_ \\_ \\_ \\_ \\_ \n\nLast Pick: Auburn vs Alabama -6 (-105) 4 units NCAAF\n\nLast Pick Reflections: Alabama jumped out to an early lead and as expected Auburn clawed its way back. Late TD helped seal the fate, and the defense stepped up from there. Pretty lackluster 2nd half from Alabama but glad to get the W.\n\nEvent: Carolina Panthers vs Los Angeles Rams\n\nPOTD: Panthers +10.5 (-110) 4 units\n\nGlad to have gotten my first win under my belt. Here, I feel like Vegas is overvaluing the Rams. To date, no one team in the NFL has really distinguished itself from the rest of the pack, granted the Rams have looked like a very efficient offense and are widely considered the best ranked team in the NFL right now. However, I anticipate them to struggle a bit against the Panthers tomorrow. Loving that we're getting 10.5 points with the Panthers on the spread and I wouldn't be shocked to see the panthers win outright here. Once again, will be doing 4 units on the spread and 0.3 units on the moneyline at +450. \n\nJust to reiterate, in conjunction with my model, I use the eye test as well as my gut feeling to play what I believe is the most-valuable pick on the slate. Cheers to a great game, and please remember to gamble responsibly and to only wager what you can afford to lose.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhqrfp/"
    },
    {
      "created_utc": 1764477390.0,
      "author": "Lyx97",
      "text": "Record: 5-1-2\n\nNet Units: +2.37\n\n*Prev Pick : Hobart Hurricanes (w) vs Perth Scorchers (w) --> Win (what a swing of emotions that was. But thanks to Hobart, we profit)*\n\neSports | StarLadder Budapest Major (CS2) | Navi vs B8 | in \\~14hrs\n\nB8 Map handicap +1.5 @ 1.55 (1u)\n\nWrite Up: I Know a lot of people have NaVi as the favorites, especially after their dominant performance yesterday, but im still not convinced/. Both their wins were against stage 1 teams, who weren't that good. In contrast, B8 have been pretty impressive & clinical. I think this will be the first good test for Navi. I predict B8 to get atleast a map off Navi or maybe a win. \n\n*Note : I actually had a BBL bet lined up, but woke up too damn late, so missed posting here :(*\n\nBoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhq6d2/"
    },
    {
      "created_utc": 1764472938.0,
      "author": "1234unodostrescuatro",
      "text": "__Record: 17-11__\n\nForm (old to new): ❌✅✅✅❌✅✅✅✅✅❌✅✅✅❌❌✅✅❌✅❌✅❌❌✅✅❌❌\n\nLast pick: Hurts U0.5 Int❌\n\nGame: CAR-SF\n\n__Today’s pick: CMC O37.5 rec yds (-110)__ \n\nAnalysis: 100% hit rate this year. Facing a very tough defense which explains the nice discount on yardage here. I’m not too worried as CMC has a WR skillset but consistently mismatched with LBs and edge rushers being forced into coverage on him. CMC should continue to get a high target share and capitalize on his recs as he has every game this year to clear this number",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhfr08/"
    },
    {
      "created_utc": 1764471486.0,
      "author": "ControlRoyal1768",
      "text": "Record: 26-16 (+27.11u)\n\nLast 10:💰💰✖️💰✖️✖️💰✖️✖️💰\n\nLast POTD: 🏈 Eagles team total under 26.5 points (-113). 💰\n\nWriteup: Just like I suspected, if Philly started from behind, it would be really difficult for them to have a chance in this one. Needed a smash pick here, glad it happened.\n\nToday’s POTD: 🏈 Bills vs Steelers under 47.5 points (-108).\n\nGame starts at 4:25pm EST. Bet 3U\n\nWriteup: Taking the under in the Bills vs Steelers game mostly due to likely game script. \n\nThe Bills have been such an interesting team this year with quality wins against powerhouses like the Chiefs and Ravens, but really bad losses against teams like the Dolphins, Falcons, and Texans. Something seems off about Josh Allen this year mainly due to just how many sacks he’s taken this year, and his ability to not get sacked used to be one of his greatest assets. He was sacked 8 times last week, and now gets a Steelers defense that includes the likes of an healthier Alex Hysmith, T.J. Watt, and others. I expect Allen to have some limited success in the passing game and rely more on his running backs.\n\nThe reasoning for this bet, like I mentioned, comes from the high likelihood that both teams will have success running the ball and will not need to pass as much as they typically do. Both teams have bottom 6 rush defenses in the league the season, and both offenses have highly efficient rushing attacks thanks to James Cook for the Bills and Jaylen Warren for the Steelers. I don’t expect Allen to find a lot of success creating explosive plays through the air against a Steelers defense that is quick to getting to the QB, and I expect Rodgers to take some slight precautions given his injury to his non-throwing wrist. \n\nBoth teams running the ball will keep the clock running throughout the game, giving both teams less time to score. James Cook did not get a lot of usage last week, which is typical in the games the Bills lose. I expect heavy usage of Cook in this one, along with Warren for the Steelers, which will result in a game with under 47.5 points.\n\nRemember to only bet what you can afford to lose, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhc6f8/"
    },
    {
      "created_utc": 1764471332.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 200-151\n\nUnits Won: +99.01u\n\nLast Pick: Maka U 7.5 Headshots + W0nderful U 6.5 Headshots (+122) X\n\nToday's Pick: **NicX U 9.5 Headshots Map 1 + Staehr>INS Map 2 Kills (+113)** 5u\n\nTeams/Time: Passion UA vs. 3DMAX (9:00 AM est.) | Astralis vs. FlyQuest (11:00 AM est.)\n\n\\-One of the worst if not the worst losses we have taken in 351 picks so far, W0nderful with his team up 12-0 and at match point had 3 headshots, then proceeds to get 5 headshots in 3 rounds to cover the line despite a 13-2 blowout win and game script going exactly as predicted, heart breaker\n\nhttps://preview.redd.it/urdbbzy74b4g1.png?width=295&format=png&auto=webp&s=1edbc1b522160d18bfbd63aaea9adecbb9307d3a\n\n**NicX U 9.5 Headshots Map 1**\n\n* Passion UA vs. 3DMAX in the 1-1 match, a b01. 3DMAX lost to fnatic 13-6 in their opener then beat FlyQuest 13-7 in the 0-1 match. Passion UA lost to FaZe 13-10 in their opener then beat MIBR 13-10 in their 2nd round match. Passion UA come in as slight favorites and the higher seed, as stated yesterday higher seed in a b01 has started on CT side so far in 95% of games played at the major\n* 3DMAX ban Mirage, 3DMAX ban Train. Passion UA ban Ancient, Inferno, Nuke, 3DMAX ban ?? (unsure but lean Overpass ban). Map will either be Overpass or Dust 2 with Passion UA on CT side but strongly lean Dust 2 as I think neither team really wants this map to end up on Overpass, and with PA having side choice and Overpass being very CT sided, think we are very likely getting dust 2\n* NicX is averaging a .63 KPR in the L3 months for Passion UA with a 59.2% headshot overall. He is averaging a .62 KPR in 2025 with a 61.5% headshot percentage overall\n* On Dust 2, NicX is averaging a .51 KPR L3 months with a 54.9% headshot overall, both significant decreases. In 2025 he is averaging a .50 KPR with a 56.2% headshot overall\n* On Overpass NicX is averaging a .68 KPR L3 months with a 56.2% headshot overall, slight increase in KPR\n* Model projecting 90% chance of him going under this line with a near 24% overall edge\n\n**Staehr>INS Map 2 Kills**\n\n* Astralis take on FlyQuest in the 0-2 match, Astralis have lost two close games against some solid teams overall, while they don't look good they have been competitive, FlyQuest on the other hand have gotten blown out twice in a row back to back. This is a b03 since it is an ellimination match, Astralis really should be picking only Ancient ever in this spot, small chance they could justify an Overpass if they are confident enough in it but I don't really see that at all with them being the better team and how big the stakes\n* Staehr is averaging a .71 KPR L3 months, INS is averaging a .66 KPR in the L3 months, Astralis is -200 favorites on the map. Staehr is averaging a .69 KPR in the last month, INS is averaging a .56 KPR last month\n* Staehr is averaging a .98 KPR at the major so far in two maps, INS is averaging a .49 KPR in two maps so far\n* Staehr is averaging a .87 KPR on Ancient L3 months, with a .80 KPR on Ancient in the L6 months\n* INS is averaging a .65 KPR L3 months on Ancient with a .56 KPR in the L6 months on the map/2025 as well\n\n\\-Model loves both plays, projected probability at \\~79% of both plays hitting while getting at + money again",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrhbsuc/"
    },
    {
      "created_utc": 1764469854.0,
      "author": "Hercules-sonofZeus",
      "text": "Record: 45-32\n\nForm (most recent on right) : ✅✅✅✖️✅✅✖️✅✅✅✖️✅✅✖️✅✖️✅✖️✅✖️✖️✖️✖️✅✅✖️✅✅✖️✖️✅✅✅✅✅✅✅✖️✖️✅✅✖️✖️✖️✖️✅✖️✅✖️✅✖️✖️✖️✅✅✅✅✅✅✖️✅✅✅✖️✅✅✅✅✅✅✅✖️✖️✖️✖️✖️✖️\n\nNet Units : +0.98u, ROI : +0.37%\n\nLast Pick: Bayern to Win or Draw✖️\n\nEvent : England Premier League 🏴󠁧󠁢󠁥󠁮󠁧󠁿\n\nAston Villa vs Wolves\n\nPick : Aston Villa to Win + Total Under 5.5 Goals @1.61 for 3u✅\n\nVilla are the clear favorites at home and should win easily while keeping the match controlled against a team that is completely out of form. Aston Villa are fourth in the Premier League with 21 points from 12 games and have won their last seven home games across all competitions, showing they are a fortress at Villa Park, while Wolves are in absolute crisis with only 2 points from 12 matches which is the third-worst record at this stage in Premier League history. Villa just beat Leeds 2-1 away and Young Boys 2-1 at home in the Europa League, proving they can score goals easily, but Wolves have lost their last five league games and conceded at least two goals in their last six competitive matches, meaning Villa will score multiple times without facing any real attacking threat. The under 5.5 goals is safe because Villa have only scored 1.3 goals per game on average this season and while Wolves concede 2.3 goals per game on average, realistic scorelines like 2-0, 3-0, or 2-1.\n\n\nIf you found these picks helpful, tips or donations are greatly appreciated as they support the time and effort I put into creating them: [buy me a beer🍻](https://buymeacoffee.com/hercules.son.of.zeus)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrh865u/"
    },
    {
      "created_utc": 1764468952.0,
      "author": "Few-Radish5584",
      "text": "Record: 2-1\n\nNet Units: +.97\n\nPrevious Pick: Saquon Barkley AnyTD (-125 ❌)\n\n(Alright so that was a poor pick. Someone in the comments said Eagles are a mess and they clearly have been. I was hyper-focused on the fact Barkley hadn’t scored in a month and was “due”.  A concept casuals usually use, but we are bettor than that.) Moving on —>\n\n\nEvent: NFL | Bills @ Steelers | 4:25pm EST\n\n**POTD: Josh Allen o233.5 Pass Yards** (-111 DK)\n\n\n1u\n\nWrite Up: Josh has cleared this line all throughout the month of November (4/4) and Pittsburgh heads into the game dead last in pass yards allowed/gm. (258.7)\n\nNot gonna overthink it.\n\nBOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrh5y8t/"
    },
    {
      "created_utc": 1764467883.0,
      "author": "FL_Bo",
      "text": "Record 1-0\nLast pick Ohio State -9.5 CFB  ✅\nVery easy cash on a line that was simply way too low due to the noise of the recent years blunders by OSU\n\nSundays Pick \n- Jaguars Vs Titans -\nBayshul Tuten Over 27.5 rushing yards (steadily moving upward) \n\nThis guy is beginning to get his share of rushing attempts for Jacksonville and showing flashes of what he can do. The jags gave away tank bigsby and ended up drafting this guy in the 4th round with the pick. Clearly they want him in the mix. With Jacksonville a decent favorite in this game you have to think they’ll be playing ahead most of the game and rushing the ball a lot. Hes averaging about 8-9 carries a game which should translate to this line being too low added with the implied game script against Tennessee. Tuten was a menace at Virginia tech and the jags are looking to get more of that out of him and he should be able to hit this line easily if he gets 8 or 9 carries. There’s not much to think about. I got the line at 26.5 and Ive got it upwards of 30-35 easily. It’s moving fast, get it as quick as you can. ✌️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrh3brn/"
    },
    {
      "created_utc": 1764467300.0,
      "author": "HeBeThatBoy",
      "text": "POTD Record: 3-1\n\nNet Units: +11.76\n\nLast Pick Thoughts: Spurs are going to Spurs. Fulham is a sleeper pick to give teams a rough time IMO.\n\nSport: English Premier League - Crystal Palace vs. Manchester United @ 7:00am EST\n\nPick: Tie or Man Utd + BTTS = +140 (5 units)\n\nWrite Up: This is very similar to my previous pick, is Crystal Palace a bounce back team? I think not. While this too is a home game for CP, they just played and lost to Strasbourg in France as of two days ago and now have a quick turnaround game against Manchester United. While CP is one of the best coached and managed teams in England, they’re not used to playing in Europe and the Prem. Manchester United is a wild card, they’ve shown flashes of progress, only to take a step back again. I do believe there is a sense of belief within ManU, they’ve proven to themselves they can play well and win. I think with more time off than CP, they’ll be more prepared. They also have the added benefit of only needing to focus on the Prem, ManU can win this. To manage a bit of risk, I’ve selected Tie OR Win for ManU, as well as BTTS. I think ManU will score, I also think they’re shaky enough to let in a goal.\n\nI’ll update based on lineup announcement.\n\nBOL!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrh1v2u/"
    },
    {
      "created_utc": 1764466340.0,
      "author": "222benz",
      "text": "Record: 1-0\nNet Units: +0.97\n\nLast Pick: Falcons ML & Tundra ML @ 1.97 (1u)✅\n\nEvent: Dota 2 BLAST Slam V | 7:00 AM EST\n\nPOTD: Execration ML vs Yakult Brothers @ 1.70 odds (1u)❌\n\nWrite Up:\n\nWe're backing the SEA powerhouse, Execration, known as the \"Chinese Slayers\" in this BO3 Last Chance Playoff match. While Yakult Brothers are a decent squad, Execration has historically performed well in high-pressure elimination series like this one. Their aggressive playstyle and individual skill ceiling often overwhelm Chinese opponents in this format. This match is win-or-go-home, and we expect Execration to step up, utilize their momentum, and secure the victory to keep their tournament hopes alive.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgzgpy/"
    },
    {
      "created_utc": 1764465906.0,
      "author": "DisastrousPurple2339",
      "text": "Record 4-1\n\nUnits +6\n\nPrevious pick Man City -1.5 ❌\n\nWe were up 2-0 at half and I don’t know what happened during the halftime talk but mfs started bullshitting in the 2nd half, gave away a stupid goal and a penalty right after that. Here’s the bounce back pick.\n\nEvent: Chelsea vs Arsenal @11:30 AM EST \n\nPick: BTTS -128 (FD) 2u\n\nI’m an Arsenal fan and as much as I would like to put our moneyline, Stamford bridge is a difficult place to play at. Chelsea just beat a talented Barcelona team in Champions League 3-0. The last time Arsenal failed to score was August 31st against Liverpool, the last time Chelsea failed to score was August 17th against palace, a defensively sound team. I anticipate seeing a 1-1, or 2-1 to either team as this matchup always provides a good watch.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgyd3y/"
    },
    {
      "created_utc": 1764465899.0,
      "author": "Bankroll_Builder",
      "text": "Record: 11-8 \n\nLast Pick: Sunderland or Draw + Man City ML (-115) ✅\n\nRecap: Beautiful Sunderland comeback. They stay unbeaten at home and we ride the wave. City made it sweaty but got the job done. We cash and move.\n\nTodays Event: Wolves at Aston Villa / Brighton at Forest (EPL) @9:05am EST \n\nToday’s Pick: Aston Villa ML + o1.5 goals in Brighton vs Forest (-110) \n\nWrite Up: Aston Villa has sneakily stacked up to 5th in the table. They have lost one prem game since August which was away at Anfield. They have been solid at home. In all comps they have won five straight at home. As well as their last four in a row in the prem. Wolves. Nothing to be said. One goal away from home all season. No wins all year. I can’t help but continue to fade them. \n\nBrighton and Forest feels like a tricky matchup. I debated with a second leg for this potd but ended up here. Two goals. In a tricky toss up game. I like it. This o1.5 has hit in 11/12 prem games for Forest. As well as 12/12 for Brighton. Both teams combined only have 3 clean sheets all season. Expecting both teams to have many chances to score. Ideally we see a first half goal and we are in business.\n\nBOL. Let’s go get another one.\n\nEdit: Typo",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgychx/"
    },
    {
      "created_utc": 1764465796.0,
      "author": "MrBigeaux",
      "text": "First time poster, long time lurker.\n\nOverall record: 0W – 0L\nUnits: +2.00 (all picks are 1 unit)\n\nToday’s Pick:\nKenneth Gainwell o50.5 Rushing + Receiving (Fanduel)\n(Line already moved from 49.5 yesterday, the market clearly respects greatness.)\n\nI’m keeping it short because I don’t want to break my undefeated streak with too many words, but here’s the vibe: Gainwell has quietly been eating into Jaylen Warren’s touches, and the team is clearly trying to get him the ball in space. Over the last couple weeks he’s been trending up in both usage and snap share, and this matchup sets up nicely for him to rack up chunk yards on the ground and through dump-offs.\n\nHe’s basically the “oh crap nothing’s open” button for this offense right now, and that alone gives him R+R upside. If he gets anywhere near his recent touch share, this line feels soft and the movement from 49.5 to 50.5 shows the books agreeing.\n\nMay my perfect record continue its historic run. BOL and bet responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgy30e/"
    },
    {
      "created_utc": 1764465298.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 9-6-1 \n\nStreak: 1W ✅\n\nNet units: +1.81u All bets are 1 unit.\n\nLast POTD 11/27/25: Ja'Marr Chase O91.5 receiving yards (-110 Bet365) ✅\n\nToday's POTD 11/30/25: Keenan Allen 03.5 receptions (-125 Bet365)\n\nEvent: Raiders @ Chargers 2:25MST\n\nWrite Up: Chargers are looking to get back on track here with a get right game against one of, if not the worst team in the NFL. Going into their BYE week the Chargers got absolutely embarrassed against Jacksonville. Los Angeles has had two weeks to prepare for this game and will be fully rested to go up against this weak Las Vegas pass defense and get themselves back on track.\n\nWith Omarion Hampton ruled out for presumably one more week, and with the Raiders competent run defense, it will be up to Justin Herbert and his wide receivers to get the yards LA needs through the air. Since entering the league, Keenan Allen has been consistently Justin Herbert's favorite target and his go to guy in big spots when they need it most.\n\nThrough 11 games Keenan Allen has averaged 7.8 targets per game and has cleared this line in 9/11 games this season. The Raiders are ranked 28th in receptions allowed to wide receivers with 12.9 per game and Allen cleared this line previously against Vegas in week 2 with 5 receptions.\n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgwtqn/"
    },
    {
      "created_utc": 1764464847.0,
      "author": "dreamchasing1",
      "text": "Record: 230-218 Net Units: -28.52 49-52 on 1.5u plays, 38-40 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [England Premier League] Man City vs Leeds\nLast pick: Man City team total over 2.5 goals @ 1.90 - 1.5 Units win\n\n\nEvent: Soccer/Football, [Bulgaria First League] Levski Sofia vs Septemvri Sofia\n\n\nPick: Levski Sofia team total over 2.5 goals @ 1.80 - 1.5 Units\n\n\nThe most prolific team in the league meets a bottom of the table team at home. In recent times, Levski have cleared this line in 6/7 of their latest games, stopped only by CSKA Sofia. They weren't as prolific earlier in the season (still winning quite comfortably), since they were often rotating players due to European qualifications. Septemvri allowed 3 or more a couple of times already this season, lost 0-5 to Ludogorets away, lost twice to CSKA Sofia 0-4 and 1-3 and games vs weaker teams such as Beroe and Botev where they allowed 3+ goals.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgvoqt/"
    },
    {
      "created_utc": 1764462981.0,
      "author": "Lumpy-Dentist3891",
      "text": "POTD Record: 3-0-0\n\nLast POTD: **Josh Hart RA Over 12.5 @ 1.74 2U** (Bet365) ✅️\n\nJalen's POTD got scratched(leg).\n\nToday's Pick: **Total Corner Over 10 @ 2.37 1.5U (Bet365)**\n\n**EPL | Chelsea v Arsenal**\n\nI like taking corner bets more than rebounds. NBA can be unpredictable with player injuries, minute restrictions, and all. But corners in soccer won't stop due to a single player's injury. My belief is corners are often driven by game script and the team's eagerness to create chances.  \nChelsea and Arsenal are the leaders in corners taken in the EPL right now, with 80 and 79 corners respectively so far in their 12 games.  \nI do not have to worry about Chelsea or Arsenal leading the game; both are capable of creating double-digit corners.  \nBoth teams have an average of 6 corners per game. If either of the teams scores in 1st half, the corner will start to burst from the other team, or if neither of the teams is able to score, corners will still burst from both teams. Both teams have players active in the roster who are on top of the leaderboard with the most final third passes as well. Generally speaking, I like this bet.  \nSorry I cannot give more stats this time since this bet is more of a situational bet, and situations/game-script are in our favor. GL 🍀.\n\nMy bets are being tracked [here](https://www.potd.lol/handicapper/Lumpy-Dentist3891-T7Acgq). Thanks to the tracking team.\n\nhttps://preview.redd.it/jfqy2zkpja4g1.png?width=449&format=png&auto=webp&s=367b7cc25b7e93d33cad20ed077182f5b436f99e",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgquth/"
    },
    {
      "created_utc": 1764462814.0,
      "author": "Square_Print_9822",
      "text": "**Pick Record: 33W - 24L    (Push: 1)**\n\n**Previous Pick: Manchester City Over 6.5 Shots on Target @ 1.83  ✅**\n\n**6 first half and 9 in total. Onto the next.**\n\n\\--\n\n**Today's Pick: Crystal Palace Over 11.5 Total Shots @ 1.80 ✅**\n\n**Crystal Palace VS Manchester United - 7:00 AM**\n\n**--**\n\n**Glasner has this Palace side 6th in the league for a reason, they've undergone some struggles in the last 2 games but a home game against United is just the right game to bounce back with.**\n\nUnited just lost to a 10-man Everton side who got battered at home today. The structure of that team has too many individual weaknesses that Palace will dig into. I do see a better performance but United simply cannot retain possession to their benefit; either they hold possession and concede counters or they leave the ball and concede shots - regardless PRESSUREEE. \n\n\\--\n\n**In United's last 5 away games, they've conceded an average of 13.8 shots per game.**\n\n**Stats (last 5 shots conceded): 10, 17, 19, 10, 13**\n\n**In Palaces' last 5 Home games, they've taken an average of 14.0 shots per game**\n\n**Stats (last 5 shots taken): 10, 10, 20, 16, 14**\n\n**--**\n\n**Expecting shots to fly tomorrow from Palace, after United's result against Everton, risks will need to be taken, and opportunities will fall at the feet of Palace players. BOL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgqf5t/"
    },
    {
      "created_utc": 1764462118.0,
      "author": "oneilmatt",
      "text": "**Record:** 4-1\n\n\n**Previous Pick:** Jacoby Brissett o243.5 passing yards ✅️ \n\n\n**Game:** NFL - Jaguars @ Titans, 12pm CDT\n\n\n**POTD:** Travis Etienne o63.5 rushing yards (-114 on FD)\n\n\n**Rationale:**\n\n\nTravis Etienne has been a solid rusher this season, averaging 74 rushing yards per game. He has hit this line in 6 of 11 games this year, with most of the misses coming in games where the Jags were trailing heavily (Rams, Seahawks) or against an elite defense (Texans). Another consideration is last week's return of Brenton Strange. Strange has been very important to the Jags' run game, and the splits make this clear. *With* Strange playing, Etienne averages 96 rushing yards per game. *Without* Strange, that drops to just 43.3. Last week he toted the ball 15 times for 86 yards, and Strange was a contributor to that.\n\n\nOn the Titans' side of things, they come into this week surrendering 108 RB rushing yards per game. Their opponents' RB1 has only not hit this line twice. Once was against the Texans, whose rushing attack has been spread out and mediocre, and the other was against the Chargers, who have had similar issues. They also give up 20.5 running back carries per game.\n\n\nDivisional games are always shifty, and I expect the Jaguars to lean on their rushing attack to try and open up the play-action game and control this incredibly important matchup.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgom5j/"
    },
    {
      "created_utc": 1764461680.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 10-5 (Avg Odds +130)\n\n**Previous Pick:** Nick Woltemade 2+ SOT (+245) ✅️\n\n**Today's Event:** English Premier League | Chelsea vs. Arsenal  (8:30AM PST)\n\n**Pick:** Enzo Fernandez 1+ SOT (+140) 1 unit to win 1.40 units\n\n**Write Up:** Our lanky German Woltemade came through for us with a late 1st half goal and a 2nd shot in the 58th minute. Great to see many of you cashed with both the 1+ SOT and 2+. Lets try for a long weekend sweep today!\n\nOff we go to London for the match of the weekend - where 3rd place Chelsea host 1st place Arsenal. You guys are probably sick of hearing me talking about Enzo Fernandez, but guys they're giving us his SOT line at plus money again. After cashing this play 3 different times so far, I'm not overthinking it. Sorry if you all are sick of this pick, but it looks too good to pass up. I also think this might be our last clear play on this line. Let's talk about that.\n\nI've always based this play on the simple fact that Enzo plays further forward, takes penalties, and take free kicks with Cole Palmer out. This has now hit in 9/9 of his last matches in all comps, averaging over 3 shots and just about 2 SOTs per game. Enzo has been arguably Chelsea's best player this season. Chelsea coach Maresca has said Palmer is ready to come back from injury, but has been very cryptic about his role. I think Palmer will suit up for the match, but I don't think he starts. If he does start, I doubt he will be playing the whole match. All of that said, I don't suspect Enzo's role will change overnight here and expect he will get at least a half without Palmer.\n\n**To be clear, I like this play whether Palmer starts or not.** It does change the team dynamic, but Enzo has been balling and I don't see him slowing down. This is a massive match with title implications - big players show up for big games.\n\nBOL if tailing, have a great Sunday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgnh75/"
    },
    {
      "created_utc": 1764461567.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 56-28-1 (+60.95u)\n\n__Previous Pick:__ [✅ ALA/AUB both score 20+ points (+140), 3u](https://www.reddit.com/r/sportsbook/s/N0sKY8sPrY)\n\n__Event:__ NFL: Broncos @ Commanders 8:20pm EST\n\n__POTD:__ Courtland Sutton longest reception o20.5 yards (-120), 3.6u to win 3u\n\n__Write Up:__ The Denver Broncos (9-2) are traveling across the country to the nation’s capital to take on the Washington Commanders (3-8) in a Week 13 Sunday Night Football showdown. The Commanders will once again be without star QB Jayden Daniels who remains out with an elbow injury, as Marcus Mariota continues to start in his place. Washington has now suffered 6 losses in a row & are trending in the opposite direction as their opponent this week. The Broncos are coming into the game looking to extend an 8 game winning streak, with the 2nd best win % in the NFL. With one of the best, if not the best, defense in the NFL, their offense gets a juicy matchup vs a vulnerable Washington defense.\n\nDenver’s offense has been solid lately, but Washington’s defense has been HORRIBLE lately. __Washington is 31st in defensive EPA since Week 6 (-76.1). They have allowed a league high 7.0 yards per play since then.__ Not only have they been just bad, they have been specifically bad against the pass. __Washington’s pass defense is the worst in the NFL in dropback success rate (51.4%) & dropback EPA allowed (0.266). Those are even worse in the last 4 weeks. Their 63.6% success rate & 0.515 EPA allowed on dropbacks are both at the bottom of the NFL. They have allowed the 2nd most receiving yards per game to WR’s (170.3).__ Their biggest issue has been giving up deep passes to opposing receivers. __Washington is allowing a league high 13 yards per reception & a league-high 6.7% touchdown rate. They have also allowed a league high 59.6% completion rate & a 120.0 QB rating (31st) on throws 10+ yards downfield.__ Here is how opposing pass catchers have fared for their longest receptions vs Washington, starting with the most recent:\n\nWaddle 31 yards, Achane 22 yards\n\nWilliams 41\n\nWhite 60, JSN 26, Arroyo 26, Horton 25\n\nKelce 38, Worthy 27, Rice 25, Juju 24\n\nLamb 74, Pickens 44\n\nSwift 55, Burden 37, Monangai 25, Odunze 21\n\nAllen 29, Conklin 21\n\nBijan 69, London 43, Pitts 26\n\nTucker 61, Meyers 45\n\nKraft 57, Heath 37, Musgrave 23\n\nThey’ve been crushed every single game. __Washington has allowed the 7th most 20+ yard receptions (38) & the 2nd most 40+ yard receptions (10).__ Now they face the Broncos who have a QB/WR tandem that have an elite 20+ yard reception connection in QB Bo Nix & WR Courtland Sutton. __Sutton had 17 catches of 20+ yards last year & has had 12 20+ yard catches in 11 games this season. Sutton has had a longest reception for 21+ yards in 8 of 11 games this season, including 4 of his last 5, with the 3 of those going for 30+ yards.__ The schematic matchup also works in Sutton’s favor. Sutton plays the X receiver in this Broncos offense. Washington’s defense plays a ton of man coverage & single high on the outside, with a banged up cornerback room. Those are the looks where you typically target the X receiver & this team allows the most yards per dropback in single high coverage this season. __Washington The Commanders play man coverage at the 9th highest rate in the NFL (31.5%). Sutton has put up 29% targets per route run & 3.29 yards per route run versus man coverage.__ That is more than double his yards vs zone. Another reason we will see Sutton get his share of targets is Denver’s run game. Since Broncos RB JK Dobbins went down with a foot injury in Week 10, 2nd round Rookie RB RJ Harvey has taken over the Denver backfield. He has been somewhat underwhelming for this offense forcing them to lean on the pass more. __Harvey has a 26.2% success rate as a runner this year, ranking 53rd of 54 RB’s with 50+ runs. He has gained 10+ yards on just 3.3% of his runs, also 53rd.__ So with the lack of rushing success combined with Washington’s severely decrepit pass defense, we should see Bo Nix dice up this secondary & pepper Sutton with targets. \n\nSutton is going to feast, he’ll get at least 1 long one.\n\n*If your book doesn’t have longest reception props, take over on receiving yards.*\n\n__Courtland Sutton longest reception o20.5 yards__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial) - [PayPal](https://paypal.me/joeinglesofficial) - [Bitcoin](https://pastebin.com/raw/GEXAsA2S)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgn6eo/"
    },
    {
      "created_utc": 1764461309.0,
      "author": "defiant_degen",
      "text": "\nOverall record 75W-45L\n\nUnits +65.1\n\nLast pick:\n\nManchester City Vs Leeds United \n\nManchester City win and over 2.5 goals\n\n(1.66) 3 units ✅\n \nYet again, somehow my picks find a way to be sweaty when Leeds should have been dead and buried by half time.\n\nCity took the lead on just 1 minute, Foden putting city ahead and the bet off to a perfect start. They doubled their lead before half time and had countless chances and should have been at least 3-0 up at half time. They were 1.03 to win at this point.\n\nCity uncharacteristically then took their foot of the gas and dispute scoring the 2nd fewest goals in the league Leeds managed to score twice to make it 2-2 heading into the final 20 mins\n\nCity eventually break them down again in the 91st minute to get the win this should have been completely sweat free but we get what we need in the end.\n\n\nToday's pick:\n\n**14 hours from this post**\n \nPremier league\n\n**West ham Vs Liverpool**\n\n**Both teams to score and over 2.5 goals**\n\n(1.83) 3 units \n\nA rejuvenated West Ham side take on free falling Liverpool side in London.\n\nWest ham come into this starting to turn a corner on their season, they are 2nd only to Burnley (who has played an extra game) for **highest goals conceded in the league 25 goals in just 12 games**\n\nThey have scored 9 goals in their last 4 games, some really impressive performances against Bournemouth away, and have back to back 3-2 and 3-1 wins against Burnley and Newcastle.\n\nThe shock of the season has been Liverpool's collapse, in attack they play fairly well, and have been unlucky to not score more goals for the chances they've created. But in defence it's just so easy to cut them apart, Van Djik has been poor and Konate has been pathetic, his body language so poor he doesn't even seem to care anymore.\n\nLiverpool have conceded 10 goals in their last 3 games, and **away from home they have just 1 clean sheet all season** against Burnley\n\nOf course Liverpool still have the better team partially in attack. The goals will eventually come particularly when playing a poor defense like West Ham, however West Ham will smell blood on this wounded Liverpool team.\nThis game has the potential for a lot of goals and I can't pass up this bet.\n\n\n\n\n\n\n\n\n\nCoffee's always appreciated if you have found my write ups and bets useful ☕\n\nhttps://buymeacoffee.com/willo777\n\n\n**BOL and only bet what you can afford to lose!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgmhf6/"
    },
    {
      "created_utc": 1764461304.0,
      "author": "Moist_Incident_3085",
      "text": "Overall record 27W-12L\n\nUnits: +9.81 (All picks are 1 unit)\n\nLast pick: Alabama -12.5 (-114) ✅\n\nPretty much expected from Alabama they did the same thing they did vs UNLV to Maryland and won very convincingly.\n\nToday's match: Carolina Panthers vs Los Angeles Rams (NFL)\n\nPick: LA Rams -8.5 Alternate Spread (-135, Fanatics)\n\nWon't be too long of a write up simply because we took the 49ers on Monday night on the spread vs the Panthers and everything in my writeup there can apply here. I think the Panthers are bottom feeders and Bryce Young is still not good. The Panthers 6 losses this season have been by an avg of 17 points a game and they have lost by 10+ in all of them except vs the Cardinals. The Panthers now face their toughest opponent of the year in the Rams with Matthew Stafford leading the MVP race being levels above Bryce Young. If the Panthers could not put up double digits in crucial game to take the lead in their division vs a 49ers team that had given up 22+ in 7 of their last 8 games then I fail to see them do better against this Rams team who are not only much better offensively but also defensively. This Panthers defense is also banged up missing their star corner in Jaycee Horn who was responsible for picking off Purdy twice on Monday night. BOL and bet responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgmgv0/"
    },
    {
      "created_utc": 1764460440.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Sunday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pa3lqk/pick_of_the_day_113025_sunday/nrgk7br/"
    }
  ]
}