{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/19/26 (Monday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/",
  "target_date": "2026-01-19",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-19T18:54:30.701409+00:00",
  "comments": [
    {
      "created_utc": 1768847964.0,
      "author": "aryastark94",
      "text": "Record: 15-6-2\n\nLast POTD: Ugo Humbert ML (-125) ❌  \n  \nToday's Pick: Shelton/Humbert over 40.5 Games (-140)\n\nI can't believe I stayed up to watch this entire match only for Humbert to completely fall apart after picking up an early break.  Hate to see it.\n\nFor tonight, really liking this over as I'm seeing a competitive match between two solid 2nd tier players looking to start their season with a bang.  Humbert made a run to the finals at Adelaide and (besides fucking up that final match) looks to be in great form.  Shelton meanwhile suffered a tough loss to Baez last week but Baez in fairness was playing some of his best tennis in years and Ben's always had an eye for the spotlight and should bring his best game for the firs grand slam of the year.  Baez/Perricard over was a strong consideration for me as well but ultimately I see each of these guys winning a set and probably a tiebreak mixed in, making the over my favorite pick of the day.\n\nBOL if you tail.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0ituws/"
    },
    {
      "created_utc": 1768844944.0,
      "author": "Seventh__Place",
      "text": "POTD RECORD: 10-6\n\nNet units: +2.796\n\nLast 10 Form (5-5): ✅❌✅✅❌❌✅✅❌❌\n\nLast POTD: Penn State-Maryland U147.5 -108 1U ❌\n\nToday’s POTD: **Derrick White O17.5 P (-125 FanDuel) 1U**\n\nEvent: NBA | Boston Celtics @ Detroit Pistons (8:10 pm EST) | 🏀\n\n*Recap: Back-to-back shit picks. My goodness, I got this game VERY wrong. This game was 56-26 at the half. I didn't just miss the under, I missed the whole damn zip code. I wasn't even close. First, Kayden Mingo not only played, but got 19 points and five assists for Penn State. Not that it mattered. The Nittany Lions played negative defense in this one. Second, both teams shot better than 50 percent and Maryland made 18 threes when their season average was eight... EIGHT!!! I have had the bizarro Midas touch in college basketball this year. Every time I think a team is going to shit the bed, they go absolutely bonkers. I might need to start Costanza-ing my picks. You probably should too! Onward...*\n\nSince starting my POTD experiment, I'm 4-6 in college basketball, including 0-for-4 in first-half bets. However, I'm 6-0 in the NBA. So, let's return to the land of the Association. What am I missing here? Derrick White is averaging 18.1 points this season. If he scores a typical amount, we cash. But against the Pistons, that number jumps to 24.3 points per game. Why? Detroit switches everything on the perimeter, which gives White the green light to shoot 3s. And boy has he. In three games against Detroit, he's gone 14-for-34 from deep. Even against a very stingy defense like Detroit, White has the all-clear to shoot - he's finished with 18 (loss), 13 (win), and 18  (loss) total attempts. All three games have been decided by seven points or less. The Pistons are favorited by 3.5 points tonight. My thesis is Boston sticks to the gameplan, especially if the Pistons jump ahead early. When Detroit switches off on White, he takes the shot. Fair wraning: he's only hitting 32.9 percent from deep. But if he's averaging 11+ attempts against Detroit - and only makes three - I like him to get nine more points from anywhere else. Why? Because Detroit rates highly against opposing shooting guards' passing numbers. The Pistons are No. 7 in assists allowed to SGs. They force a lot of isolation, which could lead to even more reliance on White's shooting. \n\nWhite cleared this line in three straight games before a blowout win over Atlanta and a Miami game that saw Anfernee Simons go off didn't need him to add much on offense. In fact, he only took a combined 11 shots in those game. And like I've pointed out, been averaging that many attempts on just 3s alone against Detroit. I suspect we'll see a return to increased volume for White, who has played the Pistons very, very well this season. The efficiency may not be there, but I believe the volume will be. Should be a fun game to watch between the top teams in the East. \n\nGood luck and Godspeed!\n\nIf I've made you a few bucks through fades, it's just gonna ask you a few questions: [https://buymeacoffee.com/seventh\\_\\_place](https://buymeacoffee.com/seventh__place)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0iighf/"
    },
    {
      "created_utc": 1768841667.0,
      "author": "Wekken",
      "text": "**Record: 5-9-2**\n\n**Football Record: 18-30-4**\n\n**Basketball Record: 0-1**\n\n**Darts Record: 0-0**\n\n**POTD Units: -3.88**\n\n**Total Units: -14.46**\n\n**Last 5:** ✅❌️✅✅️⬆️\n\n**Sport:** Darts\n\n**Last Pick:** Lyon vs Brest – Lyon -1 AH\n\n**Upcoming match:** Michael van Gerwen vs Nitin Kumar (18:45 CET)\n\n**Pick:** Michael van Gerwen -4.5 legs\n\n**Unit stake:** 3U\n\n**Odds:** 2.25\n\n**To win:** 3.75\n\n**Recap:**\n\nLyon giving away an unnecessary goal to give us a push. Not horrible but disappointing for sure as I really liked this spot. Let's try something new with darts.\n\n**Write Up:**\n\nVan Gerwen has just won the Bahrain Darts Masters 2026. He is in-form and wants to prove to everyone, including himself, that he is still one of the best there currently is.\n\nHe is up against Nitin Kumar, a player that is most definitely a step below Michael van Gerwen.\n\nLook at these stat differences in the last 6 months:\n\nVan Gerwen - Kumar\n\nAverage: 97.87 - 75.33\n\n180s per leg: 0.34 - 0.09\n\nCheckout %: 37.29% - 28.72%\n\n%15 darter when possible: 47.24% - 6.67%\n\nFirst 9 average: 108.22 - 85.18\n\nSeeing these stats MVG outperforms Kumar in every shape and form\n\nHe will finish 40% of the legs before Kumar will even get the chance to finish\n\nLooking at average 9. On average MVG will be ~69 points ahead of Kumar after 9 darts. This will be huge and when the checkout % is included I expect a very onesided match here\n\nFade or tail, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0i6eyi/"
    },
    {
      "created_utc": 1768840355.0,
      "author": "Timely-Conclusion532",
      "text": "Record: 317-196\n\nForm: ❌❌✅✅✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅✅❌❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌❌❌❌✅✅❌✅✅✅❌✅✅✅✅❌✅✅❌ ❌❌❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌✅✅✅✅❌❌✅✅✅✅✅✅❌✅✅✅✅❌✅❌✅❌✅✅❌✅✅❌❌❌✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅✅✅❌✅✅❌✅✅❌✅✅❌❌✅❌✅✅❌❌❌❌❌✅✅✅✅✅❌✅✅✅❌✅❌✅❌❌✅❌✅❌✅❌✅✅✅✅✅✅❌✅❌✅❌✅✅✅❌❌✅❌✅❌❌❌✅✅✅✅❌❌✅❌❌✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅❌✅✅✅✅✅✅✅✅❌❌✅✅✅✅❌❌❌✅❌✅✅✅❌✅✅❌✅❌❌❌❌✅❌✅✅✅✅✅❌✅✅❌✅✅✅✅✅✅✅✅❌✅❌✅❌✅❌❌❌❌✅✅✅✅❌✅✅❌✅✅❌✅✅✅✅❌❌✅✅✅❌✅❌✅✅❌❌✅❌✅❌❌✅❌❌❌✅✅❌✅✅❌✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅❌✅✅✅✅✅❌❌✅✅✅❌❌❌❌❌❌✅❌✅✅✅✅✅✅✅✅❌✅❌❌❌✅❌✅✅❌✅❌❌✅❌✅✅✅❌✅✅❌✅❌✅ ✅❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅❌✅✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌✅❌✅✅✅❌✅❌❌❌✅✅❌❌✅✅✅❌❌✅❌✅❌✅❌❌✅❌❌❌❌✅✅✅✅✅✅❌✅✅❌❌❌❌✅✅❌❌❌❌✅✅✅✅❌✅✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅❌✅✅❌✅❌❌✅✅❌✅✅✅❌✅❌✅✅✅✅✅❌✅❌✅✅❌✅✅\n\nNet Units: +3.78 units (All plays 1 unit)\n\nYesterday’s Pick: (NFL) New England Patriots ML vs Houston Texans (-174) ✅\n\n**POTD: (NCAAF) Indiana vs Miami under 49.5 points (-138) (7:30 PM EST)**\n\nReasoning: Indiana’s defense is no joke. They rank 2nd in the nation in points allowed and held Alabama to just 3 points earlier this playoffs. Miami defense is top tier as well. They rank 1st in the nation in sack rate so Mendoza should see a lot of pressure on offense. To go along with that, Miami will be playing at their home turf, Hard Rock Stadium in Miami, Florida. Offensively, I expect Miami to control the game by playing slowly and methodically, grinding out every set of downs vs this Indiana defense but it won’t be easy as Indiana ranks #2 against the run.  Points matter a lot in these type of games and every single point will be significant in this game. In college playoff environments, points tend to be 6-7 points less than the regular season average so that said, I’m taking the under in this championship game.\n\n👇\n\n&#x200B;\n\nhttps://preview.redd.it/ag66brqi2ceg1.jpeg?width=1170&format=pjpg&auto=webp&s=81f40df933da6d93d454c32d40aaa86e23410337",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0i1jez/"
    },
    {
      "created_utc": 1768834272.0,
      "author": "jakedeltoro",
      "text": "**Overall Record**: 7-4 \n\n**Form**: ❌✅✅✅✅✅❌❌✅❌✅\n\n**Net Units**: +10.66u\n\n**Last Pick**: Senegal To Lift The AFCON Trophy (WIN ✅)\n\n**Today’s Pick**: Levadiakos ML (WIN ✅)\n\n**Wager**: 3u to win 2u (-150 on Bet365)\n\n**Match**: Levadiakos vs. Panetolikos (10:00 AM CST)\n\n**League**: Greek Super League\n\n**Last Pick Summary**: All I can say is that the AFCON Championship was absolute madness. I truly disagreed with the Senegal goal that was disallowed, from what looked like very minimal contact and an exaggerated flop from the Moroccan defender. I did however agree that it was likely a penalty from the corner, but I didn’t like how Diaz threw an absolute tantrum to get VAR involved. I quite enjoyed watching his little chip penalty that was an easy save for Mendy, and then Senegal claimed the crown in extra time. That was a wild one. All I can say is ball doesn’t lie and we are back in the W column on a big 4u, plus money banger.\n\n**Today's Write Up:** Today is a really weak slate in soccer as we gear up for Champions League tomorrow. Not a problem. I will let the other cappers focus on the Aussie Open + CFP Championship. I’ve done some searching and have keyed in on my pick of the day.\n\nWe are taking my first shot at the Greek Super League and riding with Levadiakos as they take on Panetolikos. Levadiakos won the last meeting (Oct 2025) 6-0 and has proven to be a dominant force in the Greek Super League this season. They currently sit 4th in the table with 31 points, and have netted 39 times against only 18 conceded (+21 Goal Differential). Panetolikos is having the opposite season, as they sit in 10th place with only 15 points. They have only been able to find the net 14 times in 16 matches, but have conceded 27 total times. Levadiakos won’t play again until Sunday, so I am expecting them to be at maximum effort to claim an important 3 points as they aim to keep pace with the Greek Super League leaders in PAOK, AEK, and Olympiacos. Give me Levadiakos to win this match in 90”+.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0hfoes/"
    },
    {
      "created_utc": 1768833243.0,
      "author": "AmazingNinja131192",
      "text": "Record: 6-2-0 (W-L-P) Win Percentage: 75%\n\nRisked: 8 units Returned: 9.083 units Profit: 1.083 units\n\nROI: 13.54%\n\nAverage odds: 1.70\n\nFootball | Israel Premier League, Turkey Super Lig | 19:00 and 18:00 GMT+1\n\nPick: Parlay:\n\n1. Hapoel Be'er Sheva FC +0.5 (Asian) @ 1.237\n2. Göztepe AŞ +0.5 (Asian) @ 1.242\n\nParlay @ 1.537 - All bets are 1 unit unless stated otherwise.\n\nWrite up:\n\nGoztepe is one of the best performing home teams in the league, while their oponnents are not spectacular on the road. I don't see Goztepe losing at home here.\n\nBeer Sheva is one of the strongest teams in the league and in general perform well on the road. Although Hapoel is the best performing home team in the league, I just think that Beer Sheva is better team right now. Hapoel had to play 120 minutes in a Cup derby against Maccabi at home and lost after penalty kicks. Beer Sheva is a better team than Maccabi, so I see them getting a result here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0hcc44/"
    },
    {
      "created_utc": 1768830868.0,
      "author": "Lyx97",
      "text": "Record: 32-18-5\n\nNet Units: +7.44\n\n*Prev Pick : Bologna vs Fiorentina - Fabiano Parisi o0.5 Shots @ 1.5 (1u) -> W*\n\nFootball | Netherlands Eerste Divisie | Jong FC Utrecht vs Jong PSV | in \\~5hrs\n\nBTTS & o2.5 @ 1.55 (1u)\n\nWriteup: Trying my luck at the lower league of Netherlands after a long time. Both teams score & concede a lot. Utrecht have hit this line in their last 5 matches & psv in 4/5 matches. Their last meeting in Nov also saw 6 goals scored. Hoping this line hits. Only worry would be a team getting a lead & playing defensive. \n\nHope we get the W & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0h51ko/"
    },
    {
      "created_utc": 1768826903.0,
      "author": "Dr_Tholan",
      "text": "POTD record: 35-25 (+7.82u)\n\nLast 5: WWWLL League: Saudi Arabia darts masters. Michael van Gerwen - Nitin Kumar\n\nPick: Michael van Gerwen -3.5 leg handicap @ 1.56. 2u. Starts in approx 8 hours\n\nWorld series of darts second event in Saudi Arabia. Van Gerwen managed to win the first event last weekend in Bahrein with a really good display. He averaged 97.78 with a checkout percentage of 44%. I think he is really regaining his form in the past couple of months. He also played well in the World Championship of Darts. Kumar is probably the worst player in this event. Past 6 months he averaged 75.33 with a checkout percentage of 28%. The first match in the world championship he played surprisingly well with an average of 87 but in the second match against Bunting it was clear that this was an outlier as he averaged 75 in that match.\n\nI think with the current form of MVG he should easily cover this spread.\n\nBOL\n\nEdit: 6-1 W",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0guc7q/"
    },
    {
      "created_utc": 1768826279.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 84 - 86 Profit: -4.03 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅❌❌️✅❌✅❌❌✅✅✅❌❌️❌️✅✅\n\nFjolnir - Vikingur Reykjavik, over 4.5 goals @ 2\n\nThey typically push the tempo at home, creating plenty of chances, while Vikingur have the attacking depth to respond and exploit spaces on the break With both teams needing points and rarely settling for caution, over 4.5 goals offers strong value here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0gsubn/"
    },
    {
      "created_utc": 1768822007.0,
      "author": "Global_Award_1110",
      "text": "EVENT:Saudi Arabia Masters \nStart time 6.5 hours \n\n\nRECORD 0-0 +0 U\n\nPOTD: Luke littler -4.5 + Most 180s 5U -125 \n\nWrite up: for my first pick i’m keeping this one very simple, i watch a lot of darts and luke littler is without a shadow of a doubt the best player in the world. he’s fresh off a paddy power championship win defeating Gian van Veen 7-1 in the final and i expect him to pick up right where he left off this play feels wildly undervalued to me\n\nBOL if u tail",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0gjvmp/"
    },
    {
      "created_utc": 1768819925.0,
      "author": "dreadjab",
      "text": "**POTD Record:** 3-3\n\n**Last:** Shaedon Sharpe u26.5 pts (-122) DraftKings 1.5u ❌\n\n**Event:** NBA: Bucks @ Hawks 1:10 PM EST\n\n**Today’s POTD:** Myles Turner o11.5 pts + ast (-124) DraftKings 1.5u\n\n**Write-up:** Had a few plays for the early game today, but I chose this as my potd. Turner has cleared this line 65% this season and 64% on the road. The Hawks defense is pretty bad. They rank 25th or worse in the league at allowing opponent points/rebounds/assists. Opposing centers are averaging around 20 points per game and 4 assists per game. Giannis is playing today too, which should help give more presence inside the paint. Giannis’ line is set at 15.5 reb + ast, which is higher than what he is averaging this season. If bookies think he gets more this game, I’m hoping those assists go to some easy drop-off passes towards Turner in the paint. With Giannis playing, and versus bottom 50% defenses, he has cashed 12/16 times. Turner should light this defense up today with some threes as well. Turner has one of the best three point shots for a big man, and right now, the Hawks are allowing a league high 44 three point attempts against them.\n\nGood luck, fellas. 🍀",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0gfyka/"
    },
    {
      "created_utc": 1768818456.0,
      "author": "donjavogosca",
      "text": "POTD Record: 41-27, +11.2u, (ROI +12.8%)\n\nPrevious Pick: Legia to win by 12 or more, 1.86, 1u ❌️ (last 5: ✅️✅️❌️✅️❌️)\n\nEvent: China CBA: Sichuan - Guangdong, 12:35h\n\nPOTD: First Quarter total points over 43.5, 1.82, 1.5u ✅️\n\nStarts in about one hour from now. Sichuan has maintained this limit in its last 4/5 games at home, and Guangdong has also achieved this in 4/5 games as guests.\n\nH2H in their last 3 games: 23-40, 16-25, 28-29; the one that didn't make it was where Guangdong was the home team.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0gd9np/"
    },
    {
      "created_utc": 1768817595.0,
      "author": "redwhiteandblue0702",
      "text": "Record: 0-0 (+0u)\n\nROI: N/A\n\nLast POTD: N/A\n\nPOTD: NCAAFB: Carson Beck U45.5 1Q passing yards -118. (3U to win 2.54u)\n\nWrite up: Miami has tried to dominate the time of possession game all playoffs and will continue to try and establish the run game early. Look for them to go deep into the play clock and try to limit the total number of Indiana possessions. On the flip side Indiana should be able to sustain a long drive at some point this quarter.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0gbpr3/"
    },
    {
      "created_utc": 1768813677.0,
      "author": "LolPropKing1",
      "text": "POTD Record: 212-162\n\nUnits Won: +104.28u\n\nLast Pick:STATE Map 1 ML (+115) vs. Lilmix X\n\nToday's Pick: **Noah>Ice Map 1 Kills + Yike>Velija Map 1 Kills (-108)** 5u\n\nhttps://preview.redd.it/vd785gq9v9eg1.png?width=273&format=png&auto=webp&s=d9434086ac2398478cd5a251d17099bb36dc2a22\n\n  \nTeams: Heretics vs. Giants (1:00 PM EST.) | Los Ratones vs. Karmine Corp (3:00 PM EST.)\n\n*Writeup:*\n\n**Noah>Ice Map 1 Kills**\n\n* GiantX is 2-0 so far, -300 favorites as I do this writeup. Beaten Shifters/G2\n* Heretics are 0-2 so far, lost to Shifters/NAVI\n* Noah averaging 8 kills per map in 2 games so far, Ice averaging 1, small sample but Noah leading all adcs in the league while Ice is in dead last\n* Last split Noah led all adcs averaging 6.3 kills per map while Ice averaged 3.6\n\n**Yike>Velija Map 1 Kills**\n\n* Velija has looked completely exposed so far at this tournament, looks very lost on the map and Ratones as a whole do not look like they can even remotely compete.\n* They are 0-2 so far looking very uncompetitive. Lost to KCB Academy team the other ERL team brought up for this tournament and fnatic\n* KC are 1-1 so far beating KCB the team Ratones lost to before losing to KOI, who might be the best team in the entire LEC at the moment\n* Yike averaging 3 kills per map so far, Velija averaging 0.5 kills per map. Yike was a top 3/4 kill share jungle last split for the entire LEC season, also has Baus to farm kills off of\n* Jungle meta almost entirely carries atm, so team that wins will mostly always have jungle cover in kills at the moment",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0g4uhb/"
    },
    {
      "created_utc": 1768810559.0,
      "author": "lordestros",
      "text": "Last 5 POTD : ❌️✅️❌️✅️✅️\n\n**Previous pick**: Lightning vs Stars - Under 6.5 goals ✅️ (-135) (game ended 4-1)\n\n**POTD Record** : 17-12\n\n**Today's pick** : New York Rangers vs Anaheim Ducks at 10:00pm EST (NHL/Hockey)\n\nMika Zibanejad over 0.5 points\n**AND**\nMikael Granlund over 1.5 shots\n(+145)\n\n8 games in a row with a point for Zibanejad. He is on fire right now with 8 points in his last 4 games and getting a hat-trick in his last game. In his last 11 games against the Ducks, he got a point in 10 of them. Ducks are also #2 in the league in goals allowed this season with 3.58\n\nFor Granlund, he has hit that line in his last 5 games. Ever since Leo Carlsson has been out, Granlund has to play 20+ minutes per game and that means more opportunities for him to shoot on net. In his last 3 games with Carlsson out, he got 3, 4 and 3 shots. He also usually shoots a lot against New York. He hit that line 4 times in his last 5 games vs the Rangers and two of those games he ended with 7 shots(he had 20+ minutes of ice time in those two games unlike the other ones where he played only 15-16 mins). In other words, when Granlund has more ice time and responsibilities, he shoots way more.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0fzbdg/"
    },
    {
      "created_utc": 1768809925.0,
      "author": "Imaginary_Acadia_363",
      "text": "Sigmabale or horseguy where r you guys\n\n![gif](giphy|QBd2kLB5qDmysEXre9)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0fy5rj/"
    },
    {
      "created_utc": 1768809083.0,
      "author": "zan12231",
      "text": "**POTD Record:** 8-9\n\nLast 5: ✅✅✅✅❌\n\nAfter 6 straight wins, yesterday our bet didn't go through. Fears played only 10 minutes, the least in this season...\n\n**Net Units:** \\-1,99 UNIT\n\n**Previous Pick:** Jeremiah Fears O15.5 PR (-120), 1 UNIT ❌\n\n**Today's Event:** NBA: Nets vs. Suns\n\n**Today's Pick:** Dillon Brooks O22.5 PRA (-110), 1 UNIT \n\nWrite up:\n\nBrooks is really good this season, his average on PRA is 6.4 higher than last season and most importantly, he is constantly good. Not up and downs but everytime around this average.\n\nThis season his PRA average is 25.7, so 3.2 over the line. They didn't play against Brooklyn this season yet, but they are only 12th in eastern conference. Against Indiana, Washington and Charlotte, which are around the same place, his PRA's were 33, 29 an 18. Against Brooklyn he went over the line in 2 of 3 times in his career.\n\nBookies giving us -110 odds which calculates in 52.6% probability to cash. But Brooks went over this line in 23 of 36 in this season (64%). So we have 11.4% edge over the prediction in this season.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0fwlli/"
    },
    {
      "created_utc": 1768808486.0,
      "author": "Ok_Concentrate_2779",
      "text": "POTD Record 1-3 (-2U)\n\nPOTD: Brighton vs Bournemouth - Junior Kroupi 1+ SOT; 1.83 odds on bet365 ( 1.2U to win 1U)\n\nAfter the departure of Semenyo, Bournemouth need someone to step up, and Kroupi who already has seven goals this season looks set to be that man. I expect him to be even more involved and to be the one getting off more shots. The odds here make no sense as they seem really high, so probably this is the last time we see them like that.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0fvhl3/"
    },
    {
      "created_utc": 1768807848.0,
      "author": "CryptographerKey6794",
      "text": "\nRecord: 6W-3L-2P every pick is 1 unit\n\nNet units: 6.48\n\nLast Pick: Manchester united vs Manchester city\n corners o10(L)\n\n\nSoccer/english premier/ Brighton vs Bournemouth 3:00pm est\n\nPotd: Brighton vs Bournemouth \nBournemouth -0 corners(2.32)\n\nWriteup: \nBrighton and corners doesn't go well with each other having no more than 4 corners in their past game while Bournemouth can earn a lot more corners even when playing against a higher ranking team \nBOLS to all",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0fub42/"
    },
    {
      "created_utc": 1768805845.0,
      "author": "Yew32",
      "text": "Record 5-1 \n\n**POTD:** Giannis Antetokounmpo Over 28.5 Points (Line will move very soon, I believe)\n\nAlright so this one is a risky one if thats not what you want to hear fade it rn, I understand\n\nRight now Giannias Antetokounmpo is going through it, getting booed at his own Arena, telling the media that he lets nothing get to his head and that even his own family doesn't get to him. What happened the next game was 14 points in the first quarter against the Alien in 7 minutes. Granted he only scored 2 and 5 points in the next quarter and not playing the last quarter due to a blow out.  \n\nRight now Atlanta is also going through a massive slump like horrid, Jalen Johnson has been very very different not sure as to why but he looks out of it. He's playing soft, not taking the right shots and passing on open looks. Now this could be because Zacharie and Porzingis are out and potentially played a far bigger role in defence then we originally thought. Onyeka Okungwu is also definitely tired playing 33 minutes in their last 5 games which is actually a lot specifically for a center. Bucks also have an extra day of rest compared to the Hawks. \n\nNow I also mentioned Jalen and Onyeka Okungwu a lot because they are the only ones currently that mainly defend the paint or make a difference. They are quite literally the only tall players that can somewhat defend. If Onyenka and Jalen do not match Giannis' minutes then this should be a field day for Giannis, which I know this guy wants to show up especially in these circumstances. \n\nIf we want to really get into it as well, Jaylen Brown went to the free throw line 11-12 and only scored two threes and ended on 41 points, who did not even play the last quarter. Nearly all of those shots were in the restricted area which is where Giannis does damage. Now what about another big player like the Celtics big man 14 points in the restricted area as well, all in the restricted area. The previous game before that Jerami Grant had no issues getting to the line as well who also plays PF. Lebron against this blazers team? Leading scorer over Luka Doncic at 31 points as well, who is guess what a PF.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0fqg4c/"
    },
    {
      "created_utc": 1768805328.0,
      "author": "Donloppa",
      "text": "Record: 23-15\n\nNet Units: +14.41 units\n\nPick: Australian Open\n\nRinky Hijikata vs Adrian Mannarino\n\nOVER 38.5 games \n\n3 units. \n\n00:20 am MST (approx)\n\n3 units to win 2.72 units.\n\nI posted this about 11 hours ago in my thread but now that its delayed and will be on monday I will use this as my potd. \n\nI like Rinky but I have always found that when he is a favorite he doesnt perform as great as when he is a dog. Numbers could prove me wrong on that, but that is my experience. With that being said I do think Rinky will take this, but I also think we see over 40 games. \n\nEnjoy!\n\nIf you follow one of my picks and blame me for your loss, bad luck will follow you for eternity. \n\nFeel free to fade\n\nOr feel free to tip! [Buy me a beer](https://buymeacoffee.com/donloppa)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0fpeox/"
    },
    {
      "created_utc": 1768801892.0,
      "author": "Short-Virus-5992",
      "text": "Record 0-0\n\n\nSoccer | Serie A | Lazio v Como / 2:45 PM EST\n\n\nPick: Nico Paz 3+ Shots (-180 DK)\n\n\n2.7u to win 1.5u\n\n\n\n\nWrite up: Paz has hit this mark every time I have bet it (2 times prior). He had 8 shots last game against AC Milan in a game where Como had almost 70% possession and played very well. He has hit this mark in 9 out of his last 10 games that he started in Serie A. I expect Como to keep their form and for Paz to keep shooting. He hasn't scored yet in the new year so it's a hunch of mine that he's really eager to score and will keep shooting until that happens. He had 4 SOT last game, 1 from outside the box so his confidence is definitely high in his shooting ability. There's good value in laddering his shots up to 5 based on his recent performances. I'm sprinkling on him to score or assist but there's no statistical base for that. Anyway, Paz has yet to let me down when I bet him for 3+ shots, so I figured I'd share. I wouldn't be surprised if you could find better odds for this as well.\n\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0fibw8/"
    },
    {
      "created_utc": 1768799499.0,
      "author": "Diamondhf",
      "text": "POTD Record: 18-11\n\nNet Lifetime Units: +19.62\n\nLast Pick: [Miami +3.5] W https://www.reddit.com/r/sportsbook/comments/1pqyuq2/comment/nuy67ma/?context=3&utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button\n\n\nPOTD: Miami +7.5 -106 5.25u to win 5u\n\nIndiana Hoosiers @ Miami Hurricanes, 7:30pm EST, Hard Rock Stadium, Miami, Florida\n\nLast game of the year for college football. Currently riding on a nice 3 game winning streak, and what better way to cap off the National Championship game than with a 5 unit bomb? My previous pick was Miami +3.5 against A&M, and a lot of my thoughts on Miami as a whole can be found in my previous post for them. Not much has changed since then for them.\n\nIndiana is overvalued currently. There was a shockwave that went through Vegas when Indiana beat the fuck out of Oregon, 56-23. Everyone immediately skyrocketed their expectations of Indiana in the National Championship game, and the line opened up at around 9.5. Since then, I’ve seen it hovering around 7.5 to 8.5 on various books. This has happened ALL season for Indiana, and I’ve been watching them very closely. \n\nIndiana goes out and puts belt to ass against an overrated #9 ranked Illinois team, 63-10. Next week they play a top defense in Iowa and Iowa covers the +7.5 spread, and nearly beats them. They go out and beat the fuck out of Maryland, the following week Penn State (while they were going through hell with their own issues), ends up covering the spread, and forces late game heroics from Mendoza to win the game. They finish the season off beating the breaks off of Purdue, go to Indianapolis and only win by 3 against Ohio State.\n\nThe general public has Indiana as WORLD beaters because all they’ve seen for the last month is their QB win the heisman, they go out and beat the #1 team in the country in Ohio State, beat the fuck out of a NOT good Bama team, and get a huge neutral site win against an Oregon team that IMO has been overvalued all year.\n\nThis Indiana team is not good enough offensively against top end defenses to make me confident in them covering in this spot. \n\nAgainst the #8 defense in the country, Iowa held Indiana to just 20 points, and put Mendoza through hell. Mendoza had a 58% completion, 233 yard game with only 13 completions. He had his worst QBR of the year against a hostile Iowa crowd with just an 80.3 QBR. He also threw what should have been a game losing interception with 2:40 left in a tie game. Iowa covered the spread.\n\nPenn State with the #31 defense in the country (which I believe is a bit inaccurate just due to how their season unfolded), put him through hell as well. They forced him to a 63% completion, 218 yard outing, with an interception. Mendoza had a 79.9 QBR in this game, and Penn State covered the spread, Indiana only won by 3 points on a last second touchdown.\n\nOhio State with the #1 defense in the country only allowed 1 touchdown to Indiana. They scored 13 points, and barely squeaked out a win against an Ohio State team that had 5 red zone trips that they failed to score points on. Indiana covered as underdogs in the Big ten championship game. \n\nMiami is the most similar defense to the 3 teams I listed above than any other team on Indiana’s schedule. Coming in at #5 in the country, Miami’s defense is LEGIT. Read my last POTD to get a more in-depth breakdown on that entire unit because I don’t have enough space to write it here.\n\nIndiana is a great football team that is just a tiny bit overvalued. They have shown an ability to bleed against high end defenses, ultimately getting the job done against every one of them, but making it a lot closer than predicted. Miami is a really great team, and will lean on Toney to keep this game super competitive. I anticipate Indiana to win in last second heroic fashion, but ultimately fail to cover the spread.\n\nGood luck to everyone on this game, and be sure to soak it in. We won’t have college football for a while, and I sure as hell will miss it. Grab a beer and have fun watching Miami cover in their home stadium.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0fd1cb/"
    },
    {
      "created_utc": 1768798379.0,
      "author": "Top_Season327",
      "text": "Record: 0-1\nNet Units: -1.25 \nROI: -100%\n\nLast Pick: Purdue -9.5 (-125) ❌\n\nPick: Drexel @ Towson o124.5 (-110) FanDuel\n1.1 to win 1\n\nWrite Up:  Over 124.5 is a value position. While Drexel vs Towson profiles as a slower matchup, neither defense consistently suppresses scoring efficiency & Towson’s offensive rebounding creates extra shot volume that tempo metrics fail to capture. Both offenses average in the high 60’s. With a total being posted this low, I feel it’s a must buy on principle.  Both teams would need to be abysmal from the field to go under here. I believe the number can only go up from here. I can see this realistically closing with 3-4 pts of closing line.  This is a perfect overnight buy spot.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0fadrd/"
    },
    {
      "created_utc": 1768797076.0,
      "author": "planetICE",
      "text": "**Record:** 18-20-2 || **Net Units:** -4.10 \n\nLast Five (New to Old): WLWWW \n\nLast Pick: Phantom ML ✅️ || 1.5u at -196 || Phantom at Hive || 3v3 Unrivaled Basketball \n\nNice to get back in the win column as Phantom comfortably defeat Hive (71-59) with their starters Boston, Plum, and Hayes combining for 58 points. My last 5 picks have been this Unrivaled season and I'm looking to keep this run going \n\n**Today's Pick:** Vinyl at Lunar Owls o140.5 points || 1.0u at -113 on FD || 3v3 Unrivaled Basketball 9:15pm ET \n\nAll of the Lunar Owls (0-4) games have gone over this line: 142, 154, 156, 144. Vinyl's offense can go off at any time and the last two games the team has scored 89 vs Hive (40pts from Hamby) and 81 vs Breeze (30pts from Howard). This game also has several players with top PPG this year including on Lunar Owls: Marina Mabrey (27) and Aaliyah Edwards (24) and then on Vinyl: Dearica Hamby (22) and Rhyne Howard (21.5). Vinyl are coming off two nice offensive performances and against this struggling Lunar Owls squad I'm liking the over line. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0f76pv/"
    },
    {
      "created_utc": 1768796427.0,
      "author": "PurpleDragonBets",
      "text": "Record: (122-83-11) \\[+10.79\\]\n\nPOTD⭐️:🏈🏀Incarnate Word ML/Indiana -2 (-141) \\[Bet365\\]\n\nStart Time & TV 6:00 & 7:30pm EST (ESPN+ & ESPN)\n\nUnits: 3 Units\n\nReasoning: For tomorrows pick of the day we be going with a two legger with the Incarnate Word Cardinals (9-9) over the East Texas A&M Lions (7-12) and well be capping off the college football season with the Indiana Hoosiers (15-0) to cover a 2 point spread against the Miami Hurricanes (13-2) in the national championship game. First of all I like going with Incarnate Word as they are at home in this one and they have been amazing at home this year with an undefeated 8-0 record on their home court while the East Texas A&M Lions have struggled on the road this year with a 2-9 record away from home. This Cardinals squad leads the Lions in points per game, points allowed per game, field goal percentage, free throw percentage, three point percentage, three point defense, rebounds per game, and turnovers per game. This Lions team is very poor at rebounding, free throws and turning the ball over, out of 365 division one schools the Lions rank in the 300s in those metrics. I also like going with the Indiana Hoosiers in the national championship game as this Hoosiers has looked unstoppable this year as they are led by Heisman winning quarterback Fernando Mendoza who has been extremely efficient leading this Hoosier offense with a 73 percent completion percentage with 41 touchdowns with only 6 interceptions compared to Miamis quarterback who has 29 touchdowns but 11 interceptions on the year. This Indiana rushing attack is also very dangerous as they rank 12th out of 136 FBS schools tallying 220 rushing yards per game compared to Miamis rushing attack that ranks 74th in rushing yards per game. This Hoosiers squad has been lighting up the scoreboard as they rank 2nd in the FBS in points scored per game racking up 43 points per contest compared to Miami who averages 31 points per game. This Indiana team is also paired with an amazing defense as they rank higher than Miamis defense in terms of rushing yards allowed per game, passing yards allowed per game and points allowed per game so I like riding with the Hoosiers with an edge in offense and defense.\n\nPrediction: 75-68 Cardinals, 30-23 Indiana\n\nLast pick:🏈Patriots -3💰We pointed out CJ Strouds turnovers being a possible factor and man it sure was! Nice cash by the Pats there!\n\nBest of luck to everyone tailing and remember to bet responsibly! Lets cap this college football season off the right way! 🍀💜🐉\n\nhttps://preview.redd.it/2gmlot8wf8eg1.jpeg?width=1020&format=pjpg&auto=webp&s=6af2a6e688808bed27d9888a0ed6c3ee1cf64e95",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0f5ko5/"
    },
    {
      "created_utc": 1768796322.0,
      "author": "leagueisbetterlol",
      "text": "**Record:** 4-1-1 (+3.25u)\n\n**Last:** Red Wings vs Senators | Red Wings ML + Lucas Raymond 1+ Point (2.20) ✔\n\nPOTD is **Carolina Hurricanes vs Buffalo Sabres | Carolina to Score o3.5 Goals (1.83)**  \nTime: 1:30pm EST\n\nLuukkonen 2-5-1 as away, 3.19 GAA, .883%  \nLukkonen during the DAY, 1-1-2, 3.47 GAA, .885%  \nCarolina at home GFA of 3.88  \nBuffalo away allows 3.50 goals per game  \nBuffalo has gone over the game total 7 games in a row\n\nI really wanted to play Canes at home against Buffalo just 3ML but these OT's have been scaring me. Buffalo has not won in Carolina since 2016, that is 12 games at home for Carolina where 10 of those games the canes put 4+ goals in the net. I think this is a huge regression spot for the Sabres in a game during the day where their goalie does not perform. Carolina's offense is producing right now and they are 6-2 of their last 8 winning by 2 goals or more in 5 of those 6 wins. Even if Sabres for whatever reason decide to go with Ellis tomorrow in net I think the Canes are pumping the Sabres. I think Sabres still produce some offense with how they have been playing recently but I think the Canes take this game dominantly like they did the first game at home this season outshooting them 35-22 and winning 6-3. I have tomorrows mid day game ending 5-2 for the Canes.\n\nBOL! All my picks are 1U bets!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0f5bbf/"
    },
    {
      "created_utc": 1768794878.0,
      "author": "Next-Application-244",
      "text": "**POTD Record:** 8-6, Net Units +2.31\n\n**Previous Pick:** NFL - Jaylin Noel over 1.5 receptions = Loss \n\n**Reaction:** Didn't even get a look smh, CJ couldn't throw a ball\n\n**Event:** NCAAB - Lamar @ New Orleans\n\n**POTD:**  New Orleans ML\n\n**Odds: -110**\n\n**Write Up:** My model said this game had a 4-point edge in favor of New Orleans. They are currently +1.5, but I am taking them ML.\n\nBOL if tailing, feel free to send a little love my way <3\n\n[buymeacoffee.com/nextapplication](http://buymeacoffee.com/nextapplication)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0f1l2i/"
    },
    {
      "created_utc": 1768793489.0,
      "author": "Money-Swimming2179",
      "text": "Record 11-1-6\nForm: ✅✅✅✅❌❌✅❌✅✅❌❌✅✅✅⬆️✅❌<-\n\nLast POTD: **Langreo v Deportivo Fabril: Deportivo Fabril ML @1.86❌**\n\nTodays POTD: **Brighton v Bournemouth: Brighton o1.5 team goals & o7.5 match corners @1.95**\n\nFor this slip, Brighton to score twice and over 7.5 corners fits the way both of these teams play. Brighton are not crazy explosive, but they are steady. They average around 1.6 goals a game and against a defence like Bournemouth, that’s enough to expect at least two. Bournemouth concede a lot, around 2.8 goals per game recently, and they have not kept a clean sheet. That alone gives Brighton a really good chance to hit two goals, even if the game itself is not a total goal fest.\n\nBrighton are also strong defensively, so they usually control games better than their opponents. That means more time on the ball, more attacks, more pressure, and that naturally creates corners. Bournemouth also help this bet because of how they play. They attack a lot, take many shots, and their games are messy. That leads to blocks, deflections, saves, and clearances, which all turn into corners. In their recent games, Bournemouth have been involved in matches with over nine corners every time, so over 7.5 is actually a pretty low line for how their matches go.\n\nEven if the total goals stay moderate, like 2 to 1 or 2 to 0, this bet still works. Brighton can get their two goals by being patient and using Bournemouth’s weak defence, and the corner count can climb just from both teams playing open, shooting often, and forcing defensive actions. Brighton pushing for goals and Bournemouth trying to respond is the perfect recipe for a high corner count.\n\nSo the idea is simple. Bournemouth concede alot of away goals, Brighton are good enough to score twice, and the way both teams attack and defend makes corners almost guaranteed. Two Brighton goals and at least eight corners fits the stats, the styles, and the recent form really well.\n\nBest of Luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0ext7h/"
    },
    {
      "created_utc": 1768791449.0,
      "author": "WeightShift",
      "text": "**POTD Record 144-1-75 | +94.26u**\n\n**Form:** LLWWWWWWWLWLWLWLWLLWWWWWWWW\n\n**ATP: Aus Open - Rinky Hijikata H2H v Mannarino** **2U** $1.62 (Ladbrokes) 4:20PM AEDT\n\nKeeping today's write up short because I just really don't understand these odds. Mannarino has had some deep runs at the Aussie Open but he's in the twilight of his career and has had some shocking showings his last 6 matches. Rinky has had an impressive prep for the Open and whilst the opponents he's beaten havent been great, he showed flashes of brilliance against Perricard and Fokina. \n\nI question Mannarino's prep and form for this with only 3 hours of court time this year, getting demolished in both showings. \n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0erp49/"
    },
    {
      "created_utc": 1768791369.0,
      "author": "ThatOneCinaGuy",
      "text": "**Record: 127-92-9**\n\n**Units Won: +14.05 (All Picks are 1U)**\n\n**Form:  ❌✅❌✅❌✅❌✅❌🅿️❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅✅✅✅❌✅✅✅✅❌✅❌✅✅✅✅❌✅🅿️✅✅✅✅✅✅❌❌✅❌❌❌❌✅✅✅✅✅✅✅✅❌✅✅✅✅❌✅✅✅✅❌❌❌✅❌❌✅✅✅❌❌❌✅❌❌❌🅿️❌✅✅❌✅❌❌✅❌✅✅❌❌❌✅✅✅❌🅿️❌❌🅿️❌✅✅❌✅❌❌❌✅✅✅✅✅✅❌❌✅✅❌✅❌❌✅✅❌✅✅🅿️✅❌❌❌❌✅❌✅❌✅✅❌❌✅❌✅❌❌🅿️✅❌✅✅✅✅✅❌❌❌❌✅❌✅🅿️✅❌✅✅❌✅❌❌❌✅✅❌✅✅✅❌✅❌✅✅❌✅❌✅✅❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅✅✅🅿️**\n\n**Last POTD:** Melbourne City Vs Auckland - **Auckland Team Total Over 1 (Asian Total) @ 1.73 (Melbet) - PUSH**\n\n**Football | Turkey - Super Lig | 01:00 AM (GMT+8)** \n\n**Pick:** Goztepe Vs Rizespor - **Goztepe ML @ 1.94 (Melbet)**\n\n**Write Up:** Goztepe return home full of confidence, built on strong defensive organisation and taking their chances when it matters. Rizespor come into this match with mixed form, capable of good performances, but often let down by defensive mistakes. Goztepe’s recent games show a team that’s comfortable staying in control. Back-to-back clean-sheet wins against Samsunspor and Gaziantep highlight their discipline, patience, and ability to see games out. \n\nAt home, Goztepe tend to play in a controlled and measured way rather than pushing too hard. Their 0-0 draw with Kocaelispor and narrow 2-1 loss to Trabzonspor were both tight games for long periods, showing how well they limit space and force opponents into low-quality chances. Over their last five matches, Goztepe have conceded just four goals, which is impressive. While they may not score in big numbers, they are efficient going forward, especially when the game stays structured.\n\nRizespor’s recent form has been up and down. Their 3-0 home win over Eyupspor showed what they can do when things go their way, but heavy losses to Fenerbahce and narrow defeats to Besiktas and Kayserispor highlighted ongoing defensive problems.\n\nAway from home, goals have been harder to find. The 1-1 draw at Konyaspor was solid, but they struggled to control the game for long periods. Over their last five matches, Rizespor have conceded seven goals, often after losing their shape. That inconsistency makes them vulnerable against teams that manage the tempo well.\n\nGoztepe look well placed to get a win here, backed by their strong defensive record and Rizespor’s inconsistent attacking output away from home. Goztepe’s ability to keep games controlled suits this matchup perfectly. Rizespor have also struggled for results recently and remain shaky at the back, failing to keep a clean sheet in their last five matches while conceding 11 goals. With that in mind, the home side should have enough quality to secure a solid victory.\n\n**NOTE: Please only stake what you can afford to lose; know that no picks are 100% guaranteed to hit. Stake Responsibly.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0erg1f/"
    },
    {
      "created_utc": 1768790854.0,
      "author": "Vander_chill",
      "text": "**POTD Record:** 107 – 71- 11\n\n**Previous:** Luther Burden III - Over 2.5 Receptions + Barcelona Draw no Bet @ 2.09 (3 units) –LOSS!\n\n**Recap:** Luther Burden prop is pending, but does not matter because Barcelona found a way to lose.\n\n**New Event:** NCAAF–Miami vs Indiana\n\n**Pick:**  Miami Team Rushing Yards Under 118.5@ 1.83 (3 units)\n\nIndiana has the #1 rush defense in the country holding opponents to an average of 26 rush attempts per game and an average of 77 yards per game. Miami’s rush offense is 48^(th) averaging 37 rush attempts per game and 150 yards per game. Every single one of Indiana’s opponents this season has significantly reduced their rushing attempts and have had no choice but to opt for a more dynamic passing offense to try and catch up on the scoreboard.\n\nJust to illustrate let me list the names of Indiana’s opponents, the final score, rushing attempts and rushing yards against Indiana’s defense. You may recognize some of these names. Keep in mind that Indiana won all these games.\n\nName / Score / Rush Attempts / Rushing Yards\n\nOregon / 56-22 / 26 / 93\n\nAlabama / 38-3 / 18 / 23\n\nOhio State / 13-10 / 26 / 58\n\nPurdue / 56-3 / 27 / 44\n\nWisconsin / 31-7 / 30 / 70\n\nPenn State / 27-24 / 33 / 117\n\nMaryland / 55-10 / 17 / 37\n\nUCLA / 56-6 / 25 / 88\n\nMichigan St / 38-13 / 24 / 74\n\nOregon / 30-20 / 30 / 81\n\nIowa / 20-15 / 31 / 92\n\nIllinois / 63-10 / 20 / 2\n\n...enough you get the point\n\nOld Dominion did put up 218 yards rushing against Indiana in the 1^(st) game of the season and since then only Penn State went over 100 as well.\n\nIndiana has held 12 of their 14 opponents this season to 93 yards or less this season. Miami is a run heavy offense, but they will most likely be playing from behind at some point and will be forced to abandon the run. Regardless, I doubt they will have much success on the ground against Indiana.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0epusv/"
    },
    {
      "created_utc": 1768790773.0,
      "author": "Section1ne0h4our",
      "text": "Record: 21-12, +8.89u\n\n*Last 5:* ❌❌✅✅✅\n\n**CFP - Indiana @ Miami, 7:30 PM ET, ESPN**\n\n***Indiana 1H +3.5 / 1H Total u30.5 (-140) 2u***\n\nThe College Football National Championship brings us two juggernauts on the defensive end of the ball, as Miami hosts Indiana for all the marbles. **I’m taking Indiana to cover +3.5 & the total in the first half to stay low.**\n\nThe easy focus here is what both these schools have modelled their foundations on: setting the tone defensively. *Both teams decided to play a bit of shotgun football last week*, but I expect both teams use that tape to clean things up this week.\n\nThese are two of the best first half D units in all of college football. **Miami rank 3rd at 4.8 points against, meanwhile Indiana are 5th just shy of a touchdown at 6.6 points against.** On paper, there’s a touch of risk: *Indiana are “fast starters” statistically, ranking 6th in the NCAA with 20+ PPG in first half scoring*, but they will be in a hostile title atmosphere which might negate some of that flow.\n\nThis is why I’m actually giving Indiana a field goal rather than playing the money line for insurance purposes. Despite being one of college footballs fastest starters, **Indiana have actually gone under this first half total in 5 of their last 7 games**. They score, but they suffocate. \n\nLining up with this: Miami have been one of the slower starters in all of college football, ranking **84th in first quarter scoring, & 55th in first half scoring**. In fact, they have **scored a total of three points in the first quarter of their 3 playoff games this season. That’s an average of ONE point per game**. CFL shit.\n\nAs I mentioned before, Miami much like Indiana went over the first half total contrary to their body of work last week. **PRIOR TO last week, Miami were under this first half total in EVERY OTHER GAME THIS SEASON.**\n\nThey do this by **possessing the ball at a college best rate 58% per game, (62% during this college football playoff)**. Being the “home” team, they may use this stability they’ve found controlling the ball over the last few weeks to try and stagnate Indiana’s offensive unit.\n\n**Indiana rank 2nd in all of college football giving up only 13.6 first downs per game this season, Miami cracked the top 20 themselves with a respectable 17 per game**. Again - nothing to give by either defensive unit. I can see a lot of punts, a few field goals, and an emphasis on extended drives, both teams will value their early possessions and you might see both these teams take the points\n\n**I’m betting against what both teams showed off offensively last week, and leaning into what both teams are built to do on the biggest stage**\n\nLast play review:\n\n***Colby Parkinson o19.5 Rec Yds (-114) 1.25u*** ✅\n\n(Moderately sweaty as Higbee got a mid-deep touch and Ferguson in his return saw some targets and yards - but as he has always been, Colby was old reliable for us with 2 receptions for 41 on 5 targets *at the time of writing*.)\n\nBOL if you’re tailing, and if not BOL in general.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0epldr/"
    },
    {
      "created_utc": 1768790252.0,
      "author": "Queasy-Astronaut-372",
      "text": "Wtf just happened",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0envff/"
    },
    {
      "created_utc": 1768787860.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 24-25-5 (Avg Odds +128)\n\n**Previous Pick:** Ollie Watkins ATGS (+140) ❌️\n\n**Today's Event:** English Premier League (Soccer) | Brighton vs Bournemouth (12:00 PM PST)\n\n**Pick:** Kaoru Mitoma to Score or Give Assist (+135) 1 unit to win 1.35 units\n\n**Write Up:** I guess Villa was bound to lay a goose egg at some point, really bad showing by them all around. Couldn't find Watkins or any other passes near the box, and Everton played a mean defense. Well played to Everton, on to the next for us. \n\nBrighton host Bournemouth here in a battle of the mid-lower table. Expecting a shootout here as both teams need points and tend to participate in high scoring matches. Bournemouth have been a poor defensive team this season. They concede the 2nd most goals in the EPL, behind only West Ham, the 3rd most xG, and the 4th most SOTs. Their games are also the highest scoring in the EPL. This is especially true on the road, their last 8 away matches they have conceded 3-2-4-4-3-4-3-3. They have conceded over 3 goals in 7 of their last 8 away matches, which bodes well for our home team here. \n\nMitoma has been dealing with injuries most of this season, having only participated in roughly half of Brighton's EPL matches. He is now fully fit though and has come back to the starting lineup. That said, he is coming back into form and scored his 2nd goal of the season in their last match against Man City. His first goal, coincidentally, was in the reverse fixture at Bournemouth earlier in the season. Over the last 3 seasons, he has scored 4 goals against Bournemouth in 4 games. He was also Brighton's joint top scorer last season. Since his minutes have been limited and the sample size this year is small, this play is more about my opinion that Mitoma is the best player on the Brighton team, when healthy, and Bournemouth are one of the worst defensive teams in the league. \n\nBOL, happy Monday, let's start the week off with a win!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0eghvk/"
    },
    {
      "created_utc": 1768786876.0,
      "author": "kab1218",
      "text": "PoTD 17-22-1 \n\nLast 5:  ❌✅✅❌❌\n\nNet: -23.3\n\nPrevious: England | Premier League | 1130am | Aston Villa vs Everton | Aston Villa -1 5U @ +128\n\nEverton that. Haven’t won there in 10 years, Villa 2nd loss in 15 months at home. Moving on.\n\nToday: Türkiye | Super Lig | 12pm Eastern | Göztepe vs Çaykur Rizespor | Göztepe ML 2U @ -110\n\n\n\nWrite up: Göztepe are great at home (barring historically strong Turkish teams) and are on a good two win home streak. Lets see them continue that tomorrow vs one of the worst teams in the league, very poor away from home, and scoreless in their last 2. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0ediup/"
    },
    {
      "created_utc": 1768786088.0,
      "author": "stevienick8",
      "text": "Record: 0-0 \n\nEvent: Australian Open R1 \n\nPick: Mattia Belucci vs. Casper Ruud Over 36.5 Games (1.1U to win 1U) \n\nLong time lurker and long time tennis gambler. Belucci is an intriguing player with his aggressive play style and fiery antics. Ruud has had a rough run in the early rounds of majors recently. \n\nBoth players come into this tourney having lost 4 of 5 matches. I expect Belucci to play for the crowd and hold his massive serve at least 1 set. Adding in Ruuds inconsistent slam performance and I love the over here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0eb7s9/"
    },
    {
      "created_utc": 1768786033.0,
      "author": "Certain-Challenge202",
      "text": "Record: 75-49(+27.134)\n\nLast Pick: Newcastle ML v Wolves\n\nToday’s Pick: Como Double Chance v Lazio and Under 3.5 goals \n\nCompetition: Serie A\n\nSport: Football\n\nOdds: 7/10\n\nReasoning: Como are 6th with a +12 goal difference and average 1.5 points per away game, while Lazio at home only average 1.6 points and have scored just 15 in 10, this is not a dominant home side. Away, Como concede 0.9 goals per game, Lazio home matches average 2.4 total goals, and both teams’ recent form trends sit comfortably below 3.5 goals. Therefore, Como have been more reliable away than Lazio have been at home, and the numbers say this game naturally stays tight\n\nUnits: 2",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0eb1x7/"
    },
    {
      "created_utc": 1768785549.0,
      "author": "Alexandre_Lopes2",
      "text": "**Record: (5-2) (+11.06u)**\n\n**Form:** ✅✅✅❌✅✅❌\n\n**Last POTD:** Atlético ML + Barcelona ML ❌\n\n**Event/Match:** Football | Israel Premier League — Hapoel Tel Aviv vs Hapoel Beer Sheva (18:00 WET)\n\n**POTD:** Hapoel Beer Sheva ML @1.70 (2u) \n\n**Write-Up:**\n\nLuck was not on our side yesterday, with the way the game was going Barcelona should have gotten an easy win, with even 2 invalidated goals, but it is what it is, let's hope luck is with us this time.\n\nHapoel Beer Sheva come into this match in a very strong position. They sit 2nd in the league with a record of 13W, 3D, and 2L, but that’s only because Beitar Jerusalém (1st) have played one extra match. With a win here, Beer Sheva reclaim 1st place, which adds extra motivation to an already important matchup.\n\nForm strongly favors the visitors. Beer Sheva are unbeaten in their last five matches in all competitions (4W, 1D), while Hapoel Tel Aviv (5th) have been inconsistent over the same stretch (2W, 1D, 2L). Despite Tel Aviv’s solid home record this season (8W, 1D in the league), context matters: they’ve struggled badly when facing top opposition.\n\nLooking at Tel Aviv’s home defeats in all competitions this season, all of them came against teams in the top of the table: Maccabi Tel Aviv (3rd) twice and Beitar Jerusalem (1st). Going back to last season, the last time they lost at home before that was a heavy 1–5 defeat to Hapoel Beer Sheva. Against top-five teams this season, Tel Aviv have only managed one win: a 3–2 victory over Beitar Jerusalem that was heavily influenced by a late red card.\n\nThe head-to-head history is also very telling. Beer Sheva have won 4 of the last 6 meetings, and in Tel Aviv specifically, they’ve won 3 of the last 5. The last two visits saw Beer Sheva dominate, winning 5–1 and 4–0.\n\nAway from home, Beer Sheva have proven they can handle big games. This season they’ve beaten Beitar Jerusalem (0–1) and Maccabi Haifa (0–1) away, dominating both matches statistically with higher xG, more shots, more shots on target, and more big chances. Even in away games where they dropped points, performance wasn’t the issue, luck and a red card played a major role.\n\nSo even though Tel Aviv have a very strong home record this season, considering their struggles against top teams and Beer Sheva’s head-to-head dominance, I’m backing Beer Sheva to win this game and reclaim 1st place in the league.\n\nhttps://buymeacoffee.com/alexandrelopes",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0e9ndt/"
    },
    {
      "created_utc": 1768782543.0,
      "author": "CMDVN",
      "text": "Brighton @ 1.90 (Tonybet) - €300.00\n\nLast 5 >LWWLW // Profit: €2,488.01\n\nBrighton at home are 5-4-1 and have a 18:11 goal diff. On their trips Bournemouth are 1-4-5 with a leaky defense being 18:29. They also go winless in their last 5 away trips going into this game.\n\nOn the H2H end Brighton have beat Bournemouth for 4 successive home games",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0e0dag/"
    },
    {
      "created_utc": 1768781526.0,
      "author": "dreamchasing1",
      "text": "Record: 257-240 Net Units: -25.25 62-63 on 1.5u plays, 44-43 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Netherlands Eerste Divisie] Almere City vs De Graafschap\nLast pick: Asian total corners over 10.5 @ 1.90 - 1.5 Units won\n\n\nEvent: Soccer/Football, [Turkey 1. Lig] Igdir vs Sakaryaspor\n\n\nPick: BTTS @ 1.80 - 2 Units\n\n\nLast game between the two ended 3-2 this season. At home this season, Igdir have recorded a BTTS in 11/12 games, just a great matchup that allows to even way weaker sides - they allowed to Adana  who have scored just 15 in 21 games, allowed in cup games vs weak teams, allowed 2 goals to Hatayspor, another weaker side. Sakaryaspor have managed 8/10 btts hits in away games, one of the misses being vs Adana who are the worst team in the league. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0dx6jh/"
    },
    {
      "created_utc": 1768780919.0,
      "author": "damagebabee",
      "text": "**POTD** Record 131-04-102\n\nESTRELA VS ESTORIL\n\nDate: 19 JANUARY 2026 at 21:15\n\nBET ON: Both teams to score- Yes\n\nOdd: 1.73\n\n\n\n\\- For BTTS – Yes, there are compelling tactical and motivational reasons suggesting both teams will score. Estrela’s coach José Faria has publicly framed the match as one of “importance máxima” and a chance to end their winless patch, stressing that his side are confident and see positive momentum as key, even if they’ve struggled recently — he expects Estoril to come with high motivation and a different stimulus, which means Estrela will not sit back but try to take the game to them. Estrela’s recent games show they are aggressive in transition and score after the break but are also prone to conceding once the game opens up, reflecting a tactical willingness to commit players forward that weakens them defensively. Four of their last five league games have finished with over 2.5 goals, underlining this attacking-but-vulnerable profile. Many Portuguese sources confirm coach Faria’s intent to push the team forward rather than park the bus against a motivated Estoril.\n\n\\- On the other side, Estoril’s Ian Cathro has insisted his team will always play to win and “não compra o empate” (doesn’t play for a draw), even in tough away fixtures, highlighting confidence and an attacking mindset. He regularly emphasizes rigor and concentration but also the need to play their style — which is proactive and forward-looking — and has acknowledged that results haven’t matched their ambition but the approach remains the same. With Xeka out injured, Estoril’s midfield balance is more open, often leading to gaps that invite transitions — exactly the kind Estrela thrives on.\n\n\\- Combine all this with Estrela’s attacking identity under Madeira’s 4-2-3-1/4-4-2 hybrid and Estoril’s desire to impose their game and score away, and you get a match where both teams have tactical incentive and motivation to score, while neither has shown defensive solidity recently. All signs point to goals at both ends.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0dvb1i/"
    },
    {
      "created_utc": 1768780868.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 72-28-1 (+69.1u)\n\n__Previous Pick:__ [❌ Luther Burden o37.5 rec yards (-110), 5u](https://www.reddit.com/r/sportsbook/s/BLO0LGeuTB)\n\n__Event:__ NCAAF: Indiana @ Miami 7:30pm\n\n__POTD:__ Indiana -7 (-120), 3.6u to win 3u *(bought 0.5)*\n\n__Write Up:__ Curt Cignetti took the worst program in Power 5 history & turned them into the best team in the country in less than 2 years. If Indiana beats Miami & goes 16-0, it will be the greatest coaching job in the history of American sports. This will be the 1st national championship in school history. Indiana has beaten multiple elite programs, including the former #1 Ohio State Buckeyes & top 5 ranked Oregon twice. They’ve outscored their 2 playoff opponents 94-25. They rank top 3 in both scoring offense (40.4 PPG) & scoring defense (11.9 PPG) in the NCAA. Indiana QB  Fernando Mendoza (Miami native) has put on one of the best performances we have ever seen the CFB Playodds. The Heisman Trophy winner has thrown 8 TD’s with just 5 incompletions, owning an 86% completion rate. He shines in big moments, leading Indiana to a 5-0 ATS record against ranked teams. \n\n__*More write up incoming*__\n\n__Indiana -7__\n\nAppreciate the love! [🍺](https://buymeacoffee.com/joeinglesofficial) [PayPal](https://paypal.me/joeinglesofficial) [Bitcoin](https://pastebin.com/raw/GEXAsA2S) [Cashapp](https://cash.app/$KaneZippy) [Venmo](http://Venmo.com/mackenzie-botz-1)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0dv5cq/"
    },
    {
      "created_utc": 1768780709.0,
      "author": "Best_Accountant_5471",
      "text": "2026 record: 5-6 (-2.3 units)\n\n2025 record: 55-41 (+26.5 units)\n\nLast 10 (most recent on right):  ❌✅❌✅✅❌✅❌❌✅\n\nLast Pick: Francisco Comesana 🇦🇷 -2.5 games handicap vs Patrick Kypson 🇺🇸 ✅\n\nEvent: Australian Open R1 🎾\n\nPick of the Day: Novak Djokovic 🇷🇸 -8.5 games handicap vs Pedro Martinez 🇪🇸 5 units to win 4.2U @1.83 (Bet365)\n\nThe spread is quite large but I expect a beating of Martinez in this match from Djokovic. The Spaniard started the season with a title in Bengaluru but didn’t face a single player ranked in the top 230 so it won’t mean much other than give a slight bit of confidence heading into the season. The world No. 71 had a pretty bad year in 2025, especially on hard courts going 4-10 on outdoors and performed considerably worse as the season went on leading to some big losses culminating in a 4 and 1 loss to Giron in Athens. It’s no wonder really considering his lack of weapons on hard courts - with a subpar serve and conservative gamestyle he doesn’t have the game to take it to win free points on faster courts and instead has to rely on opponent’s mistakes. Unfortunately for him, most of the top players are simply too good baseliners nowadays with the exception of a couple of error-prone players (looking at you Rune who went 0-2 against the Spaniard) and therefore struggles to stay competitive against these top ranked guys. Outside of clay courts, top 15 opponents have covered this spread in all six grand slam matches against the Spaniard. Last year, Martinez lost 1,4,1 against Zverev here and I expect a similar result here. I mean, even No. 435 Riedi covered the handicap against him at the US open for crying out loud.\n\nEnter the GOAT of tennis Djokovic for one of his last chances at winning a 25th grand slam at his favourite tournament, having won it a whopping 10 times. He has nothing to prove nowadays but he’s still as hungry as ever saying he was here to take the title from Sinner and Alcaraz in his press conference. Despite playing a very limited schedule last year he’s still the world No. 4 and was undoubtedly the third best player last year, reaching the semis of each slam. I couldn’t really think of a better match up to get his season running than Martinez, he should concede few free points on return, win quite a few on serve and come out on top of most rallies to put him in confidence for the rest of the tournament. Basically, Pedro’s style of play comes mostly from waiting for the opponent’s error but is up against the most patient player on tour who should redirect the Spaniard’s pace to overwhelm him even on a bad day. It’s a hellish match-up on paper and expect a comfortable win for the Serb who won’t want to hang around in an opening match to conserve his slightly-diminished fitness levels for the later rounds. BOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0dun4f/"
    },
    {
      "created_utc": 1768780207.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 23-22 (+0.36u)\nJanuary Record 8-9 (-1.66u)\n\nSunday’s Pick - ✅ Patriots -3 -118 (1.18u to win 1u)\n\nMonday’s Pick - Stan Wawrinka ML -127 (1.27u to win 1u)\n\nStan is playing in his final Australian Open this year and he will have the full backing of the crowd. Realistically for him, a win in round 1 would be a successful tournament and I believe he knows that. He should leave it all out there against Djere.\n\nDjere had a tough 2025 with injuries, which could negate some of the concerns of stamina with Wawrinka. Wawrinka has a H2H record of 2-1 in this matchup.\n\nWith all these factors, I’ll take the veteran one last time.\n\n\nGood Luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0dt2v9/"
    },
    {
      "created_utc": 1768778925.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 42-22 (+15.10U)**\n\n**ROI: +19.36%**\n\nLast POTD: [Patriots -3 -118 ](https://www.reddit.com/r/sportsbook/s/YCRagTRPa8) ✅\n\n**POTD: NCAAFB: Indiana -4.5 First Half vs Miami -106 (1U TO WIN 0.94U)**\n\nWrite up: THAT’S 10 IN A ROW! PATRIOTS KEEP US ALIVE!!! - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Indiana 1H ML at 58%\n\n• Model projects Indiana 1H -4.5 at 54%\n\n• EV better betting 100$ = 12-13$ for this play\n\n• College Football National Championship. I want to start off by saying, I was stuck between Indiana’s 1H line and Indiana -7.5 Full Game - Gut told me to role with the 1H so here we are - Indiana averages 20 points in the 1H this year which is top 10 in college football while only allowing around 6 points in the 1H - Miami averages about 14 points in the 1H, which isn’t the best, but is still pretty good - considering how good Indiana’s defense has been, this line drops - The stats of how good Indiana’s defense is in the 1H, compared with Miami’s mediocre 1H offensive side, gives a small edge towards Indiana in this one. Indiana’s run game is one of, if not the best in the nation - Miami is susceptible to big plays on defense, while Indiana in ranked 3rd in 20+ yard rushes - Indiana should be able to control the tempo with their run game, limiting Miami possessions throughout the 1H - Indiana has been pretty dominant in their 1H’s and they seem to catch opponents off guard early - Indiana will come out with an awesome game plan, and I see them being damn near perfect in the 1H - Hoosiers cover -4.5 for us in a low scoring 1H \n\nPOTD History: https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn\n\nBOL!\n\n**POTD: NCAAFB: Indiana -4.5 First Half vs Miami -106 (1U TO WIN 0.94U)**\n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\nhttp://buymeacoffee.com/claysmiith\n\nhttps://venmo.com/u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0dozwz/"
    },
    {
      "created_utc": 1768778812.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Monday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qgnr37/pick_of_the_day_11926_monday/o0domwr/"
    }
  ]
}