{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/16/26 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/",
  "target_date": "2026-01-16",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-16T17:20:21.150647+00:00",
  "comments": [
    {
      "created_utc": 1768583856.0,
      "author": "leagueisbetterlol",
      "text": "**Record:** 2-0-1 (+2.10u)\n\n**Last:** Leafs vs VGK | William Nylander 1+ Point and 2+ shots @ (2.05) **🅿**\n\n(Nylander got 2 points and 1 shot on net in 2 minutes of ice time then got injured, most books have player prop protection in which i actually got paid out winnings but im going to count this as a push/void)\n\nPOTD is **Lightning vs Blues | Darren Raddysh 1+ Point and Game total o4.5 goals (1.95)**\n\nHofer has 2.91 GAA and .898%  \nRaddysh has 22 points in 19 away games  \nRaddysh 14 points last 7 games  \nLightning are 17-4-3 as away team  \nLightning are on 11 game win streak  \nLightning are scoring at 5 goals per game last 5 games  \nBlues allowing 3 goals per game last 5 games\n\nShort writeup cause I dont have a ton of time today but from the summarization above you can see where this is headed. A absolutely dominant Lightning team vsing a Blues team that is injured I would have taken ML if they were not on such a hot streak as usually it ends by the most random of teams in the NHL and wouldnt be surprised if they lose tonight. What I do expect is Lightning's offense to continue to produce at least 3-4 goals tonight and Raddysh to get minimum 1 point!\n\nBOL! All my picks are 1U bets!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzyctz7/"
    },
    {
      "created_utc": 1768583482.0,
      "author": "planetICE",
      "text": "**Record:** 16-19-2 || **Net Units:** \\-4.87\n\nAvg. Odds: -113 / 1.88 || Avg. Units: 1.49\n\n**Last Pick:** Phantom +3.5 points vs Mist ✅️ || 1u at -115 || Mist at Phantom 01/12/26 || 3v3 Unrivaled Basketball\n\nMist tried to make a 4th quarter comeback but Phantom ended up winning this 64-61. Phantom turned the ball over more than I expected but made up for it with a solid rebounding performance.\n\nThis is my third win in a row but it's been a poor POTD history for me with a lack of a consistent strategy. I started betting last couple years and learning still. I track my deposits vs withdrawals and I'm only up 8% lifetime (including sign up bonus bets), so I have not had a great run. My POTDs have been spread across basketball (17), baseball (11), soccer (4), golf (4), and football (1). Baseball has been my best sport (55% win rate) with basketball being second best (47% win rate). Going 1 for 8 on picks from soccer and golf is pretty bad and somewhere I'll stay away from\n\n**Today's Pick:** Laces ML || 1u at +100 on FD || Laces at Phantom 7:30pm ET || 3v3 Unrivaled Basketball\n\nLaces and Phantom have had very similar starts in 2026. Both teams are 2-1 and played 2 of the same opponents (Lunar Owls and Mist). Through the first 3 games, Laces averaged 74.3 PPG versus Phantom 73.3 PPG. Laces averaged 65.6 points against per game versus Phantom 63.3 points against. Both teams have 183 FGA with Laces going 23-66 from distance and Phantom going 24-64. The books are favoring Phantom by -1.5 points which isn't significant to me in Unrivaled given the 4th quarter format. Only 1 regular season game in 2025 was decided by 1 point (which was actually a Laces loss) and none in 2026 so far. There have been 3 games decided by 3 points or less in 2026.\n\nPhantom's advantage going into this game is on the glass. The team has 29 OR and 83 DR and leads Unrivaled with 112 total boards. Laces have 23 OR and 76 DR with 99 total boards. Phantom have played a couple more minutes than Laces but rebounding advantage still goes to Phantom. Phantom have also out blocked the Laces with 9 to 3. I think the Laces advantage is in turnovers and steals. Laces lead Unrivaled with 20 steals (12 for Phantom) and limited themselves to 19 turnovers (27 for Phantom). It's worth noting on turnovers that Phantom have generated more assists (55 compared to Laces 42), but AST to TO ratio is slightly in Laces favor at 2.21 compared to Phantom 2.04. I still think this game is a toss up and if Phantom limit their turnovers, this match could easily go their way. However, I like the plus money on Laces to win and I initially expected Laces to have the edge in the books. If the Laces can generate a couple steals and Brittney Sykes stays in form, Laces can win this one. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzybfe3/"
    },
    {
      "created_utc": 1768583346.0,
      "author": "Wekken",
      "text": "**Record: 3-9-1** \n\n**Football Record: 12-24-3** \n\n**Basketball Record: 0-1** \n\n**POTD Units: -13.53** \n\n**Total Units: -20.93** \n\n**Last 5:** ❌️⬆️✅✅❌️ \n\n**Sport:** Football \n\n**Last Pick:** Santander vs Barcelona – BTTS & o3.5 goals \n\n**Upcoming match:** Sporting CP vs Casa Pia (21:15 CET) \n\n**Pick:** Sporting CP -2.5 AH \n\n**Unit stake:** 5U \n\n**Odds:** 2.03 \n\n**To win:** 5.15U \n\n**Recap:** \n\nIt did not happen whatsoever for my prediction. The offside trap Barcelona uses often was highly effective and Santander had no real way to deal with it. Too bad we're back to red but we move. \n\n**Write Up:** \n\nI absolutely love this spot with these odds. Hence why I am putting up 5U here. \n\nSporting CP have a track record of playing well in the league after a portugal cup round. Winning 3-0, 4-0 and 1-4 in those following matches. \n\nAlso winning 6-0 after their last loss. So they recover well after losing, like they did in their last match. They want to prove themselves. \n\nAt home they win often and score a lot, going 27-3 in goal difference over 8 matches. \n\nCasa Pia has lost 4-0 versus Porto and Braga away this season. I see that same thing happening again and for these odds it is a risk I'm willing to take \n\nThe away form of 3-1-5 with a 10-17 goal difference isn't terrible but when you look closely you'll see that those 3 wins were against the bottom 3 teams in the league. Take away the wins and you're left with a 0-1-5 record with a 4-16 goal difference. \n\nTheir away record will become worse over the whole season and it is starting now \n\nThey've also played each other in the first match of the season, which saw Sporting win 0-2 away. The stats that game says it all. 8-27 in shots, 2-13 SoT in favor of Sporting CP and also 67% possession \n\nAbsolutely love the spot and will be eagerly watching this game for my first 5U play \n\nBack to red, but green is on the horizon. Fade or tail, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzyax0t/"
    },
    {
      "created_utc": 1768578227.0,
      "author": "Realistic_Apple3531",
      "text": "Bruh every time I come on here for advice or picks nobody posts their picks in the comments. Come on smh",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzxrk4o/"
    },
    {
      "created_utc": 1768576228.0,
      "author": "AthleteFar7182",
      "text": "\nPOTD Record: 0-0\n\nPick: Under 241.5 Pelicans @ Pacers NBA\n\nPelicans @ Pacers under 241.5 immediately jumps out to me, and to be honest, the line has a ton of juiciness on it, as it opened at 235.5 and its being jammed to the moon, so we are getting at an extra 6 points from where it opened at!\n\nI am not sure why the books have this one so high. Just looking at the raw math, the Pelicans average 110-111 on the road, the Pacers average 112-113 at home, and on average give up 116. So right away, I just don’t see how we have a line over 230! To give insight into how significant a 241.5 number s, it is the HIGHEST line for the Pacers at home this year, earlier this year when, Denver came in on the road with a healthy Jokic the line was only 238.5, but somehow this under-average Pels, offense is supposed to beat that number? And when you switch to the Pels, this is their 7th highest road line of the year, and they are 5-2 to the under on all games with a line over 240 this year.\n\nWhen you just look at the overall trend values, not much changes to say this isn’t a great value, pacers are under all 5 games this year as a home favorite, and they are 60% to the under at home this year overall. The Pels, meanwhile, are close to average as a road dog on the under, with a very slight lean towards the under at 56% on all road games.\n\nLastly, all recent trends also point to the under here. If you ran this same line 241.5 over the last 5 games for each team, the Pacers would be under in all 5 games, and the Pelicans would be under in 4 out of 5.\n \nThis is one that’s really blown me away. I would have taken it in a heartbeat at 235.5, and now we get extra value!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzxk6ec/"
    },
    {
      "created_utc": 1768573577.0,
      "author": "sweetnessssss",
      "text": "\\*\\*NBA\\*\\* | \\*\\*7:00 PM ET\\*\\* | CLE @ PHI\n\n\\*\\*THE PICK\\*\\*\n\nTyrese Maxey \\*\\*o36.5 PRA\\*\\* (-107 @ Fliff)\n\nStake: \\*\\*3u\\*\\*\n\n\\---\n\nThe projection is 42.1 versus the line of 36.5, a difference of 5.6 points. The market is mispricing his ability to deliver.\n\n\\*\\*RECENT FORM\\*\\*\n\nMaxey cleared 36.5 in 6/10 games.\n\nVENUE: HOME game\n\nMaxey is set to surpass his prop—this over is a strong, confident play.\n\n\\---\n\n **Model Info**\n\nI built an ML projection model that uses 100+ features including rolling averages, minutes trends, matchup data, and Vegas lines as inputs. \n\n\\*THE LINEUP v3.7 | Grade: A++\\*\n\nRecord: 3-3",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzxb6ge/"
    },
    {
      "created_utc": 1768573461.0,
      "author": "livebreathefootball",
      "text": "**Record:** 34-41 (6 push)\n\n**Net Units:** 1.47 units\n\n**Soccer | Serie A | Pisa vs Atalanta**\n\n**Pick:** Atalanta -1 Asian Handicap @ 1.89 \\[1 unit\\]\n\n**Reason:** Pisa have the worst home record in the league (1 win, 3 draws, 6 losses). They have only scored 1 goal at home all season, and 3 of their 6 losses have been by multiple goals.\n\nAtalanta are currently on a 3 game winning run in the league, and have not conceded in those 3 games either. They have won 8 games in the league this season (7 draws, 5 losses), and 5 of those wins have been by multiple goals.\n\n**Tips:** Always appreciated but not required\n\n[https://ko-fi.com/livebreathefootball](https://ko-fi.com/livebreathefootball)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzxasnk/"
    },
    {
      "created_utc": 1768571352.0,
      "author": "No-Advantage-4560",
      "text": "Record: 0 -1\n\nNet Units: -1\n\nROI: -100%\n\nParlay:\n\nPisa SC vs Atalanta BC - 2 @ 1.55\n\nClub Brugge vs Raal La Louviere - 1 @ 1.31\n\nTotal odds: 2.03",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzx415o/"
    },
    {
      "created_utc": 1768567641.0,
      "author": "TheOfficialLegendz",
      "text": "POTD Record: 1-0-0\n\nLast POTD: Copa del Rey, Racing Santander v FC \nbarcelona, Barcelona -1.5 Handicap (✅)\n\nEvent: Paris Saint-Germain v Lilie OSC\n\nPOTD: PSG v Lille OSC BTTS YES\n\nWrite up: Both Teams to Score looks reasonable for PSG vs Lille based on recent form and matchup history. PSG are one of the highest scoring teams in Ligue 1 and have scored in the vast majority of their league matches this season, but they have also conceded regularly against top-half opposition, showing they are not defensively perfect. Lille have consistently shown they can score against strong teams and have found the net in many recent league games, including away fixtures, due to their quick transitions and pressing style. Recent head-to-head meetings between PSG and Lille have frequently seen goals from both sides, with Lille managing to score even in matches they did not win. With PSG’s attack at home being very reliable and Lille having a proven ability to score against elite opposition, the statistical and tactical profile supports a BTTS Yes pick rather than it being a blind gamble.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzwtakv/"
    },
    {
      "created_utc": 1768562448.0,
      "author": "Kraken_Man_9775",
      "text": "My total win record (can be verified on my stats page):  \n2025: 48.13%, +19.07 units, 7.98% ROI (started in December)  \n2026: 55.70%, +34.44 units, 28.82% ROI\n\n**Pick of the day:**  \nLeague: Bundesliga 2  \nKick-Off: 18:30 CET  \nGame: Dusseldorf v Bielefeld  \n***Bielefeld 0 @ 2.01***\n\nReasoning: Bielefeld come into this match in better overall form and with more consistency at both ends of the pitch. They’ve shown strong defensive structure away from home, while Düsseldorf have struggled to convert chances and often leave space in transition. With the current momentum and matchup dynamics, Bielefeld to avoid defeat offers solid value.\n\nGood Luck! ✌️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzwhccu/"
    },
    {
      "created_utc": 1768558498.0,
      "author": "enemyofaverage",
      "text": "Horse whisperer",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzw9oru/"
    },
    {
      "created_utc": 1768556852.0,
      "author": "kicsimani",
      "text": "✅✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅\n\nRecord: 18W-4L\n\nUnit:+13.07\n\nLast: anderlecht vs. Gent 1@1.70✅\n\nToday: west vs. Middlesbrough 2-3goals@1.93\n\nAn interesting match, with West Brom looking to \"build\" after qualifying for the cup and on the other hand Middlesbrough, who were eliminated in the FA, will throw all their weight into the championship to achieve the long-awaited promotion. We have Ramsey's debut for the home team, who are showing greater potential on the field and it seems likely that they will be particularly competitive. The score will be decided on the line and the goal difference of 2-3 seems likely to be verified.\n\nBol",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzw6om8/"
    },
    {
      "created_utc": 1768555866.0,
      "author": "dreadjab",
      "text": "**POTD Record:** 2-1\n\n\n**Last:** Anthony Black o14.5 pts (-130) DraftKings 1.5u ☑️\n\n\n**Event:** NBA: Cavaliers @ 76ers 7:10 PM EST\n\n\n**Today’s POTD:** Joel Embiid u12.5 reb + ast (-138) FanDuel 1.5u\n\n\n**Write-up:** Hard to tell how many minutes Embiid is going to play tonight; he’s listed as questionable. In Wednesday's game against the Cavaliers, he got to 25 minutes with 7 reb + ast. When he has played 30 minutes or more, he has hit this prop 9/12 times. When he has played between 25 to 35 minutes WITH Oubre, he’s hit this line 7/7 times. He is consistently going under.\n\nHe used to be fiercely competitive against the Cavaliers and average nearly 15 rebounds against them before getting hurt, but that was in 2023, when he was averaging 30p/10r stat lines . Embiid has been nonexistent in the past two seasons. Yes, he is slowly coming back to form, but he is riddled with injuries. He still has the highest usage rate on the team, but this year there are so many guys on the Sixers that help out with boards. A lot of the guards like Edgecombe, Maxey, Oubre, and Grimes are grabbing 3-5 boards a game each. Then the extra help at center with Drummond and Bona to take some of the load off of Embiid. \n\nI have to take the under here, especially since all the data points to it. He hasn’t grabbed 13 or more reb + ast at home all season. I just don’t see it happening.\n\n\nAs always, good luck, fellas. 🍀",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzw4xr9/"
    },
    {
      "created_utc": 1768552656.0,
      "author": "donjavogosca",
      "text": "POTD Record: 40-25, +12.3u, (ROI +14.8%)\n\nPrevious Pick: Orlando to win the game by 5 or more, 1.84, 1.5u ✅️ (last 5: ✅️❌️❌️✅️✅️)\n\nEvent: ABA: Igokea - Partizan, 19:00h\n\nPOTD: Igokea +13.5 spread, 1.84, 1.5u\n\nThis limit is set too high, considering the current state of the Partizan team. They can win, but 14 points as guests is too much. They have to come back after crushing a 66-104 loss at home against Olympiakos, but a close win is the best they can do at this point.\n\nIgokea 7-4 and 5-1 at home, the only loss was from Dubai, by 14 points. They also played some really good basketball recently, high-scoring games, and had an epic 114-108 OT win against Cluj, which made an excellent team and is doing well in both ABA and the Eurocup.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzvz783/"
    },
    {
      "created_utc": 1768551735.0,
      "author": "zan12231",
      "text": "**POTD Record:** 6-8\n\n**Net Units:** \\-2,73 UNIT\n\n**Previous Pick:** Franz Wagner O23.5 PRA (-110), 1 UNIT ✅\n\n**Today's Event:** NBA: 76ers vs. Cavaliers\n\n**Today's Pick:** Quentin Grimes O14.5 PRA (-120)\n\nWrite up:\n\n76ers facing Cavaliers.\n\nHis career average is 10.9, 2.2 assists and 3.2 rebounds per game in 25.4 minutes in average and 44.3 FG%. This season his minutes are at 31.6 and his PRA this season at 21.7, so 7 over the line.\n\nBookies giving us -120 odds which calculates in 54.6% probability to cash. But Grimes went over this line in 32 of 37 in this season (86%) and 51 of 74 (69%) in last season. So we have 31% edge over the prediction in this season. He reached this live in 2 of last 5 games (not optimistic), and 7 in last 10 games. \n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzvxjcd/"
    },
    {
      "created_utc": 1768549665.0,
      "author": "lordestros",
      "text": "Last 5 POTD : ✅️✅️❌️❌️✅️\n\n**Previous pick**: Blue Jackets Next goal (-140) ✅️ (great goal by Coyle)\n\n**POTD Record** : 15-11\n\n**Today's pick** : Colorado Avalanches vs Nashville Predators at 9:00pm EST (NHL/Hockey)\n\nColorado Avalanches Next goal (First goal) (-190)\n\nIn the 3 games they played against each other this season, Colorado has scored the first goal each time.\n\nColorado has also scored the first goal 8 times in their last 10 home games. They will look to bounce back after a dissapointing loss to Toronto so they should have a good start. They are also #1 in the league in shots per game with an average of 34 so I expect plenty of chances. They had 41(at home), 42 and 26 shots in their 3 games against Nashville this season.\n\nMeanwhile, the Predators have given up the first goal 9 times in their last 10 games. They are top 10 in the league in shots allowed per game with an average of 28.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzvtoo3/"
    },
    {
      "created_utc": 1768549456.0,
      "author": "WeightShift",
      "text": "**POTD Record 144-1-73 | +99.26u**\n\n**Form:** WWWWWWWLWLWLWLWLLWWWWWWWW\n\n**NBL: Wildcats v Hawks - Javale McGee over 26.5 Points and Rebounds** **3U** $1.81 (Sportsbet) 9:30PM AEDT\n\n* The Wildcats have one of the leakiest defences against opposing bigs. They're bottom 2 in the league across the last 10 games.\n* There is noone on the Wildcats team that can guard this man. Noone. He's dropped 40 PR and 35 PR on JLA already this season.\n* But what about the return of Sam Froling? Surely that impacts it? Yes, it does but the bookies have adjusted for the minutes reduction and also the drop in usage. What I dont think theyve considered though is how effective Froling will be against Perth. He's shown season after season that big, strong bodies are his kryptonite. Kristian Doolitte, heck even Jesse Wagstaff, are bottom heavy enough to stop Sam's drives leading to his little hook shot or swing jumper.\n* Javale is much more polished offensively and I expect him to be a focal point tonight. Plus he shoots 70% from the line vs Froling's 44%.\n* The Wildcats are the second worse rebounding team in the league, only trailing Cairns in opponent O boards per game. Who is Illawarra's best offensive rebound? It's actually Sam Froling 😂  but McGee is only marginally behind and in the last 3 games Sam has shown he's comfortable sitting out of the key and trying to shoot a 3 every now and then. That leaves McGee in the middle to terrorize the Wildcats on the O board and (hopefully) put in a few second chance opportunities tonight.\n* Coach Tatum is known for coaching teams that run offenses powered by their big men - he played center himself so he knows how to build offenses around this.\n* The minutes have definitely been swinging for him and he's been frustrating to watch with some missed dunks and layups, but tonight is a nice match up for him and he should see more floor time than we've seen the last few games.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzvtafi/"
    },
    {
      "created_utc": 1768549078.0,
      "author": "FlyAway012",
      "text": "**Record:** 0-0\n\n**Net Units:** — -149\n\n**ROI:** — 1U to win 1.5U\n\n**Sport | League | Event Time / Time Zone:** NBA | New Orleans Pelicans | 4pm PST\n\n**Pick:** Trey Murphy III – Over 20.5 Points (Pelicans) \n\n**Write Up:** Trey Murphy III has been in exceptional form recently, averaging 28.7 PPG over his last 3 games with two 30+ point performances, showing a clear upward trajectory. The 20.5 points line is conservative given his current hot streak. The Pacers’ defensive struggles present a favorable matchup for Murphy to continue this scoring pace, making this a high-confidence play based on his recent output and matchup dynamics.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzvsksp/"
    },
    {
      "created_utc": 1768545665.0,
      "author": "Money-Swimming2179",
      "text": "Record 10-0-5\nForm: ✅✅✅✅❌❌✅❌✅✅❌❌✅✅✅<-\n\nLast POTD: **Den Bosch v PSV: 1st Half goals o2 Asian total @2.29✅**\n\nTodays POTD: **Werder Bremen vs Frankfurt: Frankfurt Draw no Bet @1.85**\n\nFrankfurt really haven’t been as bad as people make them out to be. Not long ago they nearly beat Stuttgart away, which is no joke this season, and then they went and drew 3-3 at home with Dortmund, who are sitting near the top of the table. Before that run, they had only lost once in 10 games, and that single loss was away to Leipzig, which is totally understandable. Other than that, they’ve been picking up points regularly and competing well against strong sides.\n\nYeah, they’ve got a few injuries, but it hasn’t completely killed their level. They still create chances, they still score, and they don’t roll over easily. Compared to Bremen, who are struggling badly in front of goal and leaking goals at the back, Frankfurt just look like the more stable and dangerous team right now.\n\nHonestly, even Frankfurt moneyline isn’t crazy here, but with Bremen at home and Frankfurt missing a few players, I’d rather play it safe. The odds should probably favor Frankfurt more than they do, so taking Frankfurt Draw No Bet feels like the smart value play.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzvlvkw/"
    },
    {
      "created_utc": 1768545007.0,
      "author": "redditusernameuneak",
      "text": "Record: 8-8\n\nBreakdown: 8-3 (WNBL), 0-4 (NBA), 0-1 (NBL)\n\nUnits: -1.66\n\nForm (most recent on left): ✅❌❌❌❌✅✅\n\nPrevious Pick: (WNBL) Perth Lynx (W) -2.5 ✅ game ended Lynx 85 - Spirit 81\n\nEvent: (WNBL) Geelong Venom (W) vs Sydney Flames (W)\n\nPOTD: Sydney Flames (W) Moneyline (2.12 on Bet365, 5 units for 5.06 units) ❌ game ended Geelong 105 - Sydney 77\n\nWrite-Up: Both teams are in the bottom half of the leaderboard, but the Flames (6-13) have shown improvement in the last few weeks, winning 3 out of their last 5 games. They had a disappointing loss in their most recent game (against the 5-13 Adelaide Lightning), but they had impressive wins before that against Spirit (13-4) and the Capitals (7-9). I think they bounce back to their previous form in this game against the lowest ranked WNBL team Venom (4-14) who have won 1 out of their last 10 games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzvkjj3/"
    },
    {
      "created_utc": 1768544535.0,
      "author": "Noobdian1",
      "text": "Record:103-87-6\n\n\n\nLast Pick:  Bologna or DRAW + Barca ML (W)\n\n\n\nToday's Pick: Pisa vs Atalanta BTTS-NO 1.83(3u)\n\n\n\nINSANE STAT just look at what I found boys and girls\n\n\n\nPISA have a 40% BTTS rate, slightly low but normal but wait here's the catch, They've had BTTS in 80% of their away games and NONE of their home games. That's right in 10 Home games they haven't had BTTS a total of ZERO time. Infact they've scored only once in those 10 games.\n\n\n\nAway Pisa are decent and have scored 7 goals but this home stat is mad\n\n\n\nWe're basically betting on a team to not score, when they've scored in just once in 10 games at home.\n\n\n\nI could take the pisa to not score + plus odds but Atlanta not score helps our bet too and im not getting greedy, funny things happen and its good value as it is so why push it GL!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzvjk8c/"
    },
    {
      "created_utc": 1768543373.0,
      "author": "LolPropKing1",
      "text": "POTD Record: 210-161\n\nUnits Won: +101.27u\n\nLast Pick: Lake U 8.5 Headshots Map 2 (-122) X\n\nTodays Pick: **VSM U 14.5 Kills Map 2 (-128)** 5u\n\nhttps://preview.redd.it/k1gtdzlpjndg1.png?width=243&format=png&auto=webp&s=3e703cfbcc064ca6d4b3dd167e7f7642a17938a0\n\n  \nTeams: paiN vs. BetBoom  \nTime: 10:00 AM EST.\n\nWriteup:\n\n* VSM is moving up to paiN from tier two in Brazil to tier 1.5/tier one, whatever you want to consider paiN. They come into this match off a long break and are underdogs in this one against BetBoom as they have two new additions to the roster adding piriajr and VSM two hot prospects from tier two South America.\n* VSM is averaging a very strong .81 KPR in the L3 months, he was easily the best player on his previous team and was put in all the star roles and best spots in order to shine/succeed. While he did very well at doing this role, he will not be in the same roles on paiN, as I am highly expecting piriajr to be the main player paiN build around who has had an even more insane, .90 KPR in the L3 months he has been absolutely farming. This would leave VSM to fill in more supportive roles. This is slightly speculative as both guys had very strong opening stats on their previous teams, biguzera also tends to be more of an entry player\n* This is something that we have been monitoring for 6+ months now, these lines of players when they first move up to tier one are continuously too high and inflated, we have seen a nearly 86% under hit rate on players in their first match when they move up to tier one of the stats tracked on my end so far from around 6 months ago. They are underdogs, T side start on a new team, new roles, big tournament with a lot of pressure\n* Outside of speculation and the move up from tier two/fact they are underdogs + inflated line from tier two, paiN really like to pick Nuke as their primary map choice, they were always an Anubis loving team so I wouldn't be surprised if they picked Anubis as well, but that part is unknown as this map just got readded to the map pool\n* Nuke was consistently VSM worst map as a pro in tier two, he dropped -.10 KPR in 2025 from his usual average when playing on Nuke, and was his lowest rated map out of the 8 in the map pool, Anubis was his second worst rated map in the pool with a -.07 KPR, so not only are we getting an inflated line in my opinion but are very likely getting him on one of his worst two maps as well\n\nMay have some ML picks for League/CS2 up in the esports channel if anyone wants those/is interested let me know and I will post them in the esports thread!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzvh36v/"
    },
    {
      "created_utc": 1768540111.0,
      "author": "Seventh__Place",
      "text": "POTD RECORD: 9-4\n\nNet units: +3.886\n\nForm:  ✅✅✅✅✅❌✅❌✅✅❌❌✅\n\nLast POTD:  Orlando -5 -110 1U ✅\n\nToday’s POTD: **DePaul-Marquette over 142.5 (-110 FanDuel) 1U**\n\nEvent: CBB | Marquette at DePaul (8:30 pm EST) | 🏀\n\n*Recap: Wow. That was... something. Memphis' biggest lead was 20, and they were up 16 after the first quarter. The Grizzlies still had a 77 percent chance to win with 3:45 left to play in the game. Orlando tied it at 107 with 2:32 to go, led by three with 1:38 to go... and proceeded to cover. I guess it's better to be lucky than good, although the Magic ARE a good team. I preseason bet them to win the Southeast Division. That same bet is +100 right now - better odds than I took, sadly. Still, what a sweat. **Side note:** I made a joke in yesterday's writeup about taking a college conference leader after jinxing two in a row. There were four in action. The two early ones did not cover. In fact, one lost outright! The two late ones (Florida Atlantic, Gonzaga) did in fact cover.*\n\nI must be a glutton for punishment. For my POTD, I'm 6-0 in the NBA and 3-4 in the college ranks. Truth be told, I like watching college basketball more. Plus, I'm a sucker for mid major and unconventional teams. Marquette (6-12) and DePaul (10-7) last met in February 2025, when a solid Golden Eagles squad beat a bad DePaul team 68-58 (126 total) in Milwaukee. Before that, they played eight straight games over 142.5 points. During that stretch, the closest they came to not clearing was 148 points in 2021. Devil's Advocate: DePaul is a dead under team this year. They're 5-12 to the under. However, they've gone over on their team total in 20 of their last 33 games (61 percent), and that's half the battle right? Marquette is 9-9 on the year, but they've gone over in their two previous games, including at defensive-minded St. John's.\n\nMarquette tends not to play defense or shoot well on the road, but they never drop their frenetic pace even when they suck. Marquette fans can thank Coach Shaka Smart for that.  Still, they are 0-5 in their five true road games, with an average losing margin of 18.4 points. When they travel, they've been giving up 84.8 points. And if you're wondering why today's spread is so thin (DePaul is favored by -3.5), it's because this is the first time DePaul has been ahead of Marquette in the Big East standings since the 2014-15 season. In fact, DePaul went winless in the Big East each of the last two seasons. Incredible! I do think there's a ton of pressure on DePaul to keep ahead of their rival. If they do, it'll be because they scored on a Marquette defense that ranks in the bottom third of the Big East in most every defensive metric, including 10th (out of 11) in scoring defense (77.2). Meanwhile, DePaul scores well at home. They've gone for 76+ in six of their last eight home games - three more than their season average. \n\nMarquette does try to play uptempo. KenPom has them 63rd in adjusted pace. If there's going to be an upset, or even a close game (like the spread suggests), I think it's going to come from Marquette matching DePaul's offensive output. This has traditionally been a \"get right\" game for the Golden Eagles, and I think there's a psychological edge there even if they've been playing so poorly all season. For what it's worth, Marquette is a better offensive rebounding team. My thesis is Marquette will be aggressively relentless on both ends of the court, but that pace will open them up for transition layups and more possessions than usual for a decent-shooting Blue Demons squad. You would think a team that shoots as poorly as Marquette would slow things down but they stick with a fast-but-flawed style to a fault. As for DePaul... I think they'll want to stick it to a nemesis that has beaten them 24 of the last 30 games, including six in a row. Overtime might even be in play here.\n\nGood luck and Godspeed!\n\nIf I've made you a few bucks through fades, it's just gonna ask you a few questions: https://buymeacoffee.com/seventh__place",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzv9k9t/"
    },
    {
      "created_utc": 1768538935.0,
      "author": "shoJm",
      "text": "**Overall Record: 18-1-12**\n\n**+13.29U**\n\n**Last Pick:** **5U - Kendric Davis (SYD) o6.5 AST (-125)** ✅ (3Q cash! Finishes with 10 to complete my ladder as well!)\n\n**Today’s Event:** Australian Basketball (NBL) - Perth Wildcats vs Illawarra Hawks | **5.30am EST**\n\n**3U - Kristian Doolittle (PER) o3.5 AST (+105) ❌** (Finishes on 3. Opportunities were there, teammates just weren't hitting their shots of his passes)\n\nTargeting another line due to some injury ramifications. Perth have added another guard to their injury list, which leaves them with only a couple guys capable of carrying the ball into the offence. Doolittle isn't a guard, but has had to step up this season with Perth refusing/struggling to sign a point-guard. He has had a lot of fluctuation in his assisting output as of late, due to guards being injured, then healthy and injured again, but one thing has stayed the same - his minutes and usage. I'm expecting Doolittle to see 33+ minutes, and in that time there won't be too many offensive sets that don't touch his hands.  \nThe reason I am targeting assists over points is because Illawarra have been toying around with a double big lineup, which may shut down Doolittle's drives to the basket or ventures through the paint. Also Illawarra have a decent lockdown defender who has already kept Doolittle to 9 and 17 points in the two H2H's. What I'm hoping for is that the defense will either collapse on Doolittle in the paint, or the defender forces the ball out his hands leading to assists for Doolittle.\n\nAll in all, the line is pretty low for someone who'll see a lot of the ball, and is even over in both H2H (4 & 5 AST).\n\n**NOTE: Please try and stick to a unit system, and only stake what you can afford to lose as there is no such thing as a guaranteed win.**\n\n**BOL!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzv6nt1/"
    },
    {
      "created_utc": 1768537670.0,
      "author": "Lyx97",
      "text": "Record: 30-17-5\n\nNet Units: +6.79\n\n*Prev Pick : Koln vs Bayern Munich - Team 2 Scores in halves : 1st half < 2nd half @ 2.01 (1u) -> W*\n\nFootball | AFC u23 Asian Cup | Japan u23 vs Jordan u23 | in \\~7hrs   \n\nFootball | English U21 Professional development league | Colchester u21 vs Bournemouth u21 | in \\~8.5hrs\n\nParlay : Japan -1 asian handicap + Colchester Bournemouth u21 match to have o2.5 goals @ 1.71 (1u)\n\nWriteup: Japan is too dominant in this tournament and had rested key players in their last match, but still won quite easily. They should probably win by 2 or more, but going a little safe here. For the 2nd leg, both teams have seen atleast 3 goals in their last 5 games, with colchester having one of the worst defense in the league. Expect to see goals and to hit this.\n\nHope we get the W & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzv3gkk/"
    },
    {
      "created_utc": 1768535557.0,
      "author": "Next-Application-244",
      "text": "**POTD Record:** 7-4, Net Units +3.31\n\n**Previous Pick:** NBA - Milwaukee Bucks @ San Antonio Spurs - Stephon Castle Over 17.5 Points = CASHHH\n\n**Reaction:** Bro had 14 in the first half, glad to see us get this one after two buzzer beater losses\n\n**Event:** NCAAB - Toledo @ Kent St./Ohio @ Ball St.\n\n**POTD:**  Kent St. + Ohio ML\n\n**Write Up:** \n\n**Kent State vs. Toledo:** \n\nKent State (13–4) enters this game with a significant home-court advantage at the Memorial Athletic and Convocation Center, where they are currently **9–1 this season**. Historically, the Golden Flashes have dominated this matchup in Kent, including a massive 40-point blowout (105–65) over Toledo last February.\n\nThe X-factor for Kent State is forward **Delrecco Gillespie**, who is currently leading the team with a double-double average of **19.3 points and 12.6 rebounds per game**. Toledo’s defense has been inconsistent, allowing nearly 82 points per game, which plays right into the hands of a Kent State offense that is averaging over 90 points at home. If Gillespie controls the glass as expected, Kent State’s win probability remains high (currently projected at 65%)\n\n**Ohio vs. Ball State:**\n\nWhile Ohio (10–8) is coming off a tough road loss to Toledo, they are heavily favored to bounce back against a struggling Ball State (4–13) team that is **0–5 in conference play**. The Bobcats have one of the most efficient offenses in the MAC, averaging 78.4 points per game compared to Ball State’s league-low 68.0 points.\n\nOhio’s success will likely hinge on **Jackson Paveletzke**, who leads the team with 17.1 points and nearly 5 assists per game. Ball State has struggled to contain perimeter scoring, and with Ohio ranking in the top tier of the conference for three-point shooting, the Bobcats should be able to stretch the floor. Furthermore, Ohio’s defense forces more turnovers and blocks more shots than the Cardinals, likely stifling any Ball State momentum before it starts.\n\nI love me a little MACtion action baby\n\nBOL if tailing, feel free to send a little love my way <3\n\n[buymeacoffee.com/nextapplication](http://buymeacoffee.com/nextapplication)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzuxuiq/"
    },
    {
      "created_utc": 1768535508.0,
      "author": "PurpleDragonBets",
      "text": "Record: (120-81-11) \\[+8.84\\]\n\nPOTD⭐️:🏀DePaul ML/Kansas ML (+106) \\[ScoreBet\\]\n\nStart Time & TV 8:00 & 8:30pm EST (FOX & FS1)\n\nUnits: 2 Units\n\nReasoning: Got a plus money pick of the day lined up for you all today! Were going with a two legger between the DePaul Blue Demons (10-7) over the Marquette Golden Eagles (6-12) and the Kansas Jayhawks (12-5) over the Baylor Bears (11-5). I really like the defense this DePaul Blue Demons team is playing as they are only allowing 68 points per game and they are up against a very lackluster Marquette defense that is ranked 280th in division one as they are letting up 78 points per game and this DePaul squad has the upperhand in field goal percentage as well as this Marquette squad only has a 40% field goal percentage as they rank 340th in division one ranking bottom 15 out of 365 division one squads. This DePaul squad also has an upperhand in free throw percentage and three point percentage and they have the home court advantage in this one against the Golden Eagles and they are 8-3 at home while Marquette is 0-5 and has not won a road game all season. I also like going with Kansas in this one against Baylor as they are coming into this one riding a huge win over #2 Iowa State and they come into this one allowing much less points than Baylor, a better free throw percentage, better three point defense, defensive rebounds, blocks per game, and they limit less turnovers per game than the Bears. The Jayhawks have home court advantage and they have been great at Allen Fieldhouse this year with a 7-1 home record so I think home court advantage is a big plus in this one. I think both of these teams should be able to handle business on their home courts in this one.\n\nPrediction: 80-71 Kansas, 74-68 DePaul\n\nLast pick:🏀Georgia Southern ML/Liberty ML💰Man that Georgia Southern game got sweaty at the end but they got the job done at the end of the day!\n\nBest of luck to everyone tailing and remember to bet responsibly! I made an X account recently so drop a follow if you want to follow along there as well @PurpleDragonBet! 💜🐉\n\nhttps://preview.redd.it/njkqezizvmdg1.jpeg?width=1078&format=pjpg&auto=webp&s=de3e7b4171fa5cc180b5fdeabb58ff5927e17114",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzuxpnn/"
    },
    {
      "created_utc": 1768534908.0,
      "author": "jakedeltoro",
      "text": "**Overall Record**: 5-3 \n\n**Form**: ❌✅✅✅✅✅❌❌\n\n**Net Units**: +4.46u\n\n**Last Pick**: Hofstra -7.5 @ Stony Brook (LOSS ❌)\n\n**Today’s Pick**: Werder Bremen vs. Eintracht Frankfurt - BTTS + o2.5 Total Goals\n\n**Wager**: 4u to win 3.2u  (-125 on Bet365)\n\n**Match**: Werder Bremen vs. Eintracht Frankfurt\n\n**League**: German Bundesliga\n\n**Last Pick Summary**: No more basketball bets for me. I just don’t get it.\n\n**Today's Write Up:** I love this setup for a BTTS + o2.5 goals! Werder Bremen returns home after a 3-0 spanking by Dortmund. They haven’t scored a single goal in 3 matches, losing 3-0, drawing 0-0, and losing 4-0. They are DUE for a goal at home here. And, coming to town is Eintracht Frankfurt who play fast and loose. Bremen had a couple opportunities against Dortmund but were unable to convert. I think they will feel the need to net in this one at home, and will begin to open up more in an attempt to get on the score sheet. Eintracht Frankfurt has given up 36 goals through 17 matches, but have been able to put in 35 goals in that span. \n\nFeels like a great opportunity for these teams to get lots of shots in and hopefully, put in a couple goals each.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzuw1db/"
    },
    {
      "created_utc": 1768529510.0,
      "author": "ThatOneCinaGuy",
      "text": "**Record: 127-92-8**\n\n**Units Won: +14.05 (All Picks are 1U)**\n\n**Form:  ❌✅❌✅❌✅❌✅❌🅿️❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅✅✅✅❌✅✅✅✅❌✅❌✅✅✅✅❌✅🅿️✅✅✅✅✅✅❌❌✅❌❌❌❌✅✅✅✅✅✅✅✅❌✅✅✅✅❌✅✅✅✅❌❌❌✅❌❌✅✅✅❌❌❌✅❌❌❌🅿️❌✅✅❌✅❌❌✅❌✅✅❌❌❌✅✅✅❌🅿️❌❌🅿️❌✅✅❌✅❌❌❌✅✅✅✅✅✅❌❌✅✅❌✅❌❌✅✅❌✅✅🅿️✅❌❌❌❌✅❌✅❌✅✅❌❌✅❌✅❌❌🅿️✅❌✅✅✅✅✅❌❌❌❌✅❌✅🅿️✅❌✅✅❌✅❌❌❌✅✅❌✅✅✅❌✅❌✅✅❌✅❌✅✅❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅✅✅**\n\n**Last POTD:** Como Vs AC Milan - **BTTS @ 1.77 (Melbet) - WON**\n\n**Football | Australia - A-League | 16:35 PM (GMT+8) - Starts in 6 Hours!**\n\n**Pick:** Melbourne City Vs Auckland - **Auckland Team Total Over 1 (Asian Total) @ 1.73 (Melbet)**\n\n**Write Up:** Melbourne City host Auckland FC in a match that looks more about control than end-to-end action. Both teams are well organised defensively, and recent meetings between them suggest this won’t be a wide-open contest. At home, Melbourne City have played with patience and discipline. Three of their last five league matches have seen them score one goal or fewer, including a narrow 1–0 win over Brisbane Roar and a 0–0 draw with Sydney FC. They may not create a lot going forward, but their solid structure has kept games close and competitive.\n\nDefensively, Melbourne City are usually reliable at home. In their last five matches, they’ve conceded more than one goal just once, in a 3–1 loss to Perth Glory. Even when results go against them, the margins tend to be small, like the narrow 1–0 defeat to Newcastle Jets. This reflects a pattern of low-scoring games shaped by patience rather than constant pressure. That approach has also led to five draws in thirteen league matches. When games are level, City often slow the tempo and focus on control instead of taking risks.\n\nAuckland FC come into this match with confidence built on strong away performances. They kept clean sheets in wins at Brisbane Roar and Western Sydney Wanderers, while a 2–1 victory at Central Coast Mariners showed they can see games out without losing their shape late on.\n\nTheir only real defensive slip in the last five matches was a 3–1 home loss to Newcastle Jets. On the road, however, Auckland have been much more compact, conceding just one goal across their last three away games. That balance between attacking when needed and staying disciplined defensively has played a big role in their league position. While the previous meeting in Melbourne ended 2–2, Auckland responded with a convincing 3–0 win in the return fixture at home.\n\nOn paper, this looks like a slower, more controlled match, and that’s likely how it will play out. It’s not so much a lack of faith in Melbourne City’s defence, but rather confidence in Auckland’s ability to find a goal. City have conceded in four of their last six home games, while Auckland have scored in five of their last six away matches, hitting more than one goal in four of those. Looking more broadly, Auckland have found the net in 11 of their 12 games so far this season. With the quality in their squad, they should have enough to get on the scoresheet again here, which would further strengthen their position in the table.\n\n**NOTE: Please only stake what you can afford to lose; know that no picks are 100% guaranteed to hit. Stake Responsibly.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzug23l/"
    },
    {
      "created_utc": 1768529413.0,
      "author": "rimurusama04",
      "text": "Death, Taxes, and SP7988 & san solares on a winstreak",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzufrnc/"
    },
    {
      "created_utc": 1768527850.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 23-23-5 (Avg Odds +128)\n\n**Previous Pick:** Barca/Racing Over 4 goals (-105) ❌️\n\n**Today's Event:** German Bundesliga (Soccer) | Werder Bremen vs Eintracht Frankfurt (11:30 AM PST)\n\n**Pick:** Total Goals Over 3 (-110) 1.1 units to win 1 unit\n\n**Write Up:** Tough one yesterday. The match was end to end as expected, but luck was not on our side. Racing had 2 goals ruled out for offside, Barca missed chance after chance and wound up with 2 goals on 17 shots. Sometimes soccer is like that.\n\nRight back to an over goals play today as Werder Bremen host Eintracht Frankfurt. I play this type of play a lot unofficially with Frankfurt, as they go through stretches of high scoring games. Frankfurt are the second highest scoring team in Bundesliga, averaging over 2 goals scored per game. They are also the 3rd worst defensive team, conceding over 3 goals per game. Combine that with the fact that Werder are also bottom 5 defensively in the league, I see this being a high scoring match. \n\nThis could be a 4-0 Frankfurt route, or we could see a 2-2, 3-2 close game. Tough to call as Frankfurt are volatile. Their last two matches ended 3-2 and 3-3 respectively, so we're banking on their good offense and bad defense continuing their latest trend. \n\nBOL and happy Friday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzub3ai/"
    },
    {
      "created_utc": 1768526873.0,
      "author": "Yew32",
      "text": "**Record 3-0**\n\n**POTD:** Kings -5.5 **(If your a safe person only take if Sabonis plays and bilal is out).**\n\nOkay, this is very interesting if you're a gambling kinda person. So Sabonis is questionable but he played full practice minutes and I think the Wizards would be a nice spot to come back and dominate. Dennis Scrhoder will also be coming back from his three game suspension. I like this because I think something is clicking: beating the Rockets, Lakers, Knicks and now they play the Wizards. I think the Kings are a nice counter to the Wizards as they have a lot of unique firepower.  \n\nIf you play pace then you have Malik, Dennis and Russ. If the three ball is not clicking then you have the paint to attack which is where Demar, Sabanis, Precious, Maxine and Westbrook thrive. On the other hand the Wizards recently gave CJ McCollum up which is very detrimental as he was the guy opening up space and being the guy that was hounded. I think as of late these rookies can't really make shots or space but that's to be expected as they're probably being pushed to experiment and to tank. Currently the Wizards are 4-16 on the road as well.\n\nI think the Kings could struggle but they have played three games at home now and are probably all very motivated due to the trade dead line to lmfao and now is probably a good time to show up. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzu881a/"
    },
    {
      "created_utc": 1768526001.0,
      "author": "san_solares",
      "text": "Net Units: +71.65  \nROI: 18.61%  \nRecord: 45-19-12 (W/L/P)\n\nLast POTD: BTTS YES  / Heerenveen v RJK Waalwijk (W)\n\nTracker on the bottom, as per.\n\nToday's POTD: Espanyol v Girona - La Liga - 3.00 PM EST - Espanyol ML - (1.90) - 5U\n\nI feel like this line is straight up wrong. Espanyol is undefeated at home this season versus teams not in the top 6; their only losses coming vs Barcelona two weeks ago, Villarreal and Betis. I firmly believe the casino undervalues Espanyol as a whole this season, coming from past experiences and believing the team is bad based on the mediocrity of their history. \n\nBOL and tail responsibly, as always.\n\n[TRACKER](https://docs.google.com/spreadsheets/d/1-PHX-U7eiB5neVpbTJVkzwquGE1KyGVQA5nfejcDT_A/edit?usp=sharing)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzu5naz/"
    },
    {
      "created_utc": 1768524270.0,
      "author": "dreamchasing1",
      "text": "Record: 256-238 Net Units: -23.10 61-62 on 1.5u plays, 44-42 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Algerian Cup] Mostaganem vs Saoura\nLast pick: Asian total corners over 8.5 @ 1.87 lost\n\n\nEvent: Soccer/Football, [Italy Primavera 1] Lazio u20 vs Sassuolo u20\n\n\nPick: Total corners over 9.5 @ 1.80 - 1.5 Units\n\n\nBoth sides average well above this line with Lazio at home getting a total of 10.70, Sassuolo 11.50 away. Covered in 7/9 games at home for Lazio and in 8/10 away games for Sassuolo. The two teams also met in November this season in a game with 11 corners total.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nzu0go2/"
    },
    {
      "created_utc": 1768524113.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 82 - 85 Profit: -6.05 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅❌❌️✅❌✅❌❌✅✅✅❌❌️\n\nRangers vs Annan Athletic, over 5.5 goals @ 2.45\n\nRangers vs Annan Athletic looks ideal for over 5.5 goals. The quality gap is massive, with Rangers likely to dominate possession, chances, and territory from the first minute. Annan tend to struggle defensively against higher-level opposition, while Rangers are ruthless in these mismatch cup-style games. An early goal should open the floodgates, with Rangers pushing the tempo throughout and rotating without losing attacking intensity.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nztzz7e/"
    },
    {
      "created_utc": 1768523638.0,
      "author": "kab1218",
      "text": "PoTD 16-20-1 Last 5:  ✅✅❌❌✅\n\nNet: -17\n\nPrevious: Italy | Serie A | 0245PM Eastern | AC Milan vs Como | AC Milan -0.0 2u @ -128 ✅\n\nMilan didn’t look great in the first half, but converted when they needed in the second half. Moving on.\n\nToday: Portugal | Primeira Liga | Sporting CP vs Casa Pia | Sporting -2 | 3U @ -130\n\nWrite up: Sporting is home. Sporting has scored 47 conceded 9. They’ve beaten Casa Pia by at least 2 in their last 4 H2H. Casa has scored 17 and conceded 34 this season. Sporting has outscored opponents 20-2 in their last 7 home matches. I see Sporting taking it to them tomorrow, doubting if Casa Pia even scores. BOL if tailing me",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nztyhvy/"
    },
    {
      "created_utc": 1768523130.0,
      "author": "Best_Accountant_5471",
      "text": "2026 record: 4-4 (+ 0.5 units)\n\n2025 record: 55-41 (+26.5 units)\n\nLast 10 (most recent on right):  ❌❌❌✅❌✅✅⏳❌✅\n\nLast Pick: Martin Vitik 1+ tackles vs Hellas Verona + Diogo Leite 1+ fouls committed vs Augsburg ✅\n\nEvent: Spain La Liga + England Championship ⚽️\n\nPick of the Day: Viktor Tsygankov 1+ tackle vs Espanyol + Aidan Morris 1+ fouls committed vs West Brom 3.5 units to win 3.5U @2.02 (Bet365)\n\nWrite-up: Vitik cashed in the 25th minute with a tackle, ending on 2 (one won) whilst Leite got his foul midway through the second half. \n\nTsygankov expected to start RW in a 4-2-3-1 formation vs Romero\n\nTsygankov tackle:  \n\n- 12/13 matches (last 17 with sub roll-on) averaging 1.4 per game  \n\n - At RW cleared in 4/4 this season (average 2.4)\n\n- RW’s had a tackle vs Espanyol in 7/9 (average 1.3) \n\nMorris expected to start LCDM in 4-2-3-1 against midfield three of Bielik, Styles, Price (no clear direct opponent)\n\nMorris 1+ fouls:  \n\n- 11/12 matches averaging 1.5 per match\n\n- 3/3 matches at LCDM averaging 1.7 this season\n\n- Opposition midfield combines for 3.0 fouls won per match \n\nUsually include a section on how opponents fare in position of stat however a very makeshift midfield is expected from West Brom (as in never played together here) that makes it pointless to do so.\n\nPick a book that voids if a player doesn’t start (both are heavily predicted to start though). BOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nztwxk8/"
    },
    {
      "created_utc": 1768523041.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 9-30-4 *The Barcelona curse is real y'all and once again my pick lost with the literal last kick of the ball. Racing Santander turned up and did us proud, leaving only scraps to Barcelona's attackers (their first shot on target came near the end of the first half) while showing glimpses of real quality themselves. Despite conceding in the second half, things looked promising as the score remained 1-0 deep into the added time and to make everything even better, the Santander player then went one on one with the goalkeeper - and had his effort spectacularly saved. That could've sealed the deal then and there, but instead Barcelona hit them with a random long ball and scored in the literal final second. How do I always manage to pick these bizarre classics is beyond me, but oh well, I'll be there for the next hatewatch. Feeling really good about this next pick and I'm sure the 10th win is just around the corner (even though it might feel like i'm stuck in a spherical room)*\n\n**Last Five:** ❌❌❌🅿️❌\n\n**Event:** Ligue 1 McDonald's, PSG v Lille, 3:00 pm EST\n\n**POTD:** Lille +1.5 Asian Handicap, -129, 2 units\n\n**Write Up:** It's actually remarkable just how poor of a season PSG are having for their lofty standards and I feel like their form has largely flown under the radar for some reason. Their gameplay has looked rather uninspiring and it almost seems as if they're not taking half the matches seriously. As a result, they find themselves **second in the French league, are already out of the French league cup,** as well as with just one win in the last three Champions League matches *(still in the top 8, but nothing is secured yet).* Even a lot of their wins were very scrappy, for example, they needed penalties to overcome Marseille in the French Supercup, narrowly beat Metz, as well as a 10-men Lyon, thanks to a 95th minute winner, didn't look convincing at all in their 1-0 win over Nice, as they once again needed a 95th minute goal etc. They also **lost against a 10-men Monaco** recently, showing that they often fail to make things going for them even when the game's events seem to want to go their way. \n\nOn the other hand, we have Lille, who are having a pretty solid season, they're sitting in 4th place in the league with **4 wins in the last 5 games** (same form as PSG), so I think a +1.5 Asian Handicap should absolutely see them through today's fixture. Feeling really good about this pick so I'm going with 2 units. BOL everyone and let's enjoy a French classic and watch PSG score 5 for some reason ☘️🫡\n\n☘️ If I've made you some money through fades, please consider dropping a tip: [https://buymeacoffee.com/sigmabale](https://buymeacoffee.com/sigmabale)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nztwnl2/"
    },
    {
      "created_utc": 1768522758.0,
      "author": "SP7988",
      "text": "**Record:** 37-18-1 (+18.82u) | L5: 4-1 (3W)\n\n**Last:** (CBB) Illinois -9.5 (1.5u) - ✅\n\n**POTD:** (CBB) Kansas (-6.5) vs Baylor\n\n**Start Time:** 8:00 PM ET (FOX)\n\n**Odds:** -115 (FanDuel)\n\n**Units:** 1.5U\n\n**Reasoning:** They say home is where the heart is. For the Kansas men’s basketball team, it’s also where the dominance is at. \n\nOver the years, Allen Fieldhouse has been a tough place to play for visitors. Under former head coach Roy Williams (1994-2003), the Jayhawks (12-5) went 201-17 in front of the home fans. Not to be outdone, his successor, current head coach Bill Self, has put together an impressive mark of his own (335-21), including setting a program record with 69-straight home victories from February 2007 to January 2011. Just Tuesday night, No. 2 Iowa State found out just how difficult of a road trip it is, falling 84-63 while shooting just 37% from the field. \n\nThat home cooking becomes evident especially on the defensive end of the floor. \n\nThrough 17 games, Kansas ranks 4th in opponent field-goal percentage (38.3%), 8th in opponent three-point shooting (28.2%), 33rd in scoring defense (67.8 PPGA) and 34th in defensive efficiency (0.958). At home, those numbers become even more impressive, falling to a minuscule 61.0 points per game allowed on just 35.4% shooting while registering a defensive efficiency of 0.857 (13th in the nation). On paper, Baylor will pose a formidable test for the unit, as the team comes in ranking 23rd in offensive efficiency (1.185), 27th in scoring (86.3 PPG), 46th in three-point shooting (36.7%) and 47th in field-goal percentage (47.9%). However, the Bears (11-5) have found offense hard to come by as of late, averaging just 68.1 points on 41.2% shooting over their last four games. \n\nFurthermore, just take a look at how the team has struggled in six contests against opponents who rank in the Top 100 in defensive efficiency: \n\n* Houston (1st): 55 points on 37% shooting (37% from beyond the arc)\n* Iowa State (5th): 60 points on 31% shooting (19% from beyond the arc)\n* TCU (25th): 63 points on 37% shooting (24% from beyond the arc)\n* St. John’s (32nd): 81 points on 37% shooting (32% from beyond the arc)\n* San Diego State (53rd): 91 points on 53% shooting (39% from beyond the arc)\n* Memphis (70th): 71 points on 34% shooting (36% from beyond the arc)\n\nNot only did Baylor go 1-5 in those six outings, but the team also failed to top 37% shooting in all but one of those games and eclipsed 71 points just twice. Not the kind of resume you want to bring into a road matchup with a defense that ranks 34th in defensive efficiency.\n\nAs for the Jayhawks, although their numbers won’t jump out as overly impressive—59th in three-point shooting (36.2%), 76th in field-goal percentage (46.9%), 77th in scoring (77.9 PPG) and 101st in offensive efficiency (1.100)—the offense kicks it into another gear in front of the home fans. \n\nIn nine home contests, Kansas has averaged 81.8 points on a blistering 50.4% shooting (37.6% from deep). In fact, the team has really started to find its groove as of late, averaging 87.7 points on 48.6% shooting (39.4% from beyond the arc) over its last three outings. That could pose problems for an underwhelming Bears defense that ranks 94th in opponent field-goal percentage (42.8%), 150th in defensive efficiency (1.037), 153rd in opponent three-point shooting (33.3%) and 193rd in scoring defense (75.5 PPGA). Further complicating matters, the unit concedes 79.5 points per game on 46.1% shooting (39.1% from the perimeter) away from home. \n\nTurnovers could prove to be the X factor on Friday night. \n\nOn the season, Baylor has fared decently in limiting mistakes with the ball, ranking 125th in turnovers per possession (15.8%), 138th in turnovers (11.5 per game) and 163rd in opponent steals (6.7). However, the team has been a little more careless over its last three contests, with those numbers ballooning to 20.6%, 14.0 and 7.3 respectively. Meanwhile, although Kansas has appeared allergic to creating turnovers—287th in steals (5.6), 334th in turnovers forced per possession (13.8%) and 335th in turnovers forced (9.8)—the team has done a little better over its last three games, increasing those numbers to 7.7 steals, 16.6% and 12.3 respectively.\n\nTrust the Jayhawks to get the job done and record their sixth-straight home victory in dominating fashion.\n\nBOL if tailing, and as always, please do so responsibly. One bet should not have you crashing out all over Reddit.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nztvs7i/"
    },
    {
      "created_utc": 1768522579.0,
      "author": "bstilled_",
      "text": "**Record:** 9-0    \n**Net Units:** +6.55                       \n**Last Pick:** RHIA - Win (Dead Heat)      \n**Australian Horse Racing, Pakenham race 2 (6:45PM AEDT)** 7.5 hours from now    \n**Pick:**  8. MISS MARANDA $1.90                     \n**Write Up:** Bit disappointing that we didn’t get the full win yesterday, just encountered a bit of traffic in the straight that halted our momentum for a bit. Hopefully a few of you got on the other tips!    \n    \nFor today’s tip we venture out to Pakenham and find MISS MARANDA here 4th up. Has just been steadily building this prep, with its first 2 runs being at distances well short of its best, but showed a high level of talent with its last start 2nd to MISSAPPREHEND (a horse going places). On that occasion she settled midfield behind the winner, and had to wait for the winner to take a gap before commencing her run, resulting in a very fast finishing 2nd.    \n    \nToday’s run we go up another 200 metres (huge plus +), and swap the inside barrier for barrier 6. I’m hoping to land in the one-one (behind the leader on the outside), and with clear air in the straight, we should hopefully go sailing past.    \n    \nThis is by far the weakest race that we contested, and I really can’t see any dangers on exposed form. All the other horses are lightly raced, so some level of improvement can be expected, however I can’t forecast enough progression from any of them to worry MISS MARANDA.    \n    \nBet is for the horse to come 1st. For every $10 you put on, should be receiving $19 ($9 profit). If you’re getting significantly less, you’ve placed the wrong bet.    \n    \nOther tips will be up in the other thread later. Any questions lemme know. GL.    \n    \nTips appreciated, big thanks to anyone who has already :)    \n    \n[buymeacoffee.com/Bstilled_](https://buymeacoffee.com/Bstilled_)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nztv8jh/"
    },
    {
      "created_utc": 1768522399.0,
      "author": "BL_ATS",
      "text": "POTD record: 15-14-1\n\nDarts, Bahrain Darts Masters 🎯\n\nLast POTD: Luke Littler vs Gian van Veen under 37.5 180s @ 1.81 ✅\n\nPOTD: Luke Humphries -1.5 legs vs Nathan Aspinall @ 1.73\n\nAfter going 3-0 during the World Championship I’m looking to continue this winning streak with another darts bet.\n\nLuke Humphries is lining up against Nathan Aspinall. After the World Championships, it’s always a surprise who’ll show up and who won’t. Last year, Bunting won this tournament after all. \n\nI’m simply looking at yesterdays results and of course the history and background of both players. Luke Humphries is generally the better player. Threw 103.66 average and won his first game 6-0. Aspinall had more trouble winning his match and won 6-4 with an average of 90.61. Consider that the opponents are legit dogshit and should have no chance against the top pros.\n\nHumphries ranked 2nd today in overall performance compared to Aspinall ranking 5th.\n\nFor this match, it’s first to 6 legs instead of the sets we saw during the World Championship.\n\nThe bet is a win if Humphries wins with atleast 6-4.\n\nOnce again, my pick is Luke Humphries -1.5 legs @ 1.73\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nztuofe/"
    },
    {
      "created_utc": 1768522288.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 39-22 (+12.62U)**\n\n**ROI: +16.83%**\n\nLast POTD: NBA: Magic vs Grizzlies U230.5 -110 (0.50U TO WIN 0.40U) ✅\n\n**POTD: NCAAB: Kansas -6.5 vs Baylor -120 (1U TO WIN 0.80U)**\n\nWrite up: The 7 bet win streak continues!!!! Let’s hope the model keeps rocking and rolling for us - Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Kansas ML at 71%\n\n• Model projects Kansas covering -6.5 at 55% - it has the line set at -8.5\n\n• EV better betting 100$ = 12-13$ for this play\n\n• Pretty fun little win streak we got going on everyone - I just have to point out, the NBA man, I don’t even care that the under hit last game, that mess is rigged and it’s just not even enjoyable watching or betting - alright enough ranting - betting on the inconsistent Jayhawks here, but really hard not to take them after their win against Iowa State - Kansas thrives at home this year, they are 7-1 at home, Baylor being 1-2 on the road, I would argue, Baylor has been weaker on the road, and haven’t been truly “battled tested” on the road either - I am jumping on this line early because one of Baylor’s top players, Skillings looks like he is going to be a GTD - if he plays, I expect the line to drop 1-2 points in favor or Baylor, if he is out, I can see it jumping to -7 ish - I do still like Kansas to cover here regardless if he plays or not - in the last 4 meetings between the two when Baylor has played at Kansas, they have lost the last 4 - Kansas averages about 68 PPG when they are at home, while Baylor’s defense seems to drop off on the road, where they give up roughly 75 PPG - Can Kansas build off of their most impressive win yet earlier this week and keep the ball rolling today - I think so - They are an inconsistent team, and I really hope that team doesn’t show up tonight… Jayhawks -6.5 is a green light\n\nPOTD History: [https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn](https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn)\n\nBOL!\n\n**POTD: NCAAB: Kansas -6.5 vs Baylor -120 (1U TO WIN 0.80U)**\n\nTips are greatly appreciated - Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nztuc0m/"
    },
    {
      "created_utc": 1768522237.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qe0j24/pick_of_the_day_11626_friday/nztu6ih/"
    }
  ]
}