{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/6/26 (Tuesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/",
  "target_date": "2026-01-06",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-06T16:21:14.219532+00:00",
  "comments": [
    {
      "created_utc": 1767716130.0,
      "author": "Timely-Conclusion532",
      "text": "Record: 307-193\n\nForm: ❌❌✅✅✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅✅❌❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌❌❌❌✅✅❌✅✅✅❌✅✅✅✅❌✅✅❌ ❌❌❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌✅✅✅✅❌❌✅✅✅✅✅✅❌✅✅✅✅❌✅❌✅❌✅✅❌✅✅❌❌❌✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅✅✅❌✅✅❌✅✅❌✅✅❌❌✅❌✅✅❌❌❌❌❌✅✅✅✅✅❌✅✅✅❌✅❌✅❌❌✅❌✅❌✅❌✅✅✅✅✅✅❌✅❌✅❌✅✅✅❌❌✅❌✅❌❌❌✅✅✅✅❌❌✅❌❌✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅❌✅✅✅✅✅✅✅✅❌❌✅✅✅✅❌❌❌✅❌✅✅✅❌✅✅❌✅❌❌❌❌✅❌✅✅✅✅✅❌✅✅❌✅✅✅✅✅✅✅✅❌✅❌✅❌✅❌❌❌❌✅✅✅✅❌✅✅❌✅✅❌✅✅✅✅❌❌✅✅✅❌✅❌✅✅❌❌✅❌✅❌❌✅❌❌❌✅✅❌✅✅❌✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅❌✅✅✅✅✅❌❌✅✅✅❌❌❌❌❌❌✅❌✅✅✅✅✅✅✅✅❌✅❌❌❌✅❌✅✅❌✅❌❌✅❌✅✅✅❌✅✅❌✅❌✅ ✅❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅❌✅✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌✅❌✅✅✅❌✅❌❌❌✅✅❌❌✅✅✅❌❌✅❌✅❌✅❌❌✅❌❌❌❌✅✅✅✅✅✅❌✅✅❌❌❌❌✅✅❌❌❌❌✅✅✅✅❌✅✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅❌✅✅❌✅❌❌✅✅❌✅✅✅❌✅❌\n\nNet Units: -0.22 units (All plays 1 unit)\n\nYesterday’s Pick: (NBA) Atlanta Hawks +6.5 vs Toronto Raptors (-180) ❌\n\n**POTD: (NCAAB) Houston Cougars -3.5 vs Texas Tech Red Raiders (-188) (9:00 PM EST)**\n\nReasoning: Houston are 13-1 on the season and are at home for this matchup with 11-3 Texas Tech. Houston’s defense is no joke. They rank 6th in the country in adjusted defensive efficiency. Houston hasn’t been great on the offensive end ranking 95th in adjusted offensive efficiency and are up against a Texas Tech team that are solid offensively and defensively however not elite. Despite how good Texas Tech have been offensively, Texas Tech ranks 235th in the nation in field goal percentage and going against an elite defense in Houston is worrisome. Texas Tech rely on the offensive rebounding to turnover rate to generate points but against Houston, that won’t be so easy. Line movement has also moved in favor of Houston. With that being said, I’m laying the 3.5 points on Houston to cover at home (playable at -6.5).\n\n👇\n\nhttps://preview.redd.it/1xdwvtem7rbg1.jpeg?width=1170&format=pjpg&auto=webp&s=c43961ee8965a858f83e2e3bb4fedfddd078681a",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/ny11uvf/"
    },
    {
      "created_utc": 1767713928.0,
      "author": "Jave3636",
      "text": "Record:2-3, WLWLL \n\n\nLast pick: Houston -7.5. Brutal. Durant went 1-11 from 3 before hitting the game winner. 9-37 from 3 and they still won. Suns were definitely tired and sloppy like I predicted, but Houston was just as bad. \n\n\nEvent: Mavericks at Kings \n\n\nPick: Naji Marshall over 17.5 points amd rebounds \n\n\nWrite Up: PJ Washington is doubtful with a sprained ankle, so there will be more minutes amd rebound opportunities for Naji. Naji actually averages over 20 PR on the road, and on top of that, the Kings are one of the worst in the league at giving rebounds to opponents. The Kings embarrassed the Mavericks last time they played, so tjere will be revenge on the mind for the Mavs. Between the Kings being bad on defense, bad at giving up rebounds, and Naji playing really well on the road (a full 3PR more than his home average), I think Naji goes over here. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/ny0tv1h/"
    },
    {
      "created_utc": 1767712612.0,
      "author": "tokcliff",
      "text": "Event: Malaysia Open Men's Single\n\nPOTD Record: 142w 95l 2p \n\nDate: 7 January SGT\n\nNet Profit = +48.6025 units\n\n\n\nKodai Naraoka -6.5 points at 1.8 @ 1.5 units (vs Chi Yu Jen)\n\n\n\n2/2 H2H, difference in class, I know Kodai was quite iffy, but recently he has been on decent form, winning the Kumamoto Masters, and reaching the SFs of the WTF while being unseeded.\n\n\n\nBTW if anyone wants to follow my blog where I do some reflection about badminton betting\n\n[https://tokkidokkie.wordpress.com/](https://tokkidokkie.wordpress.com/)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/ny0p9cj/"
    },
    {
      "created_utc": 1767711217.0,
      "author": "jedi21knight",
      "text": "Record 0-0\n\nToday’s POTD UGA+9.5\n\nGame: UGA @ Florida 7pm \n\nFull disclosure I am the biggest homer for UGA but this team is solid. \n\nWhen I looked at the line this morning and saw it was at 9.5 I was salivating. UGA is 13-1 on the season and has played good teams, only loss is to Clemson by 3 in OT and the blew a late lead. They have one common opponent which is FSU, Georgia won 107-73 at FSU and Florida won 78-76 at home. Georgia is the highest scoring team in NCAA and can put up points with anyone. One final thought is we have Florida’s last coach and I feel he will want to go into Gainesville and grab a win and show them why he should still be there coach. BOL if you tail.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/ny0kk78/"
    },
    {
      "created_utc": 1767710193.0,
      "author": "Section1ne0h4our",
      "text": "14-7, +6.39u\n\n*Last 5:* ✅❌❌❌✅\n\n**NCAAB - Bowling Green @ Kent State, 7 PM ET**\n\n***Kent State -1.5 (-120) 1.5u***\n\nTo college basketball we go! - the only thing that’s good about the football season winding down, is the opportunity to diversify the things I gamble on in the winter time, as spring comes into focus. Today I love this trend:\n\nKent State are 11-3 on the season, meanwhile Bowling Green are 11-4 - but **Bowling Green have lost 12 STRAIGHT games against Kent St, losing by an average of 11 points a game. Bowling Green haven’t beaten Kent St this decade.**\n\nNow - I emphasize, this is a full blown gut play. There is definitely a *roadblock* here, which is why Vegas had the original spread to Bowling Green, and the total is still in the mid 150s:\n\nThese are two top 20 offensive units in the country, both scoring on average in the 80s, *BUT Kent St are literally one of the nations WORST defensive teams (324th PPGA).*\n\nI’m not scared of Bowling Green outshooting Kent St, *as much as I am Kent State losing the battle up and down the floor*. On paper, Bowling Green’s defensive advantages should keep the game close, but I can’t bet against history.\n\nThis isn’t one to tail for the faint of heart. This could be one to fade for fun. Either way this is gonna be one worth watching if you love high pace basketball.\n\nLast play review:\n\n***Leicester/West Brom, Total o2.5*** ✅\n\n(As I was preparing my write up for a 4th consecutive defeat, an absolute world class goal by Fatawu (who should be on the AFCON stage with Ghana , but they’re awful right now) won us the bet. He saved our asses, I will be donating to a charity of his choice if I can find one 😂)\n\n**BOL if you’re tailing, and if not BOL in general.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/ny0h9re/"
    },
    {
      "created_utc": 1767709557.0,
      "author": "Dmyers9099",
      "text": "Record: 4-4\n\nPrevious: Atletico Madrid ML ❌\n\nEvent: Rangers v Aberdeen (Scottish Premiership) 3:00pm EST\n\nSporting CP v Vitoria de Guimaraes (Portugal League Cup) 3:00pm EST\n\nPOTD: 2-leg parlay: Rangers ML + Sporting ML -105\n\nTaking two strong teams in great form. Rangers sit in 3rd on the league table winning 4 of their last 5 games including a recent 3-1 win against Celtic. In their last 5, they’ve scored 8 goals while allowing 4.\n\nAberdeen sit at 8th on the table and have lost 4 of their last 5 games (1 draw). Their last clean sheet was on November 30th. \n\nSporting and Vitoria meet for a semi-final league cup match (Taça de Liga). Sporting sit in 2nd on the league table with a +38 goal differential. They’ve won 4 of their last 5 including a 4-1 win at Vitoria on December 23rd. In their last 5 games, they’ve scored 18 goals and only allowed 4.\n\nVitoria sit at 6th with a -6 differential. Their last 5 record is 2-1-2, scoring only 4 goals while allowing 6.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/ny0fa88/"
    },
    {
      "created_utc": 1767708337.0,
      "author": "Seventh__Place",
      "text": "POTD RECORD: 4-0\n\nNet units: +5.374 // 269% ROI\n\nForm: ✅✅✅✅\n\nLast POTD: Charleston -1.5 -120 1U ✅\n\nToday’s POTD: **Andrew Nembhard O25.5 PA -122 (FanDuel) 1U**\n\nEvent: NBA | Cavaliers @ Pacers (7:10 pm EST) | 🏀\n\n*Recap: Wild game. William and Mary shot out of the cannon and led by seven early before Charleston settled in. The Tribe shot 2-for-18 from deep in the first half, and the Cougars led by 14 at the half. William and Mary started the second half absolutely on fire and pulled within one possession, but Charleston had enough answers at home. That's four wins in a row to begin my POTD experiment. Not too bad. We move!* \n\nWe're going back to the well with one of the worst teams in the league. I must be an idiot. But pride counts for something, and the Indiana Pacers are trying to avoid a dubious distinction. A loss tonight sets a team record for consecutive futility. Four times, Indiana has stared at an unlucky 13th-straight defeat. The last time was the 1988-89 season. So tonight.... at home... against a divisional foe... with pride on the line? Yeah, I'm rolling with Andrew Nembhard again.  \n\nWhat am I missing? He *just* got this exact same line against an Orlando Magic team that is lights-out at defending opposing points guards. Nembhard cleared it playing against Jalen Suggs - the \"eater-of-assists\" - and easily did it again, days later, with Suggs out. Now, we're supposed to be afraid of Darius Garland? Garland, the same guy with a defensive impact rating in the bottom 20 percent of the league? Garland, who Nembhard shot better than 50 percent from the floor when he was the closest defender during the 2025 playoffs? Garland, who is four inches shorter than Nembhard? I see Nembhard playing bully ball and looking to score since Benedict Mathurin and Obi Toppin are still out. *(See my POTD write up from Jan. 4 as to why you would back him in points alone).* \n\nNeed more? Look to December 1. Nembhard netted 21 points and six assists against the Cavs with a much better defender in Donovan Mitchell on him. Sure, the Pacers lost that game, 135-119, but Mitchell is out tonight and Jarrett Allen is questionable with an illness. My thesis is the offense will go through Nembhard, who has already seen a spike in usage rate this year. I looked at Siakem for points, but I don't like his history against Evan Mobley. Meanwhile, Cleveland ranks a very pedestrian 15th against opposing point guards scoring. But I'm banking on Garland's underwhelming defense, and Mitchell's absence, to allow Nembhard opportunities to go inside or pull up from midrange. And don't discount the pride factor. These are professionals in a highly-professional organization. They don't want to be known for this streak. Trust. \n\nGood luck and godspeed!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/ny0bj1p/"
    },
    {
      "created_utc": 1767702114.0,
      "author": "Fit-Mix5629",
      "text": "Was lurking for a long long time, it is time to post something I guess…\n\nPOTD Record 0-0\n\nEuroleague: Virtus Bologna - Žalgiris\n\nTime: 21:30 EET\n\nPick: Žalgiris ML @2\n\nToday we have Žalgiris(11-8) visiting Italy for a clash vs Virtus Bologna(9-10). I truly understand why Žalgiris is an underdog here, they play away, the situation behind the scenes and locker room were not so great and etc, but.. Everything is in the past already, Žalgiris showed that they can play away, seems that coach Masiulis have found right talk with his team leaders and everything is cool right now. Žalgiris has great perimeter players in Fracisko and Goss, while Virtus relays on Edwards who sprained his ankle in game vs Milano, moreover Žalgiris defense 1on1 is great, because of Butkevičius and Goss. Źalgiris have no injuries(except D. Giedraitis who is not playing at all either way) while Virtus is still uncertain about Smailagic and Edwards. Žalgiris won all previous meetings so I just can’t pass these odds on Žalgiris. BOL!!\n\nExtra spice(I am not gonna count that towards the record) - Sylvain Francisko over 14.5 points\n\n\nEDIT - format",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxzuhsj/"
    },
    {
      "created_utc": 1767701152.0,
      "author": "donjavogosca",
      "text": "POTD Record: 36-20, +14.7u, (ROI +21.14%)\n\nPrevious Pick: Jusuf Nurkic to have 14+ rebounds and assists, 1.81, 1.5u ✅️ (last 5: ❌️❌️✅️❌️✅️)\n\nEvent: Euroleague: Monaco - Partizan, 19:30h\n\nPOTD: Isaac Bonga to score 10 or more points, 1.84, 1.5u\n\nPartizan lost/fired Tyrique Jones (went to Olympiakos), and the idea is that other players need/and are going to step up tonight, and Bonga is the perfect candidate for that. He made double digits in his last 4 games, and in the last 5/6.\n\nWith more space and time, hopefully, he will get this comfortably.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxzsb99/"
    },
    {
      "created_utc": 1767699929.0,
      "author": "lordestros",
      "text": "Last 5 POTD : ❌️❌️❌️❌️✅️\n\n**Previous pick** : Sweden vs Czechia U20 over 5.5 goals (-125) ✅️ (ends 4-2!)\n\n**POTD Record** : 11-8\n\n**Today's pick** : Toronto Maple Leafs vs Florida Panthers at 7:30pm EST (NHL/Hockey)\n\nAuston Matthews over 3.5 shots (+110)\n\nFinally back in the winning column after 4 losses in a row! This line seems low as Auston Matthews seems to be back in form lately. Ever since William Nylander has been out (last 4 games), he's been an offensive juggernaut hitting that line easily (6,5,5,9) and scoring 6 goals so he's definitely feeling confident about his shot again. He finally looks like the player that had a 60 and 69 goals seasons. He also has hit that line the last time they played the Panthers (December 2) with 4 shots and Nylander was in the lineup.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxzpmy2/"
    },
    {
      "created_utc": 1767697115.0,
      "author": "SnooPredictions6924",
      "text": "Record: 0-1\n\nLast Pick: Stephon Castle over 18.5 ❌ tough loss by .5\n\nNBA: Magic vs Wizards 11am AEST\n\nPOTD: Paolo Banchero over 8.5 rebounds @1.74 (bet365)\n\nWrite up: With both key players off the court, Paolo Banchero is averaging 9 rebounds per 36 minutes and has gone over in 5 of his last 8 games, averaging 16 rebound chances. Against bottom 10 rebounding teams, he’s gone over in both matchups, pulling down an average of 12 rebounds. Now he faces the Wizards, who allow the most total and offensive rebounds in the league. In games where he sees 14 or more rebound chances, he’s gone over in 10 of 10 opportunities. With his recent form, favorable matchup, and high rebound opportunity, the OVER 8.5 rebounds is very well-supported.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxzjyyo/"
    },
    {
      "created_utc": 1767695632.0,
      "author": "livebreathefootball",
      "text": "**Record:** 30-38 (5 push)\n\n**Net Units:** -0.58 units\n\n**Soccer | Serie A | Lecce vs Roma**\n\n**Pick:** Roma -1 Asian Handicap @ 2.38 [1 unit]\n\n**Reason:** Lecce have one of the worst home records in the league (2 wins, 3 draws, 4 losses). In their 4 home league losses this season, they have scored just 1 goal and conceded 8. In fact, they have scored just 6 goals at home in the league this season, the second worst record.\n\nRoma have been inconsistent of late, having won 2 and lost 4 of their last 6 league games. However, 3 of those losses came against good teams (Napoli, Juventus and Atalanta), and the fourth loss came when they played with 10 men for most of the second half. In their 5 away league wins this season, they have scored 8 goals and conceded just 2. They have conceded just 7 away goals in the league, the second best record.\n\n**Tips:** Always appreciated but not required\n\nhttps://ko-fi.com/livebreathefootball",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxzh5dj/"
    },
    {
      "created_utc": 1767694779.0,
      "author": "UnusualYou6243",
      "text": "POTD Record: 5-3 / Net Units: +4.03 / ROI: 24.2%\n\nPrevious POTD: Miles McBride 10p + Collin Sexton 10p (ALT LINES) @ +117 DraftKings / 1.8u 💰\n\nToday’s POTD: Anthony Black 25pra + Darius Garland 35pra (ALT LINES) @ +123 DraftKings / 2.4u\n\nEvent: NBA / Magic @ Wizards & Cavaliers @ Pacers 7:00 pm EST\n\nTwo good players vs two horrendous defenses. I could end the write up here. \n\nTo start things off Black has hit this line 8/8 times without Wagner & Suggs in the lineup. He is now playing the most amount of minutes tied with Banchero. The Wizards rank 29th in opponent points per game, 28th in rebounds , and 28th in assists this season. Now, they have tightened up just a bit in their L3 games so we will take a bit of insurance on his line. \n\nNow, Garland hasn’t been a world beater this season, but let’s not forget last season when Donovan Mitchell didn’t play. He has hit this line 7/10 times and had multiple 25+ point games, plus a 40 bomb on the Raptors. Max Strus also is not playing, and when they are both out he has exploded for 42 & 45 pra. Jarrett Allen is also listed as questionable with an illness. The Pacers rank 24th in opponent points per game, 30th in rebounds, and 6th in assists. They have been miserable lately. In their L3 they sit at 27th, 22nd, and 21st respectively. \n\nI love both to have great games, and I expect Garland to erupt and remind everybody just how good he is when he is the No1 option.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxzfkv9/"
    },
    {
      "created_utc": 1767694723.0,
      "author": "Kraken_Man_9775",
      "text": "My total win record (can be verified on my stats page):  \n2025: 48.13%, +19.07 units, 7.98% ROI  \n2026: 48.48%, +12.48 units, 28.04% ROI  \n  \n**Pick of the day:**  \nLeague: Serie A  \nKick-Off: 15:00 CET  \nGame: Pisa v Como  \n***Como -0.5 @ 1.833***\n\nReasoning: Como come into this match in better overall form and with more momentum than Pisa, especially in away performances where they’ve shown they can control games. On the other hand, Pisa have struggled for consistency, particularly defensively, and tend to leave spaces late in matches when chasing results. Como’s stronger structure, sharper transitions, and higher confidence level give them the edge to take this by at least one goal.\n\nGood Luck! ✌️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxzfh3y/"
    },
    {
      "created_utc": 1767694393.0,
      "author": "Bookies_nightmare700",
      "text": "POTD Record: 3-1-1\n\nUnits: +4.29\n\n  \nLast POTD: wrexham v preston o2.5 goals 1.87 ✅✅✅\n\n  \nTodays POTD: Livingston v St Mirren BTTS @1.75 2U\n\n  \nWriteup: Combined average BTTS hit rate is 78%, while the league average is significantly lower at 50%.\n\nLivingston average goals scored at home, 1.44\n\nLivingston average goals conceded at home, 2.00\n\nMirren average goals scored away, 1.00\n\nMirren average goals conceded away, 2.11\n\n  \nNeither team has kept a clean sheet (home and away respectivley) the entire season.\n\nLivingston scored in 89% of home games\n\nMirren scored in 67% of away games\n\n  \nBoth teams are sub par, both teams hit BTTS in 8/10 recent home and away games. Love this to finish with a few goals for each side.\n\nIf you have won money with my picks so far, tips are greatly appreciated!\n\n  \nComment if tailing, lets get a streak going, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxzevc1/"
    },
    {
      "created_utc": 1767692999.0,
      "author": "yungguardiola",
      "text": "**POTD Record**: 2-1 (+1.6u)\n\n**Event**: English Premier League - West Ham United vs Nottingham Forest - 20:00 GMT+0\n\n**Pick**: Nottingham Forest to Win @2.35\n\n**Write Up**: Two teams in poor form in 17th and 18th possession but I think there is honestly miles between them. And it mainly comes down to the midfield Gibbs-White, Anderson, Dominguez is leagues above Fernandes, Potts and Magassa. Now, the way Dyche sets Forest up doesn't let them shine as they could do but still. West Ham haven't won in 9 and haven't looked close to doing it either. They are a haphazard team with no cohesion and no quality. I've mentioned on here before how little I believe in this team and I'm going to do it again. They are BAD. And not only are they bad, I think they've largely given up and the press have been leaked a few things about Nuno and his relationship with the players and that is the clearest sign that this moment is nearly complete between the two. I suspect if he's really lost the dressing room, that West Ham will roll over for Forest and Nuno will be sacked.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxzcd05/"
    },
    {
      "created_utc": 1767690994.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 32-19-1\n\nSoccer\n\nLast Pick: Galatasaray win @ 1.59 odds ✅\n\nLast Pick Write Up: Easy win, and we’ve now got a lil streak going.\n\nNow for today..\n\nPick: Roma win @ 1.79 odds\n\nWrite Up: 16th place Lecce (4W5D8L, 12:23) hosts 5th place Roma (11W0D7L, 20:12). In their last 7 H2H since 2022, Roma has won 5 times and there have been 2 draws. Their last meeting in March 2025 resulting in a Roma win away. Roma has decent away form (5W4L) while Lecce at home are nothing special (2W3D4L). I think Roma will secure a win here. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxz8vsc/"
    },
    {
      "created_utc": 1767690560.0,
      "author": "kab1218",
      "text": "PoTD 10-16-1\n\nNet: -18.5\n\nPrevious: AFCON 11am eastern | 2pm eastern | Egypt ML vs Benin + Nigeria ML vs Mozambique\n\nEgypt wins in extra time, but full time reads as a draw. Stupid but moving on. \n\n\n\nToday: Serie A | 9am eastern | Pisa vs Como | U 2.5 goals\n\n1U @ -145\n\nWrite up: Pisa is very defensive at home and have gone 9/9 home games under 2.5. Como like to score but Pisa have kept far better teams to lower scoring games. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxz85c9/"
    },
    {
      "created_utc": 1767684652.0,
      "author": "namanasthana208",
      "text": "**Pick of the Day**\n\n**Sport:** Soccer  \n**League:** Serie A (Italy)  \n**Event:** Sassuolo vs Juventus  \n**Time:** Tomorrow, **2:45 PM EST**\n\n**Pick:** Juventus ML  \n**Odds:** 1.76  \n**Units:** 3u\n\n**Write-up:**  \nGoing with Juventus here. They’ve been much more consistent than Sassuolo this season and usually take care of business in these kinds of matchups. Even when Juve isn’t flashy, they tend to manage games well against lower-table sides.\n\nSassuolo can be dangerous on their day, but they’ve been unreliable defensively and struggle when teams control possession and tempo - which is exactly how Juve likes to play these spots. Juventus also has more depth and experience, which usually shows over 90 minutes.\n\nNot a lock, but at these odds I’m comfortable backing the better team to get the win.\n\nGL if you’re riding 👍  \nNo side picks.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxyxpcg/"
    },
    {
      "created_utc": 1767683886.0,
      "author": "UserMSDGCRS",
      "text": "Record: 2-4\n\nStreak: 2L\n\nNet Units: -6.06u\n\nLast Pick: COL Avalanche -1.5 vs. WPG Jets (+110 DK) 3u to win 3.3u ❌\n\nPOTD Event: Scotland Soccer Rangers vs. Aberdeen (12 PM PST)\n\nPOTD (1/6/26): Rangers ML (-190 DK) 5u to win 2.63u\n\nWrite-Up: Took a break because my picks weren’t doing great.\n\nRangers have completely transformed under new manager Danny Rohl. They are the much better team here, and I wouldn’t hate placing a bet for them to put 2 or 3 past Aberdeen along with the win, but I’m keeping it simple and low risk. Rangers expected goals have been insane lately, and they recently beat Hibernian 1-0 who just beat Aberdeen 2-0.\n\nI really can’t see anything but a Rangers win here so should be fine to place a bigger bet here to get some return.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxywbb2/"
    },
    {
      "created_utc": 1767681470.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 185-140\n\nSeason record: 22-17\n\nLast POTD: __Steph Curry 5+ AST @2.40 1U__ ✅\n\nToday’s POTD: __Paolo Banchero O8.5 Rebs @1.71 (Bet365) 1U__\n\nNBA | Magic v Wizards | 🏀  \n\nPayday! Thanks chef curry who ends on 6 dimes\n\nWizards has been an elite matchup for rebounds for opposing PF’s & centers this season, perfect spot for Banchero here who had 11 rebounds in the earlier meeting this season. Paolo only played 26 minutes in that game due to a 31 point blowout win, with Franz Wagner and Suggs active who are both out for this one.\n\nBooks are expecting a closer contest with a 6.5 spread, and it does make somewhat sense with Suggs/Franz out & the Wizards playing more competitive as of late.\n\nWith both of them out he’s over in 5/8 games this season and is now facing a Wizards side that has allowed 5th most rebounds to PF’s this season. Perfect spot for Paolo to rack up the weak side rebounds with Sarr back for the Wizards who like to stretch the floor.\n\nSaw Giannis with 15, Ighodaro 10, Aldama 10 & 10 & Mamu 11 rebounds.. just to name a few PF’s matched up against the Wizards recently.\n\nCool with 9.5 if bumped for a little less than 1U.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxyro0f/"
    },
    {
      "created_utc": 1767680715.0,
      "author": "JainaForLife",
      "text": "Record: 19-9 ✅✅✅✅❌❌✅❌ ❌ ✅✅✅✅✅❌✅✅✅❌✅❌✅✅✅❌❌✅✅\n\nNet Units: +23.25U  \nSport: Basketball  \nLeague: NCAAB  \nTime: 8:00PM EST\n\n**Yesterday's Pick:** Grambling -6.5 vs. Texas Southern for 2 units. ✅\n\n**Today’s Pick:** UCF +4.5 -115 vs. Oklahoma State for 2 units\n\nThis is a model play, converted my old model into a kenpom-esque model.  Model seems to think the let down spot & travel spot for UCF is not significant enough to make up for the talent discrepancy; UCF looked unphased in their only road game this year, and should be able to keep this a close game.  If UCF can contain Anthony Roy, they should cover this number easily, if not win outright.\n\nROI so far is 10.1%\n\nGL if tailing as always.\n\n[BMAC](https://buymeacoffee.com/theforecastcard)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxyq67f/"
    },
    {
      "created_utc": 1767680545.0,
      "author": "NetLess2696",
      "text": "**Record: 4-0**\n\n**Net Units: 3.48**\n\n**Last Pick:** [Minnesota Wild at LA Kings over 5.5 goals](https://www.reddit.com/r/sportsbook/comments/1q45a0k/comment/nxr4q4c/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) ✅\n\n**Basketball | NBA | Orlando Magic at Washington Wizards 7 PM EST**\n\n**Pick: Paolo Banchero Double Double YES (+100) 1 unit**\n\n**Last Pick Write Up:** Wow we managed to hit this line, it was looking really bleak until we got two quick goals out of the Kings in the 2nd period. The Wild had multiple power plays where they just couldn't convert and we even had a goal called back from the Kings (it was the correct call), Wild managed to close the goal gap 2-3 and emptied their net which allowed for an easy Kings goal to push us across the line. Saved by the bell but ill take it.\n\n**Write up:** Finally onto our first NBA pick, we're gonna take what people might view as a \"risky\" pick. I think Paolo should clear this line, he has looked much better every game he plays coming back from injury and looking like his allstar self. These last few weeks havent been kind to his public perception, however he was coming off of a groin injury which resulted in him not being able to do simple things such as even jumping. Paolo is a phyiscal guy and he knows how to use it when hes healthy. I favor him to get to this line. In the last 5 games hes hit this 3 times, and he has looked much better every game he plays.\n\n**This is a somewhat risky pick so please do your own research/fade.**\n\nBOL and only bet what you can afford to lose",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxyptqn/"
    },
    {
      "created_utc": 1767680342.0,
      "author": "Ghost_eggs",
      "text": "**POTD Record:** 10-7\n\n**Record (oldest -> newest): ✅✅✅**❌**✅✅**❌**✅✅✅✅✅**❌❌❌❌❌\n\n**Net Units:** \\+2.14\n\n**Previous Pick:** Luka Doncic o 32.5 points (-120 on DK); 4 units ❌\n\n**Previous Pick Reaction:** The curse continues. Luka had 30 at the end of 3Q. Surely the NBA's scoring leader can manage 3 points in an entire 4th quarter? Nope. Bricks every shot and free throw, finishes with 30. Ah well, no more Luka bets. \n\n**Today's Event:** NBA 🏀 Orlando Magic @ Washington Wizards (4:00pm PST)\n\n**Today's Pick:** Paolo Banchero 40+ Points/Rebounds/Assists \\[PRA\\] (-130 on DK); 5 units\n\nAfter a little break I'll take another shot here with a reliable strategy in backing forwards/centers against the Wizards. \n\nBanchero has been playing well lately and seems to be fully recovered from injury, recording 40+ PRA in 4 straight games and averaging 44.8 PRA in that stretch. This is a good spot for him to continue this streak against the most favorable matchup in the league. \n\nWAS is in the bottom five in all three categories of points, rebounds, and assists given up to opposing power forwards. Their front court is either too inexperienced (Sarr), too old (Middleton), or too foul-prone (Bagley) to put up meaningful resistance against the more talented big men in the league. This has been a recurring issue for WAS for the last several years. \n\nIn his last five games against the Wizards , Paolo is over this line in 4/5. The one miss was when Wagner was playing, and Paolo's numbers all increase without Wagner. Interestingly, all 4 hits were games in Washington (the one miss last season was in Orlando). \n\nBlowouts are always a consideration in a Wizards game, though the point spread is set to 6.5 so it is expected to be competitive. And in their one previous matchup this season, Paolo covered anyway despite the blowout and playing only 26 minutes. \n\nRough stretch lately but this is one of the more favorable spots I've seen. Tail with caution, on account of the curse.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxypevv/"
    },
    {
      "created_utc": 1767678886.0,
      "author": "Noobdian1",
      "text": "Record:101-86-5\n\n\n\nLast Pick: Leicester vs West Brom over 2.5 u/2.13 (2u) (W)\n\n  \nNeeded that win after 2 losses, I feel it now! \n\n\n\nToday's Pick: Pisa vs Como- BTTS NO 1.73 (3U)\n\n\n\nBOYS, yall  won't believe the facts I have for you today so fasten your seat belts lads\n\n\n\nI'm confused whether to take the under 2.5 here or the BTTS NO, I finally ended up with the BTTS NO and here is my analysis.\n\n\n\nPISA HAVE SCORED ONCE IN 9 HOME GAMES. You read that right ONCE. A SINGLE GOAL. Away they've scored 12 in 9 games which is very weird.\n\n\n\nPISA HAVE A 0% HOME BTTS RECORD while Como only have a 33% away BTTS record.\n\n\n\n4/5 last away games for Como didn't see BTTS \n\n\n\nAnd  as I said before none of Pisa's home games have seen BTTS.\n\n\n\nI'm not calling this bet a lock, cuz no bet is a lock. But with these statistics we gotta bet man, if we lose so be it, BUT my job here is to bring y'all bets with an edge so we keep winning long time and trust me, we will! GL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxymdvm/"
    },
    {
      "created_utc": 1767675739.0,
      "author": "wes2211",
      "text": ">**Record:** 123-104\n>**Net Units:** +24.93 units\n\n>**Curling** | **Players' Championship** | **7:30PM EST**\n\n>**Pick:** Team McEwen +3.5 @ 1.86\n\n>The final slam of the season starts Tuesday and the late draw has Team McEwen against Team Dunstone. Team Dunstone played very poorly in the last slam, going winless at the Canadian Open. This spread is way too large for two top ten teams in the world playing each other, the margin between them is much tighter. McEwen beat Dunstone as recently as the Trials and also beat him last year in this event.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxyf9ce/"
    },
    {
      "created_utc": 1767674631.0,
      "author": "RlFFRAFF",
      "text": "Record: 6-1 (+10.78 Units)\n\nHistory: ❇️❇️❇️❇️💢❇️❇️\n\nPrevious Pick: Matas Buzelis 15+ Points (-152) 1 Unit\n\nRecap: On a heater with player props. I did end up commenting on my original post and letting you guys know I upgraded this to a max play and at a better line of -122, but for integrity sake for my record I’m only going to count it as the 1 Unit win at -152 per my original post. Coby ended up playing, but Buzelis shooting 87.5% adjusted rode us to an easy cash despite the Bulls getting walked on. We’ll take it.\n\nToday’s Pick: San Antonio Spurs -5.5 (-105) 2 Units\n\n1/6/2026 5:00pm PST / NBA / San Antonio Spurs @ Memphis Grizzlies\n\nNarrative: Grizzlies on a 4 game losing skid, while the Spurs took a tough loss themselves in their most recent match up against Portland. A good get back spot for SAS to bounce back into the winning column and sustain their position amongst the top of the Western Conference. The Grizzlies are a fringe play-in team with a lack of identity this year in my opinion. Rookie, Coward, has really been the engine for them and he’ll be out for this game, only the 2nd missed game of his career. Ja Morant of course is a high powered engine himself, but he is questionable to play after coming down with a calf contusion last game, which a strain on the same calf caused him to miss 10 games back in November. I’m going to assume MEM doesn’t push their franchise guy to play here unless he insists. On the other hand, Vassell will be out for the Spurs, and Wembanyama with a questionable designation. Wemby has missed the last 2 games after hyperextending his knee, but took part in 5-on-5 work today according to the Spurs, which gives us hope for him lacing up. Spurs have won 10 of 14 games without Wemby so far this season, by an average of 8.3 points. Wemby or not, -5.5 sounds good to me. GG!\n\nTips: Venmo @kadehutchins",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxycip1/"
    },
    {
      "created_utc": 1767671767.0,
      "author": "Donloppa",
      "text": "Record: 18-11\n\nNet Units: +9.16 units\n\nPick: Tennis\nGrigor Dimitrov ML + Alex De Minaur ML Bet365 -115\n\nChanging things up on this play. I have a handful of guys that I love to watch/put money on. These are two of them. There is always a chance of an upset like FAA today but I think both of these guys win their matches. I will be asleep while they play but hopefully I wake up to a win. \n\n1:30 am MST & 1:00 am MST\n\n5 units to win 4.49 units.\n\nIf you follow one of my picks and blame me for your loss, bad luck will follow you for eternity. \n\nFeel free to fade\n\nOr feel free to tip! [Buy me a beer](https://buymeacoffee.com/donloppa)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxy50oi/"
    },
    {
      "created_utc": 1767666757.0,
      "author": "ThatOneCinaGuy",
      "text": "**Record: 121-91-8**\n\n**Units Won: +10.24 (All Picks are 1U)**\n\n**Form:  ❌✅❌✅❌✅❌✅❌🅿️❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅✅✅✅❌✅✅✅✅❌✅❌✅✅✅✅❌✅🅿️✅✅✅✅✅✅❌❌✅❌❌❌❌✅✅✅✅✅✅✅✅❌✅✅✅✅❌✅✅✅✅❌❌❌✅❌❌✅✅✅❌❌❌✅❌❌❌🅿️❌✅✅❌✅❌❌✅❌✅✅❌❌❌✅✅✅❌🅿️❌❌🅿️❌✅✅❌✅❌❌❌✅✅✅✅✅✅❌❌✅✅❌✅❌❌✅✅❌✅✅🅿️✅❌❌❌❌✅❌✅❌✅✅❌❌✅❌✅❌❌🅿️✅❌✅✅✅✅✅❌❌❌❌✅❌✅🅿️✅❌✅✅❌✅❌❌❌✅✅❌✅✅✅❌✅❌✅✅❌✅❌✅✅❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌❌❌✅✅**\n\n**Last POTD:** Leicester Vs West Brom - **BTTS @ 1.8 (Melbet) - WON**\n\n**Football | Italy - Serie A | 22:00 PM (GMT+8)**\n\n**Pick:** Pisa Vs Como - **Como ML @ 1.76 (Melbet)**\n\n**Write Up:** Pisa and Como come into this match in very different form. Pisa are still struggling to find consistency, while Como arrive full of confidence with a clear game plan. Como head into the game after two straight wins without conceding and are pushing for a top-four spot and European football. Pisa, on the other hand, have managed just one win all season and are already facing a tough battle to stay in the league.\n\nPisa have drawn three of their last five games, including 1–1 away at Genoa and 2–2 at Cagliari. These results show they can stay competitive, but often struggle to see games through. They’ve scored just 13 goals in 18 league matches, which explains why tight games usually don’t go their way. At home, losses to Juventus and Parma without scoring highlight their attacking problems.\n\nPisa have failed to score in three of their last five matches and conceded first in four of them. Even when they’re well organised, goals are hard to come by. Nine draws from 18 games show resilience, but also a lack of cutting edge. Against a more clinical and in-form Como side, that pattern could prove costly.\n\nComo’s recent form has been well balanced. They’ve won three of their last five matches, including clean-sheet victories over Udinese and Sassuolo. Even their losses to Roma and Inter Milan were more about facing top opposition than any drop in performance.\n\nDefensively, Como have been one of the standout teams in the league, conceding just 12 goals in 17 matches. That strength carries over away from home, highlighted by a convincing 3–0 win at Lecce where they stayed in control and took their chances. They’ll also take confidence from past meetings, having beaten Pisa 3–1 in March 2024 and remaining unbeaten in the last five head-to-heads. Overall, Como look more settled and reliable at both ends of the pitch.\n\nPisa struggle to score and often fall behind early, which makes this a very tough game for them. Como are organised, confident, and strong at the back, giving them a clear advantage. Based on the form and stats, Como should be comfortable winners here.\n\n**NOTE: Please only stake what you can afford to lose; know that no picks are 100% guaranteed to hit. Stake Responsibly.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxxqagx/"
    },
    {
      "created_utc": 1767666187.0,
      "author": "Wekken",
      "text": "**POTD Record: 1-3**\n\n**Football Record: 3-4**\n\n**POTD Units: -3.16** \n\n**Total Units: -2.21**\n\n**Last 5:** ❌️✅️❌️❌️\n\n**Sport:** Football\n\n**Match:** Rangers vs Aberdeen (21:00 CET) & Sporting CP vs Vitoria (21:00 CET)\n\n**Pick:** Rangers ML & Sporting CP ML\n\n**Unit stake:** 2U\n\n**Odds:** 1.99\n\n**To win:** 1.98U\n\n**Recap:**\n\nIt was an interesting game to watch. Big chances for Egypt with a banger goal to go up 1-0. Sadly Benin had a reflection that gave them the tie to get ET. POTD isn't going great but it can only go up from here. Right?\n\n**Write Up:**\n\nRangers are coming off of an amazing away win vs Celtic. The last 3 times they've won away at Celtic a win followed in the next fixture\n\nAberdeen are out of form away from home. Winning 4 and losing 6 games with no draws. Scoring 7 goals in those 10 games combined. This includes a 3-1 loss away at Celtic recently who just lost to Rangers\n\nIt doesn't bode well for Aberdeen this game with Rangers being the in form team having won 4 out of L5 games except against surprising league leaders Hearts. They also boast an impressive 5-4-1 home record. They rarely lose at home with the only loss being against Hearts earlier in the season\n\nRangers have also had the upper hand in this fixture in recent years. L10 went 7-2-1 in favor of Rangers\n\nThe 23rd of December Sporting CP beat Vitoria 1-4 away from home. I don't think things have changed enough for Vitoria to get their hopes up\n\nVitoria in the league have played 8 games away from home, only scoring 4 in the process\n\nSporting have scored 27 goals in 8 home games whilst only conceding 3\n\nIt might be a cup game but those numbers are very telling of the way this game will probably go\n\nThe H2H earlier including home+away form is enough for me\n\nBOL everyone!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxxok9x/"
    },
    {
      "created_utc": 1767663706.0,
      "author": "Lyx97",
      "text": "Record: 26-13-4\n\nNet Units: +6.54\n\n*Prev Pick : Virtus Pro ML + Team Zone ML @ 1.77 (1u) -> Win*\n\neSports | M7 World Championship | Team Zone vs Guangzhou Gaming | in \\~6.5hrs\n\nCricket | Vijay Hazare Trophy | Karnataka vs Rajasthan | in \\~2hrs\n\nParlay : Total Maps o3.5 + Devdutt Padikkal to score o41.5 runs @ 2.405 (1u)\n\nWriteup: Sorry for the short notice. Regarding the first leg, both teams are of similar skill level, though the bookies are giving a slight edge to the Mongolian side. The ML feels risky, but i expect the series to atleast go to 4 maps or even 5, since neither team is at a level to blank the other. For the 2nd leg, DDP is in the form of his life,   has crossed this run mark in the past 4/5 matches + he needs to keep this performance to get selected to the national side. Will likely cross this, unless the pitch is utter crap or he has a stinker of a game.\n\nHope we slowly string up wins & BoL\n\nNote : The odds & stakes are as on betwinner, 1xbet, etc\n\nhttps://preview.redd.it/u2c2hbwpvmbg1.png?width=747&format=png&auto=webp&s=4243e9b0be82f833f7b25e3a072509645bbeb882",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxxgwyd/"
    },
    {
      "created_utc": 1767663694.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 16-16 (-0.17u)\nJanuary Record 1-3 (-2.29u)\n\nMonday’s Pick - Minnesota Wild ML -104 (1.04u to win 1u)\n\nTuesday’s Pick - New York Islanders ML +105 (1u to win 1.05u)\n\nSorokin will be back in goal tomorrow for the Islanders after being out with a lower body injury for the last 2 weeks. He’s had a good year so far (.910 save percentage and 2.55 GAA). The Islanders are underdogs at home, despite being 13-8-2 this year and they get their star goaltender back.\n\nThe Devils will be starting Markstrom most likely. He has been good over the last month, but this is still a matchup that favors the Islanders. Markstrom started against the Islanders on 12/23 and only allowed 2 goals on 25 shots. \n\nBut the issue with the Devils is scoring goals. They are near the bottom of the league in goals scored per game and are going up against one of the best goalies in the league, and the Islanders are + money.\n\nGood Luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxxgvl2/"
    },
    {
      "created_utc": 1767659614.0,
      "author": "SoggyDatabase2348",
      "text": "**Record: 31-21 (+6.45U)**\n\n**ROI: +9.77%**\n\nLast POTD: Pending: NCAAB: Nebraska +1.5 vs. Ohio State -122 (1U TO WIN 0.78U)✅\n\n**POTD: NCAAB: Duke +1.5 vs. Louisville -120 (1U TO WIN 0.80U)**\n\nWrite up: *I understand that the POTD tracker did not pick up on my Monday POTD, Nebraska +1.5 - I have reached out to those who run that website to see where the mess up was - In the comments below, I have screenshots of the play etc... Not sure what happened with everything, so hoping to get this sorted out ASAP - Here is the link where the bet can be found posted in the Monday POTD thread:* [https://www.reddit.com/r/sportsbook/comments/1q45a0k/comment/nxpwmo2/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/sportsbook/comments/1q45a0k/comment/nxpwmo2/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) \\- Model has this as the highest confident Edge % and EV % for the day. Will add some personal information in this write-up as well.\n\n• ⁠Model has Duke winning by 4+\n\n• Model projects a high scoring game for Duke - TT going over on the road, will be a close matchup - Model also has Louisville TT over\n\n• EV better betting 100$ = 12-13$ for this play\n\n• Duke UGH - as many of you know, I am a diehard Tarheel, so this bet hurts... Duke has not lost to Louisville in the last 7 matchups, and while yes, Louisville has been historically bad, I like this stat - Duke has one of the best defenses in the country, and while Louisville scores big and a lot at home, I think Duke has what it takes on the defensive end to slow them down - I think Duke is easily the better team overall, and I would like to think most people agree - I believe this line is set at +1.5 solely because of the home court advantage - If Duke was at home - I think they are -6.5 favs - Not many times a year do we get the opportunity to bet on a Top 10 team + the points - Duke is shooting a nice 50% from the field and has terrific defense - Duke is the better play, and I believe there is value in this bet - Give me the Blue Devils +1.5\n\nPOTD History: [https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn](https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn)\n\nBOL!\n\n**POTD: NCAAB: Duke +1.5 vs. Louisville -120 (1U TO WIN 0.80U)**\n\nTips are greatly appreciated, PayPal link in bio. Proceeds will be going towards my student loans and my morning cold brews. Thank you for the support.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxx44eg/"
    },
    {
      "created_utc": 1767659336.0,
      "author": "kumpirbb",
      "text": "1W-0V-0L   +1,02u (all bets are 1 unit)\n\nLast Pick: Sakkari ML ✅\n\nLast 6: ✅\n\n\n\n**Sport**: Tennis 🎾\n\n**League**: Brisbane ATP\n\n**Match**: Dimitrov vs Carreno-Busta\n\n**Pick**: Dimitrov -3,0 games @ 1,93\n\n\n\nOdds here are reflecting lack of Dimitrov match shape as he only played Paris since he retired in that match in Wimbledon where he had Sinner on ropes. In that match in Paris I backed Dimitrov against Mpetshi Perricard and it was an easy win. However, he withdrew from the second round. It's been more than couple months since them and I guess he is match fit. He should especially be match fit in his first match of the tournament/season, and I'm much more inclined to back him in R1 than later.\n\n\n\nCarreno Busta played two Q rounds here, managing to win Bellucci in 3rd set tie breaker and then Cazaux retired in first set. Should be better prepared for conditions here, but quality difference at this age is bigger than ever and surface advantage should be huge. Odds are going down on Dimitrov, but since I expect him to cruise here I like this line. Dimotrov has a SF and a title here last couple of years.\n\nEdit: OK, I’ve noticed my comments are not being published although I can see them as posted. Same thing about the pick I posted yesterday and I guess the reason is this is a new account. Maybe comments get visible later. I’m not really experienced reddit user so not able to post a screenshot here (don’t know if it’s possible), but I posted one in an unpublished comment. I can send dm of my yesterday pick as I see it to anyone interested.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxx380n/"
    },
    {
      "created_utc": 1767659044.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 78 - 80 Profit: -5.63 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅❌❌️✅\n\nAl wahda vs Bani Yas, over 3.5 goals @ 2.31\n\nAl Wahda vs Bani Yas has goals written all over it. Al Wahda are strong at home, play attacking football, and rarely slow the tempo, while Bani Yas struggle defensively and concede plenty of chances. Both sides are capable of scoring, and with open play expected, this matchup suits a high-scoring game. Over 3.5 goals at 2.31 looks excellent value in a game that should be fast, aggressive, and full of chances.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxx2acd/"
    },
    {
      "created_utc": 1767658769.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 7-23-3 *Can you believe it, the curse is lifted at last and once again, it's the AFCON that does it for us! Some luck finally came my way as Egypt scored first, but they were quickly stunned. The BTTS pick that I suggested also came through for us. What a day, but now's the time to build on this, and two hours later I've identified just the right match to get us over the line. Onwards and upwards, there's still a very long way to go if I want to properly recover the good old bankroll*\n\n**Last Five:** ❌❌❌❌✅\n\n**Event:** Serie A, Pisa v Como, 9:00 am EST\n\n**POTD:** Pisa Win or Draw +100, 1 unit\n\n**Write Up:** We're backing the underdog again in the always unpredictable Serie A *(or rather, the only predictable thing about it is that the matches are going to be dry as hell).* On paper, Como’s league position and recent form make them look stronger, but there are some reasons as to why I think Pisa are getting something out of today's game. Hear me out.\n\nFirstly, Pisa are very tricky to play against, constantly suffocating the opposing forwards and **grinding out draws at home,** thanks to their physical and well organised defence. The narrative that Pisa are easily beaten ignores how hard they’ve made games tough at their ground. Despite flirting with relegation, they've proven they can absolutely grind out results as they've just earned an impressive 1-1 draw away at Genoa, and **five of their last six away trips have ended in draws or narrow results.** Their ability to keep matches tight makes them a strong pick against a Como team that isn’t unbeatable. Frankly, I find this team overrated, the media and people genuinely seem to have inflated their value because of the vibes (Fabregas is the manager, they've signed well known semi washed players as well as a wonderkid in Nico Paz, the location is rich and aesthetic etc.) and the \"small club making it in the top flight\" narrative, even though they've spent crazy amounts of money for their size just to languish in upper midtable and be questionable in a match against Pisa, with all due respect to Pisa (I want them to do well as I'm backing them).\n\nYes, Pisa have struggled for goals *(only one scored in nine home league games),* but they’ve often frustrated opponents and forced teams to slow down the tempo. Against a Como side that has been more vulnerable on the road and **missing some key players** (more on that later), Pisa’s organised defence is there to limit chances and raise the likelihood of a draw or narrow win for the hosts. They generally concede fewer high-quality chances than raw tables suggest.\n\nNext up is the H2H that includes several draws and tight contests. Pisa aren't a side that would collapse against Como out of all the teams; past meetings have often been close. In the past **3 years, Como have only registered one league win against Pisa,** while two matches ended in a draw.\n\nWhat also gives Pisa hope ahead of this clash is that Como's key man, **Nico Paz is just returning from injury and therefore won't be at 100%,** some minute management is also likely. The pacey **Assane Diao is also out,** as is Alvaro Morata, while Jayden Addai remains questionable. The Douvikas-Paz partnership has been fairly fruitful for Como this season and with the latter not being at full strength, Pisa's defence shouldn't be tested quite as much.\n\nAll in all, I think Como have just been punching over their weight class this season and they're bound to drop points against a resilient side in Pisa, who will be looking to escape the relegation scrap in front of their diehard fans. The odds of +100 that cover a win and a draw are just too good to ignore here. I also like the BTTS No and the Under 2.5 Goals narrative if you're up to some experimentation, *but I've just focused on match results after the Mozambique debacle*. Going with just a unit once again as I'm saving my bankroll for a huge play on Wednesday. BOL and let's get a streak going ☘️🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxx1en8/"
    },
    {
      "created_utc": 1767658703.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 19-18-5 (Avg Odds +129)\n\n**Previous Pick:** Jordan James 1+ SOT (+125) ❌️\n\n**Today's Event:** English Premier League (Soccer) | West Ham vs Nottingham Forest (12:00 PM PST)\n\n**Pick:** Neco Williams 1+ SOT (+240) 1 unit to win 2.4 units\n\n**Write Up:** Tough loss yesterday as James took 3 shots, two of which were very close to finding the target. He also logged an assist instead of shooting inside the box, which was not ideal for us. Still like the read and would play it again, just unfortunate luck this go around. We move on.\n\nA proper relegation battle here as 18th place West Ham host 17th place Forest. Neither of these teams are good, but both desperately need a win here. Forest are 4 points ahead of West Ham in the League, a win for them brings them 7 points clear of the danger zone. Conversely for West Ham, a win here brings them within 1 point of the safe zone. Huge implications at this point in the season, as both teams are losing to every team above them. \n\nNeco Williams is the 1st choice fullback (plays both left and right) for Forest (and Wales). Yes, I'm playing another defender in a shot prop. This is another combination of current form and data. Neco has been in great form, landing a SOT in 4 of his last 5 matches including vs Man City who allow the 2nd fewest SOTs in the league. He's also had 6 SOTs in his last 7 matches. Coach Dyche has been encouraging him to play further forward and take shots, and I expect that trend to continue here. \n\nWest Ham conversely are the worst defensive team in the league. They have conceded the most SOTs in the EPL this season with 105, 2nd most shots in league with 300 (avg 15 per game), and the most goals with 40. They also look like a team defeated, giving last place Wolves their first win of the season over the weekend 3-0. In that match, they let in 9 SOTs. Interestingly, the entire back 3 for Wolves each got an SOT in that match. Backtracking one more game where West Ham hosted Brighton (who play a similar shape to Forest), West Ham conceded a SOT to each of the two Brighton wingers, including a goal. The point here is that West Ham are weak against fullbacks, that combined with Neco's current form and playing further forward in a wingback-type role put this pick on my radar. \n\n**The odds are high on this for a reason, so mind your units here.** There's always risk in these plays as the odds climb, but we've hit a +245 play before here when Woltemade cashed us with 2 SOTs, so they can hit and I love the value this one brings. \n\nBOL and happy Tuesday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxx170p/"
    },
    {
      "created_utc": 1767657815.0,
      "author": "dreamchasing1",
      "text": "Record: 250-234 Net Units: -25.38 58-61 on 1.5u plays, 42-41 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Israel Liga Leumit] Ironi Modiin vs Hapoel Hadera \nLast pick: BTTS @ 1.83 - 1.5 Units  Loss\n\n\nEvent: Soccer/Football, [English Premier League] West Ham vs Nottingham\n\n\nPick: West Ham over 4.5 corners + Nottingham over 0.5 cards @ 1.95\n\n\nWest ham are a surprisingly great corner generating team, averaging around 6 for them at home, covering in 9/10 home PL games, one miss vs Spurs, where they had a red card around the 50th min. Between them, this line hit last season twice, this season, it hit again in the reverse matchup with 7 for West Ham playing away @ Forest. Forest allow close to 5 on average when playing away as well. Forest have been carded in 9/10 away games this season with west ham at home averaging around 2 cards per game for their opponents. Ref is not the best, but we are not asking for much here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxwyd2k/"
    },
    {
      "created_utc": 1767657513.0,
      "author": "major-couch-potato",
      "text": "Record: 170-138, +8.33 units\n\nLast Pick: Wu to win first set vs Marozsan (+110, 1 unit) ✅\n\nTennis | ATP Hong Kong | 5:00 AM EST (estimated)\n\nToday's Pick: Jan-Lennard Struff vs Botic van de Zandschulp | **Struff to win 2-0 at +175. 1 unit.**\n\nWrite-up: Jan-Lennard Struff comes into this first-round Hong Kong match in a strong position. He already won two qualifying matches against Zsombor Piros and Nishesh Basavareddy, which means that he should be more accustomed to these conditions than Botic. It was hard to find a streakier player than the German in 2025, but his highs, which included US Open wins over Holger Rune and Frances Tiafoe, were certainly high. One pattern, however, is that the faster the courts are, the better Struff's aggressive shot selection and willingness to come to net work out for him. From what I watched of yesterday's action, these courts seemed to be extremely quick, with big hitter Cilic scoring an easy win over the crafty Mannarino and most players performing well on serve. \n\nMeanwhile, I'm a bit less certain that Botic can take advantage of the conditions. Unlike Struff, he ended last year on a downswing, and it's been a while since I've felt as if he was fully committed to a tournament. I don't doubt that Botic has the tools to be performing better, and the new year can always inspire fresh motivation, but I don't think this is the tournament where he turns things around. In general, his heavy forehand is most effective on slower hard courts, and Indian Wells/Miami in March has historically been when he finds his stride. With that in mind, it's hard to ignore Struff's preparation advantage and strong qualifying performance to back someone who ended last year on very uncertain terms. \n\nKeep in mind that I like Struff's ML as well if you can get it at -150 or better. This is my personal play simply because the odds are more favorable, and I think there's a good chance that Struff can take control early and roll from there. There's not really an inherent level gap between these players, so I wouldn't feel confident in Struff coming back or outlasting in a third set if Botic does come in strong.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxwxdz0/"
    },
    {
      "created_utc": 1767656519.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Tuesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1q525zw/pick_of_the_day_1626_tuesday/nxwu802/"
    }
  ]
}