{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/18/25 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/",
  "target_date": "2025-12-18",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-18T15:12:54.714858+00:00",
  "comments": [
    {
      "created_utc": 1766070574.0,
      "author": "oldpascas",
      "text": "**Record: 6-2**\n\n**Last Pick:** Rayo Vallecano vs Real Betis – Real Betis ML @ 2.57 (2 Units) **L**\n\n**Net Units:** \\+6,88\n\n**Soccer | UEFA Conference League | January 9, 2026 | 21:00 CET / 15:00 ET**\n\n**Pick: Crystal Palace vs KuPS Kuopio – BTTS NO @ 1.72 (2 Units)**\n\nLet’s be honest about this matchup: the market has the winner correct, but it’s completely misreading the *shape* of the game. We are looking at a classic mismatch between a disciplined Premier League defense and an attack that simply doesn't travel well. Palace aren't just winning at Selhurst Park; they are effectively strangling games, conceding a negligible 0.67 goals per match, even if that isn't reflected in their goals conceded stats. Contrast that with KuPS, who look toothless on European away days - failing to score in four of their last five trips. When you pit a rigid defensive block against an attack averaging just 0.8 goals per game, the most likely outcome isn't a shootout, it’s a suffocating home win.\n\nThis creates a glaring disconnect in the odds. Bookmakers are pricing \"Both Teams to Score: NO\" at 1.72, implying a 58% chance of a clean sheet. That price feels generic, as if they're pricing a standard cup tie rather than *this* specific tactical mismatch. My model, which heavily weights KuPS's inability to create high-quality chances away from home, puts the true probability closer to 72%. finding a good edge. The Palace -1.5 handicap is a fair aggressive play, but the clean sheet price is where the math is undeniable.\n\n**Please only bet money that you can afford to lose. BOL to all of you!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nup1uks/"
    },
    {
      "created_utc": 1766070081.0,
      "author": "Professional-Love954",
      "text": "**Record:** First pick🍀\n\n**Today's Event:** NHL 🏒 - **Dallas Stars** **@ San Jose Sharks | 9:00 PM CST** \n\n**Pick:**  Stars to win in regulation and SJS to score u1.5 in first   \n  \n**Odds:** 2.12 | +112 | 2 units to win 2.24\n\nWrite up: The Dallas Stars (22-7-5) hold a statistical advantage over the San Jose Sharks (17-14-3) in nearly every aspect of the game. They have 4th ranked offense (3.29 goals/game) and 5th-ranked defense (2.59 goals against/game). The most tactical advantage for Dallas lies in special teams. The Stars possess the NHLs 2nd ranked power play, converting at 31.43%. They have scored 33 goals on 105 opportunities. San Jose penalty kill is very mediocre, ranking 23rd at 78.57%.\n\n**Dallas Road Record:** 11-2-4. Dallas plays better on the road than almost any team in the league. Dallas also dominated the previous meeting 4-1 just two weeks ago.\n\nSan Jose ranks dead last in the league in shot generation (24.3 shots/game), making it difficult for them to sustain pressure against a Dallas, team that excels at suppressing chances. San Jose offense ranks 19th in the league (2.97 goals per game), but this number is heavily skewed by the production of their top line. With Smith out, the burden is almost entirely on Celebrini.\n\nAnd yes, i am aware of the 3W streak SJS is riding, but that streak came from Flames and Penguins. Tonight Dallas ends their streak.  \n\nLets enjoy a lot of hockey tonight and good luck everyone 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nup0cw5/"
    },
    {
      "created_utc": 1766069008.0,
      "author": "wes2211",
      "text": ">**Record:** 123-100\n>**Net Units:** +28.93 units\n\n>**Curling** | **Canadian Open** | **9:00PM EST**\n\n>**Pick:** Team Morrison ML @ 2.0\n\n>Team Morrison are up against Team Yoshimura tonight and the wrong team is favoured here. Team Morrison have been the better team through the first two days and have also been the better team this season. They came into this week 25-15 on the season compared to Team Yoshimura's 24-22. These two last faced each other two years ago in Oakville where Morrison won both matches.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuox5ui/"
    },
    {
      "created_utc": 1766068853.0,
      "author": "MugiwaraLobo",
      "text": "First POTD Post 0-0\n\nEvent: Copa Del Ray - Soccer - 1 and 3 PM games\n\nPick: 2 leg parlay - Athletic Club ML + Real Betis ML +114\n\nWrite Up: 2 top level La Liga teams playing against a 2nd and 3rd league team. Both Athletic and Betis always play with pride and don’t give up. This is a tournament where Betis has won 3 times last being 22’ and Athletic has won 24 times last being 24’. This is a real shot on getting a trophy so I expect them to play their hearts out.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuowpsz/"
    },
    {
      "created_utc": 1766068294.0,
      "author": "Laird87",
      "text": "POTD Record: 209-208, -77.79 Units\n\nCurrent streak: ✅\n\nLast 10: ✅❌❌❌❌❌✅❌❌✅\n\nWow, almost forgot what it felt like to win, but the Cavaliers do indeed suck.  The fact that so many teams make the playoffs in the NBA is despicable and the league should disband because those guys have no business competing for any kind of postseason.  Sorry to the people that faded that one but if the data are correct, you would be advised to stick with it because I'll likely lose again soon.\n\nToronto Maple Leafs ML, +136, 1 Unit\n\nYou know who sucks right now but doesn't suck overall?  The Capitals.  They are in one of those long, shitty streaks where they forgot the point to hockey was scoring goals.  These mires usually last for 3-4 games so I'm hoping this is one I can cash in on.\n\nBOL, tail or fade! Tip Jar: [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuov3eb/"
    },
    {
      "created_utc": 1766066610.0,
      "author": "AdAggressive6388",
      "text": "Record: 9-8\n\nSport | NHL Oilers vs Bruins\n\nPick: Bruins ML (+120)\n\nWrite Up: Great spot for some plus money in the Bruins. The Bruins have been playing great hockey especially at home. The bruins are 5 out of their last 6 games and every win was by multiple goals. They have a top 5 pp amd a decent pk and both swayman and ulmark are playing goaltending. On the other side the Oilers are always dangerous with mcdavid and Draisaitl but they are in the middle of a long east coast road trip and they have had trouble on the road this season. Gotta take the Bruins at home for plus money.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuoq9q2/"
    },
    {
      "created_utc": 1766066031.0,
      "author": "Plastic_Permission81",
      "text": "POTD Record: 3–3–0\n\nNet Units: +2.71 units\n\nROI: 12.3%\n\n5 Unit Plays: 2–1\n\n3 Unit Plays: 1–1\n\n1 Unit Plays: 0–1\n\nStreak: L3\n\nForm (Last 5): ✅ ✅ 💩 💩 💩\n\nLast Pick Reflection: The blues win 1-0. 😵‍💫\n\nEvent: NFL | Los Angeles Rams at Seattle Seahawks | December 18, 2025 | 7:15 PM CT | Lumen Field, Seattle, WA  ￼\n\nPick: Seattle Seahawks −1.5 (−108) | 5 units\n\nWrite Up:\nThis Week 16 NFC West showdown lines up as one of the most consequential games of the season between two 11–3 teams. Seattle is a slight home favorite in the early lines, with the spread around −1.5 for the Seahawks, indicating the market views this as a tight but winnable spot for the home side. Fuck the rest of this write up, the pick is sea hawks on the spread. Five fuckin units.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuoon4r/"
    },
    {
      "created_utc": 1766064684.0,
      "author": "SignalNomads",
      "text": "POTD Record: 0-0 (time to join the fun)\n\n\nMatch: Detroit Pistons @ Dallas Mavericks; Orlando Magic @ Denver Nuggets\n\nPick: Parlay - Cade Cunningham o1.5 3PM (1.57) & Bruce Brown o2.5 R (1.26)\n\nBook: Bovada (you can probably find better prices, I'm limited in book options)\n\nOdds: 1.97 (-103)\n\nRisk: 2.00u\n\n---\n\nBruce Brown is averaging 3.9 R/gm this season, and has only missed this mark 5 times this season. When he's playing 25min+ a game he's only missed the mark once, and over the last five games he is averaging 26ish min per game. Last 5 games rebound count in order of most recent: 9-5-0-3-4.\n\nCade Cunningham is averaging 2.08 3PM this season on 6.39 attempts but over the last five games he's averaging 2.8 3PM on 6.80 attempts. If we toss out the Atlanta blowout 2025.12.12 he's averaging 3.00 3PM on 7.75 attempts in those remaining 4 games. I think we see him sink at least a couple 3s tonight again.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuoky94/"
    },
    {
      "created_utc": 1766063232.0,
      "author": "awkward__fly",
      "text": "3-0-1 (+3 units)\n\n\nLast Pick Last Newcastle vs Fulham - BTTS (via KneeExisting2384) & Double chance - Newcastle to Win or Tie (inspired via TennisFantic101)  1.1 units @ -110✅\n\n\nRecap: extra time score gave Newcastle the win, sorry for doubting you TennisFantic101; I was just playing it safe. \n\n\nToday's POTD's Pick of the day\n\n\nI like Missouri State +0.5 (-110) via Technical-Primary302 for 1.1 units\n\n\nI don't understand how ML is -120, but either Missouri State is the pick. Explosive offense vs weak secondary. Better turn over margin, and that RB is a dual threat.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuoh7ms/"
    },
    {
      "created_utc": 1766059590.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 5-7-2 *The unbeaten streak is over at last, shame, but we had a great run, and today's the start of a new one*\n\n**Event:** Jordan Division 1, Al Sareeh v Jerash SC, starts 25 minutes from now\n\n**POTD:** Jerash SC DNB +150, 3.5 units\n\n**Write Up:** We're staying in the Jordan Division for now because betting on obscure leagues is how you give yourself an edge and I do know what I'm doing when it comes to those, despite yesterday's mishap. Al Sareeh and Jerash are sitting next to each other on the league table, and the latter are on a poor run of form, which has resulted in this overly inflated line that covers a cheeky Jerash win, all the while giving us some security in the case of a draw. Not much time left before the start of the match so the writeup is gonna be nice and brief, but historically, that's when we'd hit the majority of our wins, so consider yourself lucky if you've managed to catch this one in time. BOL and as always, only bet what you can comfortably afford to lose 🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuo92de/"
    },
    {
      "created_utc": 1766057795.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 28-17-1\n\nSoccer\n\nLast Pick: Radnicki 1923 vs Cukaricki - BTTS at 1.68 odds - ✅✅\n\nLast Pick Write Up: Sweat free win that hit in the first half.\n\nNow for today..\n\nPick: MC Alger win at 1.79 odds\n\nWrite Up: Another one, based on trends and form. MB Rouissat is hosting MC Alger in the Algerian Ligue 1. Yeah I know, this is pretty degenerate, but bear with me.\n\nMC Alger is at first place in the table with 8W1D0L (12:4 scored vs conceded) while Rouissat is at 11th spot with 3W4D3L (11:11 scored vs conceded). MC Algers away form is 3W1D0L and Rouissat at home is 2W2D1L.\n\nNow I'm no expert on Algerian football. For all I know, the top MC Alger strikers just got into a car crash. But I think what is more likely is that the bookies are overestimating the away disadvantage because based on the trends, the 1.79 odds look good. I googled \"Algiers to Rouissat\" travel time and it is 1 hour and 25 minutes by flight, which doesn't seem too bad.\n\nBOL and don't tell my wife what I'm posting.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuo5jbw/"
    },
    {
      "created_utc": 1766057434.0,
      "author": "_AnalkingSkywanker",
      "text": "**Pick of the Day**\n\n**POTD Record:** 3-7\n\n**ROI:** -75.40%\n\n**Last Pick:** Manchester City vs Brentford, City win & over 2.5 match goals - ❌💸\n\n**Today's Event:** NHL Columbus Blue Jackets vs Minnesota Wild - Minnesota to WIN - 10€ to win 23.50€\n\n**Write-Up:**\n\nHonestly this feels like a pretty straightforward play. Wild control the puck, create chances, and Kaprizov is just going to create danger all night. Columbus has been sloppy at defending and struggles to sustain pressure against structured teams like Minnesota. Home/away splits also favor the Wild in these tight, low-event matchups. If you want to play SAFE this match, you can also take Minnesota ML with 1.84 odds and that also seems like an overkill for the match.\n\n\n\n**CBJ vs MW - Minnesota to WIN**\n\nBest of luck if tailing! Let's turn the sleigh around finally and start winning from now on! I can feel it!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuo4vas/"
    },
    {
      "created_utc": 1766046789.0,
      "author": "donjavogosca",
      "text": "POTD Record: 23-15, +6.57u, (ROI +13.7%)\n\nPrevious Pick: Partizan to win the first half -17.5 spread & Partizan to win the game -32.5 spread, 2.65, 1.5u ✅️, (last 5: ✅️✅️❌️❌️✅️)\n\nEvent: WABA, Rilski Sportist - Buducnost, 16:00h\n\nPOTD: Buducnost to win the first half -12.5 spread & Buducnost to win the game -23.5 spread, 2.55, 1u\n\nTrying a similar, if not the same play as yesterday. I think Buducnost team is a better one than Partizan, which is not that important for the analysis here, but just as a comparison with yesterday's game. Rilski has only 2 wins, against Orlovi and Zagreb, and that is why the odds are not too inflated.\n\nOtherwise, they lost in the last round to Celje, 90-65, and Celje does not have the same quality level as Partizan, Buducnost, and Montana.\n\nBuducnost plays as a guest here, which is not going to be that much of a disadvantage, all these games are played in smaller halls, probably school centers. They don't have any other games this year, and I hope they want to finish 2025 in style.\n\n1 unit today.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nunnc92/"
    },
    {
      "created_utc": 1766046757.0,
      "author": "IAmLeftHandedOk",
      "text": "Last Pick: Cardiff +2 - PUSH 🪝\n\nEvent: TNF — Rams @ Seahawks | 8:15 PM ET\n\nToday’s POTD: Seattle Seahawks ML (-120) BET365 / 2 Units 🔨\n\nWrite Up:\n\nSeattle lost the first matchup by 2 points on the road while Sam Darnold threw FOUR interceptions. That’s about as bad as a game can go for a QB and they still almost won. That level of turnover luck is not happening again.\n\nNow we get the rematch in Seattle on a short week in primetime. Seattle has been elite defensively all year, ranking top 3 in points allowed, yards per play, and run defense.\n\nOn the Rams side, no Davante Adams is massive. That removes their biggest mismatch. Add in rainy, windy Seattle weather and this turns into a game about defense.\n\nWe are seeing over 60 percent of the public on the Rams. They are the trendy side. The sexy side. Stafford MVP buzz, McVay genius narratives, the Lions win, Stafford being 6-0 vs Seattle. All the headlines are lining up to push you one way.\n\nThe Rams are also dealing with travel issues on a short week flying into one of the toughest environments in the league.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nunnae9/"
    },
    {
      "created_utc": 1766046354.0,
      "author": "Lumpy-Dentist3891",
      "text": "POTD Record: 7-6-0\n\nLast POTD: **Jayson Tyson Over 20.5 PR @ 1.9 5U (Bet365)** ✅\n\nToday's Pick: **Kawhi Leonard - Under 24.5 pts @ 1.86 5U (Bet365)**\n\n**NBA | Clippers v Thunder**\n\nFirst of all, this will probably be a blowout game. OKC is the favourite by 17.5 points at the time of writing. With Harden out, Kawhi will primarily be the main ball shooter and the whole OKC defense will be around him.  \nGL 🍀.\n\nMy bets are being tracked [here](https://www.potd.lol/handicapper/Lumpy-Dentist3891-T7Acgq). Thanks to the tracking team.\n\nhttps://preview.redd.it/c6ejo2559x7g1.png?width=448&format=png&auto=webp&s=aab2c60ecc17a58fecc209e4534200015c301139",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nunmneq/"
    },
    {
      "created_utc": 1766041470.0,
      "author": "Ralphjinasseater",
      "text": "Record : 16-15-2  \nNet units:(-1.81 units)\nLast pick: Jaylen Wells under 14.5 Points (-125) hard rock ❌❌\n\nPick of the day : Naji Marshall under 2.5 Assists\n\nReason • \n\n Marshall draws a BRUTAL matchup versus the Pistons, who allow the LEAST total assists and the 3rd LEAST assists to opposing SFs. \n\nMarshall has struggled against good assist defenses, with him going under this line in 8/10 matchups this season against top 10 assist defenses with him having 3 or fewer assists in all 10/10 of those games and against top 5 assist defenses, he’s under this line in all 5/5 starts.\n\nIn those 5 games against top 5 assist defenses, Naji saw 3 or FEWER potential assists in 4/5 of the games. \n\nNaji faced the Pistons earlier this season and recorded ONLY 3 potential assists and when seeing 5 or fewer potential assists against top 10 assist defenses,Marshall is under this line in 7/8 games this season.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuneldu/"
    },
    {
      "created_utc": 1766038212.0,
      "author": "Technical-Primary302",
      "text": "CFB Xbox Bowl \n\nOverall: 1-0\n✅️ \n\nPrevious: Old Dominion Vs South Florida Under 52.5 ✅️ \n\nPOTD: Missouri St vs Arkansas St\n \nMissouri State -1.5 spread. \n\nMissouri State enters their first-ever bowl game with a chip on their shoulder and a resume of \"quality losses\" that suggests they can compete at this level. While their defense isn't a shutdown unit, it likely won't need to be against an Arkansas State offense that ranks a lowly 112th in offensive EPA per play. \n\nThe real advantage lies in the Bears' aerial assault. Quarterback Jacob Clark has already proven he can dissect high-level competition, posting 330 yards and four touchdowns against UTEP and nearly 300 yards in a win over Liberty. They are perfectly positioned to exploit an Arkansas State secondary that surrenders 8 yards per pass attempt. With five different receivers recording at least 30 catches this year, the Bears have too many weapons for the Red Wolves to track, and that passing volume should be the deciding factor in this matchup. The Bears can also lean on star runner Shomari Lawrence to capitalize on an Arkansas St defense that frequently gives up explosive plays and high rushing success rates",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nun8o32/"
    },
    {
      "created_utc": 1766038028.0,
      "author": "EthicalGambler",
      "text": "**My Record:** 72-63-3 (+1.72u)\n\n**Today’s Pick:** De'Aaron Fox o1.5 Steals (Spurs vs Wizards)\n\n**Odds:** +135\n\n**Units:** 2.0\n\nTip off is 5:10 PST. Staying with this system for Fox to have at least 2 steals in the game. It’s a prop that he has achieved at least every three games this season.  This is his second game in the system. \n\nShould this not hit I will double my wager again and continue to do so until it hits. \n\n**Previous Pick**: De'Aaron Fox o1.5 Steals (Knicks vs Spurs) ❌\n\n\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/EthicalGambler-U6cnjV?utm_source=mdembed&utm_campaign=EthicalGambler) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nun8bg0/"
    },
    {
      "created_utc": 1766037042.0,
      "author": "Savings-Dig8902",
      "text": "POTD RECORD (2-1)\n\nPOTD: Rashid Shaheed o2.5 Rec -140\n\nRashid has slowly been gelling with his new offense in Seattle. Shaheed gets a favorable matchup here with LA ranking 29th in REC versus WR and 26th in REC against. Rasheed’s targets have also increased in the last 3 games averaging 5 targets in his last 3 outings.\n\nEverything I play is 1unit unless said otherwise.\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nun6ego/"
    },
    {
      "created_utc": 1766036596.0,
      "author": "Ghost_eggs",
      "text": "**POTD Record:** 5-1\n\n**✅✅✅**❌**✅✅**\n\n**Net Units:** \\+9.75\n\n**Previous Pick:** Lonzo Ball u 1.5 threes made (-109 on DK); 2 units **✅**\n\n**Previous Pick Reaction:**\n\n![gif](giphy|3o6fIPEq2QsIjoNhtu)\n\nLonzo did not disappoint! Sometimes a pick makes me nervous while I watch the game but this just felt easy. Ball, with his usual fuckery, goes 0/4 from three for an easy W. I feel a little bad because he just looks so mentally defeated, but my bank account thanks him.\n\n**Today's Event:** NBA 🏀 GS Warriors @ Phoenix Suns (6:00pm PST)\n\n**Today's Pick:** Mark Williams to record a double-double (+173 on DK); 2 units\n\nI don't usually go for this type of prop but I love the odds on it given the matchup.\n\nFirst I must acknowledge that Mark has just 7 double-doubles in 22 games played this season and has not recorded one in the past 5 consecutive games.\n\nThis is purely a matchup-based pick. In the previous matchup against GSW this season, he recorded a strong DD  with 16 and 16, as well as a DD in both previous matchups against GSW last season (when he was w CHA) recording 12/13 and 12/12 respectively. Prior to that, due to injuries, Williams had not played against GSW since 2022.\n\nGSW, for their part, give up a lot of rebounds to centers (6th most) and a moderate amount of points to centers (10th most). Some of this is due to Kerr's pathological insistence on \"small-ball\" with Draymond at center. However, Post, a legit 7-footer, is now starting as center, and while Post has been playing better he is still soft af and cannot contain an athletic beast like Mark Williams. I'll note that Post was the starting center when Mark got his 16/16 game earlier this season, so he was actually less effective at containing him than Draymond has been in prior matchups.\n\nMark's rebound line is set at 9.5, so this may be a good alternative if you want something a little less spicy. But he does tend to get a lot of tip layups/dunks on the offensive glass, so I think his rebounding will be tied closely to his scoring and I'm a fan of the extra juice in the DD odds.\n\nSo in short, while Mark Williams is not exactly a DD machine, this is a proven favorable matchup for him where he has covered the line comfortably. At ~~+176~~ \\+173 think it's a solid pick for a small-ish 2-unit bet.\n\n**Edited** to correct typo on odds at end of writeup",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nun5ips/"
    },
    {
      "created_utc": 1766035908.0,
      "author": "20k_rpm",
      "text": "PotD Record **:** **26** W **- 17** L\n\nNet Profit **:** \\+4.61 units\n\nPrevious Pick **:** Spirit -1.5 handicap vs Xtreme - **win**\n\nForm **:** ✅✅✅✅✅❌✅✅✅❌✅❌❌❌✅✅✅❌✅✅✅❌✅❌❌❌✅✅❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌\n\nEvent **:** Counter Strike **|** Draculan **| Friendly Campers** vs **Heroic Academy**\n\nPick **:** **Friendly Campers -1.5 map handicap** **|** 3 units **@ 1.75 odds**\n\nReasoning **:** heroic academy is a new team formed in this month and has played less than 5 matches. Friendly campers are the same team ex-ESC and are significantly higher level and way better experienced players. Campers weak map is dust 2 but if they keep their calm they can take the series 2-0.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nun45ug/"
    },
    {
      "created_utc": 1766035842.0,
      "author": "Teej-bets",
      "text": "POTD Record: 1–0 (+1.30u)\n\nPrevious Pick: ✅ Vanderbilt vs Memphis — Under 160.5 (-115), 1.5u (CASHED)\n\nEvent: NCAAM 🏀\nGame: Louisiana @ Southern Miss — 8:30pm EST\n\nPOTD: Southern Miss -12.5 (-110)\nRisk: 1.5u to win 1.36u\n\n⸻\n\nWrite-Up:\n\nThis is a classic bad team vs competent team spot, and the number still isn’t high enough.\n\nLouisiana comes into this matchup at 1–10 on the season and has struggled mightily on both ends of the floor. Offensively, they’ve been extremely inconsistent and have had real issues scoring efficiently against even average defenses. Defensively, they allow high-percentage looks and don’t have the personnel to slow disciplined half-court teams.\n\nSouthern Miss, on the other hand, is the more complete and reliable team here. They defend well, play with structure, and don’t rely on high-variance shooting to separate. At home, against a Louisiana team that routinely falls behind early, this sets up as a game where Southern Miss controls tempo and gradually builds a margin.\n\nThe low total (131.5) also helps reduce backdoor risk. Louisiana isn’t built to score quickly, which makes it difficult for them to close gaps late if this gets out of hand.\n\nThis is a reliability vs dysfunction matchup.\n\nHoping to make a name for myself in this thread for college basketball! Let me know if you tail and no matter what BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nun410n/"
    },
    {
      "created_utc": 1766033092.0,
      "author": "billycapezzi",
      "text": "\nPOTD RECORD: 178-135\n\nSeason record: 15-12\n\nLast POTD: __DeMar DeRozan o20.5 P @1.80 1U__ ❌\n\nToday’s POTD: __Luka Doncic o8.5 AST @1.83 (Bet365) 1U__\n\nNBA | Lakers v Jazz | 🏀  \n\nOnly 21 minutes played with 7 FGA, Kings absolutely got demolished but still should’ve had more minutes imo. Very bad variance atm\n\nLuka matches up against the Jazz tomorrow who’s ranked 29th in assists allowed this season, perfect for Luka who should have the ball in his hands plenty. \n\n10 & 8 assists against the Jazz earlier this season where he had 14 & 20 potentials, but LeBron and Reaves were both active in the miss, no Reaves for this one. \n\nOver in 2/3 w/o Reaves this season avg 10 APG & 16 potentials, sole miss being last game against the Suns which is tough matchup for assists. No Ayton available either, 2/2 on this line w/o Ayton with him avg 11.5 APG & 16.5 potentials in those two games without him.\n\nThink Luka gets close to a TD here, huge upside with the RA’s without Ayton & Reaves but going for only assists this game as it’s the perfect matchup for it.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numy8bd/"
    },
    {
      "created_utc": 1766032658.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 30-15 (+18U)\n\nLast Pick: Louisville @ Tennessee Under 158.5 (-110) (1U) ✅\n\n[Under write up](https://www.reddit.com/r/sportsbook/s/GbYdBzvQlx)\n\nEvent: Oilers vs Bruins  (NHL) (6pm central)\n\nPOTD: Over 6.5 (+100) (1U) \n\nWrite up:\nBoth teams come into this non conference matchup on absolute fire. Theo bruins have won 4 out of their last 5 and have scored at least 4 goals in every win. Their lone loss was a 6-2 defeat in Minnesota. The Oilers have won 3 out of their last 5 posting at least 4 goals in 1 of those theee and 6 in the other two. In their two losses they allowed 4 goals in both. In their last 10 games they both rank 3rd and 4th in goals for and although Boston has allowed the 11th best goals they are expected to allow the 3rd worst mark in hockey. This is likely because they have allowed the second most shots on goal over their last 10 in the league. Both teams are also top 5 in shooting percentage over their last 10 and both are also top 5 in high danger shots for, while the bruins have allowed the 3rd most high danger shots over that same span. The bruins are 19-15 to the over and the oilers are 19-14 to the over but both have cashed this line in 3 out of their last 5. This will also be the oilers 4th game in 6 nights and they could have some tired legs. I think at even money this over is a great bet. As always, cheers 🍻\n\nI also was gonna make this my POTD too but didn’t, Seahawks for the win for any NFL betters, \n\nSean McVay coming off the flu\n-Sean McVay having a kid this week\n-Davante Adams likely out due to a hamstring injury\n-Puka Nacua going on livestreams talking crap about other teams and the refs\n-Puka Nacua’s brother stealing an NBA player’s SUV\n-Their team plane is having equipment issues and can’t fly to Seattle the day before the game\n\nAll on a short week before the biggest matchup of the nfl season? Crazy. Yeah and I don’t see darnold tossing 4 picks again (and they still only lost by 2) just figured I’d share some free game for the community just cause I love y’all.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numxa8v/"
    },
    {
      "created_utc": 1766031916.0,
      "author": "Hey52511",
      "text": "NBA POTD 14-11\n\nLast Pick: **Josh Giddey over 7.5 Assists,** ends up with 11 Assists plenty of opportunities to have more as well.\n\nToday's Pick: **Kawhi Leonard under 24.5 Points**\n\nThis one is more of a gut-based read than a numbers-driven play, but the setup is worth talking through. Injury-wise, Oklahoma City Thunder are missing both Jaylin Williams and Isaiah Hartenstein, which likely pushes them into smaller lineups. With Chet Holmgren not being a traditional center, that opens up concerns about interior presence and theoretically gives Kawhi Leonard space to operate, especially if he looks to attack downhill.\n\nHowever, the other side of the matchup introduces real resistance. James Harden being out simplifies Oklahoma City’s defensive priorities, allowing Luguentz Dort to lock in on Kawhi as the primary assignment, with help and doubles likely coming behind it. If Leonard is operating mostly at small forward, OKC ranks **top two in the league at defending SFs**, and they have the depth of perimeter defenders to rotate bodies at him all night.\n\nGame script also matters. The spread sitting around **-18.5** raises legitimate blowout risk. Even if Kawhi starts well, reduced fourth-quarter minutes become a concern if the game gets out of hand early.\n\nLooking at recent performances, Leonard’s biggest scoring nights have tended to come against fast-paced or structurally compromised defenses. He’s had success against teams like the Miami Heat and New Orleans Pelicans, and he’s also scored well against slower teams like the Portland Trail Blazers, Phoenix Suns, and Dallas Mavericks. But context matters in each case. Dallas and Phoenix were severely depleted in the frontcourt, and Portland lacked their usual perimeter stopper, which softened the defensive matchups Leonard faced.\n\nTo be clear, Kawhi is a championship-level scorer and absolutely capable of attacking a team missing size. That upside is real. But when you combine elite perimeter defense, likely doubles, a heavy spread, and blowout risk, **24.5 points feels a touch inflated** for this specific environment.\n\nIt’s not a hard fade, but relative to other spots on the board, this one feels more fragile than the number suggests.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numvnn6/"
    },
    {
      "created_utc": 1766031569.0,
      "author": "Longshot2069",
      "text": "POTD Record: 1-1-0 [+1.3 Units]\n\nAll Plays 1 Unit\n\nPrevious Play: Wed Prop Parlay DeBrincat & Raymond 1+ Point Each ( Lost)\n\nPOTD for Thursday Dec 18th\n\nNHL - Chicago @ Montreal 7pm est\n\nPick - Montreal -1.5 Goals on the spread +136\n\n- Chicago and Montreal both lost last game, Chicago vs Toronto, Montreal at home vs Philly.  Looking for Montreal to bounce back, and soundly beat Chicago who are 1-6 in the last 7 Road Games. Caudfield & Suzuki with bounce back with plenty of goals in this game, Montreal takes it. \n\nGood Luck 👍",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numuv7m/"
    },
    {
      "created_utc": 1766031194.0,
      "author": "UserMSDGCRS",
      "text": "Record: 2-2\n\nStreak: 1W\n\nNet Units: -0.06u\n\nLast Pick: McDaniels Over 2.5 Assists (-136 DK) 4u to win 2.94u ✅ \n\nQuick write-up: Easy cash in the first quarter. Ended with 6 assists.\n\nEvent: Soccer Europa Conference League 12:00 PM Shakhtar Donetsk vs. Rijeka\n\nPOTD (12/17/25): Shakhtar Moneyline (-110 DK) 3u to win 2.72u\n\nWrite-Up: Shakhtar is one of the best teams in the tournament (2nd right now) and they are facing a Croatian team who has had mixed results. Shakhtar doesn’t have any other games that I can tell, so they can go full power here, and they have been performing well. When fully fit, they have one of the better squads in the tournament.\n\nThe only way I would see Rijeka getting a result is if they were playing at home, which they are not, so I don’t see Shakhtar doing anything but winning this one, however I’m not confident they will win by any more than 1 which is why I’m taking the ML here.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numu0dm/"
    },
    {
      "created_utc": 1766030772.0,
      "author": "olstewman",
      "text": "PICK OF THE DAY RECORD: 0-0\n\nPICK: College Hoops\nDrake Bulldogs vs Murray State Racers -6.5\n\nLocation: CFSB Center, Murray, Kentucky\n\nStart time: 8:00 PM Eastern Standard Time on ESPN+\n\nMissouri Valley conference play BA-BAY!\n\nRacers come into this home matchup 8-3 holding fourth place in the Mountain Valley Conference. They are coming off of a victory at home against a GOOD Akron team 115-100, and their previous three games were a victory at home against Bellarmine, Morehead State, George Washington.\n\nThe Drizzy Drake Bulldogs are 6-5 this season currently in seventh place in the Mountain Valley Conference. They are coming off of a home loss to North Dakota State. \n\nThe difference: The Racers average 91 PPG on nearly 50% shooting from the field. Drake ain’t got those horses. Averaging 80 PPG on 47% shooting the Bulldogs are gonna get ran outta the gym. Let’s race past em!!\n\nPICK: Murray State Racers -6.5",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numt141/"
    },
    {
      "created_utc": 1766029970.0,
      "author": "DaggyNC",
      "text": "Record: 1-1\n\nNet Units: +1\n\nLast Pick: ✅Hurricanes -1.5 (Carolina Hurricanes @ Nashville Predators) The Canes stuck to the plan and suffocated the Nashville offense and defense with puck possession and relentless shooting attempts. Clean and easy win.\n\nHockey | NHL | Chicago Blackhawks @ Montreal Canadiens | 7 P.M. EST\n\nPick: Montreal Canadiens -1.5 (+140)\n\nWrite Up: With Connor Bedard out until the new year, the blackhawks look to regress heavily on offense. The Canadiens look to ride a solid start to the season and play defensively sound hockey that should perform even better against a Blackhawks roster missing their most essential and dynamic player. Factor in the home-ice advantage for the Canadiens, and the Blackhawks are going to have a tough time matching their game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numr50d/"
    },
    {
      "created_utc": 1766029747.0,
      "author": "kab1218",
      "text": "PoTD 7-7\n\nNet: -2.5\n\nPrevious: Celta de Vigo vs Albacete (Celta moving on) + Villarreal v Racing Santander (Villarreal moving on) 2U @ +116\n\nTeams playing down to opponents in Copa Del Rey, losers. We move on. \n\nToday: Conference League - Strasbourg -1.5 v Breiõblik + Shakhtar ML v Rijeka \n\n2U @ +189\n\nThe top two teams in the conference league are both at home on the Thursday before Christmas. I see them both fighting for first today. Strasbourg is playing one of the weakest teams in the Conference league, so I’m expecting a nice easy 2-0 or better from them. Shakhtar is playing a better team in Rijeka but I don’t Shakhtar drawing or losing here. Should be two easy wins and a nice +money parlay for us today. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numqlt2/"
    },
    {
      "created_utc": 1766029571.0,
      "author": "Background_Law8395",
      "text": "**Record**: 6-1-1 (Wins-Losses-Pushes) (+10.85u)\n\n**Last Pick**: Manchester City Moneyline + Goal Range: 2-4 vs. Brentford 2u ✅\n\nShocking that people in the replies genuinely thought City wouldn't win at home against a bad Brentford team but hey, their loss. Solid win yet again.\n\n**Event**: Italy Super Cup: Napoli vs. AC Milan 11:00am PST\n\n**POTD**: AC Milan Draw no Bet (-120) 2u\n\n**Write up**:\n\nMilan have been superb this season, only losing 1 of their last 15 games in all competitions (being their elimination from the Coppa Italia). Milan are 4-3-1 away from home this season, with the loss also being the Coppa game. With it looking likely that Inter take the Serie A this season, Milan will be looking for a way to get some form of silverware this season. They are the best team away from home in Serie A this season, only conceding 5 goals in their 7 away matches. I do see Milan winning this game but given it is a cup game AND it is away from home, there is a chance Napoli drag it past regular time. Like the DnB for this safety.\n\nOn the other hand we have a Napoli side that have been plagued with injuries this season. Missing two of their starting midfielders (de Bruyne and Anguissa) the crazy start they had to the season has not continued. Although they are **7**\\-3-0 at home across all competitions, their only real challenge was Inter (that game was played with both injured midfielders fit at the time). Napoli have lost their last 2 games and look like a shell of the team that started off the season so incredibly. They average about 1.73 goals per match at home, and although I do feel like Milan advance, Napoli's home form worries me a bit for the regular time result.\n\nAlso, earlier this season AC Milan beat Napoli 2-1 (with Napoli being fully healthy at the time). Milan were up 2-0 before a brutal red card and conceded penalty giving Napoli their 1 goal of the game.\n\n**BOL!**\n\n**EDIT:** just noticed this game is in Saudi lmao. Home and away won't really matter. That actually makes me more confident given how good Napoli are at home. Sorry for the confusion, wrote this in the midst of a study session lol",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numq6mi/"
    },
    {
      "created_utc": 1766026444.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 15-9-2 (Avg Odds +125)\n\n**Previous Pick:** Haaland to Score and City to Win (-110) ✅️🅿️\n\n**Today's Event:** Europa Conference League | Crystal Palace vs KuPS (12:00 PM PST)\n\n**Pick:** Crystal Palace TT Goals Over 2.5  (+100) 1 unit to win 1 unit\n\n**Write Up:** These cup game rosters have been extra unpredictable this year. Haaland never saw the pitch so he voided, and the Man City ML leg won so we technically cashed, just with lower odds. A win is a win though! (I've recorded this as a win om my record and reduced the avg odds accordingly to the leg that won).\n\nToday we've got a European Conference League Match where EPL side Crystal Palace host Finnish side KuPS. I'm going to be honest, I had to look this club up. They are the 1st place Finnish league team from last season. They've had an okay start to Conference League, going 1-3-1. These Scandinavian clubs are tough to place, since their league takes place spring-fall and they're technically off season. Are they rested and play well? Are they rusty? Anyways, I really don't see them being a match for Palace today.\n\nRather than trying to predict lineups again, I'm going with a total goals play as I think regardless of who plays for Palace, they will score a lot of goals here. They're due for a bounce back game after a tough loss to Man City over the weekend and I am expecting them to let off some steam on this Finnish team. Palace are 3-0-2 thus far in Conference League and will need to do better to secure their position in the bext round. In their last 3 matches, they've score 3-1-3 goals, their dud being away against 1st place Strasborg. I like Palace at home here to score 3-4 goals. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numicpl/"
    },
    {
      "created_utc": 1766025421.0,
      "author": "dreamchasing1",
      "text": "Record: 243-223 Net Units: -19.73 55-54 on 1.5u plays, 40-41 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Malaysia Super League] Kuala Lumpur City vs Johor DT\nLast pick: Total corners over 8.5 @ 1.72 won\n\n\nEvent: Soccer/Football, [Conference League] Rayo Vallecano vs Drita\n\n\nPick: Asian total corners over 9.5 @ 1.85 - this pick is the same as just total corners over 9.5 \n\n\nRayo have covered in 5/5 games in the Conference League, best corner generating team in La Liga. Rayo have to win to guarantee their spot in the top 8 in the league phase. Drita might be good in the top 24, but they can try to get something here as a win might put them in the top 8, whereas a draw pretty much secures top 24, so incentive is there for both sides. Drita played some pretty weak sides in the league phase, so they covered in just 2/5 games vs Shkendija (12 total, 10 allowed) and AZ (10 total, 6 allowed). Drita allow a lot of corners when travelling, they allowed 6 to Shelbourne, 7 and 9 to Differdange, 18 to FCSB, 6 to Copenhagen. I'm taking the total for both instead of just Rayo because if Rayo score, Drita can also get some corners as they did vs AZ.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numfn0r/"
    },
    {
      "created_utc": 1766025265.0,
      "author": "Vander_chill",
      "text": "**POTD Record:**  101 – 63 - 10\n\n**Previous:**  EFL Cup - Man City -1 Asian Handicap vs Brentford – WINNING!\n\n**New Event:**  UEFA Conference League – Crystal Palace vs KuPS & Sparta Praha vs Aberdeen\n\n**Pick:**  Crystal Palace -1 (1.35) & Sparta Praha -1 (1.3) Asian Handicap @ 1.73 (Usual 3 units)\n\nFor background informational purposes, this will be the last phase matchday of the UEFA Conference League comprised of 36 teams of which the top 8 will automatically move on to the Round of 16, while teams in 9^(th) through 24^(th) places will go to playoffs to determine which additional 8 teams will make the Round of 16. \n\n**LEG 1:** Crystal Palace -1 vs KuPS \n\nPalace sit 9^(th) in the table.  One spot right outside the top 8 qualification spots and will be at home hosting 25^(th) placed KuPS which also sits 1 spot outside a chance to go to playoffs.  So both teams have something to play for.  However, KuPS have played 5 games so far against teams currently sitting in 16^(th), 18^(th), 19^(th) 27^(th), and 31^(st) places.  They have yet to face a top side in this tournament and Crystal Palace, currently 5^(th) in the top Premier League, will be an opponent far outside their normal rivals. \n\nI see no issues for Palace to provide a spanking to KuPs by multiple goals at home and make it to the top 8.  Should they only win by 1, it’s a push.\n\n**LEG 2:** Sparta Praha -1vs Aberdeen\n\nSimilar story to Leg 1. Sparta are 6^(th) and in a 5 way tie with 10 points to make the top 8.  They are home and hosting 33^(rd) place Aberdeen who are eliminated from the competition.  Sparta have to win as they do not know what the outcomes of the other matches may be.  There are 3 points separating 20 teams at the moment and the simulcast should be crazy with last minute dramatics in all the matches.  Nevertheless, Aberdeen have been terrible thus far and will most likely not have much fight left if any. \n\nAgain, I see no issues for Sparta to secure their place in the top 8 playing at home against an already defeated Aberdeen.  Should they only win by 1, it’s a push as well.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numf8ac/"
    },
    {
      "created_utc": 1766023866.0,
      "author": "Lyx97",
      "text": "Record: 16-7-2\n\nNet Units: +4.00\n\n*Prev Pick : Paris FC W vs Barcelona W o2.5 & Leuven W vs Arsenal W o2.5 @ 1.6 (1u) --> Loss \\[Just depressed with these results. Dont know why Barca just stopped scoring, missed quite a few chances too\\]*\n\nFootball | Conference League | Strasbourg vs Breidablik | in \\~18hrs\n\nBreidablik Asian Handicap +2 @ 1.84 (1u)\n\nWrite Up : Just been in a rut of losses but i guess this is the way betting goes & i gotta keep trying to get back to winning. \n\nLooking at the Conference league today. 2 teams here today, who cant be more opposite in terms of situation in this competition. Strasbourg is on top of the table, and have qualified to the next round while the visitors need a win to atleast have hopes of qualifying to the next round.\n\nStasbourg are in pretty bad form, having won just once in their last four games. That win was against Aberdeen by 1:0. Looking at their matches, they usually dont win by huge margins, especially in Europe.\n\nBreidablik, meanwhile, are only playing Conference League games since their domestic season is over. But, they are doing a decent job at the moment, winning four points in the last two games vs Shamrock Rovers and Samsunspor. Also, they only lost once by more than two goals in five Conference League games this season.\n\nConsidering Strasbourg already secured the 1/8 Finals and may probably look to rest key players to focus on the domestic league (where they are struggling), i think the team from Iceland may surprise us (hopefully in a good way). Going with the +2 Asian Handicap, where a loss of 2 will atleast give a refund\n\n*Note : As you can see the stats, Ive been on a 2 game losing streak, so do be careful before tailing me*\n\nHope we go back to winning ways & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/numbhtj/"
    },
    {
      "created_utc": 1766023102.0,
      "author": "deerhilldr",
      "text": "Record: 1-1 \n\nPrevious: NCAAF South Florida -2.5 (-110) vs Old Dominion @ 2PM PST\n\nPOTD: NFL o42.5 (-110) Seahawks vs Rams @ 5:15PM PST 1U \n\nWrite Up: Both defenses are pretty good but I’m finding it hard believing the Seahawks are gonna hold down Stafford even with no Davante (I like the emergence of their tight end replacing Higbee), and the Seahawks offense also lethal when Darnold playing good, rather than trying to guess a side in what should be a tight game, it will probably end 24-21 hopefully!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/num9gd1/"
    },
    {
      "created_utc": 1766021933.0,
      "author": "ptrckfrnndz",
      "text": "+25.52\n\n15 - 7\n\nFORM: ❌️✅️✅️✅️✅️ (LAST 5)\n\nSports: TENNIS\n\nPICK: yoshimura daiki ML 5 UNITS VS. Sakamoto hiiro ❌️ \n\n❌️ What a choke 4-2 leading the third set and cant finish the game. He really cant composed himself when the game is getting him. Im sorry guys but i think hes still the right pick its just so many unforced error. I hope to bounce back tomorrow ❌️\n\nPick: ✅️ gomez victoria 5units  @1.83 vs. Arifullina arina ✅️\n\n\nTime: about 7hrs from posting\n\nReasoning: again sorry for all who tailed. That mf is a choker.. for todays pick i think shes a better quality player.. slightly higher rank and been playing on some good tours.. should have the better experience\n\nBol\n\n\nMaybe you can tip me if i made you some money. So i can buy food for my self.. thank you\n\nhttps://www.paypal.me/ptrckfrnndz06",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/num6e2n/"
    },
    {
      "created_utc": 1766020307.0,
      "author": "Best_Accountant_5471",
      "text": "Record: 52-37 (+27.9 units)\n\nLast 10 (most recent on right):  ❌❌❌❌✅❌❌❌❌✅\n\nLast Pick: Aras Kargo (W) vs Vakifbank (W) O129.5 points ✅\n\nEvent: Israel Premier League Women 🏐\n\nPick of the Day: Maccabi Nazareth (W) vs Maccabi Hadera (W) O127.5 points 1.2 units to win 1U @ 1.83 (Bet365)\n\nWrite-up: The betting Gods have given me a break with a sweat-free play. Vegas called and told me they were bankrupt after that. On a real note though I’m happy to have given something back to those who have been tailing and supporting amidst the dire form, fingers crossed we kick on now. Vakifbank unsurprisingly won in straights but they were each contested enough to reach 146 points (23-25, 24-26, 23-25). Aras really should’ve won a set but masterfully choked especially in those first two.\n\nI feel like these picks are getting more obscure by the day and you know what, I’m personally absolutely loving it. The Israeli Women Premier league is back for the first time since 2022 🔥. I’ve been eagerly anticipating its return just like we surely all have. We’re eight matches into the season with the home team Nazareth sitting in 9th spot (out of 11) and Hadera in second. The sample size may not be massive but there are still some nice trends that have started to develop. After a start to the season that saw the hosts lose 5 in a row they’ve started to pick up form with two wins and three competitive sets against top of the league Ashdod. They have nevertheless cleared the line in their last 7 matches including the 5/5 they have played at home this season. Hadera meanwhile have been off to a flier with 7 wins of 8 (only losing to Ashdod). They have covered the over in 5/5 away matches played this season and their last 5 total matches. BOL !\n\nhttps://preview.redd.it/7jspecf25v7g1.jpeg?width=1179&format=pjpg&auto=webp&s=365ac7c652da513945ce6f82fd8cdd7106e32d4c",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/num24ql/"
    },
    {
      "created_utc": 1766019705.0,
      "author": "Substantial-Pay-4591",
      "text": "\nPOTD Record 10-7 (+3.02u)\n\nWednesday’s Pick - ❌ Florida Panthers -1.5 +190 (1u to win 1.9u) vs LA Kings\n\nThursday’s Pick - Rams vs Seahawks o 42.5 -105 (1.05u to win 1u)\n\nRashid Shaheed o40 yards was going to be my pick, but I don’t want to copy Joe.\n\nI was expecting a higher total in this game between two 11 win teams and I think we will get it. Even without Davonte, I expect this offense to be moving the ball, especially with their RB duo.\n\nAs far as Seattle goes, they’ll have to pass due to the Rams excellent run defense and their running game hasn’t been that great as of late. That could open up more opportunities for points and the Rams defense can be beat through the air, which you saw last week with Amon Ra and Jameson Williams.\n\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/num0izs/"
    },
    {
      "created_utc": 1766019681.0,
      "author": "Certain-Challenge202",
      "text": "Record: 62-42 (+13.8)\n\nLast Pick: Schindler -1.5 ML vs Burton\n\nToday’s Pick: Joyce -1.5 ML vs Bates\n\nSport: World Championship Darts\n\nReasoning: Joyce’s ranking, scoring average and checkout edge point to him winning this cleanly rather than grinding it out, with Bates development Tour success not translating well to Ally Pally set play. At 8/11, Joyce -1.5 sets is priced below his true chance of a 3–0 or 3–1 win.\n\nOdds: 8/11\n\nUnits: 1-3",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/num0grf/"
    },
    {
      "created_utc": 1766017595.0,
      "author": "ControlRoyal1768",
      "text": "Record: 28-22 (+18.97u)\n\nLast 10:✖️💰💰✖️✖️✖️✖️💰✖️✖️\n\nLast POTD: 🏀 UConn -13.5 (-110) ✖️\n\nToday’s POTD: 🏈 Colby Parkinson ATD (+200).\n\nGame starts at 8:15pm EST. Bet 2U\n\nWriteup: Got this at +205 and that’s close enough to +200. If you’re annoyed at that sue me. Just wait until I endure inevitable brain rot as I post a bet for the Jake Paul match Friday night.\n\nFor Thursday Night Football, we have a potential NFC Championship preview in the Rams vs Seahawks. These are two of the best three teams in the sport and will likely determine the winner of the division. These teams have absolute superstars on both sides of the ball and should be a really exciting game. However, we do have some injuries to mention. The Rams will be without their top endzone threat in Davante Adams, and the Seahawks will be without their starting left tackle in Charles Cross.\n\nOver the last few weeks, the Rams have been running a ton of 13 personnel, meaning 3 tight ends on the field. Starting tight end Tyler Higbee has been out for a while now, so tight ends like Parkinson have been getting a ton more playing time. Since November 9th, even with Davante Adams getting so many of the redzone looks, Parksinson has scored 6 touchdowns in 6 games, with only one of those games not having a score. On top of this, while the Seahawks defense has been one of the best in the league, they are quietly one of the worst defenses against the tight end position.\n\nNow with Davante Adams out, Parkinson should see even more action in this game, and especially in the redzone. He should score in this one.\n\nRemember to only bet what you can afford to lose, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nulurz8/"
    },
    {
      "created_utc": 1766014460.0,
      "author": "Pefkov",
      "text": "**Record**: 17-10\n\n**Net Units**: +5.88\n\n**Last Pick**: Tua Tagovailoa u29.5 Pass Attempts (-126 on DK) 1u to win 0.80u ✅\n\n**Todays Event** 🏈 NFL Thursday Night Football Rams @ Seahawks 7:15 PM CST 🏈\n\n**Todays pick:** Jason Myers 8+ Kicking Points (-111 on DK) 1u to win 0.9u\n\nI know i've done this exact pick in the past this season but it's looking too good to pass up.  A divisional game where two teams with good defenses have to win to get control of the bloodbath that is the NFC West and to keep 1 seed hopes alive. \n\n**Writeup:** Lets start with the obvious. Jason Myers has been one of if not the best kicking performers this season. He's averaging 10.9 kicking points a game and is on route to break the regular season points scoring record, being just 33 points behind LaDainian Tomlinson's 186 point record. Now the forecast is looking like it will be a very windy game, but they're looking to be Headwinds/Tailwinds, the former of which would help Myers. He will be utilized this game.\n\nAs mentioned earlier, this is a divisional game between two teams with solid defenses, and pretty stellar offenses. While being good, the Seahawks haven't always been consistent in the red zone, not helped by the fact that Rams have one of the best red zone defenses in the league. Their third down conversion rate is sitting pretty low at just under 38%\n\n The lines for this game are very slim with the Seahawks being favored at -1.5. From what it's looking like, Field Goals will be the difference. No doubt these teams will take every opportunity they can to get points. Two field goals and two extra points (which Seahawks are expected to score twice as their game line is at 2.5 touchdowns). \n\nBless a good Thursday night game and Best of Luck to everyone tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nullnf9/"
    },
    {
      "created_utc": 1766014115.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 22-15 (+4.67U)**\n\nROI: +9.53%\n\nLast POTD: Pending: NBA: Cavaliers vs. Bulls Under 242.5 -105 (1U to win 0.95U)✅\n\n**POTD: NFL 2 Parlay: Darnold 200+ Passing Yards + Kyren Williams 40+ Rushing Yards -103 (1U to win 0.97U)**\n\nWrite up: Model has this as the highest confident Edge % and EV % for the day. Man, I can't wait for this game, this will be a fun one. \n\n• ⁠Model has Darnold projection at 255-260+ yards passing \n\n• ⁠There is an edge of 7-9% and the EV is looking like 8$ based on a 100$ bettor\n\n• Season average is way above this line, and Darnold hits this line a lot - also to note, Seahawks do not have a run game \n\n• Kyren's projection on the model is 75+ yards (which I was surprised by considering how well the Seahawks D is - but last time they played he went for 90+\n\n• Edge is set at about a 4-6% differential with the EV% being right at 5$ for a 100$ bettor  \n\nPOTD History: [https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn](https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn)\n\nBOL!\n\n**POTD: NFL 2 Parlay: Darnold 200+ Passing Yards + Kyren Williams 40+ Rushing Yards -103 (1U to win 0.97U)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith))",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nulkn0p/"
    },
    {
      "created_utc": 1766013737.0,
      "author": "GrimesSeraph",
      "text": "**POTD Record**: 1 - 0\n\n**Prev Pick** : KNVB Beker |  Ajax @ Excelsior Maassluis Over 3.5 Goals 💵 ( We off to frickin great start, literally sweat free bet with another 9 goals banger )\n\n**Net Profit** : +2.50units\n\n**Event**: Europe Conference League | KuPS @ Crystal Palace | 15.00 PM EST\n\n**POTD**: Crystal Palace -1.5 @1.80 1.88u to win 1.50u\n\n( 1u = 10$ For me personally )\n\n**Write Up why its my POTD** :\n\nShort , sweet and simple . CP -1.5 is solid. Palace’s chance creation at home is clear big xG edge, higher tempo, and far more depth even with rotation. KuPS struggle badly away in Europe (low possession, low shots, under 1.0 xG avg) and don’t have the attacking tools to chase if they concede. Once Palace go ahead, this opens up clear path to cover -1.5 .",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nuljiy1/"
    },
    {
      "created_utc": 1766013614.0,
      "author": "tennisfanatic101",
      "text": "💎POTD: AC Milan to qualify for next round\nOdds: -122 on FanDuel\nWager: 1.5 Units\n\nRecord: 6-5\nNet Units: + 0.5✅\n\n⚽️AC Milan vs Napoli, 12/18/2525 Thur, 2 pm Eastern Time\n\nExplanation: AC Milan can qualify on Thursday vs Napoli because they have been more reliable and they have a cleaner path to controlling the match—even on neutral ground in the Supercoppa Italiana semi-final. Napoli is coming off a disappointing 1–0 loss at Udinese, while Milan is coming off a 2–2 draw vs Sassuolo, but the bigger picture is that Milan’s league profile is extremely steady: through 15 Serie A matches they’re 9W–5D–1L with 24 scored, 13 conceded (32 points), and their underlying shot/chance balance is strong (+6.4 on shots and +0.43 on shot-differential per match per FBref), which usually translates into fewer “bad” game states.  \n\nThe expected-goals data supports that Milan is creating at an elite level: Milan is at 24.76 xG on the season (2nd in Serie A) with 16.85 xGA, while Napoli sits below them in xG creation, implying Milan’s attack is producing more repeatable chances and isn’t as dependent on finishing spikes. \n\nAlso, the teams have already played this season with Milan winning 2–1, and Milan has tended to be more solid in big games, so if this turns into a tight, tactical game where one sequence decides it, Milan’s proven ability to manage their opponents gives them a very real chance to qualify.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nulj5ua/"
    },
    {
      "created_utc": 1766013089.0,
      "author": "Fair-Asparagus-9264",
      "text": "Record 4-3 (+1.29U)\n\nPrevious Pick: Lions at Rams NFL 16:25pm (EST) **Stafford + Goff over 525 yards passing (-137) 5U** ✅\n\nEasy cash as Stafford and Goff combine for over 700+ yards through the air. For anyone who, as suggested, laddered (550/575/600/625/650/675/700)– you did very very well.\n\n**POTD:** NFL Rams at Seahawks TNF 8:15pm (EST) **Puka + JSN over 175 receiving (-156) 3U**\n\nPuka and JSN are by far and away the two most dominant WR in the NFL. They lead the league in receiving yards/game (JSN: 110, Puka: 105). The next closest is London at 90. That combines for 215+ yards/game receiving.\n\nThey lead all WR in Big Plays – receptions of 20+ (JSN: 25, Puka:23). Again the next highest is J. Williams at 19. They own the lion’s share of targets and air yards on the rams and seahawks and Devante Adams is in all likelihood gonna miss this one. SEA allow the third fewest RB rush yards (73/game) while RAMS allow 6^(th) fewest (77/game). Last time these two teams met this line hit: Puka went 7/75 (despite Stafford throwing for only 130 yards) while JSN went 9/105 (despite 4 interceptions from Darnold). Last two weeks, Puka hit (181) and nearly hit (167 yards) this line all by himself. Latest forecast (though its Seattle so things can change) shows rain ending by 3pm.  \n\nIts gonna be a fierce game with huge playoff implications. Rams squeaked by 21-19 largely due to Darnold INT’s. Expecting a close game again. My bet is whoever is trailing in late third/early fourth will tilt toward pass, pushing either JSN or Puka over 100-110+ if they’re not already there. Then, all the other guy needs for this to hit is 65-75 yards. In Draftkings, you can find this bet under Receiving --> Combined Receiving Yards --> **Puka Nacua + Jaxon Smith-Njigba 175+ Yards**. If you want better odds you can go O 189.5 (-112) or ladder to 200+ (+114)\n\nBOL if Tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nulhl27/"
    },
    {
      "created_utc": 1766013010.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 14-8-1 \n\nStreak: 3W ✅\n\nNet units: +4.14u All bets are 1 unit.\n\nLast POTD 12/14/25: D'andre Swift rushing attempts O12.5 (-102 FanDuel) ✅\n\nToday's POTD 12/18/25: Kyren Williams rushing yards O55.5 (-115 Bet365)\n\nEvent: TNF Rams @ Seahawks 6:15MST\n\nWrite Up: With the most recent weather forecast moving into Seattle, my pick for this game was a tough decision. With a chance of rain and heavy winds up to 20MPH, my pick has shifted from JSN receiving yards to Kyren Williams rushing for the over.\n\nDuring their week 11 matchup against Seattle, Williams rushed 12 times for 91 yards and proved to be a very effective piece in the offense in that game. Over their last 3 games, Los Angeles has ranked 3rd in the league for rushing yards with 186.7, while ranking 4th on the season in away games with 142.7.\n\nKyren Williams has hit this rushing number in 11/14 games this season and has 70+ yards in 3 straight. Even though his snap share with Blake Corum has almost been cut to an even 50/50, Williams has continued to perform well during his opportunities and his numbers have not reflected on the snap count.\n\nAlthough Seattle has shown to be one of the best run defending teams in the league, I trust Sean McVay will effectively scheme his offense to be successful on the ground when passing will be somewhat limited with Davante Adams banged up and the weather being what it is.\n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nulhc79/"
    },
    {
      "created_utc": 1766012806.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 65-31-1 (+74.53u)\n\n__Previous Pick:__ [✅ Jacksonville St ML (+120), 2u](https://www.reddit.com/r/sportsbook/s/lr2SYJx1bV)\n\n__Event:__ NFL: Rams @ Seahawks 8:15pm EST\n\n__POTD:__ Rashid Shaheed o34.5 receiving yards (-110), 3.3u to win 3u\n\n__Write Up:__ I can confidently say one has watched Rashid Shaheed since he joined the NFL more than I have. I’m the Commish of a 14 year fantasy football league that gives points for kick/punt return yards (shoutout FDS). As one of the best returners in the league, I have heavily followed & studied Rashid Shaheed since he came into the league in 2022. He’s been on my roster every year & has been one of the most valuable players in the league. Despite him starting my fantasy lineup in the playoffs this week, this is isn’t a biased play. I actually preferred Colby Parkinson ATTD (+230) as my POTD but POTD rules won’t allow plays over +200 odds. A tear is brought to my eye that after these years, 97 POTD writeups, Shaheed finally has made his way here, the beautiful butterfly can finally spread his wings for the world to see. Great player, great recent results, great game script. Shaheed was traded from the Saints to the Seahawks last month, & boy do they have a big game vs the Rams this week.\n\nThe (11-3) Seattle Seahawks host the (11-3) LA Rams at Lumen Field on Thursday Night Football in a huge intra-divisional matchup. These 2 teams are currently tied & battling for the top spot in the NFC West. Both teams enter this game 8-1 straight up & 7-2 against the spread over their last 9 games. This is their 2 matchup in a little over a month, with the Rams winning at home 21-19. But that final score doesn’t show how dominant Seattle was driving the ball downfield. The Seahawks out-gained the Rams by 165 yards & had a 26-12 first down differential. The issue was Seahawks QB Sam Darnold threw 4 interceptions & their was horrible playcalling the red zone as Seattle only scored a TD on 1 trip of their 4 chances. That was the Seahawks only loss in their last 9 games. __As for the Rams they have been rocking & rolling since then, with 40+ points & 500+ yards in back to back games. They have been on fire at the end of the regular season the past few years with an elite December record going 17-3 ATS, including 2-0 ATS this year. The Rams are also dominating on the road, having gone 11-2 ATS in their last 13 games & 17-5 ATS overall since December 1, 2024.__ The reason I’m adding this to a Seattle WR’s prop write-up, is opposing offenses have to sling it in order to keep up with the Rams high powered offense. But Seattle has been great lately as well. __Seattle has won its last 4 home games by an average margin of 14.5 points per game.__ We have 2 QB’s that are playing at a high level & sling it. This has resulted in both of their leading WR’s pending the league in receiving yards, with Seahawks Jaxon Smith-Njigba & Rams Puka Nacua ranking 1st & 2nd in the NFL this season. The last December or later matchup between the NFL’s top 2 WR’s was Week 16, 2021, when Rams Cooper Kupp (now on Seahawks) defeated Justin Jefferson’s Vikings. JSN has been an elite weapon for Darnold, but the addition of Shaheed has open up even more opportunities for him.\n\nSeahawks QB Sam Darnold has been airing it out all season long. He is also averaging 245.2 pass yards per game (6th) & he’s top 5 in passer rating (102). He’s got one of the biggest set of balls in the NFL & will sling it deep (as evident of his 4 INT’s vs Rams last month). __Darnold has average 8.8 yards per pass attempt (most in the NFL), ranks 1st in Pass Success % (among QB’s with 300+ snaps), he ranks 1st in both passes 50+ yards (7) & 40+ yards (11), 4th in passes 20+ yards (50), & 5th in passes 30+ yards (19).__\nMost of those yards came to JSN, with the Seahawks lacking a #2 WR. That changed on November 4th when the Seahawks traded a 4th & 5th draft pick for vertical weapon Rashid Shaheed. Shaheed was quiet after the trade. He didn’t crack a 10% target share in any of his first 4 games. While the Seahawks were easing him into a new offense & playbook, Shaheed having limited action was also because the Seahawks didn’t need to throw the ball. In his first 4 games, the Seahawks saw 3 easy wins against the Cardinals, Titans, & Vikings. Darnold completed just 10, 16, & 14 passes in those games. But then he emerged two weeks ago & Shaheed has finally established himself in this offense. __He’s seen 5+ targets & 65+ receiving yards in back to back weeks. His numbers from Week 10-13 compared to 14-15: Target Share: 8.3% -> 18.2%. Targets Per Route: 0.12 -> 0.23. Yards Per Game: 9.3 -> 70.5. Yards Per Route: 0.47 -> 2.71. Last week he had a 23.8% first read rate (10 total targets).__ He’s become an important part of this offense. Darnold went to him multiple times on the game-winning drive, giving Shaheed a 21% target share. Shaheed had the 3rd highest PFF offensive rating (74.8). His snap count rose to 68% & he ran a route on 86.5% of the Seahawks' dropbacks. Now he faces a Rams defense that has been a funnel to outside receivers. __The Rams allow 4th most receiving yards per game on the 9th highest yards per route run to outside WR’s. Shaheed has ran 74% of his routes out wide.__ The Rams CB duo of Emmanuel Forbes & Cobie Durant ranks outside the top 50 in yards per coverage snap. They just gave up 20 rec 298 yards Jamo Williams & Amon-Ra St. Brown. The week before they gave up 16 rec 200 yards on 16 rec to Michael Wilson & Trey McBride. The Rams also have been dominant vs the run this season. __The Rams are allowing 3.8 YPC to RB’s (3rd). They’ve allowed a league low 3 rushes for 20+ yards this season, a league low rushing 5 TD’s, & the longest rush they have allowed this season is just 29 yards, the only team under 30 yards.__  They just held the best RB tandem in the league on the Lions to 70 yards on 20 carries, forcing Goff to air it out for 338 yards. They game before that they held the Seahawks RB’s to 29 yards on 10 carries. Seahawks will have to move the ball through the air as well.\n\nThe forecast is showing rain & some wind which normally would be scary for a receiving prop. This will be Sam Darnold's 4th rain game as a QB in Seattle. In his 3 rain games at Lumen he has went 50-77 (65% completion), 606 yards, 6 TD, 0 INT, 115.7 Passer Rating. 2 of those were blowouts where they ran the ball the entire 2nd halves. Still expect him to sling it this game. __The Seahawks are first in the NFL in differential of 20+ yard plays vs their opponents (+21). They are Seahawks average 28.9 points per game (5th). While the Rams are allowing opposing offenses to run 64.5 plays per game, (3rd most) & passing on 56.8% of plays (7th most). Opponents pass 61.38% vs Seahawks (3rd most).__ All signs point to a ton of opportunities for Shaheed. He’s a big play machine & has hit this line in 30/42 games in his career where he was healthy & had a catch.\n\nRashid Shaheats this game.\n\n__Rashid Shaheed o34.5 receiving yards__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial)  [PayPal](https://paypal.me/joeinglesofficial)  [Bitcoin](https://pastebin.com/raw/GEXAsA2S)  [Venmo](http://Venmo.com/mackenzie-botz-1)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nulgpyd/"
    },
    {
      "created_utc": 1766012787.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ppb27g/pick_of_the_day_121825_thursday/nulgnr0/"
    }
  ]
}