{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/13/25 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/",
  "target_date": "2025-11-13",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-13T18:48:35.044309+00:00",
  "comments": [
    {
      "created_utc": 1763059489.0,
      "author": "EzPickzz",
      "text": "Record: 13-6\n\nUnit record: +19u\n\nLast pick: 2 leg parlay, Brock Bowers 50 receiving yards & Bo Nix 175 passing yards ❌\n\nPOTD 💎: Jets vs Patriots (UNDER 44.5) \n\nDraftkings: -135 (+2u)\n\nTime: 8:15pm @New England",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nood50m/"
    },
    {
      "created_utc": 1763059411.0,
      "author": "Eddy1877",
      "text": "Record: 3-2\n\n\nEvent: Oilers vs. Blue Jackets, 7:30 pm\n\n\nPick: Adam Fantilli over 0.5 points\n\n\nOdds: -130 Fanatics\n\n\nReasoning: Fantilli has eleven points in sixteen games this season, including two against the Oilers on 11/10. In that game he was facing their best goalie, Stuart Skinner, but tonight the Oilers are starting Calvin Pickard, the second worst goalie in the league. Through six starts he's allowing 4.0 goals/game and has a save percentage of .836.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/noocv01/"
    },
    {
      "created_utc": 1763057860.0,
      "author": "Super_DAC",
      "text": "Record: 8-4\n\nNet Units: 2\n\nPrevious Pick: Toledo ML -200 (1 Unit) ✅\nEz\n\nEvent: NFL Football New England Patriots (8-2) vs New York Jets (2-7) 11/13 8:15PM EST\n\nPick: Stefon Diggs anytime TD scorer +134 (1 Unit)\n\nWrite up: The hype is real in Foxboro, and the best Patriots team since the Brady years looks to keep things rolling against the visiting Jets. New England has scored at least 20 points in 8 of their 10 games this season, and the passing game is a big reason why.\n\nDrake Maye and Diggs had a quiet start to the season, however things have taken a turn recently. The 2nd year phenom and veteran WR have connected for a TD in each of the past 3 games. \n\nCoach Aaron Glenn has managed to lead New York to repeat victories coming into this divisional showdown. The rookie head coach has the Jets playing hard, and they scored over 20 points in each of their recent wins. On a short week, points could be plentiful, and both teams might have to air the ball out.\n\nI expect Diggs to find pay dirt at least once to extend his TD streak to 4 straight games. BOL to those tailing, let’s do some winning!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/noo7dbm/"
    },
    {
      "created_utc": 1763056685.0,
      "author": "the-last-of-the-hens",
      "text": "**POTD Record:** 2-4\n\n**Last Pick:** Jacob Markstrom Over 21.5 Saves ❌\n\n**Net Units:** \\-3.07\n\n**Event:** Buffalo Sabres vs Colorado Avalanche \n\n**Pick:** Over 6.5 Total Goals (-110) for 2U\n\n**Write Up:** Tough loss with Markstrom finishing with 20 saves on the night after the Blackhawks had 11 shot attempts miss the net or be blocked in the 3rd and overtime. \n\nWould typically be going with the Leafs over when they're in action but with Matthews potentially out, I'll ride that outside of my POTD alone and give a pick I'm more confident in. \n\n  \nBuffalo is playing their second night in a row, following a 5-2 loss to Utah last night and will unfortunately be stacked against the best team in the NHL. Buffalo is 7-2-1 in their last 10 and averaging 6.4 total goals in those games whereas Colorado is 5-5 but averaging 7.3 total goals in their games. When the Avs score big, they score huge. Nathan Mackinnon is an absolute sicko who refuses to take a night off (22p L10) and will carry the pace offensively against a subpar Buffalo D-core and goalie. \n\nValeri Nichushkin is out which may slow down their power play but he's never been the driver of the unit and I expect one of Nelson/Lehkonon/Landeskog to slot in and fill the role of net front presence without missing a beat. \n\n3+3=7.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/noo3bav/"
    },
    {
      "created_utc": 1763052169.0,
      "author": "Vander_chill",
      "text": "**POTD Record:**  93 – 59 - 9\n\n**Previous:**  Man City Draw-no-bet & Gil Vicente Draw-no-bet – WIN/DRAW\n\n**Recap:**  Masterclass by City and Pep to get his 1,000^(th) win as a head coach.  Gil Vicente however, was surprised by bottom of table AVS whom played their asses off and accomplished a much needed draw.  Not a loss for us, but not a pure win either.\n\n**New Event:**  Republic of Ireland vs Portugal & England vs Serbia\n\n**Pick:**  Republic of Ireland Over 1.5 cards & Serbia Over 1.5 cards @ 2.00 (Usual 3 units)\n\nEuropean World Cup Qualifiers and penultimate group matchday has wrrived.  Meaning, after today just one more match to determine who gets into the 2026 World Cup either directly or via playoffs.  A lot of drama to unfold for those teams that are playing for survival and these two matches are no exception. \n\nExperience has taught me to avoid betting favorites that have the table standing advantage as oftentimes they may let their guard down and disappoint even with a draw over a desperate sides with little to lose.  While the better team often prevails nonetheless, these matches more often translate into physical games as the accumulation of cards leading to suspensions no longer matter because there is no tomorrow.  There is historical data and context to prove this.\n\n**Leg 1**:  Republic of Ireland (ROI) vs Portugal – ROI Over 1.5 cards\n\nROI host group leaders Portugal in a match with huge implications for them.  Portugal have 10 points followed by Hungary with 5, Ireland with 4, and Armenia with 3.  Irish media are calling this their biggest match in 5 years and a miracle draw would be huge for them against a Portuguese side that will play their final match in 10 days at home versus an Armenia with little hopes. \n\nMeanwhile Hungary will most likely beat Armenia today and jump ahead solidifying 2^(nd) place in the table.  Therefore Ireland have no choice but to play for all the marbles today and when it’s due or die for the Irish, fouls and cards abound.\n\nThe anticipation and hype surrounding this match is unreal for a variety of reasons including this match marks Portuguese superstar’s Cristiano Ronaldo’s last ever official match in Ireland.\n\n* When ROI visited Portugal last month and lost 1-0, the Irish received 5 cards.\n* ROI have received at least 2 cards in their last 8 official (non-friendly) matches.\n* The last time ROI did not receive at least 1.5 cards in an official match was last October where they won 2-1 against Finland.\n* ROI have not lost at home in their last 5 matches.\n\n**Leg 2**:  England vs Serbia – Serbia over 1.5 cards\n\nIn this group there are 5 teams, but only 3 matter as Latvia and Andorra have been eliminated.  England sit atop of the table with 18 points and a stellar perfect record of 6 wins and 18 goals with 0 received, Albania are 2^(nd) with 11 points and Serbia sits 3^(rd) with 10.  This fight is between Serbia and Albania for the 2nd ticket to the World Cup. \n\nAlbania are in a must win situation and are heavy favorites to beat last placed Andorra today.  Their final match will be against England at Wembley and the Albanian’s have surely budgeted for a loss there.\n\n* Serbia’s final match will be at home against Latvia, and that will provide an almost certain win as well. \n* Serbia’s match today against England at Wembley is a monumental challenge where Serbia need to walk away with at least a draw to remain in the race for 2^(nd) place.\n* Serbia’s propensity for cards seems to be in direct correlation with the quality of their rivals.  Against easier teams less cards and more of them against harder sides. \n* In the home leg against England, Serbia was embarrassed losing 5-0 and received 2 cards in the process.\n\nIf we look at the last 10 matches by Serbia against top European sides in non-friendly competitive matches, the results tell the story:  4,4,7,2,2,2,2,3,4,5,4  \n(These 10 matches go back to 2018 and were against Spain, England, Switzerland, Denmark and Germany)\n\nAs we have seen time and again whether in Tennis, Basketball, MMA or any sport, the Serbs will not go down without a fight and if they can’t win, fight they will.  1.5 cards is almost a given for them.\n\n[Standings](https://imgur.com/a/I3Mb9nT)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nonnz2m/"
    },
    {
      "created_utc": 1763052016.0,
      "author": "kab1218",
      "text": "POTD 0-1\n\nRecap: Victor Snow ATTD\nIf they didn’t give up multiple fumbles and interceptions, him scoring was possible. \n\nToday: Colton Joseph ( Troy vs Old Dominion University) OVER 235.5 passing yards @ -115\n\nHe already has 2231 passing yards on the year. At home he is averaging 288.25 yards in the air. He has hit this mark 3 of the last five games, missing one by 5 yards, with a majority of those being away games. Troy is allowing 195 yards in the air. I see him getting over 235 easy. \n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nonng7o/"
    },
    {
      "created_utc": 1763050689.0,
      "author": "Initial_Increase_242",
      "text": "Record: 21-17-1 (+9.21u) Bets are to win 1u unless otherwise stated\n\nLast Pick: 🏀 Paolo Banchero o14.5 FGA (-130) \\[Injury Void\\]\n\nToday's Pick: 🏈 NYJ/NE - Both Teams to Make 33+ Yard FG (+100) 2u \\[DK\\]\n\nBack to the bread and butter. Kickers, divisional and primetime. Folk has hit this number in all 9 games this year - he has been one of the most reliable kickers. Even in blowouts or losses he has hit the number. Hoping we can get one early before the Pats extend the lead. The Jets defense have allowed the 7th most points in the NFL and have have also allowed the most fantasy points per game for kickers at 10.8. We know that the Patriots will get down the field and score so I think that Borregales will get an opportunity or two to knock one in.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nonixxj/"
    },
    {
      "created_utc": 1763049766.0,
      "author": "SoggyDatabase2348",
      "text": "***POTD RECORD: 3-0 (+11.74$)***\n\n*Last POTD: Nikola Jokic 50+ PRA (5$ TO WIN $4.55)*✅\n\n***POTD: Breece Hall O54.5 Rushing Yards (5$ TO WIN $4.50)***\n\n*Write up: Yes, I know, I can't believe I am betting on a Jets player either, but this line is a little too low.* \n\n* *Hall has averaged 80.2 rushing yards in his career against the patriots. He is also averaging 20.3 rushing attempts in his career when facing the Patriots*\n* *Last game against the Browns, he ran for 83 yards, and we have seen what the Browns defense has done against RB's all year*\n* *It seems like Breece is starting to find his stride a little bit, regardless of how bad his team/QB has been*\n* *I do not see the Jets winning by any means, but I do not think this game is going to be a blowout like many may think. Primetime games this year have been weird, and I will roll the dice with Hall tonight* \n* *Hall ranks top 10 in YPG in 2025*\n* *The past two games, Hall's longest rush has been 30+* \n* *Sean Tucker of TB, just recorded 53 yards last week against this defense and averaged 5.9 YPC*\n\n*Something feels off with this line for Breece Hall, the Jet's rely on the run game, if the script allows it, he will get 20 some carries tonight.* \n\n***Breece Hall O54.5 Rushing Yards***\n\n*Tips are appreciated; proceeds will be going towards my student loans.*\n\n  \nVenmo: u/claysmiith\n\nPayPal: u/claysmiith",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nonfswh/"
    },
    {
      "created_utc": 1763044238.0,
      "author": "Elevate203",
      "text": "POTD Record: 0-0\n\nPrevious Pick: None\n\nEvent: Atlanta Hawks @ Utah Jazz 9:10 PM EST\n\nPOTD: Svi Mykhailuk o1.5 3pts (-180)\n\nReasoning: So the odds aren’t great but I really like the value here. Svi has hit more than 2 3’s in 4 out of the last 5 games(one of those he went off for 6-11 from distance). Atlanta is allowing opponents to shoot a league-worst percentage on open shots and giving up a high frequency of open 3-point attempts. They also played last night so closing out on those kick out open 3’s I anticipate them being a step or two slower than on fresh legs. I’m a die hard Celtics fan, and watched a lot of Svi, and that is 75% of his game. He can catch fire and he’s been starting games for Utah so I really like the odds on this pick. I’m laddering up to 4/5 makes. Good luck everyone!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nomxpti/"
    },
    {
      "created_utc": 1763043860.0,
      "author": "HarrySonofHairy",
      "text": "POTD Record: 1-0\nTOTAL ROI: +91.5%\nLAST PICK:\nReed Sheppard O 11.5 Points (-109 DraftKings) — ✅ WIN\nProfit: +1.83u\n\nEasy cash last night in his best game of the season, let's see if we can go 2-0.\n---\nTODAYS PICK\nNBA \nPACERS @ SUNS\n\nRoyce O’Neale Over 10.5 Points (-135 Bet365)\n1 Unit\n\nHes hit this line in all but 2 games this year, averaging 14 ppg at home. He plays 30 mins a game, seems to always get open shots, and hits them at a fairly consistent rate.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nomwliu/"
    },
    {
      "created_utc": 1763042013.0,
      "author": "Ascending_Saiyan",
      "text": "POTD Record: 2-5-1\n\nNet units: -3.2u. All bets are 1 unit.\n\nLast POTD 11/9/25: Oronde Gadsden II 052.5 receiving yards (-110 Bet365) ❌\n\nBid of a bad beat on this one. Gadsden was getting his targets but he made a couple of drops and to make it worse, he left halfway through the 3rd qtr with a knee injury.\n\nToday's POTD 11/13/25: TreVeyon Henderson 60+ rushing yards & Breece Hall 2+ receptions (-119 FanDuel)\n\nEvent: TNF Jets @ Patriots 6:15MST\n\nWrite up: Keeping this one simple. Jets have a porous run defense and just recently traded their best run stuffer Quinnen Williams. TreVeyon will be getting a full workload with Stevenson out this game. He just ran all over the Buccos last week and I expect the Patriots to feed him all game long.\n\nBreece Hall will be seeing an increased role in the passing game today with Wilson out today  and the Patriots are ranked 32nd in the league with receptions allowed to running backs. At this point the Jets have Breece as their biggest offensive weapon and they will be looking to him for whatever offensive production he'll be able to give them.\n\nTail of fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nomr82o/"
    },
    {
      "created_utc": 1763041771.0,
      "author": "CadettoPicks",
      "text": "**Record:** 0–2  \n**Net Units:** \\-2.00u\n\n**Sport | League | Event Time / Time Zone:**  \nSoccer | International (WC Qualifiers) | Nov 14, 6:45 AM AEDT\n\n**Pick:** England To Win to Nil @ 1.93 (1u)\n\n**Last Pick:** Ohio ML @ 1.91 (1u) ❌\n\nPoor start continues, Ohio were up at the half but just couldn't get anything rolling, way below their average yards for the year in what was just a pretty gross game all round. This is where we turn things around and get the first W.\n\n**Write Up:**  \nOnto the soccer grind here and rolling with England to get the job done against Serbia without conceding. England have looked strong in qualifying - averaging over 3 goals a game recently and showing solid defensive shape where they are yet to concede a goal across their 6 games. They’re deep all over the pitch, and when the front three click, they’re tough for anyone to contain.\n\nSerbia haven't looked dangerous, they’ve been shaky at the back, giving up goals in nearly every match against top-tier opposition. Their defensive line tends to sit deep, which works against smaller teams but usually struggles once England start moving the ball quickly through midfield.\n\nEngland’s attack has just been cleaner and more balanced - with Kane in great form, and Jude and Foden back in the squad, their midfield control should make it hard for Serbia to build much rhythm, especially with no Mitrovic in the squad.\n\nIt’s also worth noting Serbia haven’t been great in high-pressure qualifiers, especially away from home. England’s experience and overall quality edge should show over 90 minutes.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nomqiuq/"
    },
    {
      "created_utc": 1763041467.0,
      "author": "Flashy_Calendar3995",
      "text": "3-3 \n\n\n➕️ 0 units\n\n\nNHL\n\n\nSan Jose Sharks vs Calgary Flames\n\n\n6pm PST\n\n\n\n\nDetailed Analysis: Why the San Jose Sharks (+130) Are the Model's Top Pick to Upset the Calgary Flames\n\n\n\n\nThe model flags the San Jose Sharks as the premier value play tonight at Scotiabank Saddledome (9:00 PM ET, November 13, 2025), with a projected 58% win probability against the Calgary Flames. This contrasts Vegas' implied ~43.5% for SJS (+130 across books, with Flames at -154), yielding a solid 14.5% edge after vig.5af573 Calgary's early-season collapse—rooted in league-worst defense—creates a mismatch the odds undervalue.\n\n\n1. Pythagorean Efficiency: Sharks' Balance Exploits Flames' Defensive Collapse (Core Metric)\n\nSharks' Steady Form: San Jose (7-8-2, 16 points) has tallied 55 GF (3.2/GP, top-10) against 57 GA (3.4/GP, bottom-half), yielding a Pythagorean win % of 48.2% (55² / (55² + 57²) ≈ 0.482). Their +2 differential in recent games (3-2-1 last 6) shows resilience, especially on the road (4-4-1, averaging 3.1 GF/GP). SJS grinds with depth scoring, ranking mid-pack in close games (9/17 by 1-2 goals).\n\n\nFlames' Bottom-Feeder Stats: Calgary (5-10-3, 13 points) limps with 38 GF (2.1/GP, dead last) and 58 GA (3.2/GP, bottom-5), for a dismal 30.0% Pyth (38² / (38² + 58²) ≈ 0.300)—worst in the West and overdue for regression (actual win % 0.361 trails Pyth by 6%). They've allowed 4+ GA in 8/18, including a 5-1 shellacking to Vancouver recently. Model weights GA heavily (60% in early data), projecting +0.8 expected goals for SJS.\n\n\n2. Goaltending Edge: SJS Stability vs. CGY \n\n\nSharks' Reliability: Yaroslav Askarov (3.29 GAA, .899 SV%) and Alexander Nedeljkovic (2.96 GAA, .906 SV%) combine for a .902 team SV% (mid-tier), but they've limited damage in 4/17 games (<3 GA).df87fda3aee1 Road SV% holds at .889, and SJS is 5-1 when allowing <4 goals—key against CGY's anemic offense.\n\nFlames' Liability: Dustin Wolf (3.24 GAA, .893 SV%) and Devin Cooley (1.75 GAA, .935 SV%) anchor a mid-tier team SV% (.902), conceding 3.8 GA/GP in losses (12/18 games).f7cf016debe7 Wolf's been pulled once;1beda6 model adjusts +2.5% to SJS prob for this gap, emphasizing regulation stability (under hits 13/18 for CGY).\n\n3. Offensive Matchup and Special Teams: SJS Depth Over CGY Stagnation\nScoring Dynamics: SJS counters with Tyler Toffoli (11G) and Mikael Granlund (15 pts), averaging 3.0 GF/GP away despite a 2-3 skid. Their 22.4% PP (12th) exploits CGY's 76.5% PK (bottom-10). Calgary's stars (Huberdeau 8 pts) fizzle at 2.0 GF/GP home, with a league-low 14.3% PP—SJS's 82.1% PK (top-15) neutralizes it.\n\nModel Projection: xG proxies forecast a 3.2-2.4 SJS edge, favoring even-strength (SJS 51% faceoffs). \n\n\nCGY's over-dependence on low-event games (under in 11/18) crumbles vs. SJS's shot volume (30.5 SOG/GP).\n\n4. Odds Value and Home Adjustment: Strong Edge on SJS\n\n\nProb Discrepancy: Model base home win = 0.300 / (0.300 + 0.482) ≈ 38.4%, +4% boost to 42.4%—below implied ~60.6% (-154). This flips to 57.6% SJS true prob vs. ~43.5% implied (+130), for +14.5% EV ($100 bet yields ~$21 expected profit long-term).\n\n\nHistorical Fit: SJS is 4-6 as +130+ dogs but covers in mismatches like this; model backtests 57% on similar road underdogs vs. bottom defenses. Head-to-head: SJS 3-2 last 5 in CGY.\n\n5. Intangibles: Injuries, Schedule, and Momentum\nInjury Lean: CGY misses key D (Andersson questionable, knee); SJS healthier, with Celebrini back boosting lines.\n\nFatigue/Momentum: Both on mini-skids (CGY 1-4 last 5, SJS 2-3), but SJS faces softer travel post-home stand. Model +1% to road teams with GF edge post-OT lessons.\nTweak from Yesterday: Upped SV% weight slightly for underdogs—reinforces SJS here.\nIn essence, the model's data core (70% Pyth/SV%, 30% odds) exposes Calgary's frailty, forecasting a 3-2 SJS win (58% clip, under 5.5 -110).\n\n\n Fade the Flames' home hype—+130 is prime value in this lopsided efficiency gap. Monitor lines for drifts; bet responsibly, and let's eat !!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nompmyn/"
    },
    {
      "created_utc": 1763041319.0,
      "author": "john_doe_774",
      "text": "Date: 11/13\nRecord: 7-4 \nNet units: +1.78u\n\nPrevious pick: Nick Folk over 1.5 fgs ✅\nToday’s pick: Patriots -7 & Drake Maye under 0.5 interceptions -110\nEvent: Patriots vs Jets\n\nNick Folk always comes through for him. I almost picked him again for todays game and still think he’s a good bet at very plus money.\n\nLooked at Treveyon rush yds, breece hall recs, drake maye pass yds, and under on breece hall rush yds. A lot of value around.\n\nStill taking all of those, but for my POTD, I will be taking Drake Maye who has a modestly high interception rate to not get another one against a Jets team with a gutted defence and no interceptions this season. Also expect Pats to cover their spread of -13, but playing it down to -7 for a safer parlay.\n\nBOL to us.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nomp7sr/"
    },
    {
      "created_utc": 1763040660.0,
      "author": "wes2211",
      "text": ">**Record:** 112-92\n>**Net Units:** +26.65 units\n\n>**Curling** | **U.S.A. Olympic Trials** | **1:00PM EST**\n\n>**Pick:** Team Dropkin ML @ 2.2\n\n>Team Dropkin take on Team Casper in their second matchup of the double round robin. Team Dropkin are the better team but after Team Casper won the first match, the line has shifted way over, favouring Team Casper now. This is a gross overreaction to a small sample size and Team Dropkin should still be the favourite here. Dropkin won the other two matchups this season 7-2 and 7-3 and leads the career head-to-head 9-7.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nomncj3/"
    },
    {
      "created_utc": 1763039463.0,
      "author": "EthicalGambler",
      "text": "#*I am tracking cappers who post in these threads and will continue to do so for the foreseeable future. [Here is the new document which started tracking 09/01/25](https://www.potd.lol/today?utm_source=redditpost).*\n\n**My Record:** 68-59-3 (-1.50u)\n\n**Today’s Pick:** Svi Mykhailiuk o1.5 three points made (Hawks vs Jazz)\n\n**Odds:** -130\n\n**Units:** 1.3u\n\nTip off is 6:10pm PST. The Jazz are sitting in tenth place in, the hugely competitive, Western Conference and they go up tonight against a red hot Hawks team. A team that is missing their superstar Trae Young for at least a couple of more weeks. \n\nAtlanta is on game 3 of a 4 game road trip and are on a 3 game winning streak. Last night they blew out Sacramento but had to travel to Utah over night. This team from Salt Lake might be what slows the Hawks upward trend. \n\nIn the last 4 games Svi Mykhailiuk has averaged 3.5 three buckets. Most of those games have been against contending teams (Timberwolves, Pistons). The Jazz are 4-7 this season and have not won against a team that was sitting above .500. Mykhailiuk will be the starting shooting guard and I expect he will attempt 8-10 threes. Watch for him with his step back to the line, perimeter shooting. \n\n**Previous Pick**: Jonas Valanciunas o7.5 points (Nuggets vs Clippers) ✅\n\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/EthicalGambler-U6cnjV?utm_source=mdembed&utm_campaign=EthicalGambler) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nomk2yx/"
    },
    {
      "created_utc": 1763038229.0,
      "author": "Worried_Session_2681",
      "text": "Record: 0-0\nNet Units: +0.00\nROI: —\n\nSport | League | Event Time / Time Zone:\nNCAAB | Men’s College Basketball | 8:00 PM ET\n\nPick: Alabama -3.5 (-110) | 1.5 Units\n\nWrite Up:\nThis pick is based on my matchup model that weighs pace, offensive efficiency, and matchup differentials. Alabama ranks among the top 10 nationally in adjusted tempo and 3-point attempts per possession, while Purdue’s interior-heavy style slows their overall efficiency when facing high-pace teams.\n\nThe model projects Alabama with a 63% win probability and a median margin of victory of 6.2 points, creating value on the -3.5 spread. Purdue’s defensive struggles against Oakland (allowing 77 points and 44% shooting) and potential absence of Trey Kaufmann-Renn further tilt the matchup toward Alabama.\n\nExpect Alabama’s guard play and tempo to dictate the pace and pull away late.\n\nPlay: Alabama -3.5 (-110) | Risk 1.5 U to win 1.36 U",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nomgwwy/"
    },
    {
      "created_utc": 1763036383.0,
      "author": "AK24AK24",
      "text": "***Record:*** 5-1\n\n***Last Pick:*** (Win) Grayson Allen -0.5 pts vs PJ Washington (-115 Draftkings)\n\nA win is a win but I'm guessing PJ got hurt because I saw he only played the first quarter?\n\n***Today's Pick:*** Brandon Ingram -4.5 pts vs Darius Garland (Draftkings -114)\n\n***Reason:*** Garland is coming back from injury and with it being a toe/foot injury they're being cautious on his minutes. In 3 games this year he's averaging 13PPG. On the other hand, Ingram comes into this game averaging 21.4PPG and has been consistent all year. He leads Toronto in minutes per game and by now you know I like betting guys who play a lot. With Garland playing 20-25 mins, I see him only scoring 12-15pts tonight and Ingram has hit 20+ pts in 8 of his last 10 games. GL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nomcliv/"
    },
    {
      "created_utc": 1763036082.0,
      "author": "Flashy-Today2189",
      "text": "What’s up everyone!  I’ve been lurking for a bit and decided to finally throw my hat in the ring with some picks!  Hopefully we can all make some money together!\n\nMy first pick of the day is Kyle Williams under 1.5 receptions on DK for +107\n\nWhenever you got an under this low it can be a little sweaty, but this line just doesn’t make sense to me, and is a bit of an overreaction to his big catch versus TB last week.  The fact is, his numbers don’t warrant this being a plus money over\n\nOn the season (10 games) he has 3 receptions.   Prior to last week, his last reception was week 3 versus Pittsburgh.  In fact, he’s only had 2 games total where he’s had 2 targets.  He has had 7 games with no receptions, and 4 games with no targets at all\n\nNow you mix in a cold night game, on a short week versus a team the Patriots should beat by double digits, I’m assuming we will see a more run heavy game plan.\n\nI’m also on the under for his longest reception (16.5) and total yard (19.5) but feel best about the total",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nombxid/"
    },
    {
      "created_utc": 1763035813.0,
      "author": "Vet100",
      "text": "Record: 15-7 \n\nNet Units: +6.46 \n\nROI: 29.4%\n\nPick: NBA Hawks v Jazz \n\nIsiah Collier O1.5 3s attempted @ $1.52, B365 \n\nWrite-Up: Miserable slate, miserable odds. \n\nHe has hit this 2/3 this year, more importantly once he got into the swing of things last year with increased minutes he hit this in 38/47 (80.9% hit rate) games to end the year. He averaged 17.12 minutes in his first 24 games, then his next 47 he averaged 30.38 minutes. In those games he averaged 2.8 3 point attempts a game. \n\nEvery young guard is being encouraged to develop & shoot more from 3. The Jazz sit 8th in 3s attempted per game, the Hawks are 12th (mid range) for opposition 3 point attempts, averaging 38. I am expecting the Jazz to attempt repeat their dose of 152, with at least 40 attempts. \n\nCollier should get 25-30 minutes - which is enough last year and this year combined to go at 81.6% hit rate, so getting $1.52 odds is still high value, even if it’s lower than I usually target (I think my lowest before this was $1.68, and my average over my first 20 bets was ~$2). \n\nThe negative is just the odds - at 1U we are playing it safe as I’m really trying to stretch my units long term, but I understand other people may not see the appeal. A blow-out either way could happen, Daniels guarding Collier could mean he passes more, and he might just get enough looks he doesn’t need to shoot 3s. But I love 3 attempted bets on young players due to the league trend + he has a solid hit rate over his last 50 games now which makes me think I won’t get this line for much longer, if at all.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nombcgi/"
    },
    {
      "created_utc": 1763034593.0,
      "author": "dlilfan",
      "text": "Record: 6-2\n\nNet Units: +5.9 U\n\nPrevious Euroleague / Paris Basketball vs Panathinaikos / Panathinaikos ML + Kendrick Nunn o20.5 points at 2.75 odds 1 U ❌\n\nPOTD: Euroleague / Real Madrid vs Panathinaikos / Real Madrid ML + U 177,5 pts at 2.00 odds 2 U\n\nTough loss last time as Panathinaikos won and Nunn scored 20. I was confident with Panathinaikos winning last game against Pari, but this isnt the case against Madrid. Their lack of bigs cant be compensated by their guard play and they will lose this game. My personal bet is Real Madrid -4.5 & U 177,5 points  for 2.5 odds but play it safe and bet the ML or drop your units to 1.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nom8r95/"
    },
    {
      "created_utc": 1763032266.0,
      "author": "ThatCherry7173",
      "text": "Record: 6-1\n\nNet Units: +4.71\n\nOdds: -135\n\nSport: Basketball & Hockey | NBA & NHL | 6:00PM & 8:00PM Central\n\nPick: Cleveland Cavaliers ML + Colorado Avalanche ML\n\nBet 1 unit to win .74 units\n\nWhy: Cleveland’s been rolling lately, winning five of their last six, and they’re back at home where they’ve been nearly unbeatable against Toronto. They should also get a couple of key players back after resting them last night, which only boosts their depth and energy. Toronto’s been solid, but they’ve struggled on the road against this division, and that trend probably continues here. As for Colorado, they’re one of the hottest teams in the league right now — nearly perfect at home and playing with a ton of confidence. Buffalo’s on the second night of a back-to-back, short on bodies, and hasn’t been able to win on the road yet. The mindset tonight is to take two strong home teams in great form against tired, inconsistent opponents.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nom4924/"
    },
    {
      "created_utc": 1763024346.0,
      "author": "Hsil18",
      "text": "POTD RECORD: 24-7\n\nLAST PICK: England -23.5 v Fiji @ 2.05 ❌\n\nTODAYS FIXTURES: France v Ukraine + England v Serbia ⚽️ \n\nTODAYS PICKS: France -1.5 and England ML @ 2.04 (3U)\n\n\nWrite up:\n\n\nBack to basics today. International break is always a great chance to make money as most of the time things go to script… expect that to happen here.\n\nFrance play Ukraine in Paris infront of an expectant home crowd. There is so much quality in that side and it’s looking like a probable front 4 of Barcola, olise, Mbappe and mateta. More than enough quality to put away this average Ukrainian side.\n\n\nSimilar story with England. Just too much quality for this good but non comparable Serbian side. Kane, saka , inform rashford and Bellingham likely to make up the top 4. Couple that with the fact that England beat Serbia 5-0 away from home only  2 months ago, only points to one conclusion.\n\nI think this double is crazy priced considering everything and great value indeed.\n\nBOL to those who tail and see you on the other side 🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nolr2xc/"
    },
    {
      "created_utc": 1763020928.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 3-0, +3.12u\n\n**Previous Pick:** Euroleague: Milano - Lyon, Milano to win by 6 or more & under 168.5 points in the game, 1.82, 1u ✅️\n\n**Event:** NBA: Utah - Atlanta\n\n**POTD:** over 232.5 points in the game, 1.83, 1u\n\nI chose this today for the following reasons:\n\n\\- Utahs last game against the Pacers and 280 points in the 152-128 win\n\n\\- They had a day to rest, hopefully worked on improving threes, their % are terrible\n\n\\- Atlanta didn't have a day to rest, an easy win last night against the Kings, now they are hoping for another easy one. I am hoping they save up on defense, shoot more and earlier, and hopefully speed up the game with more easy points",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nolljz3/"
    },
    {
      "created_utc": 1763020136.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 22-9-1\n\nSoccer\n\nLast Pick: Bolton Wanderers ML + Doncaster Rovers-Bradford City BTTS Yes at 1.97 ✅\n\nLast Pick Write Up: We were playing with fire, but man defeated fire and bent it to his will. \n\nNow for today..\n\nPick: Portugal ML + France ML at 1.68 odds\n\nWrite Up: We have the international games for the next few days. Portugal is playing Ireland. Ireland, the Emerald Isle, is a great and a proud nation that has endured multiple hardships, yet always stands tall. Come Out Ye Black and Tans, Tiocfaidh ár lá ☘️\n\nI love Ireland. Unfortunately, I think they will have to endure another hardship, because Portugal is better at soccer, and I think the UEFA Nations League winners will win here too.\n\nNow for France against Ukraine - not much to say, really. France are better and last time France played against Ukraine they won 2-0, they will (probably) win again.\n\nEXTRA: this is NOT my POTD and is just for fun, but I’m also laddering Norway goals scored up to 5.5 for 1/3 of a unit each ladder, just because you never know when Norway goes beast mode and Haaland decides to just pop 50 goals for fun. It might be though that the Vikings will be more hesitant to humiliate Estonia while they don’t have the same problems with humiliating Israel or Moldova.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nolk7wi/"
    },
    {
      "created_utc": 1763018520.0,
      "author": "OliveCritical5134",
      "text": "**Record: 19-11**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅✅✅\n\n**Sport:** ⚽ / World Cup Qualifiers Europe - Group D / Azerbaijan v Iceland & France v Ukraine\n\n**Net units/ROI:** \\+26.33u / 34.64%\n\n**Previous Pick:** *Bayern Munich (W) v Arsenal (W): Both teams to score @ 1.57 -- 1 unit*✅\n\n**Summary:** 0-2 at half time, 3-2 at the final whistle. Hit. We're bouncing back from that unlucky losing streak of 4 earlier!\n\n**Today's Pick:** *France to win & over 2,5 total goals + Iceland to win @ 2.55 -- 2 units*\n\n**Write up:**\n\nToday's action is based around the tension in Group D! Iceland need to win to stay in the race but play Azerbaijan who are already knocked out whilst Ukraine will try to get some sort of result against France to gain the edge over Iceland before the final game which is a direct meeting between 2nd and 3rd.\n\n**France v Ukraine (19.45 GMT)**\n\nFrance have enough power and goalscorers in the squad to put a lot of attacking pressure on Ukraine and create tons of chances. In France's 4 matches in the campaign so far they've seen 12 goals combined, 3 goals average per game. Ukraine have seen 15 combined for and gainst in 4 matches, 3.75 average per game.\n\nUkraine will have to attack as they need to have a better goal difference compared to Iceland going into the final matchup.\n\n**Iceland v Azerbaijan (17.00 GMT)**\n\nI'm going very safe here with my pick because I think Iceland will try to turn this in a goalscoring fest to gain the edge over Ukraine on goal difference which would make them second if their matchup were to end in a draw.\n\nAzerbaijan are OUT of the running for qualification. They have conceded 11 goals in 4 matches, 5 out of those were against Iceland in the previous matchup. Azerbaijan haven't won a game since June 2024.\n\nThis previous matchup ended in 5-0 to Iceland. Iceland will give everything they have to climb over Ukraine in the standings and become second going into the final match.\n\n**Best of luck if tailing!** 🍀\n\n**PS:** If you want, you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nolhioh/"
    },
    {
      "created_utc": 1763015441.0,
      "author": "Exact-Employer-5248",
      "text": "Record: 1-1\n\nPrevious Pick: Miami Oh ML ❌\n\nRecap:\n\nAfter picking up a solid win on Western Michigan on Tuesday I was feeling good again about taking another solid MAC team at home against an over valued Toledo team on the road. Unfortunately, Miami announced at the last minute that their dynamic quarterback would be out and the backup played just as you’d expect a 5th year MAC system qb would. Despite countless mistakes by Toledo in the first half Miami could not capitalize and by the end of the second half it was essentially over. You would think in a regulated market we could get better transparency on injuries but then again I guess it’s just part of it 🤷‍♂️\n\nToday’s Pick: 🦈San Jose Sharks Ml🦈 (+140) @ Calgary - ☢️ MAX PLAY (5 unit) ☢️\n\nWriteup:\n\nIt’s funny, for the longest time me and my degen buddies coined a term, fade the sharks. If we had a bad TNF or a rough Saturday betting college, when all else failed you could count on breaking even by fading the sharks.\n\nSharks up 3-1 against the kings in the 3rd?\n\nFade the sharks.\n\nSharks up by one with 3 minutes left against the knights.\n\nFade the sharks.\n\nBet against them when they’re up, fade them in a parlay, no matter what you could always count on fading the sharks.\n\nBut something has changed.\n\nDare I say what we first saw last year as occasional sporadic explosive offensive hockey periods followed by implosion has now devolved into a young consistent fast team that can finish. If they’re up by two this year it feels as if the sharks just play harder, this year they’ve been going for the kill, and when it comes to a Calgary team that has been the most disappointing in the league, I truly believe the blood is in the water for this young hungry team.\n\nI don’t just think that San Jose will win, but I honestly believe that they will win by three or more in this spot. Calgary may get better as the year progresses and San Jose very well may regress but the fact of the matter is right now one of the hottest teams in hockey is playing a team on the road that is deflated in Calgary. Calgary has the worst offense in the league playing against a San Jose offense that believe it or not has been top 10 this year. Obviously anything can happen and this very well could be a trap line because I really don’t see how this sharks team is +140 even with their goalie out.\n\nTo conclude, 5 unit max play on the San Jose sharks.\n\nRide with the sharks 🦈\n\nhttps://preview.redd.it/29600345xy0g1.jpeg?width=1068&format=pjpg&auto=webp&s=5e457ee0f5aba8d76749415b8201e678e3a1ed82",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nolc2hw/"
    },
    {
      "created_utc": 1763015183.0,
      "author": "this_guy9",
      "text": "**POTD Record:** 3-1\n\n**Net Units:** \\+3.19\n\n**Previous Pick:** [✅ Victor Wembanyama o1.5 Threes -130](https://www.reddit.com/r/sportsbook/comments/1ouqr3f/comment/nokl1mb/?context=3)\n\nNever doubt the 4th quarter demon Wemby.\n\nFor today, not a usual SGP fan, but we've been having some great success with it this season. And these few game slates always make me uneasy so lets get some alt lines going. Almost all books hopefully have this for yall.\n\n**🏀 Scottie Barnes 6+ Rebounds + Immanuel Quickly 5+ Assists -120** vs the Cleveland Cavaliers\n\nNumbers wise you can't get much better than this.\n\nBarnes:\n\n\\- Cavs rank LAST in the league in allowing rebounds to PFs\n\n\\- Barnes cashed in L8/8 games vs Cavs (last 3 all going above 10 rebounds)\n\n\\- Jarrett Allen coming off a heavy effort B2B could get bullied\n\n\\- Averages vs Cavs: 8.5 Rebounds, Averages L5: 8.2 Rebounds\n\nQuickley:\n\n\\- Cashed this line in L9/10\n\n\\- Cashed this line in L2/3 vs Cavs on 30 min or less\n\n\\- Quickley has been hitting 32-36 min this season in competitive games\n\n\\- Both teams top 10 in the NBA in pace. Over/under at 240.5 means buckets will come\n\nFull Stats if you'd like to do additional research: [Barnes Rebounds Data](https://www.statpick.ai/48952511/scottie-barnes-rebounds) || [Quickley Assists Data](https://www.statpick.ai/50621093/immanuel-quickley-assists)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nolblpi/"
    },
    {
      "created_utc": 1763013359.0,
      "author": "MWMM93",
      "text": "**POTD Record 45-38-2**\n\nEasy W, and back on a winning streak. BBALL PAUL looked like an all star in that game, my god. Multiple 14-0 runs from both teams, but Detroit broke open the game after giving up a 20 point lead and being a one possession game late. \n\nBefore I get into my play, I do want to apologize for my lack of info in my posts this past week. Job was demanding a lot out of me, and I wasn’t articulating my thought process like usual. For example, in my last play, I half way mentioned the injuries, however I was not making the pick in the hopes that cade played, and giddey didn’t. Rather, I was expecting both to be out (hoping cade played while giddey sat), and loved Detroit in that matchup. I just thought they had a tough team, and that the bulls are the bottom of the league, while getting priced based on their 5-0 start.\n\nAnyways, back to my normal schedule, and with a small slate tomorrow, only one game jumps out, and it’s a team I have stayed away from since losing a few early in the season.\n\n**Cavs ­-7.5 vs Raptors**\n\nOkay I am back on the cavs, after taking a breather. Man have they been showing up in a meaningful way as of late. Big comeback vs the Bulls, a buzzer beater loss vs Miami (best ending of the season so far), and then going into Miami again in their last game, down at half, missing half their rotation, and still punched through with Allen dominating (30-10) and the rest of the squad stepping up when it counted (Hunter 21-6, Ball 15-8, and Porter 19-8). That’s what legit teams do. I’ve watched. I waited. Now I’m back in.\n\nObviously, there is major bias here (life-long cavs fan), and the slate is weak, but I’m trusting Cleveland to cover this spread tomorrow. Even though -7.5 feels bold, when you factor in momentum, matchups, and the implied lineup certainty of Mitchell & Mobley playing, it starts to look right.\n\nMitchell and Mobley were held out just for rest the in their last game night, and everything indicates they’ll suit up tomorrow. That changes the complexion hard. Toronto has good players. I’m not sleeping on them but they’re vulnerable to bigs, physical play, and teams that can get to the rim. Cleveland matches up with the perfect blueprint: Allen inside, Mobley roaming, Mitchell creating havoc off the perimeter. Mitchell and JA sat in their loss on Halloween, however Mobley had 29/8, while Hunter put up 26/7.\n\nMatchup wise, this is where the Cavs pull ahead. Toronto’s offense leans on jumpers, secondary creation, and good looks from the wings. Cleveland’s defense, even when short-handed has owned the paint, limiting second-chance points, rebounding aggressively, and forcing tougher mid-ranges rather than uncontested drives. With Mobley in there and Allen doing his thing, Cleveland becomes an interior nightmare. Raptors don’t have a dominant rim scorer or elite shot-blocker to counter this. They’ll try spacing, motion, reads but the Cavs are built to eat inside.\n\nMeanwhile, Cleveland’s offense has settled into a rhythm. With Mitchell back the ball moves, the spacing clears, and Mobley/Allen-style big-whammy action creates lobs, roll-pop mismatches, and kicks. The Raptors, on the other hand, have shown wavering defensive resolve on the road. If the Cavs come out with energy, wear Toronto down and close strong, the seven-point margin seems very doable.\n\nThe spread opened closer to -6 and has moved upward slightly toward -7.5 as rumors of full strength circulated. That tells me the sharp money is leaning Cavs now. Public money has been split, but any book comfortable raising the line when Mitchell/Mobley status flips to active makes me think there is a little value here at this number also.\n\nThat being said, this isn’t risk-free and I am obviously biased. Toronto has shooters who can catch fire. If Mitchell is even slightly hobbled (or sits), or if Cleveland’s bench goes cold for long stretches, the line could be too ambitious. Cleveland has had stretches this season where they can appear vulnerable when they can’t impose themselves early, however in their last few games, I have seen their ceiling, and think its as high as any team in the league (minus OKC).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nol85i9/"
    },
    {
      "created_utc": 1763013341.0,
      "author": "IndianBettor19",
      "text": "Record (W-D-L): 6-0-2\n\nNet Units: +8.28 Units\n\nFootball | National Football League | 8:15 PM EST\n\nPick: TreVeyon Henderson O 16.5 Rush Attempts (-125 ESPN BET, 2 Units)\n\nWrite Up: The New England Patriots (my favorite team since childhood) is facing the New York Jets in a divisional rivalry matchup with a -13.5 spread (opened at -10.5). Vegas, our biggest enemy, is predicting a blowout and rightfully so. The Patriots have won their last seven games, including a big win against the Buccaneers. The absolute key part of this write up, which I cannot emphasize enough, is the following quotation from Patriots head coach, Mike Vrabel:\n\n\"TreVeyon Henderson is expected to get a big load\".\n\nPlease do not take that out of context. But yes, these words from Mike Vrabel were said. It makes sense, considering the game script should align with a heavy rushing second half performance from the Patriots. The Jets give up the third most rushing attempts per game in the league at 30.4 rush attempts per game. The Jets also give up the fourth highest rushing play percentage in the league at 49.02%. These are the two most important stats (in my opinion) for rush attempts, including the predicted game script. On top of all this, the Patriots head coach said that Henderson is expected to get a \"big load\". Gibson and Stevenson are both out, and Terrell is questionable. If Terrell is ruled out, and this line is still 16.5, I will be taking a loan and hammering this.\n\nApart from this, he also has a great matchup against the Jets run defense in terms of getting a lot of yards. I don't often place two units on plays, but I do not understand how Henderson doesn't have a nuclear game tomorrow. I believe he will get lots of touches from the backfield even if the Patriots are somehow losing, or in a close game situation. Lastly, the Jets are ketchup water, and without Garrett Wilson, they are expired moldy meat.\n\nI also feel that teams run the ball more in TNF matchups after coming off a short week from Sunday games. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nol8484/"
    },
    {
      "created_utc": 1763013184.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 12-5 (+9.4U)\n\nLast Pick: North Texas +3 (-120) (1U)✅\n\n[UNT write up](https://www.reddit.com/r/sportsbook/s/T6KZgUKqGh)\n\nHoly fuck. UNT had that game in the absolute bag then it decided that it didn’t want to play basketball anymore. I mean first of all the fact that they were even in a situation where that kid could’ve called a foul when they didn’t have one to sell the game in and of itself is crazy. But secondly. I’m almost glad he did, because if that game went to OT I’m not sure we get out alive, Oregon state  clearly had all the momentum as they finished the game on a 20-5 run🤮 if you took the moneyline I genuinely feel bad for you. YOU NEED THERAPY😂😂 nah in all seriousness tho we need a victory blunt to calm the system after a game like that! But a wins a win baby, cheers 🍻 \n\nEvent: Kings @ Maple Leafs (6pm central)\n\nPOTD: Kings ML (-115) (1U)\n\n-everything is bet to win unit amount-\n\nWrite up: \nThe Maple Leafs enter this matchup on a three‑game losing streak at home, and the issues run deeper than bad luck. Toronto has conceded 15 goals across those three games, and their defensive collapse coincides with losing both Auston Matthews and starting goaltender Anthony Stolarz to injury. Matthews’ timeline remains uncertain, and while the team insists Stolarz will be fine, the immediate reality is shaky depth in net. Over their last 10 games, the Leafs have allowed the most goals in the league, averaging 3.9 goals against per 60 minutes.\n\n\nOffensively, Toronto’s numbers look strong at first glance — second‑most goals in the league over their last 10 games with 28 — but the underlying metrics tell a different story. Their expected goals in that span sit closer to 21, which is below average, suggesting regression is already catching up. Meanwhile, the Kings have quietly built one of the most balanced profiles in hockey. Over their last 10, they rank fifth in Corsi and fourth in Fenwick, allowing only 17 goals with a goals‑against rate of 2.12 per 60 minutes. They’ve also limited opponents to just 197 shots on goal compared to Toronto’s 241 allowed in the same stretch.\n\n\nLos Angeles comes into this game riding momentum from a dominant 5–1 win over Montreal and sporting a 7‑1‑2 road record. They’ve proven they don’t need shootouts to win — going 7‑0‑4 in games where they score three or more — and their defensive discipline travels well. With Toronto’s inflated scoring numbers masking defensive fragility and lineup uncertainty, the Kings moneyline offers clear value.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nol7t54/"
    },
    {
      "created_utc": 1763012978.0,
      "author": "2thyKing",
      "text": "Record: 0-0 (first time!)\n\nNet Units: N/A\n\nROI: N/A\n\nBasketball | NBA Toronto Raptors @ Cleveland Cavaliers | 7:00 EST / GMT -5\n\nPick: Jakob Poeltl OVER 7.5 reb (-139 DK)\n\nWrite Up: Cleveland has allowed the 7th most rebounds to opponents this season (58.2 per game). Over their last 3, 59.2. They give up an average of 3 more rebounds at home than they do on the road.\n\nPoeltl over his last 3 games has recorded 9, 10, and 10 rebounds, respectively. I’m definitely targeting him to get at least 8 tonight. \n\nYou can also go with the alt line of 9+ on DK for +119 (at the time of this writing) if you’re feeling spicy. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nol7ep5/"
    },
    {
      "created_utc": 1763009951.0,
      "author": "dutchbanderlind",
      "text": "Record: 8-5\n\nLast pick: Utah Mammoth 60min ML ✅\n\nPick: Colorado Avalanche -1.5 (-125)\n\nThe Avalanche are hosting the Sabres at home who are on a back-to-back. Avalanche are 5-0-2 at home, and the Sabres have never won on the road this season. Historically, the Avalanche dominate the Sabres with a record of 8-2 in their last 10 meetings. I see the Avalanche running through this tired and really bad Sabres team. \n\nBOL if tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nol15q9/"
    },
    {
      "created_utc": 1763009825.0,
      "author": "UserQAV",
      "text": "**Record**: 1-1 ❌✅\n\n**Net Units**: +2.25u\n\n**Last Pick**: Ibrahime Konate 2+ Fouls Committed vs Manchester City at 2.75 (3U) ✅\n\n**Event**: World Cup Qualifying (Soccer)\n\nRepublic of Ireland vs Portugal\n\n**Pick**: Cristiano Ronaldo to score anything and 2+ shots on target at 2.00 (2U)\n\n**Write Up**: Cristiano Ronaldo is the center of Portugal’s attack and always gets many chances during the games he plays. According to their previous records, Portugal will likely dominate possession and create many chances, and I see Ronaldo getting at least 2 goal-scoring opportunities in this game. A team like Ireland would sit back, and Ronaldo would exploit from that. Another factor to take into account is that Ronaldo is on penalties, which makes this pick look much better.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nol0vvd/"
    },
    {
      "created_utc": 1763007950.0,
      "author": "CartPathCasher",
      "text": "**POTD Record:** 1-0\n\n**ROI:** \\+2.68 units\n\n**Previous Pick:** [✅ ](https://www.reddit.com/r/sportsbook/s/03slhXpfsS)Keldon Johnson o13.5 Points + Rebounds vs GSW\n\n**Event:** NFL: Jets @ Patriots 8:15pm EST\n\n**POTD:** 2 leg parlay Breece Hall 2+ Receptions Alt Line  + TreVeyon Henderson 60+ Yards Alt line -122\n\nRIsk 3 units to win 2.46 units\n\n**Write up:** With the Jets dealing with injury concerns and trading away key defensive players this past week, they will lean on Breece Hall and Lazard in the passing game. New England has been allowing passing backs to catch an average of 3 passes over the past 3 weeks. On the other side, Henderson is going to be in a one-sided game with a weaker defense and will easily get his touches in. I see both exceeding these, but the last few weeks have had weird games on prime-time days, so I am going with a lower parlay for an easy payout while I focus my attention on Friday's NBA cup games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nokwoud/"
    },
    {
      "created_utc": 1763006872.0,
      "author": "ZackDrex98",
      "text": "**Record: (14-12-2)**\n\n**Form** : ✅✅✖️✅✅✅✖️✅✖️✖️✅✖️✖️✅✅✅🅿️🅿️✖️✖️✖️✅✅✖️\n\n**Net Units: -2.9 U**\n\nLast Pick : KCC(-1.5) First Half Vs LG | 1.8 | 5U✖️\n\n**Game: Anyang Booster Vs Wongju DB** \n\n**Pick : Anayang to win First Half | 1.76 |5 U**✅\n\n**Write Up: Today i will go with another KBL game again. Anyang is showing a good  form in the first half this season winning 10 out of 13.**  \nAnyang 1H (10 ✅ - 3❌)  \n Vs Sono ✅  \n Vs Kogas✅   \n Vs DB ❌  \n Vs Sknight✅   \n Vs Thunder❌   \n Vs LG✅   \n Vs Mobis✅   \n Vs KCC ✅   \n Vs KT ✅  \n Vs Sono✅   \n Vs Thunder❌   \n  Vs Sknight✅   \n  Vs Mobis ✅  \nFor DB , they are 5 Win - 2 Draw - 5 Lose in the first half this season. So , I will trust Anyang to get the win in the first half.\n\nDonations are completely optional, but you feel free to show support here.\n\n**Buy me a Coffeee**: [https://buymeacoffee.com/zackdrex98](https://buymeacoffee.com/zackdrex98)\n\nMuch appreciated! ❤️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/noku5jp/"
    },
    {
      "created_utc": 1763005718.0,
      "author": "Dont_Tail_Me_Bro",
      "text": "Record: 4-6\n\nNet Units: -1.68u\n\nLast pick: Oklahoma State -32.5 ❌ Oklahoma State led by 31 with 10 minutes left with the live line at -36.5 and we still couldn't cover. Neat. \n\nNCAAB // Loyola Chicago Ramblers @ Wichita State Shockers\n\n**Pick: Wichita State -3.5 (-110) 1u**\n\n  \nGoing back to the literal only thing that's worked in the last week, fading Loyola Chicago. They come in at 1-2 with a lackluster resume including a horrific 8-point loss to Mercyhurst (#332 in KenPom). Now they have to hit the road for the first time this year and are coming up against a Wichita State team who has looked good to start the season albeit against bad competition. \n\n  \nWichita state is 2-0 and dropped 105 points their last time out. Wichita State has been shooting the ball well and has been dominant on the glass so far boasting a rebound margin of +14 per game. Meanwhile Loyola Chicago has struggled in this area sitting at a rebounding margin of -8. Keep in mind that is coming against much worse competition than Wichita State as they got outrebounded by both Cleveland State and Mercyhurst. \n\n  \nIt is hard to see a way that Loyola Chicago overcomes what should be a huge rebounding discrepancy, which should lead to a lot of one and done possessions for them and a lot of second chance opportunities for Wichita State. \n\n\n\nWichita State: #106 in KenPom\n\nLoyola Chicago: #139 in KenPom\n\nWichita State: 2-0 ATS covering with an average margin of +16.5pts. \n\nLoyola Chicago: 0-3 ATS not covering by an average margin of -15.7pts. \n\n  \nLet's take a look at some of Wichita State's chants and cheers via their school's official website:\n\n* \"LET'S GO SHOCKS!\"\n* \"GO SHOCKS GO!\"\n* \"YOU DON'T WANT TO GO TO WAR, WITH THE SHOCKERS, DON'T START NO STUFF, WON'T BE NO STUFF!\"\n* \"HEYYYYYY OHHHHHHH, SHOCKERS GONNA SHOCK YOU AGAIN!\"\n* \"HEY GO SHOCKS! HEY GO SHOCKS! HEY GO SHOCKS! WE'RE GONNA BEAT THE HECK OUT OF YOU, AND YOU, AND YOU AND YOU AND YOU!\"\n\n  \nWow, if that doesn't instill confidence in this pick than I don't know what would. \n\nGive 'em the shocker!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nokrb1z/"
    },
    {
      "created_utc": 1763005357.0,
      "author": "Best_Accountant_5471",
      "text": "Record: 50-29 (+43.6 units)\n\nLast 10 (most recent on right):  ❌✅✅✅✅❌✅✅✅❌\n\nLast Pick: Rayo Vallecano +1.5 corner handicap vs Real Madrid (or +2 corner handicap) ❌\n\nEvent: UEFA World Cup Qualifying ⚽️\n\nPick of the Day: England vs Serbia O3.5 total cards 4U @ 1.90 (Bet365)\n\nWrite-up: Bit of a frustrating loss to be honest, Vallecano really gave Los Blancos a tough game ending in a 0-0 draw. As a result of this being a good result for Rayo and not so much for Real, the leaders expectedly piled on pressure towards the end of the match which provided more corner opportunities. The home team were actually leading on the count 5-4 in the 80th when Madrid were mistakenly given a corner as Vini clearly kicked the ball out himself. This was then followed by Fran Perez intentionally letting the ball run out of play thinking it would be a goal kick but added another corner. The count ended 8-5 to Real, let’s bounce back.\n\nTuchel-ball is in full flow and has got the England fans dreaming of a second World Cup success after their 1966 victory. The Three Lions have a new generation of players after the last couple of golden generations came short and I do seriously see them as contenders in tournaments to come having narrowly lost the Euros final to Spain last year. England have won all 10 matches under Tuchel and conceded just one goal in that time frame though the opposition has been pretty light and are a lock for WC26 qualification. Meanwhile this is a big game for Serbia who sit 3rd in Group K and will be battling it out with Albania for a play-off spot. They last failed to qualify in 2014 but their destiny is out of their hands unless they can get a win tonight at Wembley. It won’t be an easy task but Panuović’s men won’t go down without a fight and I expect this to be a feisty affair which is good on the cards front.\n\nEngland has averaged 1.6 cards for + 2.3 against cards in their last 20 competitive whilst Serbia has 2.4 and conceded 1.7 in the same timeframe. Using more recent stats and home/away splits I get an estimated 3.6 total cards (1.5 for England, 2.1 for Serbia). Slovak referee of the day Ivan Kružliak has averaged 4.3 cards per match this season with a career 5.2 handed out on average. Using his card-friendly weighting I get an approximate 2.1 cards for The Three Lions and 2.9 for the Eagles (4.9 total). That gives this play an estimated 72% chance of winning and the line cleared in the reverse fixture. BOL !\n\nEDIT: the O3.5 refers to booking points (red = 2 bookings) so check which system your book uses and keep that in mind if tailing\n\nI’m raising money for Movember, ALL proceeds will be going to a good cause. Donations aren’t expected but very much appreciated so if you have profited from my picks please do consider donating, a little goes a long way. [https://buymeacoffee.com/best\\_accountant\\_5471](https://buymeacoffee.com/best_accountant_5471)\n\nhttps://preview.redd.it/1ebhwka24y0g1.jpeg?width=1179&format=pjpg&auto=webp&s=cc14e5d9c337314c8b622eca19694f57594430e3",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nokqdcv/"
    },
    {
      "created_utc": 1762999118.0,
      "author": "NVSBETS",
      "text": "POTD Record: 3-1\n\nNet Units: +1.78u ROI: 30.17%\n\nPrevious POTD: Felix Auger-Aliassime +1.5s -179 +1u✅\n\nSport: Tennis Tournament: ATP Finals Time: 2:30PM EST\n\nPOTD: Carlos Alcaraz -1.5 sets/2:0 -200\n\nAnalysis: so you’re telling me, Alex fucking DeMinaur was *favourited* to beat Musetti in straight but yet Carlo Alcaraz Montoya Pacino is only -200 to beat him in straights on even shakier legs? This hits 8/10 times gimme a freebie that’ll look -500 thanks",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nok9cvr/"
    },
    {
      "created_utc": 1762996675.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 52-24-1 (+60.0u)\n\n__NFL Record:__ 36-12 (+55.91u) 75% W/L\n\n__Previous Pick:__ [✅ Christian Watson o38.5 rec yards (-115), 2.4u](https://www.reddit.com/r/sportsbook/s/03slhXpfsS)\n\n__Event:__ NFL: Jets @ Patriots 8:15pm EST\n\n__POTD:__ TreVeyon Henderson o76.5 rushing yards (-115), 3u to win 2.61u\n\n__Write Up:__ The (2-7) New York Jets are traveling to Gillette Stadium to take on the (8-2) New England Patriots in an AFC East clash on Thursday Night Football. The Jets began the season 0-7, but they are coming off 2 straight wins vs the Bengals & most recently the Browns. Yes, 2 very bad teams. __This was after New York traded their 2 best defensive players at the trade deadline, DT Quinnen Williams & CB Sauce Gardner. And now they will be without star WR Garrett Wilson being out the next few weeks with a knee injury.__ They’re down to crumbs. As for the Patriots, they started the season 1-2 after 3 games & have not lost since, looking for their 8th straight win. They are now 1.5 games ahead of the Bills in the AFC East Standings. __The Patriots have covered the spread in 5 of their last 6 games.__ This is mostly due to Drake Maye playing some good football at QB, but the run game exploded last week as well.\n\nPats QB Drake Maye has been a beast this year. __The 23 year old QB has 250+ passing yards in 5 of his last 6 games, throwing for 270 yards last week.__ He has 2555 passing yards on the year, with a 19 to 5 TD to INT ratio. Nate has been the most accurate passer in the league so far this season. __Maye ranks #1 in the NFL in Catchable Ball Thrown Rate at 83%. Inside 10 yards on quick passes, his 92.8% well thrown pct on quick passes trails only Josh Allen while the Pats convert 53.3% of these concepts into successful plays, 3rd best in the NFL. His completion pct on 10+ yard throws is 63.7% this season, (2nd). He’s also 2nd in the league in 20+ yard passes (35), 30+ yard passes (14), 40 yard passes (6), & leads the league in 50+ yarders (5).__ He’s been able to do so because he has been reading defenses at an extremely elite level, even when coverages are hidden. __Maye leads the NFL with 700 pass yds & 6 pass TD against disguised coverages this season.__ This is key because the Jets run disguises coverages more than any team in the league. __They use a base scheme that leans zone (67% of snaps), but they frequently switch to man after snap (33% 8th most in NFL), especially in key situations. Against man coverage, Maye is averaging 9.7 yards per pass (2nd). He also has a league high 14% scramble rate against man coverage, which will be a problem for a weak Jets DL.__ The Jets have struggled to pressure opposing QB’s, even moreso now after trading their best DLineman. __The Jets are 31st in pressure rate (28.9%) & do not have a single INT this season. When Maye is not pressured he has a 78.6% completion pct (4th) for 9.0 yards per pass (3rd), & a 7.3% TD rate (7th).__ Why does all of this matter? Because the Patriots are going to torch them early, then feed TreVeyon. __The Patriots have led at halftime in 7 straight games. They dominate in the 2nd Quarter with a +35 point differential (3rd in NFL). Now they face a Jets team that has a point differential of -50 in the 2nd Quarter (2nd worst) & -28 in the 1st (5th worst).__ Maye is going to do some damage, take a big lead, & make the defense focus on him. Then it’s going to be Rookie 2nd round pick, TreVeyon Henderson time…\n\nIt may have taken a few injuries, but Henderson finally had the breakout game we’ve all been waiting for. __Henderson broke out in a big way last week, putting up 147 yards on 14 carries with 2 TD’s against a tough Buccaneers defense. The explosion was on full display, as he ripped off not one, but two long TD runs (55 & 69 yards). He hit 22.01 MPH on those runs, the fastest by any Patriots ball carrier since 2018, and the 5th fastest overall this year.__ But what is more important what how often he was on the field. With starter Rhamondre Stevenson out with a toe injury (also ruled out this week), Henderson was promoted to starter & flourished. __Not only did Henderson set season high’s in carries (14), rushing yards (147), TDs (2) but he also set a season high in snap percentage at 84%.__ The other RB, undrafted 2nd year Terrell Jennings left the game with a knee injury & is listed as questionable this week, but it was clear regardless that this was Henderson’s backfield as even with Jennings active in Week 9, Henderson played 75% of the snaps, so Henderson should be set up for another high workload game. His improvement these past 3 weeks have been unbelievable. __In Week’s 1-7 he averaged 3.56 YPC (36th of 42 RBs) & 0% explosive rate (last). Week 8-10: 7.29 YPC (3rd) & a 13.2% explosive rate (2nd). His 10.5 YPC was the highest in the NFL this past week. He had 93 rush yards over expected. Rhamondre Stevenson has 20 RYOE on the SEASON. Henserson now ranks ranks 2nd in yards before contact per attempt among RB’s with 25 carries.__ Schematically this is a matchup nightmare for the Jets. __Henderson has been significantly more successful on zone rush concepts, with a 57.7% success rate compared to a 41.2% success rate versus man/gap concepts. The Jets are the 6th worst vs zone rush concepts allowing 4.5 YPC.__ As for when he does run in gap concepts he loves the B & D gaps. __He averages 7.1 YPC in B Gap (most in NFL) with a 52.8% success rate 8.0 YPC with a 64.0% success rate in the D Gap (compared to 3.3 YPC & 37% success rate in the A & C gaps). The Jets give up most the YPC to the B & D gaps at 5.33 YPC.__ But the biggest way he earned trust from the coaches was in practice last week. In their previous game before the Bucs, when pass blocking Henderson allowed 3 pressures for a 28.7 pass block grade. He practiced it hard all week & it paid off. __Last game Henderson allowed 0 pressures in pass protection, good for a 79.6 pass block grade, both season highs.__ Now he faces a bad Jets defense that has been torched on the ground. __The Jets are allowing 104.5 rushing yards per game to backs (23rd) & they allow the 6th highest EPA/rush (0.02). Opposing RB’s vs the Jets have exploded this season (starting with the most recent): Judkins 22/75, Brown/Perine 21/167, Dowdle 17/79, Javonte, Williams 16/135, Achane 20/99, & Cook 21/132. They’ve allowed the 6th most YPC their last 3 games (5.1). Opponents run on the Jets 49.02% of their plays (4th most in the league.__ Also Jets QB Justin Fields is bad. He completed just 6 passes for 54 yards last week, & has throw for less than 54 yards in 3 out of his last 4 game, completed less than 10 passes in those games. He’s also failed to top 31 rushing yards in 5 straight games. Jets avg 143.8 passing yards (last). Now they’re without their best WR.\n\nThere’s a lot more but ran out of room. Pats -12.5. OL is fantastic. QB playing great. The Jets suck. Coaches will let Henderson eat.\n\n__TreVeyon Henderson o76.5 rushing yards__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial) - [PayPal](https://paypal.me/joeinglesofficial)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nok2l6m/"
    },
    {
      "created_utc": 1762996553.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 194-142\n\nUnits Won: +114.57u\n\nLast Pick: NOVAQ Map 2 ML (-122) vs. 500✅\n\nToday's Pick: **JamYoung>DGT Map 1 Kills (-139)** 5u ✅\n\nhttps://preview.redd.it/y6vxwjfodx0g1.png?width=218&format=png&auto=webp&s=1c1f09b8c4913347ee48499bfcb3bc29ee7eb0ef\n\nTeams: TYLOO vs. paiN  \nTime: 2:00 AM EST.\n\n**Writeup:**\n\n* Jamyoung is averaging a .69 KPR L3 months, with a .71 KPR in the last month\n* DGT is averaging a .65 KPR L3 months with a .61 KPR in the last month\n* paiN should pick Nuke, their best map and one they beat TYLOO on 13-6 in the previous match between the two\n* Despite TYLOO's struggles, they beat Vitality badly yesterday on the map and have been putting a ton of work into this map behind the scenes. Even if they don't take the map outright, I think we see a much closer game overall. Of TYLOO's recent 4 Nuke games, they have upsets against Vitality/FaZe and a 13-11 loss against 3DMAX who are another fantastic Nuke team, I think they are a better Nuke team then they showed against paiN\n* DGT has struggled on Nuke heavily, especially recently, DGT is averaging a .54 KPR last month on Nuke, a .59 KPR L3 months, and a .64 KPR since joining paiN overall. Solid drop off especilly considering the strong results paiN have showed on this map, meaning the drop is even more substantial\n* Jamyoung has maintained strong Nuke stats throughout the last year despite TYLOO's struggles on it as a team. He is averaging a .71 KPR L3 months on the map, a .81 KPR L6 months and a .81 KPR in the last year as well on the map\n* DGT will start on T side, since joining paiN he has had solid T side numbers compared to most players but still weaker then on CT side by a slight margin averaging a .63 KPR average on T side Nuke\n* JamYoung will start on CT side, in the last year he has averaged very strong CT side numbers averaging a .80 KPR on CT side, but is quite good on T side as well giving him a strong balance overall\n* Last time they faced h2h, DGT beat Jamyoung on Nuke 11-9 in kills, this was despite a paiN 13-6 win. On top of this, Jamyoung has played 21 maps of Nuke in the last 12 months, against paiN was the only map he has ever dropped single digit kills",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nok292u/"
    },
    {
      "created_utc": 1762994805.0,
      "author": "VAM89",
      "text": " Record: 22-14\n\nNet Units: +14.17\n\nYesterday's Pick: Atletico MG to win vs Fortaleza 3u @ $1.61\n\n3-1 up and drew 3-3 with an injury time goal. Spewing. \n\nOnly slight positive from the game is that the Fortaleza player who scored a hatty played for Atletico last season and apologized after scoring three times. I don't think I've seen that before. \n\nToday's Pick: Mbappe to score anytime vs Ukraine 3u at $1.57\n\nI got this at $1.61, and it's already down to $1.57 at the time of writing, which is about 4 hours before the post goes live. \n\nIt's an important game for France, so I'm expecting all the big guns to come out. \n\nIf Mbappe plays for France recently, he scores. In his last two international windows (3 games) he's scored three and assisted two. \n\nOne of those goals was the away game vs Ukraine. \n\nMbappe is also the penalty taker, so that will be another way he can score. Always nice to have the pen taker when picking a scorer. \n\nLike I said before, it's an important game for France... There is only 3 points separation between France and Ukraine and a five-goal difference... So a loss can really make things tight, where a win can secure qualification.\n\nFrance won't want to mess about here.\n\nIf the $1.57 isn't to your liking, I also don't hate Mbappe and Olise both to score or assist at $2. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojxdkm/"
    },
    {
      "created_utc": 1762993997.0,
      "author": "LilMatchaKitty",
      "text": "***4-0***  \n***Units:*** *+10.04*\n\n***Previous POTD***  \n***-*** *Barcelona (W) 2nd Half Team Total Goals 2+*  \n***-*** *Bayern Munich (W) to win either half*  \n***Odds:*** *2.20*  \n***Units:*** *2*\n\n*After a low scoring but a dominating 1-0 first half, Barcelona then matched it with the same energy in the second half and had a low scoring (by their standards) second half and won 2-0. Final score was 3-0 and we won that leg. Bayern went into halftime 2-0 down to Arsenal and honestly after they completely got shut out in the first half, it wasn't looking good. Bayern then came out in the second half and not only won the half but also won the game 3-2 giving us another win and another winning POTD!*\n\n***POTD5***  \n**-** *Harry Kane to score or assist*  \n**-** *England v Serbia Both Teams To Score NO*  \n***Odds:*** *2.60*  \n***Units:*** *3*\n\n***Sport:*** *Soccer ⚽*  \n***Teams:*** *England v Serbia*  \n***⏰:*** 5:45AM AEST  (19 hours from time of posting)\\*\n\n***Reasoning:***  \n***-*** *The last time these two sides met was back in September, England won 5-0*  \n***-*** *England haven't conceded a goal in a competitive match for over 1 year, the last time being in October 2024*  \n***-*** *The last time Serbia scored against a top 10 ranked nation was back in 2021 against Portugal, since then they have had 6 chances and been held goal less in all of them*  \n***-*** *England and Serbia have played each other two times with England winning both fixtures to nil*  \n***-*** *Harry Kane has scored or assisted 29 times in 20 games this season*  \n***-*** *England have scored 30 Goals in their last 10 Competitive games, 10 coming from their last 2 which were both 5-0 wins*\n\n*I have been riding the England clean sheet wave for a while, this is a good test for it. Also just remember nobody is perfect at betting, I have been on a good run to start off here but please stick to your units and stay within your limits. Good luck if you decide to follow \\^\\^*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojv1ik/"
    },
    {
      "created_utc": 1762992246.0,
      "author": "Pefkov",
      "text": "**Record:** 11-6\n\n**Net Units:** \\+4.72\n\n**Last Pick:** Josh Jacobs O68.5 Rushing (-112 on DK) 1u to win 0.89u ✅\n\n**Todays Event**: 🏈 NFL Thursday Night Football Jets @ Patriots 7:15 PM CST🏈\n\n**Todays pick**: Mack Hollins 40+ Receiving (+104 on DK) 1u to win 1.04u\n\n**Writeup:** Mack just came off a crazy 106 yard receiving game against Tampa bay and cleared this number in 3/5 of his last games. His average sits lower than the line at 32.2, but since week 5, he's been seeing more usage, averaging 1.8 targets with 1.4 receptions weeks 1-5, meanwhile weeks 6-10 having 4.8 targets with 3.8 receptions. While his target share has been low at only \\~12% in 2025, Kayshon Boutte has been ruled out, along with TE2 Austin Hooper, which will pump his numbers up, with the potential to be WR2 behind Stephon Diggs\n\nWhile Hollins is versatile and can play generally well in both, he tends to do better in zone coverage which is what Jets run about 2/3rds of the time. Not only that but the Jets do worse against outside receivers  Jets also allow 8 yards per target to opposing receivers. Another thing to note is that outside Cornerback Azaraeye'h Thomas has been ruled out for this game, allowing for easier matchups for our outside receivers, and makes it less intimidating as the jets hold the 8th best pass defense.\n\nThe last bit of info i'd like to add is that this is a Thursday night divisional game, if I was superstitious, i'd say something about the last 3 snooze fest primetime games. The lines are heavily in Patriots favor, yet recently (post Tom Brady Patriots), Jets mostly have been able to keep the game within 1 score, with November 24th of 2021 being the last time Jets lost by more than that 1 score. If this is potentially a trap game, there could be a larger chance for more passes, and more to our boy Hollins.\n\nBOL to anyone tailing!\n\n[Tips Greatly Appreciated ☕](https://buymeacoffee.com/pefpef)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojpzz2/"
    },
    {
      "created_utc": 1762990283.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 2-0\n\n**Previous Pick:** Morgan Gibbs White 1+ SOT (-110) ✅️\n\n**Today's Event:** UEFA World Cup Quals | England vs Serbia (11:45 AM PST)\n\n**Pick:** Elliot Anderson 1+ SOT (+110), 1 unit to win 1.1 units\n\n**Write Up:** Hello again friends! We're back after a few days break with some world cup qualifier action where we're into the last two games of the group stage. In case you can't tell by now, I love SOT plays. They're quite fun to root for while watching a match. Our first two plays both hit within the first 3 minutes of their respective games, great start to POTD! I was waffling here between this pick and England 3+ goals, but landed here because this one could be a slog. England have qualified for the world cup, so this is technically a meaningless game for them. But England boss Thomas Tuchel wants his side to continue to gel and build momentum. He also loves himself some Elliot Anderson. Anderson has played nearly every minute for England since his first cap with the senior squad in September. Anderson also fits the mold for my favorite kind of player to back, scrappy hard working midfielders who like to take long shots. We're getting good odds here because Anderson has only recorded a SOT for England in 1 of 4 matches. But in his last match against Latvia, he took 5 shots. While none of those found the target, the uptick in shot attempts are promising as his confidence builds and he cements himself in England's midfield. \n\nNow to Serbia. They currently sit 3rd in the group, 1 point behind Albania. Serbia needs a point here to stay alive in qualifiers. I expect them to park the bus and invite shots from a distance, as they won't win a high goal shootout with England. This is Anderson's shooting range and I fully expect him to find the target here, if not the back of the net. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojkh4s/"
    },
    {
      "created_utc": 1762989811.0,
      "author": "dreamchasing1",
      "text": "Record: 223-210 Net Units: -22.64 47-50 on 1.5u plays, 37-39 on 2u plays, 1-2 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Scotland Challenge Cup] East Kilbride vs Celtic B\nLast pick: BTTS + OVER 2.5 GOALS @ 2.05 L\n\n\nEvent: Soccer/Football, [World Cup QUALS] Moldova Vs Italy\n\n\nPick: Moldova over 1.5 corners @ 1.72 - 3 Units\n\n\nBoth sides arguably with not much at stake here as Italy have a slim to none chance of overtaking Norway, whereas Moldova cannot advance anymore. Moldova at home though to get just 2 corners, when they got 6 in the reverse matchup seems great, so far with 6 games played Moldova covered this in all but 1 game away vs Norway. At home, Moldova got 6 vs Norway. Moldova have also previously gotten at least 2 vs Romania in a friendly very recently and vs Poland. Italy have given up 2 or more corners in 5/6 games during the group stage. Simply expect the home side to show a respectable performance and get at least 2 corners here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojj4r2/"
    },
    {
      "created_utc": 1762989618.0,
      "author": "InternationalRest542",
      "text": "POTD Record: 2 - 0\n\n\nNet Profit : +5.43 Units\n\n\nPrevious Pick: Karl-Anthony Towns Over 13.5 Rebound+Assist  @1.81 3u to win 2.43u 💵✅\n\n\nEvent: NFL | Jets @ Patriots ( Divisional Matchup )\n\n\nPOTD: Hunter Henry Over 33.5 Rec Yards @1.83 2u to win 1.66u\n\n\nWrite Up:  \n\n\nHunter Henry will see an increased role in the Patriots passing offense because Kayshon Boutte (hamstring) will not playing and Austin Hooper (concussion) are on limited minuts vs the Jets . Maye has been leaning on short and middle reads, especially to his TE which Henry already averages about 3.8 receptions and 44.9 yards per game with him.\n\n\nAustin Hooper’s absence removes the team’s TE2 and a reliable underneath target. That means Henry should get nearly all tight end snaps.\n\n\nKayshon Boutte missing will hurt their WR core, so the Patriots may funnel more targets toward Henry . Also The Jets this season allow tight ends to average about 42.6 receiving yards per game when being targeted. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojikvn/"
    },
    {
      "created_utc": 1762987245.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ovjznc/pick_of_the_day_111325_thursday/nojbitc/"
    }
  ]
}