{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 2/3/26 (Tuesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qubl02/pick_of_the_day_2326_tuesday/",
  "target_date": "2026-02-03",
  "timezone": "America/Chicago",
  "collected_utc": "2026-02-02T23:53:31.448053+00:00",
  "comments": [
    {
      "created_utc": 1770076093.0,
      "author": "222benz",
      "text": "Record: 6-10-1\n\nNet Units: -9.70u\n\nROI: -16.30%\n\nLast Pick: Team Spirit 2-0 + Team Yandex ML ❌\n\nSport: eSports | Dota 2\n\nEvent: BLAST Slam | OG vs. Team Liquid\n\nTime: 6:00 AM EST\n\nPOTD: OG ML @ 2.21 odds (5u)\n\nWrite Up:\n\nMan, that last parlay was brutal. Spirit did their job but Yandex fell apart completely. Time to bounce back with new Dota tournament.\n\nWe’re fading Team Liquid here. I know Liquid is the better team on paper, but have you seen them lately? They looked absolutely lost in the Fissure and ESL Birmingham qualifiers a couple of weeks ago. They seem shaky rn and definitely not in top form.\n\nOn the other side, we’ve got this new look OG squad. With the SEA boys like Yopaj and Natsumi, they play that hyper-aggressive, chaotic style that is perfect for a Best of 1. In a BO1 group stage match, I’ll take the unpredictable, aggressive underdog over a slumping favorite every time. Liquid tends to start tournaments slow, and if OG runs at them early, this could be over fast.\n\n\nBOL.\n\nhttps://buymeacoffee.com/222benz",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qubl02/pick_of_the_day_2326_tuesday/o390pwr/"
    },
    {
      "created_utc": 1770075949.0,
      "author": "nigerianPriince0",
      "text": "**Record: 117W  - 90 L**\n\n**Form: 15-1**\n\n **✅ ✅ ✅ ✅ ✅ ✅✖️✅ ✅ ✅ ✅ ✅ ✅ ✅ ✅ ✅**\n\n**---**\n\n**Last Pick: Al-Nassr Over 6.5 Corners @ 1.83 ✅**\n\n**Confidence: 85%**\n\n**---**\n\n**Today's Pick: Barcelona Over 6.5 Corners @ 1.61**\n\n**Confidence: 90%**\n\n**Details: Albacete VS Barcelona - Spain Copa del Rey -3:00 PM EST**\n\n**---**\n\n**Lower than I'd like but Honestly just surprised there is any value at all on this line considering the difference in quality between these sides + previous rounds.**\n\n**---**\n\nAlbacete are a league lower than Barcelona (Laliga 2) and will look to replicate the same gameplan that saw them knock out Real Madrid in the Round of 16. Fortunately for us that gameplan saw Real Madrid get 11 corners total and I expect Barca to cover us.\n\n* **Barcelona** are ranked **#1/20 in La Liga for corners awarded with an average of 7.1 per game,** now facing lower opposition I expect average at the least\n* Last Cup round Barcelona faced the best team in the La Liga 2 and still managed to put up **10 corners in the game. The round before they managed 9 corners against Guadalajara**\n* **Albacete** in La Liga 2 are **ranked 4th highest for corners conceded per game at 5.2 corners per game.**\n* Albacete miraculously managed to knock out Real Madrid in the previous round and **Madrid still manage to put up 11 corners against them**\n\n**---**\n\n**Expecting Barcelona to avoid falling under the same hand as Real Madrid and go for the kill early, Albacete will have the confidence in their structure and won't mind conceding corners considering 11 did nothing to save Madrid.**\n\n**---**\n\n**Special thank you for the coffee and beers, cant express how much they help keep these coming!**\n\n[**https://paypal.me/PrinceAtonyo**](https://paypal.me/PrinceAtonyo)\n\n**BOL!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qubl02/pick_of_the_day_2326_tuesday/o390a2h/"
    },
    {
      "created_utc": 1770075744.0,
      "author": "CMDVN",
      "text": "AC Milan @ 2.43 - €500.00 (Unibet) // Serie A Football\n\nLast 5 > LWWLW // Profit: €4,198.04\n\nStaying in Serie A, mybad for the loss… should’ve never trusted Roma at all. I want to blacklist Serie A from all my future bets if this loses, but I am confident in today’s.\n\nIn today’s matchup we have a Bologna side who are in bad form, in their last 10 games they have been 1-3-6. At home they are 0-1-4 in their last 5. Milan is on the other end, they are 2nd in the Serie A as away team and currently still unbeaten (6-5-0). In their last 5 their form was WWDWD. \n\nMilan have a decent H2H (5-3-2) against Bologna, but it pops up more at the stadium of their opponents. At Bologna, Milan are 13-5-1 as a traveling team, with the only loss the most recent one. In the managerial H2H Allegri is 7-1-1 against Vincenzo.\n\nAlso to note, Bologna are missing their main GK due to red card. For Milan Pulisic and Saelemaekers are out, I reckon some good long shots from Rabiot should do it.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qubl02/pick_of_the_day_2326_tuesday/o38znla/"
    },
    {
      "created_utc": 1770075618.0,
      "author": "SP7988",
      "text": "**Record:** 45-23-1 (+22.12u)\n\n**Last:** (CBB) Kansas +4.5 (1.5u) - Pending\n\n**POTD:** (CBB) Indiana ML at USC\n\n**Start Time:** 10:00 PM ET (Peacock)\n\n**Odds:** +105 (Caesars)\n\n**Units:** 1.5U\n\n**Reasoning:** Just when I thought I was out, they pull me back in.\n\nIt’s a Godfather quote that jumps top of mind when it comes to betting on Indiana basketball. That’s because after appearing all but dead in the water following a four-game skid, the team has responded by winning each of its next three contests. That includes an impressive 72-67 victory over then-No. 12 Purdue last Tuesday night. \n\nStill, I can understand the hesitancy to trust a Hoosiers (14-7) squad that is just 2-6 against Quad 1 opponents. \n\nWhile the shortcomings against quality opponents is most definitely concerning, a closer look at the matchup against USC provides quite a bit of optimism. Through 22 games, the Trojans (16-6) rank just 130th in offensive efficiency (1.078) and 97th in defensive efficiency (1.017). Now consider this: in 12 games against opponents ranked outside of the Top 100 in offensive efficiency, the Indiana defense concedes an average of 62.8 points on a  porous 37.4% shooting (26.6% from beyond the arc). Furthermore, the unit held 11 of those opponents to 42% shooting or less while limiting all but three to 33% or less from the perimeter. Not to mention, the Hoosiers were 11-1 in those contests, with each win coming by eight or more points and all but one by 17+. \n\nThe same improvement can be seen on the other end of the floor.\n\nWhile the Indiana offense has been pretty good overall—37th in offensive efficiency (1.156), 57th in scoring (81.5 PPG), 68th in field-goal percentage (47.0%) and 85th in three-point shooting (35.7%)—the unit takes it to another level against poor competition. In 12 games against opponents who rank outside of the Top 75 in defensive efficiency, the Hoosiers have averaged 88.8 points on a blistering 51.1% shooting from the field (39.2% from beyond the arc). While Lamar Wilkerson (19.4 PPG) and Tucker DeVries (14.3 PPG) should once again pace the team, its been the recent play of junior Nick Dorn (9.7 PPG) that has been played a major role in Indiana’s recent run of success—20.2 points per game over his last four games. They should have no issue penetrating a USC defense that hasn’t held an opponent under 69 points since Dec. 14. \n\nTurnovers should prove to be the difference in this one.\n\nOn the year, neither team has made a habit of forcing opponents into mistakes, with the Trojans ranking 135th in turnovers forced (12.3 per game), 180th in turnovers forced per possession (16.5%) and 240th in steals (6.0) while the Hoosiers enter ranked 239th in turnovers forced (11.0), 243rd in turnovers forced per possession (15.7%) and 312th in steals (5.4). However, while Indiana has done a great job playing clean basketball on the offensive end—56th in turnovers per possession (14.7%), 57th in opponent steals (5.7) and 58th in turnovers (10.4)—the same can’t be said about USC, which ranks 200th in turnovers per possession (17.0%), 265th in opponent steals (7.2), 268th in turnovers (12.7). If the Hoosiers can take advantage here, that could very well be the X factor.\n\nKeep the points, trust Indiana to win this one outright. \n\nBOL if tailing, and as always, please do so responsibly. One bet should not have you crashing out all over Reddit.\n\nTracker link: https://docs.google.com/spreadsheets/d/1P5YErUwS5fI-JqVXGYOP96Zr7TsHgaZaJq6tV8tDaGk/edit?usp=sharing",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qubl02/pick_of_the_day_2326_tuesday/o38zacd/"
    },
    {
      "created_utc": 1770075464.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 89 - 95 Profit: -6.25 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅❌❌️✅❌✅❌❌✅✅✅❌❌️❌️✅✅✅❌️❌️❌️✅❌️❌️❌️❌️❌️✅❌️❌️✅✅❌️\n\nTrabzonspor vs Fethiyespor, over 3.5 goals @ 2\n\nTrabzonspor are Turkey’s top-flight side with attacking quality capable of producing multiple goals, especially at home, and they’ve shown they can score freely in cup competition. Fethiyespor have also been involved in matches with multiple goals recently, particularly away from home. Historical goal averages in the cup and recent attacking performances from both teams suggest this fixture has the potential to be open and high-scoring, making Over 3.5 goals a possibility worth considering.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qubl02/pick_of_the_day_2326_tuesday/o38ytze/"
    },
    {
      "created_utc": 1770075255.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Tuesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qubl02/pick_of_the_day_2326_tuesday/o38y7l0/"
    }
  ]
}