{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 2/11/26 (Wednesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1r1gcvx/pick_of_the_day_21126_wednesday/",
  "target_date": "2026-02-11",
  "timezone": "America/Chicago",
  "collected_utc": "2026-02-11T00:03:09.360161+00:00",
  "comments": [
    {
      "created_utc": 1770768145.0,
      "author": "LolPropKing1",
      "text": "POTD Record: 223-172\n\nUnits Won: +96.79u\n\nLast Pick: Ryan3 U 3.5 Kills Map 1 (-139) ✅\n\nToday's Pick: **S**t**arry U 4.5 Kills Map 1 (-122)** 5u\n\nhttps://preview.redd.it/b1ynukztarig1.png?width=584&format=png&auto=webp&s=d360d8979103a763ef7ddf3e691f43601e122b91\n\nNote; if anyone needs help finding the pick or a place to bet esports feel free to reach out!\n\nLeague of Legends (LOL) | LPL 2026 Split 1 playoffs | 1:00 AM EST. | Teams: IG vs. OMG\n\n**Writeup:**\n\n* Extremely interesting game, LPL was split into 3 groups, many thought that the gaps between the groups were massive, especially between the top group and the bottom two groups. So far the playoffs results have left some serious doubts about that, as TES and IG from the top group both struggled against lower tier teams with TES barely surviving in a 5 game win against WE, and IG losing outright 3-1 as solid favorites. OMG are coming off some really good form ever since swapping out their jungler for re0 and beat EDG yesterday who were big -500 favorites in a 3-1 upset.\n* This is the final b05 to determine who makes the top group, both teams will be leaving everything on the line here. On one hand, I am a big IG fan and love Rookie he is my all time favorite player, on the other they look awful this split. However, I think this matchup should be significantly better for IG then the NIP matchup on paper, they have much better win cons imo, a better bot matchup, a better top matchup, and a winning mid matchup with Rookie>haichao who has always done historically very well against Haichao in the h2h. Re0 has also been getting away with invading and playing relatively disrespectfully quite a bit against EDG, however I don't think he can get away with the same things against Wei.\n* This pick is mainly banking on IG to win Map 1, their are some small cases this pick can miss if IG lose the map, but in general this will normally line up with the overall map winner. \n* With the above point, their are two reasons why I really like this line despite IG shaky form, IG are close to -200 favorites to win the map, while you are getting this line at -122, Starry is 0/9 hitrate in map losses this split so far averaging 2.11 kills per map loss overall. In map wins he has gone over in 5/9 of the match wins this split, but still gives 4/9 wins where he went under this line\n* OMG are also averaging the least kills in map losses of any team in the entire LPL at just 5.8 kills per map loss, meaning even if rounding this up to \\~6 kills per map loss, Starry would need to pick up \\~83% of them in a map loss on that trajectory while currently only averaging a 30.6% kill share for LNG\n* Think despite IG's struggles, tons of advantages coming in, they got a full day rest to scout an entire b05 from OMG coming in, they are higher seed and get draft advantage in the b05, they are the more experienced players and have clear advantages in individual players in the matchup. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r1gcvx/pick_of_the_day_21126_wednesday/o4pmkzf/"
    },
    {
      "created_utc": 1770766420.0,
      "author": "dreamchasing1",
      "text": "Record: 267-252 Net Units: -27.57 66-67 on 1.5u plays, 45-44 on 2u plays, 2-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Germany DFB Pokal] Hertha vs Freiburg\nLast pick: Hertha over 10.5 shots @ 1.80 loss\n\n\nEvent: Soccer/Football, [Italy Serie C] Union Arzignano vs Trento\n\n\nPick:  BTTS @ 1.90 - 1.5 units\n\n\nThis meeting has seen btts 3 times in their most recent games with a btts this season in the reverse matchup (2-2 draw). 9 out of 12 games have hit a btts at home for Arzignano, with Trento managing the same but in away games - 9/12. Both sides are also the biggest btts hitting sides overall in the league with 17/25 games hitting btts for the hosts and 16/25 games hitting btts for the guests.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r1gcvx/pick_of_the_day_21126_wednesday/o4phh8f/"
    },
    {
      "created_utc": 1770765735.0,
      "author": "micahpugh",
      "text": "POTD Record: 98 - 52\n\nLast POTD: Djokovic v Alcaraz o3.5 sets - W\n\nPick: Alexander Bublik ML vs Hubert Hurkacz (-140 odds via FD) 1U\n\nEvent: ATP Rotterdam Round of 16 7:30 A.M. CST\n\nH2H favors Hurkacz 6-1 in this matchup however the last matchup was in 2023 and Bublik has had a massive last 12ish months. Both players love playing indoors with Hurkacz slightly earning the edge in serving but Bublik likely the better baseliner on both the FH and BH. Hurkacz had a pretty lengthy time off last year due to injury and he is still yet to have multiple impressive showings in a tournament. I think Bublik will come out and move Hubie all over the court as well as serve well.\n\n[PayPal](https://www.paypal.me/micahpugh?locale.x=en_US)\n\n[Venmo](https://venmo.com/u/Micah-Pugh)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r1gcvx/pick_of_the_day_21126_wednesday/o4pfg9v/"
    },
    {
      "created_utc": 1770764824.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Wednesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r1gcvx/pick_of_the_day_21126_wednesday/o4pcqd0/"
    }
  ]
}