{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/16/25 (Tuesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/",
  "target_date": "2025-12-16",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-16T17:46:21.847485+00:00",
  "comments": [
    {
      "created_utc": 1765903291.0,
      "author": "coltysports",
      "text": "__POTD Record:__ 4 - 1 __+2u__\n\n__Previous Pick:__ Wyoming -4.5 ✅️\n\n__Event:__ Louisville @ Tennesee 7pm EST\n\n__POTD:__ Louisville +2.5                       \n\n__Reasoning:__ I enjoy watching both of these teams. I am taking the points here but believe LOU will win outright. \n\n__Bets:__ .5u on Louisville ML and .5u on Louisville +2.5 😂\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nucwk5h/"
    },
    {
      "created_utc": 1765902280.0,
      "author": "DaggyNC",
      "text": "Record: 0-0\n\nNet Units: N/A\n\nROI: N/A\n\nHockey | NHL | 7 P.M. EST | Anaheim Ducks @ Columbus Blue Jackets\n\nPick: Anaheim Ducks ML (+118)\n\nWrite Up: Despite being one of the best teams in the western conference, as well as one of the most improved teams relevant to last years performance, the Ducks are still consistently underrated on the road, leading to + lines in many of their road games, even against inferior opponents. The Ducks got their franchise goalie (Dostal) back off the injured list a couple games ago, and he’s looked solid as always - and I expect the trend to continue against a hit-and-miss Columbus line up.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuct1kh/"
    },
    {
      "created_utc": 1765897737.0,
      "author": "Laird87",
      "text": "POTD Record: 208-207, -78.43 Units\n\nCurrent streak: ❌❌❌❌\n\nLast 10: ❌❌❌❌✅❌❌✅❌❌\n\nWorst capper in here back with another very fadeable pick if you trust the data.\n\nToday's Pick:  Marist +1.5 @ Georgia Tech, +170, 1 Unit, 7:30 PM EST\n\nYou know who fucking sucks?  Georgia Tech basketball.  Marist is actually having a decent year.  They need to bring relegation to college basketball and Georgia Tech needs to leave the ACC in basketball because they can't keep up.  I love Marist to send all 12 fans home crying tonight.\n\nBOL, tail or fade! Tip Jar: [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nucdnca/"
    },
    {
      "created_utc": 1765897479.0,
      "author": "Ok_Ad6462",
      "text": "**POTD 2024:** 8-7\n\n**POTD 2025:** 0-0\n\n**Event: EFL (Carabao) Cup Quarter-final- Chelsea @ Cardiff City 12:00PM PST (8:00PM GMT UK Time)**\n\n**POTD: Chelsea ML and o2.5 total goals (-120) 1u**\n\n**Write Up:** A team not in the Premier League or Championship advancing to the EFL cup quarter finals is rare let alone making it to the semifinals. To put into perspective how big an upset Cardiff beating Chelsea would actually be, I looked up how many times a team from the third tier or fourth tier of English football has beaten a premier league team to advance to the semi finals since 2000. I could only find a handful of instances like Bradford City 2012/13 and Sheffield United 2014/15. Regardless, the point is that the gap in quality of play and talent is enormous between these two sides.\n\nI expect Chelsea’s young but talented front line to find a lot of success facing less stringent competition in the form of a Cardiff defense that routinely concedes goals to their football league 1 competition. Cardiff’s matches since the end of the October international break have especially seen no shortage of goals for them and their opponents with 3+ total goals in 9/12 games across all competitions during this period. Outside of the EFL cup, Cardiff’s defensive woes have gotten worse since the start of December allowing 10 goals in a 4 game span. If they get off to a fast start, I would not be surprised if Chelsea end up comfortably clearing the over by themselves in this game. \n\nAfter playing 4 matches in 10 days, Chelsea is once again expected to feature a heavily rotated squad @ Cardiff City who have played 4 matches in 11 games. Luckily for the Blues, Moises Caicedo is back from injury and likely to play a healthy amount of minutes in this game. Chelsea will also have the luxury of bringing their heavy hitters off the bench at the break or in the second half if they can’t put Cardiff away early. However, Chelsea’s depth on the back line is questionable for a champions league quality side, routinely allowing lesser opponents to find the back of the net when they’re not at full strength. This sets up nicely for a Cardiff City team that is averaging over 2 goals per game and close to 3 goals per game at home in the EFL1. Additionally, both teams have been very goal friendly in this competition. Over 2.5 goals has hit in all 4 of Cardiff’s EFL Cup games and both of Chelsea’s EFL Cup games respectively. \n\nChelsea: 4-3 @ Wolves, 2-1 @ Lincoln City \n\nCardiff City: 2-1 Swindon Town, 3-0 Cheltenham Town, 2-1 @ Burnley, 2-1 @ Wrexham\n\nCardiff should have some great chances to find the back of the net in this one but their inability to stop teams from scoring especially recently should be taken advantage of by a much more talented Chelsea team. Both teams’ defenses have several questions going into this game but I don’t expect Cardiff to have enough possession of the ball to test Chelsea’s defense and outscore them.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nucctcn/"
    },
    {
      "created_utc": 1765892618.0,
      "author": "AdBig9816",
      "text": "Record: 0-1 (-1.25u)\n\nNet Units: All plays to win 1u\n\nLast POTD: Miami Dolphins +3.5 (Loss)\n❌\n\nBASKETBALL | NCAAM | 11:00 AM / EST\n\nPick: Drexel -5.5 (-125)\n\nWrite Up: This is an efficiency driven play rather than a pace concern. Possession based models (AdjO/AdjD, efficiency margin) project this closer to Drexel -7 or -8, making -5.5 a playable number. Drexel holds a clear edge in half court defensive efficiency and is effective at limiting transition opportunities, which directly attacks Howard’s offensive strength. Howard relies heavily on pace, turnovers, and quick scoring, but Drexel’s ball security and shot selection reduce those easy points and force lower quality possessions. Even in a slower game, the efficiency gap should show over 60+ possessions, and Howard lacks the offensive profile to erase deficits quickly. This sets up as a controlled game where Drexel steadily separates rather than a one-possession finish.\n\nSorry about Dolphins yesterday, getting back today!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuby94j/"
    },
    {
      "created_utc": 1765891997.0,
      "author": "Section1ne0h4our",
      "text": "1-0, +0.95u\n\nLast 5: ✅❓❓❓❓\n\n(Previous play review at end of post)\n\nToday’s play:\n\nELC: Cardiff - Chelsea\n\nBTTS/o2.5 (-105) 1u\n\nToday we head to the English League Cup as Cardiff hosts Chelsea in what hopes to be a high scoring affair, between two high volume teams in a cup quarter final. We are looking at both teams to score with the total soaring over the 2.5 the bookies have listed. This smells like a match that could flirt with 4/5 goals and neither team defensively are particularly solid.\n\nFrom a Chelsea perspective, they’ve scored in 23 of 25 matches this season, and although defensively they have improved as of late, in this competition so far this combo has cleared 2/2. We lay a bit of risk here with Chelsea likely to play a stronger side with silverware on the horizon, but even their strongest side have shown the potential to leak goals this season.\n\nFrom a Cardiff perspective, they’ve cleared BTTS in 6 of their last 8, and went over the total 7/8. A lot of this bet is backed on the belief that Cardiff will be well up for this match mixed with the fact they concede a lot of goals themselves: they haven’t kept a clean sheet since September 27th, but have also scored in 8 consecutive matches within that timespan.\n\nHistorically (Despite it only being 5 matches over 15 years) this combo has covered 5/5 times - another fun historical fact: Cardiff OPENED the scoring in 4 of the last 5 matches despite losing all 5 - This marks that there’s a sign of historical open play between these teams. I do understand that history doesn’t account for currency, but we also know how history can play its way in this sport. I like Chelsea to win today 2-1 but wouldn’t be shocked if we see a 3-1/3-2 scoreline\n\n(Last play review:\nNFL: Miami @ Pittsburgh\nPittsburgh/Total +3.5/u45.5 (-105) 1u ✅\n\n(It got sweaty on the total near and around the end, but in reality this easily hit, left some meat on the bone with the spread but that’s the point of insurance)\n\nBOL if you’re tailing, and if not BOL in general!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nubwi12/"
    },
    {
      "created_utc": 1765886129.0,
      "author": "kab1218",
      "text": "PoTD records: 6-6  we gotta break this\n\nNet: -0.6\n\nPrevious: Man U v Bournemouth - Senne Lammens O 2.5 saves 1U @ -125\n\nLammens couldn’t stop anything for awhile there but he got some garbage time saves thankfully. Moving on. \n\nToday: EFL Cup 1pm MTN Chelsea @ Cardiff city. Chelsea to win and O 1.5 goals 2u @ -168\n\nTaking a safer bet here today with Chelsea beating a weaker side in Cardiff City and expecting more than 1 goal scored total. Chelsea’s 2 EFL cup games ended 4-3 and 2-1, while all of Cardiffs games have had at least 3 goals. Cardiffs are league One, two tiers below Chelsea. Even using backups Chelsea has more than enough quality to see this out. BOL if tailing",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nubiewh/"
    },
    {
      "created_utc": 1765884444.0,
      "author": "Far-Hovercraft1324",
      "text": "https://preview.redd.it/kilbl5u2xj7g1.jpeg?width=1320&format=pjpg&auto=webp&s=4eb97fa33d9cb82216f7709f062b6b1a80991ae3",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nubf11x/"
    },
    {
      "created_utc": 1765884388.0,
      "author": "Lyx97",
      "text": "Record: 16-5-2\n\nNet Units: +6.00\n\n*Prev Pick : Sheffield Wednesday vs Derby County : Over 2 asian line @ 1.61 (1u) --> Win*\n\nFootball | England National League | Truro City vs Wealdstone | in \\~8hrs\n\nWealdstone Asian Handicap 0 @ 1.77 (1u) (also Draw no Bet in some bookies)\n\nWrite Up : Going even further down the English ladder (didnt want to bet on EFL cup, since people have already given some of the leans which i had). Feel that these odds are a little too big to be missed.\n\nTruro lost the last seven matches in a row & have conceded 20 goals in those matches. Wealdstone lost only one of the last ten matches & also score atleast a goal on average + they beat Truro 2-0, earlier in this season. However, since they are playing an away, giving a benefit of doubt & going for a DNB.\n\nHope we continue the wins & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nubex57/"
    },
    {
      "created_utc": 1765881735.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 26-17-1\n\nSoccer\n\nLast Pick: Aston Villa ML @ 1.68 - WON\n\nLast Pick Write Up: A nice win. \n\nNow for today..\n\nPick: St. Gallen VS Sion - BTTS at 1.6 odds\n\nWrite Up: St. Gallen is hosting Sion today. I'm going with a bet based on trends. In their last 5 H2H meetings since 27/10/2024, BTTS has hit in 4 out of 5 times (most recent game in late Oct 2025 going 3-2 in favor of Sion). BTTS has hit in 6/8 latest Sion games. Both teams are running hot, with St Gallen recently beating top of the league team Thun and Sion having no losses in their last 6 matches (and has won the last 3). \n\nWhy keep rambling? I think both teams will put ball in net. Ball in net good.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuba1dv/"
    },
    {
      "created_utc": 1765877816.0,
      "author": "lordestros",
      "text": "POTD Record 6-3\n\n3 wins in a row!\n\nMontreal Canadiens vs Philadelphia Flyers at 7:00pm EST (NHL/Hockey)\n\nTrevor Zegras over 0.5 points (-160)\n\nTrevor Zegras loves to play against the Canadiens. He had 2 points in his last game against them this season(Flyers won 5-4) and has 8 points in 6 games vs Montreal (every game he had a point or more except for his first game as a rookie in 2021). He's also been on fire lately with 6 points in his last 4 games (11 in his last 10). Flyers won 3 out of their last 4 road games with 4+ goals so I expect them to put up a fight against a Canadiens team that has defensive lapses, shaky goalies situation and can also struggle at home (lost 3 out of their last 5 games).\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nub399p/"
    },
    {
      "created_utc": 1765876089.0,
      "author": "Rest_Few",
      "text": "Record: ✅✅✅\n\nPrevious pick: Fene vs Konyaspor o2.5 goals ✅\n\nNet Units: 1U\n\nEvent: Cardiff vs Chelsea\n\nPick: Btts or GG (1.80 odds)\n\nWrite Up: Another boom yesterday with the bet coming home in the first half ! That’s 3 straight wins now \n\nToday we head to Carabao Cup in England !!\nChelsea will travel to face League One leaders Cardiff in the Carabao Cup. Enzo Maresca has already confirmed there will be changes to the squad, which often levels the playing field in domestic cup ties especially away from home.\n\nCardiff have been extremely strong on their own ground. They’ve scored in 13 of their last 15 home matches across all competitions, averaging an impressive 2.69 goals per game. Their intensity, direct style, and confidence at home make them a dangerous opponent, particularly against rotated Premier League sides.\n\nChelsea still carry quality and should create chances, but with rotation expected and Cardiff’s excellent home scoring form, this has all the ingredients for a competitive and open cup tie rather than a comfortable away win.\n\nBOL!! \n\nWishing everyone green ticks today. Tips are appreciated if this adds value \n\n[Tip Jar](https://www.paypal.com/paypalme/FaisalGidado)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nub0g0o/"
    },
    {
      "created_utc": 1765875408.0,
      "author": "Noobdian1",
      "text": "Record: 99-84-5\n\nI’ve been at 99 forever wtf \n\nToday’s pick: South Africa vs Ghana +1.5 @1.95(2u)\n\nAlmost even odds on a handi on Ghana here is a steal in my opinion, I’m not even sure that SA can a beat a W here and the bookies price them winning by 2 evenly? It’s very sus and the odds are super bait yes. But if it’s a bait so be fucking it. Ghana have covered this handi 9/10 times and the only time they didn’t was against Japan which was a 2-0 loss.\n\nJapan are far superior to this South African side.\n\nThis is purely a value pick. Let’s see how it goes eh",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuazca4/"
    },
    {
      "created_utc": 1765873394.0,
      "author": "donjavogosca",
      "text": "POTD Record: 22-14, +5.6u, (ROI +12.4%)\n\nPrevious Pick: Philippines  to win -36.5 spread, 1.82, 1.5u ❌️, (last 5: ✅️✅️✅️✅️❌️)\n\nEvent: ABA2, Vojvodina Novi Sad - Podgorica, 16:30h\n\nPOTD: Vojvodina to win -10.5 spread, 1.80, 1.5u ❌️\n\nBoth teams play both the ABA2 and Serbian/Montenegro leagues, and the current form, standings, and quality are all on the side of Vojvodina.\n\nPodgorica played some close games in their home league; Ulcinj and Rozaje are all teams they should win easily against. They played the semifinals last year, lost to Buducnost, and if they keep up like this, this season is going to be significantly worse. Vojvodina won an important game against the table leader Zlatibor Cajetina, then lost to Sloga as guests, but showed that they can defend their home court, and they should win comfortably today.\n\n\nedit: too late now, but the time was actually 16:00.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuaw1jz/"
    },
    {
      "created_utc": 1765871395.0,
      "author": "Ralphjinasseater",
      "text": "Record : 15-14-2  \nNet units:(-1.72 units)\nLast pick: Derrick White under 5.5 Assists ✅\n\nPick of the day : Karl-Anthony Towns under 31.5 PR (-110)HR\n\nReason • \n\nTowns draws a BRUTAL matchup versus the Spurs defense that has been ELITE this season, especially versus Centers.\n\nEven with Wemby missing a ton of time, The Spurs have still allowed the 8th LEAST points to opposing centers and have also allowed the 6th LEAST points in the paint this season. \n\nKAT has gone under this line in 5/6 matchups against top 15 paint defenses WITH OG and has also gone under this line in 6/8 matchups versus top 15 center defenses this season WITH OG.\n\nKAT takes 66% of his shots from >10 feet, where the Spurs rank 2nd BEST defensively. \n\nKAT scores another 60% of his points from free throws, transition, PnR roll man and put-back and the Spurs rank top 7 defensively versus ALL of those play types.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuasnld/"
    },
    {
      "created_utc": 1765868410.0,
      "author": "Ghost_eggs",
      "text": "**POTD Record:** 3-1\n\n**✅✅✅**❌\n\n**Net Units:** \\+4.89\n\n**Previous Pick:** Ivica Zubac o 17.5 points (-104 on DK); 2 units ❌\n\n**Previous Pick Reaction:** Just a bad read on my part. In what I can only interpret as Ty Lue daring Ballmer to fire him, he fails to utilize Zubac offensively in Edey's absence. Zu only has 6 FGA and was hardly involved in the offense. Kicking myself for not sticking with my initial instinct pursuing his rebound line instead. Apologies to anyone who tailed.\n\n**Today's Event:** NBA 🏀 SA Spurs vs. NY Knicks (5:30pm PST)\n\n**Today's Pick:** Josh Hart o 1.5 Steals + Blocks (-132 on DK); 4 units\n\nIn the name of going with my gut, this is the first pick that stood out to me.\n\nHart is a pure hustle player and a good defender whether on-ball, on help defense, or in transition. While it doesn't always show up in the box score, lately it has.\n\nHe is over this line in 8 of L10, averaging 2.6 stocks per game over that span. And while he usually gets it done from steals alone (i.e., 2+ steals in most of those hits), I like the 2+ stocks line for a little added security.\n\nKnicks and Spurs have not faced off this season yet, but last season Hart was over this line in 2/2 matchups against the Spurs.\n\nThis pick also accounts for the importance and \"playoff-like atmosphere\" of this game, in which Hart is likely to see big minutes and elevate his game. For instance, in the Knicks' previous cup game against the Magic, Hart had 3 steals (and 1 block) despite ORL ranking 10th fewest turnovers per game and 7th fewest steals allowed to opponents per game (SAS, by comparison, ranks 13th and 10th in those categories, respectively). Hart also had 2 steals in the prior cup game against the Raptors, who are not especially turnover-prone.\n\nI should also note that the Spurs commit considerably more turnovers when Wemby is playing, somewhat surprisingly. As a team, they average 17 TOV per game with Wemby, and only 12 without.\n\nSo overall, I think Hart covers this line as he has done in 80% of his last 10 games including both previous cup games. I wouldn't be surprised if he gets it done on steals alone, but the over 1.5 stocks line is a bit more conservative.\n\n**Edited** to fix an error on time of event.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuangwa/"
    },
    {
      "created_utc": 1765867967.0,
      "author": "Dramatic-Fox-4826",
      "text": "**POTD Stats:**\n\n**Record**: 46/37  \n**Profit in Units**: 40.5u  \n**Average Odds**: 2.07\n\n**The pick:**\n\n**Sport**: Soccer  \n**League**: England - Non League Div One: Northern East  \n**Time**: 21:45 ( GMT +2 )  \n**Event:** Consett AFC v Silsden  \n**Pick**: 1X & Over 2.5 **@ 2.05**  \n**Stake**: 3 Units\n\n**Write up:**\n\n**The pick:**  \nI’m backing **1X & Over 2.5** here because the game fits a profile that usually delivers **goals with home-side protection**.\n\nThe odds structure points to a **slight home edge**, but not dominance — the kind of setup where the home team avoids defeat while the match stays open. In similar profiles, games rarely slow down, and once the first goal arrives, the tempo tends to increase rather than settle.\n\nFrom the goal perspective, this profile leans strongly toward **Over 1.5 as a base**, with frequent transitions into **3+ goal games**, especially in non-league environments where defensive control is inconsistent. Clean sheets are not a key feature here, which supports combining goals with a safer double chance instead of a straight result.\n\nRather than forcing a home win, the **1X gives protection**, while **Over 2.5** aligns with the natural match flow suggested by the profile and motive structure.\n\n**My Model in general:**  \nMy model is built around the idea that matches follow **recurring patterns**, not randomness.  \nInstead of predicting games in isolation, it groups matches by **odds profiles** and studies what *actually* happens when similar games are played.\n\nBy clustering historical matches with the same **home–draw–away odds**, I track how games usually unfold — goals, BTTS, scorelines, and game flow. From there, the model identifies **motives**: situations where teams are more likely to attack, trade goals, or avoid clean sheets.\n\nEvery pick comes from **data-backed profiles, not opinions** — combining odds structure, score patterns, and streak behavior to find spots where the market regularly repeats itself.\n\n***Il post more picks on the soccer thread!***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuamnjt/"
    },
    {
      "created_utc": 1765866176.0,
      "author": "awkward__fly",
      "text": "1-0-1\n\n\n+1  unit \n\n\nLast Pick Bettis Draw no bet (push)\n\n\n**Pick of the Day's Pick of the day:**\n\n\nChelsea vs Cardiff BTTS (+100)\n\n\nI was going to tail one of the two people who recommended Jacksonville State for my pick of the day, but then I saw background_law8385's pick again and I can't resist tailing a second time in a row; the first time was a push. Cardiff City is averaging 1.8 goals per game at home and while Chelsea is the stronger team, they have been known to concede goals. While background_law added he thinks Chelsea will win, I think this is the play.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuajbw3/"
    },
    {
      "created_utc": 1765863596.0,
      "author": "wes2211",
      "text": ">**Record:** 122-99\n>**Net Units:** +28.48 units\n\n>**Curling** | **Canadian Open** | **4:00PM EST**\n\n>**Pick:** Team Kang ML @ 2.45\n\n>The fourth slam of the season begins Tuesday morning and this match features Team Kang vs Team Hasselborg. Team Hasselborg have not played many events so far this season and I think that will hurt them early on in this event. Team Kang are 10-7 against elite teams this season while Team Hasselborg are 6-5. These teams played just last month in Tahoe where Kang won 6-1.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuae9q3/"
    },
    {
      "created_utc": 1765863511.0,
      "author": "Background_Law8395",
      "text": "**Record**: 4-1-1 (Wins-Losses-Pushes) (+5.25u)\n\n**Last picks**: Rayo Vallecano vs Real Betis Draw no Bet (-120) 2u **PUSH**\n\nKind of what I expected to happen, better to get a push than a loss taking moneyline. Shoutout to the guy who said to take over 10 corners, that was a great pick.\n\n**Event**: EFL Cup: Cardiff City vs. Chelsea 12:00pm PST\n\n**POTD**: Both Team to Score: YES (-106) 3u\n\n**Write up:**\n\nCardiff have been on a tear in the Championship this season, sitting in first place with a record of 13-2-4. On average in the Championship they score 1.89 goals per match and concede 1.05. They've only lost 2 matches in 10 games at home, scoring 2.6 goals per match (which is insane). They're on a 5 game winstreak in the Championship and have scored 3 or more goals in 4 of those games and BTTS hitting 3 times. They (somewhat) shockingly beat Premier League club Burnley earlier in the competition 1-2 away, so they've shown they can score against Premier League teams. Now, the past doesn't mean much when the last matchup of these teams was almost 7 years ago, but BTTS has hit in all 4 matches these clubs have ever played against each other. Cardiff basically bag goals for fun right now.\n\nChelsea on the other hand have been in a bad bit of form recently, going 2-2-1 in their last 5 Premier League Games and only scoring 6 goals. In their previous 2 EFL cup games, Chelsea conceded a goal to Lincoln (who are third in the Championship right now) and conceded 3 to the most fraudulent team in the Prem, Wolves. BTTS has hit in 3 of their last 5 games, most notably conceding 3 away at Leeds. With Palmer most likely starting to get some minutes, and probably starting Esetvao as well, I can see Cardiff hitting a big counter at some point. \n\nIn my mind Chelsea undoubtably will this game, but they have so many moments of weakness in their backline that I think Cardiff can get away with 1 here, especially given their superb form as of recent.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuae3b7/"
    },
    {
      "created_utc": 1765862344.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 29-15 (+17U)\n\nLast Pick: SGP Kings +1.5/Under 5.5 goals (+140) (1U) 🙅‍♂️\n\n[SGP write up](https://www.reddit.com/r/sportsbook/s/4lRPvKPQCC)\n\nWell we had the under right but the Kings absolutely collapsed for us late in the 3rd. Maybe I got too greedy adding that leg.\n\nEvent: Louisville @ Tennessee (NCAAB) (6pm central)\n\nPOTD: Under 158.5 (-110) (1U)\n\nWrite up:\n\nPeople have seen these Louisville games skyrocket over totals and assume this is the right call. However I see this being much lower than people expect. Here is why. First of all we have seen the line flip from Louisville -1.5 to Tennessee -1.5, and if I’m being honest I think Louisville is the much better team here. HOWEVER… if Tennessee is going to win this game (and I believe they for sure can) it’s going to come down to slowing this game down and grinding out a defensive win. Tennessee just doesn’t have the depth and scoring ability to keep up with Louisville in a track meet.\n\nLouisville likes to get out and play fast, evident in their 39tg fasted adjusted tempo per Kenpom. Tennessee prefers to slow it down ranking 223rd in tempo. As I mentioned, Tennessees offense lags but their defense is elite. We know Louisville lives and dies by three. They attempt the most threes per game in all of college basketball. However, their 37.5% three point average drops to 30% on the road and Tennessee brings the 53rd best three point defense holding opponents to just 29% from behind the arc and just 45% from inside the arc (24th nationally). Tennessee prefers to play the opposite and actually ranks 241st in three point attempts per game, connecting on 34% of those attempts. Louisville brings an elite defense as well holding the opponents to under 30% from downtown but the nations 9th best two point percentage defense holding opponents inside the arc to just 43%!! Louisville is 58th in possessions per game but tennesse is 211th and will look to slow the game down. Both teams are also top 20 in opponent effective fg%. Not to mention louisvilles 94 ppg average is bolstered by an insane 100 ppg average at home against inferior opponents but that total drops to 80 on the road and this will be there second true road test outside an ugly loss to Arkansas in which they were just pedestrian from three. Ark also loves to play fast and this will be a different story in Knoxville. The cardinals will also come in here defensive minded as they look to secure a road win without letting up a 20 point halftime deficit to come back from like what happened in Fayetteville. If Tennessee is going to win this game it is going to have to be a 60 minute sound defensive effort and a much slower pace than Louisville likes to play at with plenty of contention at the three line. I don’t see this getting into the 80s tomorrow. Let’s get back on track. As always, cheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nuably2/"
    },
    {
      "created_utc": 1765859166.0,
      "author": "UserMSDGCRS",
      "text": "Record: 1-1\n\nStreak: 1W\n\nNet Units: -1u\n\nLast Pick: Troyes ML (+100 DK) 2u to win 2u ✅\n\nEvent: Soccer England National League Wealdstone @ Truro City 12/16 11:45 AM\n\nPOTD (12/16/25): Wealdstone Moneyline (+140 DK) 2u to win 2.8u\n\nWrite-Up: Disclaimer, I’ve never watched the England National League, but based on stats and current form, this pick makes sense to me. Please don’t tail thinking I am an expert on this league.\n\nTruro City sit bottom of the table in 24th and are on a 7 game losing streak in all competitions, scoring just 3 goals in that span. Wealdstone is mid table, but look to be playing okay. They are in touching distance of the playoff spots, but will need to continue gathering points.\n\nTLDR: If I have +140 odds to bet against the worst team in the league who are on a 7 game losing streak, I’m going to do it.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nua4g2a/"
    },
    {
      "created_utc": 1765858872.0,
      "author": "IAmLeftHandedOk",
      "text": "Pick of the Day – 12/16/25 (Tuesday)\n\nRecord: 0–0\nUnits: 2 Units\n\nToday’s match: Cardiff City vs Chelsea (EFL Cup)\n\nPick: Cardiff +2 (-120) BET 365\n\nAlright listen up people. No ChatGPT shit. We’re taking Cardiff +2 at (-120) vs Chelsea.\n\nWHY?! \n\nBecause they’re strong at home and will be facing Chelsea’s B Squad. Chelsea has been very inconsistent across competitions and normally play DOWN to their opponent. They should control possession, but without their strongest lineup, pulling away by three goals feels unlikely.\n\nNot to mention Chelsea -2 goals is +200. \n\nThis confirms Cardiff +2 is great value. Bet365 has already moved the line from -105 to -120. \n\nThis sets up as a narrow Chelsea win or a draw. Losing by one, forcing penalties or a push if Chelsea win by exactly two. \n\nRolling with Cardiff +2. BOL and bet responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nua3rnw/"
    },
    {
      "created_utc": 1765856724.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 9-6 (+3.02u)\n\nMonday’s Pick- ✅Devon Achane o 111.5 rush+rec yds -114 (1.14u to win 1u)\n\nTuesday’s Pick- Minnesota Wild ML vs Capitals -122 (1.22u to win 1u)\n\nA fun matchup between two good teams. We don’t have any goalies starts confirmed yet, but the Capitals starter Logan Thompson has started 4 straight and he got a bit ruffed up in his last game, so there is a good chance that Lindgren gets a start, but that’s not confirmed. If that comes to fruition, I think the odds will swing a bit to the Wild.\n\nSpeaking of the Wild, they’ve won 4 in a row. It’s pretty likely that they will have Gustavsson starting and Minnesota is 11-3-4 at home this season.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9yhuz/"
    },
    {
      "created_utc": 1765856526.0,
      "author": "EthicalGambler",
      "text": "**My Record:** 72-62-3 (+2.72u)\n\n**Today’s Pick:** De'Aaron Fox o1.5 Steals (Knicks vs Spurs)\n\n**Odds:** +130\n\n**Units:** 1.0\n\nTip off is 5:40 PST. Flipping back to the defense system for Fox. He hit this on Saturday and simply put he has not gone more than 3 games in a row where he did not have 2+ steals this season. \n\nGiven that this game is the NBA Cup final I expect it to be as competitive as it it gets at this point in the season. \n\nShould this not hit I will double my units and play it again on Thursday. \n\n**Previous Pick**: Jonas Valanciunas o7.5 points (Nuggets vs Rockets) ✅ \n\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/EthicalGambler-U6cnjV?utm_source=mdembed&utm_campaign=EthicalGambler) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9xze3/"
    },
    {
      "created_utc": 1765855831.0,
      "author": "Best_Accountant_5471",
      "text": "Record: 51-36 (+28.1 units)\n\nLast 10 (most recent on right):  ✅❌❌❌❌❌✅❌❌❌\n\nLast Pick: Liam Thompson (Derby County) 1+ tackle vs Sheffield Wednesday + Jesus Ramirez (Nacional) 1+ shot on target vs Tondela ❌\n\nEvent: China WCBA 🏀\n\nPick of the Day: Shaanxi Tianze (W) vs Jiangsu Phoenixs (W) U162.5 points 1.2 units to win 1U @ 1.83 (Bet365)\n\nWrite-up: I don’t even know what to do anymore, Thompson doesn’t tackle for the first time in NINETEEN matches. 19. 18+1. It’s just wild, he scores for the first time in two years but as soon as Sheffield would take him on he would run off shying away from every challenge. Rodriguez got two SOTs (and a goal) in the wildest match I’ve ever watched, an even better version of Watford-Leicester 2013.\n\nI’ve left the football before the football has left me, how the mighty have fallen (I also may have lost my mind tipping women’s Chinese basketball). I’m not going to act like I watch this league but I know basketball and most importantly the stats make this play worth it. Shaanxi are playing at home and are the heavy underdogs coming into this game against Jiangsu. The line is therefore a lot higher than expected but it doesn’t reflect the reality of the situation. Shaanxi is the team that plays the slowest in the league at home whilst the Phoenixs are generally pace-compliant on the road which means that we can expect a low scoring game with low possessions if all goes to plan. 17/19 (89%) of the home team’s matches have cleared the line at home whilst 7/8 (86%) of the away team has also gone under. Their H2H isn’t meaningful considering they’ve only played once since 2019 but that match was last year and it featured just 132 points. At these odds, all I’m seeing is value. Considering the run I’m on everything will probably go against my research so there’s that to consider. BOL !\n\nhttps://preview.redd.it/xt28hplwjh7g1.jpeg?width=1179&format=pjpg&auto=webp&s=9ab8278ae4810f568992b0cba490261f923ea416",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9w6xr/"
    },
    {
      "created_utc": 1765854352.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 21-14 (+4.72u)**\n\nROI: +10.04% \n\nLast POTD: Pending: NFL De'Von Achane Over 16.5 Rushing Attempts -131 (2.50$ TO WIN 1.90$)x\n\n**POTD: NBA Cup Final: San Antonio Spurs +5.5 & Over 225.5 Total Points +129 (1U to win 1.29U)**\n\nWrite up: Lost the last 5, my apologies. Changing it up. I have received a lot of messages about the model, the ROI, EV, and the SD (Standard Deviation). It seems that a lot of reddit users would like to see the model's + odds and plays that the model can find that has positive EV value. That being said, I played around with the model for the past few hours, inputted some new information, so here we are. I wanted to play Spurs +2.5 & Over 228.5 together, but I have to keep the odds under +200 per Reddit's rules. I will also be parlaying two picks each POTD moving forward because it allows for you all to tail the parlay or individually. Let me know what you all want to see moving forward and if there is anything I can do to help!\n\n• ⁠EV Information: Win probability for the Spurs at +2.5 is 57% vs 52.4% implied at -110 - EV on 1 unit = (0.57 × 0.91) − (0.43 × 1) ≈ +0.09 units (about +9% ROI)\n\n• ⁠Personal Information: Public seems to really like Knicks in this one, probably because of how they have been playing/recent form - The Spurs are well rested, and coming off a huge W against OKC where Wembanyama was on restricted minutes\n\n• EV Information: Looking at efficiency and tempo, the projection is around 232.5 for the game - With the current line being at 228.5, which is 4-5 points lower, SD = 10 points which gives the over a 0.3-0.4 edge - 55% hit rate vs. 52.4% implied number\n\n• Personal Information: I think we are seeing Vegas undermine the Spurs offense - they have such a big ceiling when Wemby plays - Knicks on the other hand, between their man guys Brunson, Towns, Anunoby - they will be leading the way for the Knicks in scoring.\n\nPOTD History: https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn\n\nBOL!\n\n**POTD: NBA Cup Final: San Antonio Spurs +5.5 & Over 225.5 Total Points +129 (1U to win 1.29U)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\nhttp://buymeacoffee.com/claysmiith\n\nhttps://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9s7w8/"
    },
    {
      "created_utc": 1765853856.0,
      "author": "cedarrapidsiaus",
      "text": "POTD record: 49-32  \n\n\\+16.18 units\n\nLast Pick: NFL 🏈 Atlanta Falcons vs. Tampa Bay Buccaneers. 8:15 p.m. E.T. USA. Buccaneers Team Total OVER 23.5 points (-126) Draft Kings. 5 Units ✅\n\nToday's Pick: NBA 🏀NBA CUP CHAMPIONSHIP San Antonio Spurs vs New York Knickerbockers (neutral site in Las Vegas) UNDER 230.5 (-110) Betonline. 1 Unit\n\nTwo teams here that can put up a lot of points. Total has been bet up from 227.5 so it may continue to rise given the current trend so if you share similar beliefs on this pick you could risk waiting for better odds.. However, IMO this number is too high for a championship game. I expect the referees to swallow their whistle more  and allow for more physicality (which they have for every cup final in the past). Players giving more effort usually leads to more gassed players, more turnovers, more missed bunnies/total shots than normal, etc. A lot of factors that help usually bode much better for the under than the over.\n\nKnicks have some intense perimeter/backcourt defenders like Hart, Bridges, OG, and the Spurs have Castle on their end to lockdown. Towns and Mitchell can provide Defense on the frontcourt end for New York, While Wembanyama is the best defender in the NBA and Kornet provides big interior size when he's off the court for San Antonio.\n\nMiles McBride being out is an additional slight help to the under IMO.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9qv3f/"
    },
    {
      "created_utc": 1765853267.0,
      "author": "More_Reflection_26",
      "text": "POTD Record: 206-159\n\nUnits Won: +92.73u\n\nLast Pick:  Frozen O 7.5 Headshots Map 1(-133) X\n\nToday's Pick: **Ex-Betera Map 1 ML  vs. GUN5 + O 18.5 Rounds (+110)** 5u\n\nTime: 1:00 PM EST. | League: Nodwin Clutch Series\n\n\\*If anyone needs help finding the pick or where to bet esports feel free to reach out!\n\nWriteup:\n\n* Betera have been on a really good run of form recently, they got dropped by Betera (hence the ex-Betera) and have been looking very good since that happened going 6-2 in their last 8 matches with a map score of  14-7. On top of this, in their last 15 series Betera have won their map pick in 13/15 of them. They have a very strong map pool atm with only one map below 50% winrate and a ton of reps on all maps as they have been very active recently and this new lineup has been looking increasingly good and facing very strong/active tier two competition while doing it including betBoom, 500, BIG, EYEBALLERS and more\n* GUN5 have been much less active team overall and have also struggled a bit the last 3 weeks losing to K27 3 times and 2-0'd by Sashi in a complete stomp, with their only wins coming against WW who aren't a serious team and are ranked outside the top 100 atm. They haven't been facing many hard teams outside of Sashi in the last month and a half I really think a slow start could be on the table for GUN5 in this one\n* GUN5 are the higher seeded team, they got a playoff invite directly while ex-Betera qualified/played to get here, last Nodwin Clutch Series, the playoff invite teams picked their map second in Round of 16 in 8/8 matches meaning GUN5 should pick their map 2nd, meaning Betera get first choice. Interestingly enough, we saw invited teams underperform expectations at Nodwin 2, with non invited teams going 4-4 in the round of 16 with a 9-8 map score overall while generally being lower ranked\n\n**Projected Veto:**\n\n* Betera ban Nuke, GUN5 ban Overpass\n* Betera pick Train/Dust 2\n\n**Train Stats:**\n\n* Betera are 57% winrate on 23 maps of Train L3 months, 5-4 in the last month\n* Betera are 10/11 hitrate on O 18.5 rounds on Train in 2025 with this roster iteration\n* GUN5 are 36% winrate on 11 maps of Train L3 months, 0 games last month. Least played map and lowest winrate by far \n* GUN5 15/15 hitrate on O 18.5 Rounds on Train in 2025,\n\n**Dust 2 Stats:**\n\n* GUN5 52% winrate on 23 maps of Dust 2 in the L3 months, 4 map loss streak\n* Betera 65% winrate on 31 maps of Dust 2 in the L3 months, 3 map winstreak\n* GUN5 19/20 hitrate on O 18.5 Rounds on Dust 2\n* Betera 15/20 hitrate on O 18.5 Rounds on Dust 2, mainly when they start CT side (not their map pick) however and also not expecting them to pick Dust 2 here",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9p84k/"
    },
    {
      "created_utc": 1765853132.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 14-9-1 (Avg Odds +127)\n\n**Previous Pick:** Bruno Fernandes to Score or Give Assist (+100) ✅️\n\n**Today's Event:** EFL (Carabao) Cup | Cardiff City vs Chelsea (12:00 PM PST)\n\n**Pick:** Estevao ATGS (+180) 1.0 unit to win 1.8 units\n\n**Write Up:** What. A. Game. 8 total goals and really could have been more. Bruno cashes for us with an assist in the 1st half stoppage time and then scores a lovely free kick goal in the 2nd half for good measure. Great game to watch and even better that our pick cashed sweat free. \n\nToday we've got a spicy +180 odds pick, as we head to Wales as Cardiff host Chelsea in an EFL cup match. Cardiff is first place in League One, which confusingly is actually the third tier of English football. They are the lowest tier team still in the EFL cup and I expect them to throw everything they can at Chelsea here in front of their home crowd. So I really don't think they'll park the bus and only play defense. They will know they need a few goals to get by here. This will be Cardiff's 6th game in 17 days, an absolutely brutal schedule, and they do not have nearly the squad depth that Chelsea does. They've also conceded 10 goals in their last 4 games and are going to have another tough test today.\n\nChelsea on the other hand have almost an entire 2nd squad that could probably compete in the Premier League (certainly could beat Wolves). Coach Maresca has emphasized resting his starters in these cup matches and I would not be shocked if the starting 11 today is 11 entirely different players than their last match over the weekend. Even with that expectation, Chelsea are still -400 favorites away against the team two tiers below them. \n\nQueue Estevao. The 18 year old budding Brazilian superstar. This lad is going to be special. Up until a week ago where coach played him for just the first half of a few EPL matches, he scored a goal in 7/7 of the matches he started for club and country. Most of his starts for Chelsea have come in Champion's League and the EFL cup, having a great game in his last EFL cup match against Wolves where he scored a 41' goal. There's always a risk, but I don't see a world where Marecsca keeps him out of the lineup today, and he is very likely to be the best player on the pitch for either side. \n\nI'm expecting an end to end match and a lot of ball control for Chelsea as their 2nd team and fringe starters fight for more 1st team playing time. I expect Estevao to lead this charge and I love the odds we're getting for it. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9ouct/"
    },
    {
      "created_utc": 1765853019.0,
      "author": "tennisfanatic101",
      "text": "💎POTD: Spurs ML\nOdds: +116 on FanDuel\nWager: 1.5 Units\n\nRecord: 5-3\nNet Units: + 1.90 ✅ \n\n🏀, Spurs vs Knicks, 12/16/25 Tue, 8:30 pm Eastern Time\n\nExplanation: Both offenses are top of the league no doubt, but the difference-maker is San Antonio’s one-two punch  is with De’Aaron Fox (23.9 PPG ) and Wemby (25.8 PPG, 12.6 RPG, 3.5 BPG). Wemby being a blocking machine and rim protector is going to be huge for this game. And not to mention wemby is going to be doubled sometimes on offense. Dish and shoot for the Spurs, and the Knicks are going to have a challenge with Wemby’s elite rim protection. \n\nNew York is already down key guard depth like Miles McBride (out) (and Shamet out). I see the Spurs taking this game over down the stretch.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9oivp/"
    },
    {
      "created_utc": 1765852806.0,
      "author": "Ned_Pepper",
      "text": "Darts 🎯- 2026 PDC World Championship \n\n🌶️ Overall: 52-33-1\n\n2026 PDC 🎯 World Championships: 1-1\n\nPrevious: \n\nMadars Razma (-161) v Jamai van den Herik ✅ \n\nMervyn King (+120) v Ian White ❌\n\nPOTD: Ricardo Pietreczko (-136) v Jose de Sousa\n\nAfter a few days off, lookin’ to bounce back and catch a little heat — and to do so, I am happily locking in current world #33 Ricardo “Pikachu” Pietreczko to defeat current world #73 Jose “the Special One” de Sousa. \n\nSeemingly each data point and factor I tend to look at when capping a 🎯 match points in favor of Ricardo, which does beg the question, why are the odds so close. I refuse to be deterred however, and believe Pikachu will win the this match for a few reasons. \n\nHead-to-head, Ricardo is 3-0 in their last 3 dating back to 2022, including a 6-4 victory this year back in April. Ricardo also has been trending upwards & quite well on the PDC Order of Merit, achieving a career best top 33 ranking. De Sousa, on the other hand, who was the Premier League of Darts runner-up back in 2021, has continued to plummet, earning just $59k on tour in the past calendar year. \n\nWinner of this one has a fairly favorable draw in the bracket as well, with the victor taking on the winner of Fallon Sherrock/Dave Chisnall in the next round, with the winner likely being a decent-sized favorite in the following round, as the 🇸🇪 Andreas Harryson eliminated world #12 Ross “Smudger” Smith. \n\nNot much more for analysis on this one. Locking in the slightly favored Pietreczko, who owns the H2H record and is in vastly better form at this time. After Pikachu wins this one, got my eyes on a match for Wednesday, and it is off to the races! 🌶️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9nxgq/"
    },
    {
      "created_utc": 1765852575.0,
      "author": "asakura6900",
      "text": "PoTD 3-5\n\n\nPDC Darts World Championship\n\n\nPaolo Nebrida +1.5 sets @ +100/2.00 vs Scott Williams\n\n\nFirst Potd in a long time.Really like how the bookies are underestimating Nebrida here.We saw how good he was last year in this very same tournament and how he carried the Philippines last world cup of darts.Yes Scott is ranked 36 in the world but he found little success this year.I personally believe Nebrida can take him out.\n\n\nBoL and sorry for the short writeup.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9naep/"
    },
    {
      "created_utc": 1765852427.0,
      "author": "Vander_chill",
      "text": "**Been away for a while, but also been waiting for a good pick for a 100th win.  Full disclosure, I was convinced on this pick after listening to Steve Merrill from Wagertalk.  He likes the MoneyLine at plus money, but I’m being conservative on the Alt-line +3.**\n\n**POTD Record:**  99 – 63 - 10\n\n**Previous:**  Arsenal vs Brentford - Both teams score NO & Real Madrid Draw no Bet vs Athletic Club – WINNING!\n\n**New Event:**  NCAAF Veterans Bowl – Troy vs Jacksonville State\n\n**Pick:**  Jacksonville State +3 (Alt line) @ 1.75 (Usual 3 units)\n\nBoth of these Alabama based teams will be playing at a neutral site in Montgomery, Alabama for the Veterans Bowl.  The line has moved from Troy -3 to -1.5 in this one as Troy’s QB Goose Crowder has been upgraded to “probable” due to an ankle injury.  This should not matter much as both QB’s have very similar stats and share identical 130 QB ratings.  This matchup should and will come down to the run game.\n\nIf this was a regular season game Troy would have a slight edge anyway.  However, as this is a bowl game and there will be opt-outs as well as other changes to consider, the edge should sit with the most consistent team.  That is, the one that is not undergoing many drastic personnel changes. \n\nTroy averages 99 yards per game and 2.8 yards per rush, which is not great.  Take away from that their #1 starting running back Tate Meadows has opted out of this bowl game, and their starting DE Jackson has also opted out and they have several injuries on offense as well. \n\nMeanwhile Jacksonville State is a run first offense that runs the ball 47 times a game and averages 259 rushing yards per game which represents about 67% of their total offensive yards per game.  They also average 5.5 yards per carry.  Although their passing game is not great at all, there is little to no question they will dominate the line of scrimmage with their rushing game.\n\nJacksonville State is losing an OT to the transfer portal and have a few injuries of their own but nothing that will stop their rush attack which is the difference in this game.\n\nThe selling point here is that Jacksonville State will most certainly have the rushing edge in this bowl game, are coming in as underdogs, and will play in a neutral site inside their home state with quite a bit of support from their local fans.  Makes for a compelling pick.\n\nLet’s get #100!!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9mvmb/"
    },
    {
      "created_utc": 1765852374.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 64-30-1 (+76.25u)\n\n__Previous Pick:__ [__*Pending:*__ De’Von Achane o78.5 rushing yards (-110), 4.12u](https://www.reddit.com/r/sportsbook/s/BWa7cKDTLJ)\n\n__Event:__ Troy vs Jacksonville St 9pm EST\n\n__POTD:__ Jacksonville St ML (+120), 2 to win 2.4u\n\n__Write Up:__ It’s not Auburn vs Alabama but 2 Alabama teams are playing in Birmingham, Alabama in the IS4S Salute to Veterans Bowl, as Troy (8-5, 6-2 in Sun Belt) takes on Jacksonville State (8-5, 7-1 in CUSA). This bowl has been one of the most underrated bowls for years, with 10 of 11 being decided by one score. Both these teams finished as runner-up’s in their conference championships. Troy didn't have a prayer against the James Madison run game in the conference ship. JMU ended up with 318 yards on 42 carries for an average of 7.6 ypc. That run defense is going to be a problem vs a Jax St team that has one of the best run games in the country, more on that later. Troy is in its 3rd bowl game in four years, & its first since Gerad Parker took over. Troy went 4-8 on his first season as coach, but quickly turned them around this season. The Trojans don't do anything particularly well, they’re missing key players, & they're banged up, but they're a tough team. As for Jax St, they made it to back to back Conference USA championships this year. After winning last year, this year they fell to my Alma mater Kennesaw St, despite beating them in their first matchup earlier in the season. Jax St made the move up to FBS in 2023 & have been incredibly consistent, winning 8+ games in 3 years in a row. They had a tough blow this past offseason, losing their Head Coach Rich Rodriguez to West Virginia. But new head coach Charles Kelly came in & picked up right where Rodriguez left off. Jax St is a blast when the offense works. It didn't in the CUSA title loss to KSU, but with a win, it will come up with its third 9 win season in a row since moving up to the FBs ranks. It's also the 3rd straight bowl appearance. Big game for both teams to end the season strong. But not all players will be participating in this one. Here are the players each team will be without & why:\n\n__Troy key players out:__\n\n__Starting CB Kaleno Levine - NFL Draft:__ 2nd in passes defended on team (5), 2nd in tackles among CB’s (41). __Starting RB Tae Meadows - Transfer:__ Leading rusher with 695 yards, 159 carries, 4.4 ypc, 6 TD’s. __Starting C Paul Bowling - Transfer:__ One of highest rated OL on team. __DT DJ Jackson Jr- Transfer.__ Averaged half snaps per game. __Starting LT Elijah Prather - Injured.__ Out for half season. __Starting RT Garner Langlo - Injured.__ Out for half season.\n\n__Jax State key players out:__\n\n__Starting RT Reggie Jackson - Transfer.__ Started 11 games. __LG Adrian Gumm - Injured.__ Missed CUSA ship. __CB Tyrin Taylor - Injured.__ Missed CUSA ship.\n\nThis is going to be one of the best non-playoff bowl games this season as there are only 3 players total on both teams that are sitting out for the portal, one of the fewest amount of all the bowls. The only player hitting the portal for Jax St is their RT, but it shouldn’t affect one of the best run offenses in the nation. __Jax St had the 2nd most rushing yards in the nation this season (3,354), averaging 258 per game.__ They have one of the RB’s in the nation, the stats prove it. __All American running back, TCU transfer Cam Cook leads the nation in rushing yards with 1,659 on the season, rushing yards per game (127.6), 101 broken tackles, & 52 explosive runs. He is destroying defenses averaging 5.6 yards per carry & has 16 TD’s on the season. He is one of just 4 RBs this season averaging over 2.00 Scrimmage Yards per Team Play this season.__ The dude is a monster & this weak Troy run defense won’t be able to stop him. Troy just allowed James Madison’s RB Wayne Knight to run for 212 yards on 21 carries & 1 TD. __Troy has allowed 192.1 rushing yards per game, 115th in the NCAA. Their biggest issue is tackling, as they have a 59.6 PFF tackling grade, 112th in NCAA.__ That’s going to be a problem vs Cam Cook who is almost impossible to be brought down with his 101 broken tackles on the season. Cook has been most successful this year with power runs from the pistol or offset gun formation, which is a gap scheme. __Troy has been torched vs gap schemes runs this year, allowing 5.3 yards per carry (109th).__ Jax State’s spread offense creates light defensive boxes. __62% of Jax St’s plays have been against a light box. Troy run’s a 3-3-5 scheme, which is naturally a light box & they have gotten wrecked with it, allowing 6.0 yards per carry to RB’s when in a light box (108th).__ Troy has only have 2 teams faced top 10 in run rate & rushing yards this year in Old Dominion & James Madison & they lost both games. OD is 10th in run rate (61.38%) & 8th in rushing yards per game (234.4). They beat Troy 31-0 rushing for 351 yards & 3 TD’s. JMU is 9th in run rate (61.61%) & 6th in rushing yards per game (240.8). They beat Troy 31-14. Jax St also has a mobile QB in Caden Creel who has 1,085 rushing yards (2nd among QB’s, 23rd in NCAA) & 684 yards after contact is (2nd among QB’s), & had 7 rushing TD’s. Creel has an 8/4 TD/INT ratio with a 60.7% completion rate. Creel didn’t even play until Week 5 this season. Troy’s defense will have their hands full with Creek & Cook.\n\nTroy’s QB Goose Crowder left last game on crutches & is questionable but has practiced & most likely will play banged up. Crowder had just a 58.9% completion % with an 11/5 TD/INT ratio. __He leads a Troy offense that ranks 111th in success rate.__ They are without their starting RB Tate Meadows who entered the transfer portal. Meadows was their workhorse back. Even with Meadows, __Troy averages the 2nd lowest yards per carry in the nation averaging just 2.4 ypc.__ Their backup Lovett has just 317 yards on 81 carries this season on a  weak 3.9 ypc & 2 TD’s. He’s much less explosive with a longest rush of just 22 yards. __Troy will be without 3 starting offensive lineman which is a disaster for an offense that leads the nation in sacks allowed with 57. The next closest team entering the bowl season was Ball State with 49. Troy ranks 126th in pressure rate allowed. Jax State ranks 32nd in pressure rate generated. The offensive line struggles to block (126th in front seven havoc) & that’s where Jax State’s defense excels (43rd in front seven havoc, 31st in line yards).__ Troy is going to have to pass since their ground game is horrible, they’ve passed a ton ranking 23rd in pass % the last 3 games, yet they average just 7 yards per pass (74th). Troy gains a full yard less per play on offense (4.7) than it allows on defense (5.7). Jax St has improved defending the pass as well as they went from rank 120 in passing yards allowed, to top 50 over their last 3 allowing just 207.3 per game just behind LSU. In those last 3 they played Kennesaw St who ranks 41st in pass yards, WKU (29th), & FIU (54th). I like Jax St on both sides of the ball.\n\nCam will Cook.\n\n__Jacksonville State ML__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial)  [PayPal](https://paypal.me/joeinglesofficial)  [Bitcoin](https://pastebin.com/raw/GEXAsA2S)  [Venmo](http://Venmo.com/mackenzie-botz-1)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9mq8c/"
    },
    {
      "created_utc": 1765852197.0,
      "author": "dreamchasing1",
      "text": "Record: 241-223 Net Units: -22.45 55-54 on 1.5u plays, 39-41 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Spanish La Liga] Rayo Vallecano vs Betis\nLast pick: total corners over 10.5 @ 2.10 - 1.5 Units won\n\n\nEvent: Soccer/Football, [English EFL Cup] Cardiff vs Chelsea\n\n\nPick: Cardiff total shots over 8.5 @ 2.00 - 2 Units\n\n\nUnfortunately with the timing of this thread, the line is now 8.5, it was 6.5 and a 3 unit play initially :(. Still like this line though.\nCardiff are the best league one side so far, averaging the 2nd most shots for team in that league. They got to this stage covering vs Wrexham with 23 shots, and 9 vs Burnley (away). Chelsea should make significant changes here as they did against another League One side (Lincoln), where  Chelsea allowed 16 shots, they played Wolves in this cup after that and allowed 15. Cardiff have covered this in 14/15 home games in all competitions so far, although against significantly weaker sides. Chelsea have allowed 9+ shots in 10/13 away games that include Qarabag, Lincoln, Leeds, Wolves.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9m8bz/"
    },
    {
      "created_utc": 1765851975.0,
      "author": "ptrckfrnndz",
      "text": "+26.37\n\n14 - 6\n\nFORM: ✅️✅️✅️✅️✅️ (LAST 5)\n\nSports: TENNIS\n\nPICK: MOCHIZUKI, KOTARO ML vs. Yoshimura, daiki @1.65 5units ✅️✅️✅️✅️✅️✅️\n\nPICK: roger pascual ferra ML 5UNITS vs. Felix balshaw ✅️✅️✅️✅️✅️✅️✅️\n\n\nThats 7 in row!!!!!🤑🤑🤑🤑🤑🤑\n\n\n\nThis is my pick for tomorrow \n\n\n\nhttps://www.reddit.com/r/sportsbook/s/dj56JGn7pp\n\nTime: abt 7 hrs from posting\n\nReasoning: later kind of busy. We won 6 times in a row! Im so happy i hope people are following my picks so i can continue doing this. \n\nFORM OF FERRA IS BETTER THAN BALSHAW. \n\nI AM FADING BALSHAW. GOT TO WATCH LAST GAME AND HES NOT IMPRESSIVE\n\nBol\n\n\nMaybe you can tip me if i made you some money. So i can buy food for my self.. thank you\n\nhttps://www.paypal.me/ptrckfrnndz06",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9llvu/"
    },
    {
      "created_utc": 1765851833.0,
      "author": "Hey52511",
      "text": "NBA POTD 13-10 \n\nLast Pick: James Harden over 7.5 Assists.\n\nWin or lose im happy with the Harden pick, line has moved to 8.5. Gotta love it, take the line ages ago wasnt aware that he was questionable with a calf injury, clearly played different as to how he usually does.\n\nTodays Pick: **Jalen Brunson Over 29.5 Points.**\n\n**TL;DR:** Brunson’s NBA Cup scoring has been consistently strong at **29, 33, 37, 35, and 40 points**, and San Antonio ranks **bottom 23rd in points allowed to opposing point guards** while also sitting **top five at limiting assists**, a setup that pushes scoring toward self-created offense. With the game total at **231.5**, it is reasonable to think it is in the NBA’s best interest for either a high-scoring game or star-driven performances from players like **Brunson and Wembanyama** in a showcase setting. That environment aligns well with Brunson’s usage-heavy, score-first profile.\n\nMotivation is clearly present across the board in this NBA Cup setting. You’ve got players openly talking about what winning means to them, like Tyler Kolek wanting to buy his dad a new car or Josh Hart joking about getting himself a new watch. But Jalen Brunson operates on a different level. This is the same player who took a **113 million dollar pay cut** to help New York bring in Karl Anthony Towns, a move that shows his focus is on winning and competing, not personal incentives.\n\nThis matchup sets up well for Jalen Brunson because his role and scoring profile are both stable and self-generated. He averages **92.1 touches per game**, nearly **8 minutes of time of possession**, and over **5 dribbles per touch**, confirming that he is not a system scorer. He is the possession finisher. When the Knicks need offense, the ball stays with Brunson, and possessions usually end with a shot or a foul drawn by him.\n\nThe scoring base is clear and repeatable. Brunson produces **10.9 points per game from pull-up jumpers** on **43.6% shooting**, plus **11.3 points per game off drives** on roughly **16 drives per game**. That puts him around **22 points per night from self-created offense alone**, before accounting for secondary buckets, late-clock shots, or non-drive free throws.\n\nHome and road splits add context without introducing risk. On the road, Brunson increases his pull-up volume from **9.5 to 12.6 attempts**, boosting pull-up scoring from **9.1 to 13.0 points per game**. His driving volume and output remain steady at about **16 drives and 11 points**, with the difference being method rather than result. He draws more free throws at home and finishes more efficiently on the road. There is no drop-off in involvement or aggression.\n\nDefensively, San Antonio aligns directly with Brunson’s strengths. The Spurs allow **47.5 points in the paint per game**, with recent games trending even higher, and show clear softness in the **5 to 14 foot range**, allowing **41.3% from 5 to 9 feet** and **45.5% from 10 to 14 feet**. That in-between area is Brunson’s comfort zone, where he thrives on floaters and short pull-ups without needing to attack the rim repeatedly.\n\nPositionally, the Spurs rank **bottom 23rd in points allowed to point guards**, while also ranking **top five at limiting assists to the position**. That defensive combination tends to suppress ball movement while allowing primary scorers to take on more responsibility. Against a score-first guard like Brunson, that usually results in more shot attempts rather than fewer.\n\nVictor Wembanyama is accounted for, but with a likely **20 to 22 minute restriction**, his impact is limited to short stretches. Over a full game, Brunson should see extended possessions against non-Victor lineups, where San Antonio’s paint and mid-paint defense weakens significantly.\n\nPut together, this is not a spot where Brunson needs an outlier shooting night. His usage is secure, his scoring comes from multiple independent avenues, and the Spurs’ defensive weaknesses sit directly in the areas he exploits most. With a **231.5 total** and an NBA Cup setting that naturally elevates star usage, Brunson’s path to a strong scoring night is supported by role and volume.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9l7nx/"
    },
    {
      "created_utc": 1765851521.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Tuesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pnq84i/pick_of_the_day_121625_tuesday/nu9kco5/"
    }
  ]
}