{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/3/25 (Wednesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pcn9zb/pick_of_the_day_12325_wednesday/",
  "target_date": "2025-12-03",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-02T23:41:19.281510+00:00",
  "comments": [
    {
      "created_utc": 1764717266.0,
      "author": "MrPunter500",
      "text": "**Record: 1-0** \n\n**Net Units: 0.57 units up**\n\n**ROI: 57%**\n\nLast Pick: Sonmez vs Jimenez Kasintseva - Sonmez ML @ 1.57 ✅️\n\nThis was a classic WTA style match, with both players breaking each other constantly but Sonmez won the 2nd set tiebreak and carried the momentum to finish off with a win.\n\n**Tennis** | **Challenger Angers (Women)** | **12:30 PM (Eastern Time)**\n\n**Plays will always be shared as 1 unit for fair record purposes**\n\n**Pick:** **Monnot vs Sonmez - Sonmez to win 2-0 @ 1.81**\n\nSonmez had a sweaty battle against Kasintseva, an opponent who was able to keep the match close due to her size advantage on this indoor surface in Angers, by saving 8 break points. This was still a quality win for Sonmez, especially after surviving a second-set tiebreak against a taller opponent. \n\nThis time, things should become a lot easier against Monnot, a player who has never been able to break into the top 400, as she will need to beat Sonmez from the baseline, since she only has 1.64 metres, so she shouldn't be able to serve at a high level to avoid rallies against a stronger opponent. \n\nSonmez was able to reach a career-high top-70 in October, after some strong performances in Beijing and Ningbo. Most recently, she was able to beat Eva Lys, a top-40 player, on this surface (Indoor Hard).\n\nWith this, the skill gap should be huge, and I'm expecting Sonmez to win in straight sets.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pcn9zb/pick_of_the_day_12325_wednesday/nrz0dd2/"
    },
    {
      "created_utc": 1764716567.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 11-6 (Avg Odds +130)\n\n**Previous Pick:** Harry Wilson 1+ SOT (+105) ❌️\n\n**Today's Event:** English Premier League | Arsenal vs. Brentford (11:30AM PST)\n\n**Pick:** Thiago 1+ SOT (+100) 1 unit to win 1 unit\n\n**Write Up:** All I can say is wow. What a match that was, we were treated to a real spectacle. Bummer that Wilson didn't look to shoot much of the game and his teammates didnt pick out his runs in the box. 9 goals were scored and our guy wound up with one assist and no shots. We move on, sorry we lost, but thankful for a great game. I've mentioned this before, but my plays are intended to boost the enjoyment of watching some great matches. Giving us something to root for. We won't hit them all, but we try to hit as many as possible. \n\nWe stay in London today where 1st Place Arsenal hosts 11th place Brentford. These mid-week matches are always tricky, as coaches will want to rotate without losing synergy and giving up points. I think Arsenal will be looking towards the weekend where they play at Villa and try to rotate as much as possible. Brentford on the other hand will want to play spoiler as they are not playing in Europe this season and I expect most of their 1st team. \n\nI was shocked to see this line at even money and wouldn't be surprised if this moves quickly. Thiago has had a fantastic start to the season, filling the void for Brentford left by the parting of Mbuemo and Wissa. He's got 11 goals and is a striker in form. He's averaging over 2 SOTs per match, and has only failed a SOT in 3 matches making him 10/13. \n\nArsenal has a great defense, but we also bet against it over the weekend with success. I expect Arsenal to rotate their already injured backline even more here. I love this play because Thiago has hit SOTs against the big teams all season, landing 3 SOTs on Liverpool and 1 on Man City. He's also hit 3-2-2 SOTs in his last 3 matches. Arsenal should win this match, but I'll gladly take Thiago to get 1 SOT at even money!\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pcn9zb/pick_of_the_day_12325_wednesday/nryy9iw/"
    },
    {
      "created_utc": 1764716020.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Wednesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pcn9zb/pick_of_the_day_12325_wednesday/nrywl1w/"
    }
  ]
}