{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/18/25 (Tuesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/",
  "target_date": "2025-11-18",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-18T14:10:52.390896+00:00",
  "comments": [
    {
      "created_utc": 1763472517.0,
      "author": "ControlRoyal1768",
      "text": "Record: 24-14 (+25.52u)\n\nLast 10: 💰✖️💰✖️💰💰✖️💰✖️✖️\n\nLast POTD: 🏈 Ashton Jeanty over 84.5 scrimmage yards (-114).\n\nWriteup: Completely missed here, should’ve gone with his receiving yards given negative game script and Quinnen Williams now on the Cowboys. Brutal pick and brutal weekend…but I refuse to lose 3 in a row.\n\nToday’s POTD: ⚽️ Scotland vs Denmark both teams to score (-122).\n\nGame starts at 2:45pm EST. Bet 4.5u\n\nWriteup: Let’s try a different sport. World Cup qualifier season is upon us and I could not be more excited. We have 2 teams in this one who are fighting for an auto spot in the World Cup and are reaching the top of their form offensively. Both teams have scored in many of their games recently and have a history of scoring in their qualifying matches. With a lot on the line, I expect both teams to be a bit aggressive in their play and each team to put one in the back of the net with efficient offense and perhaps a little bit too much aggressiveness on the defensive side.\n\nRemember to only bet what you can afford to lose, and BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/nphm4ho/"
    },
    {
      "created_utc": 1763472420.0,
      "author": "IllPath7022",
      "text": "Record: 4–2\n\nLast Pick: Donovan Mitchell o39.5pra (-111) @ 1u✅\n\nNet Units: +5.96u\n\nRecap: Mitchell had bout 25 points alone by half so this hit pretty comfortably which I enjoyed \n\nSport: Basketball\nLeague: NBA\nTime: 7:40pmET\nGame: Boston Celtics vs Brooklyn Nets\n\nToday’s POTD: Derrick White o22.5p/a\n\nWrite up: Brooklyns defense is giving up well over this to opposing shooting guards a game having them average and Derrick White is averaging 26.2p/a over the last 5 games",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/nphltuv/"
    },
    {
      "created_utc": 1763471701.0,
      "author": "Laird87",
      "text": "POTD Record: 206-201, -69.62 Units\n\nCurrent streak: ❌❌\n\nLast 10: ❌❌✅❌❌✅❌✅✅❌\n\nLast Pick: Senators -1.5 ❌❌❌❌❌\n\nToday's Pick: NCAAB:  American +20.5 @ Rutgers, -175, 3 Units, 6:30 PM EST\n\nBig Ten teams are usually okay at home but Rutgers is off to a shaky start, and while American's record isn't great, one of their losses was to a solid George Washington team.  I like this to stay within 20.\n\nBOL, tail or fade! Tip Jar: [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/nphjpo7/"
    },
    {
      "created_utc": 1763469060.0,
      "author": "Maleficent_Weight713",
      "text": "Record: 0-0\n\nNet Units: Starting from scratch\n\n**Hockey | NHL | 8 pm/10 pm EST**\n\n**Pick: Dallas stars ML & San Jose Sharks +1.5 parlay +135 odds on Hard Rock Bet**\n\nI’ve been hitting on hockey pretty consistently this season, and I wanted to start sharing some plays and see if I can build a streak going.\n\nI’m taking the Stars on the Moneyline. They’ve been hot all season, and while the Islanders’ record looks solid (they have actually been playing decently as of late), I think it’s a bit misleading. On paper, Dallas is a stronger team. They’re on a five game winning streak and back at home, where they’ve been pretty good with a  6-3-1 record. The Islanders have been respectable on the road, but to me Dallas is just the more complete team here. Next is the San Jose Sharks +1.5. I know, betting on the Sharks can be a little iffy. But they actually haven’t been playing all that poorly. They’ve had their bad games for sure, but they’ve also put together one of their longer winning streaks recently. This pick is mainly a fade of Utah. A lot of people in this subreddit have been riding them because they’ve been decent, but lately they’ve hit a bit of a funk with some natural regression. They looked so shaky yesterday against a Ducks team who honestly was playing very sloppy hockey. A couple things push me toward the Sharks here: San Jose has covered +1.5 often at home (8/10 times this year). The Shark Tank gives them a legitimate boost. Utah is on a back-to-back. They will be fanning out Vitek Vanecek in goal, who hasn’t been reliable. As a Panthers fan I watched him last year, and he was pretty underwhelming. The +1.5 has also hit in every game he’s played for the opposing team. The fact that Utah could only muster up a single goal yesterday along with the heartbreaking loss I feel will just have them annoyed and not focused. Utah also has a much worse road record than their home record. BOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/nphcxav/"
    },
    {
      "created_utc": 1763468669.0,
      "author": "Flashy_Calendar3995",
      "text": "Record: 4-5\nUnits minus 1\n\n\nNHL\nRangers vs Knights \n7pm PST\n\n\n\nGold Pick Deep Dive: New York Rangers vs. Vegas Golden Knights\n\nGame Time: 10:00 PM EST\n\nVenue: T-Mobile Arena, Las Vegas, NV\n\n Rangers (+110) \n\nWager 2 units\n\n1. The Core Thesis: Roster Decimation vs. Stability\n\nThe distinction of \"Gold\" confidence for this selection is rooted in a massive disparity between perceived team strength and actual roster availability. While the Vegas Golden Knights typically enjoy a formidable home-ice advantage at T-Mobile Arena, the current iteration of the team is statistically compromised by the loss of its primary offensive and defensive drivers. The market pricing—establishing Vegas as a favorite—relies heavily on reputation, ignoring the immediate impact of losing captain Mark Stone and center William Karlsson simultaneously.\n\n1.1. The Injury Crisis in Vegas\n\nThe Golden Knights are currently navigating a \"worst-case scenario\" regarding their forward depth.\n\nMark Stone (Captain): Stone is sidelined week-to-week with a wrist/upper-body injury.2 His absence is catastrophic for Vegas; he was leading the team in points and power-play production prior to the injury.4 Without Stone, the Knights lose their primary transition engine and defensive conscience.\n\nWilliam Karlsson (Center): Placed on Injured Reserve with a lower-body injury, Karlsson's absence strips the team of its best two-way center.5\n\nAdin Hill (Goaltender): The starting netminder is dealing with a lower-body injury, forcing the team to rely on depth goaltending options.5\n\nThe impact is quantifiable: since Stone’s injury, Vegas has fallen into a severe scoring rut, managing only 11 goals in their last five games and being outscored 17-11 in that span.3\n\n2. The Goaltending Mismatch\n\nThis matchup presents one of the most lopsided goaltending comparisons on the slate.\n\nNew York Rangers: Igor Shesterkin remains one of the league's elite goaltenders, providing a safety net that allows the Rangers to play aggressively.\n\nVegas Golden Knights: With Adin Hill out, Vegas is likely turning to Akira Schmid. Schmid’s recent form has been volatile; he recently allowed 4 goals on 24 shots in an overtime loss to the New York Islanders.6 Facing a Rangers offense featuring Artemi Panarin and Chris Kreider is a significantly steeper challenge than facing the low-scoring Islanders.\n\n3. Statistical Regression and Form\n\nThe recent form of both teams highlights the value on the underdog.\n\nVegas Form: The Golden Knights are 1-3-1 in their last five games, a direct correlation to their injury woes.3 They have struggled to generate high-danger chances, often scoring four total goals or fewer across multiple periods in recent outings.5\n\nNY Rangers Metrics: The Rangers enter with a 10-7-2 record and solid underlying metrics.1 They rank 4th in the NHL in Expected Goals Percentage (xG%) at 54.29% 7, indicating that their 5-on-5 process is dominant. They are generating quality looks consistently, whereas Vegas is struggling to simply enter the offensive zone without Stone.\n\n4. The Verdict and Wager\n\nThe \"Super Model\" identifies the Rangers as a mathematical favorite masquerading as a market underdog. The current line of +110 1 offers positive expected value (+EV). You are effectively getting the healthier, statistically superior team, with the better goaltender, at plus-money odds solely because they are the road team.\n\nPrimary Wager: NY Rangers Moneyline (+110)\n\nRisk Profile: Medium-Low (Gold Confidence)\n\nKey Variable: Akira Schmid’s performance under high-volume shot pressure.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/nphbztg/"
    },
    {
      "created_utc": 1763465763.0,
      "author": "Trevmichi",
      "text": "*Record*: 0-0\n\n*Net Units*: +/- 0u\n\n*ROI*: +/- 0%\n\nBasketball | NBA | 11 PM | Eastern Time\n\n*Event*: Phoenix Suns @ Portland Trail Blazers \n\n*POTD*: Dillon Brooks o1.5 Steals (+155 on DK), 1u to win 1.55u\n\n*Write Up*: A buddy of mine strongly recommended getting on reddit *shivers* and providing my $.02 for the degen community. As much as I’ve avoided the reddit world and the degeneracy of the masses, this sounds like great fun. From the write-ups I’ve seen thus far, there’s some very impressive knowledge on display. I’ll begin with a pretty risky first bet, but it’s one I feel inclined to share. \n\nWhen assessing the quality of a steals/blocks o/u bet, you must first assess the predicted amount of possessions per game or at the very least sufficiently estimate the pace. For this particular game, *the Trail Blazers rank 3rd in possessions per game*. Splitter has them playing at a very fast pace. On the flip side, Phoenix rank 25th in possessions per game, they play a slow paced offense and focus lots of their energy on “attacking” on the defensive side of the ball. This philosophy from Jordan Ott has what appears to be a lackluster roster looking like a playoff worthy team. \n\nNext, we must assess whether having more or less possessions will lead to additional turnovers, and in this case, they do. *Portland ranks 21st in turnovers per possession*; Not a great statistic considering their pacing. \n\nLastly, before analyzing Dillon Brooks and the Phoenix Defense, let’s see how this translates into steals, because turnovers come in various shapes and sizes and don’t necessarily directly lead to more steals. When you look at the data, Portland ranks 28th (3rd worst) in opposing steals per game, and ranked 29th last season. The numbers certainly add up, these aren’t anomalous in any way, shape, or form. \n\nNow let’s talk about Dillon Brooks, and how he fits into the mold of the Phoenix defense that Jordan Ott has been building. Thus far, in the 8 games with Phoenix, *Brooks has hit o1.5 in 62.5% of his games (5/8)*. Not a huge sample size, and if you look at his lifetime statistics, you would expect some type of regression, even if he continues to average 25+ minutes a game. But Jordan Ott encourages a slower offense so that they can be explosive on defense, and maintain a relatively high pace at that. It’s the perfect environment for a player like Brooks to flourish. They force lots and lots of turnovers. *The Suns are ranked 7th at 16.3/game, but this fails to recognize that with their slower pace of play, it’s actually substantially more impressive than many of the teams ranking above them. *\n\nSo considering the expected pacing, the limited but useful historical data that we have, and the price that is given at +155 (39.2% breakeven win rate), I love this bet at this price. Good luck to everyone with their wagers! Make sure to gamble responsibly! \n\n*Dillon Brooks o1.5 Steals*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/nph5jy3/"
    },
    {
      "created_utc": 1763465664.0,
      "author": "CBB-Junky",
      "text": "**CBB record: 8-3** \nall picks to win 1U\n\nLast pick: NCSU -11.5 ❌\n\nEvent CBB: Duke vs Kansas 9PM Eastern Time\n\nPick: **Kansas Team Total Under 69.5** (-112 FanDuel)\n\nBouncing back today. \n\nSimply put, Duke hasn’t given up 70pts all season long. I expect the trend to continue against Kansas, who is expected to be without their best player, and superstar freshman Peterson.\n\nFrankly even if Peterson played i would take this line so this makes me that much more confident. Dukes defensive versatility is something you will not see often in college.\n\nThey only are allowing .77pts per possession which is 4th in the country. Duke can go big, running 6’11, 6’9, 6’9 in the front court but also have the ability to switch every screen with perimeter defenders and go “small” (not that small) by going 6’9, 6’9, 6’6 and then two 6’5’s.\n\nPoint is they can adapt to whatever the other teams game plan is as they have so far.\n\nDuke has 2 NBA-level defenders in Maliq Brown and Dame Sarr who are incredible in playing the passing lane getting steals and deflections. Kansas has been turning the ball over a lot w a 19% turnover rate last 3 games. They turned it over 14 and 18 times against low-major teams no where near Dukes level of defense.\n\nWith Peterson out, Kansas will not score 70pts and i don’t even think they would if he played. Expecting 18+ turnovers against Duke tonight.\n\nTake Kansas TT under 69.5",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/nph5d0i/"
    },
    {
      "created_utc": 1763465499.0,
      "author": "ThatCherry7173",
      "text": "Record: 10-2\n\nNet units: +9.59\n\nOdds: -192\n\nSport: Basketball\n\nLeague: NBA\n\nTime: 6:30 - 7 PM Central\n\nPick: Celtics ML & Spurs +3.5\n\nBet 3 units to win 1.56\n\nWhy: At the time of me writing this, Celtics are double dight favorites. I don't think they'll quite win by double digits, but they should get the win regardless. They won their last 2 games - the clippers game was very close. I'm hoping this gives them confidence and momentum right now while they wait for Jason Tatum's return. But even without Tatum, Celtics should get the win. Nets will be without Cam Thomas and Haywood Highsmith. \n\nFor the Spurs game - honestly they may win the game outright and cover the -6 spread. The only reason I teased it a bit is because they won't have Wemby. But the grizzlies are not doing great at all right now, losing 8 out of their last 9. If you're feeling confident in the spurs, you can take them ML but I'm opting for the tease on this one. \n\nbest of luck if tailing. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/nph51of/"
    },
    {
      "created_utc": 1763465006.0,
      "author": "1234unodostrescuatro",
      "text": "__Record: 15-7__\n\nForm (old to new): ❌✅✅✅❌✅✅✅✅✅❌✅✅✅❌❌✅❌✅❌✅\n\nLast pick: Pickens O64.5 (-110)✅\n\nGame: DET@ATL\n\n__Today’s pick: Duren double-double & Jalen Johnson O4.5 ast (-120)__ \n\nAnalysis: Duren is a double double machine. He dunks on hoes and grabs boards on little men. Jalen Johnson has stepped into more of a distributor role with Trae Young injured and I expect that to continue tonight.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/nph44b8/"
    },
    {
      "created_utc": 1763464734.0,
      "author": "solmer7",
      "text": "Record:** 46W-23L (+9.38 units)\n\n **Last 10 POTD:    ❌ ✅ ✅ ❌ ✅ ✅ ✅ ✅ ❌ ❌\n\n \\*\\* Football \\\\ World Cup Qualification\\*\\* \n\n**\\*\\*POTD\\*\\*: Spain vs Türkiye - Both teams to score and Spain to win @2.35 - 1 unit ( All my picks are 1 unit)\n\n **Writeup**: Hey folks, Spain on beast mode without conceding any goal in group stage, they are clear favorite for to be champion. Türkiye is strong with rising stars Arda and Kenan, played good stage matches expect a 6-0 lose against Spain. Both team guaranteed their place. However, I expect a goal from Türkiye tonight and goals from Spain side as usual. Best of luck to who tails! \n\nI would be greatly appreciated, if you wish to tip.\n\nTFLCDLox65FoD7nNiZBnXmeuvJTQRvKnEn(TRC20)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/nph3m6s/"
    },
    {
      "created_utc": 1763455286.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 6-2, +3.61u\n\n**Previous Pick:** Dubai to win by 7 or more, 1.86, 1u ✅️ (last 5: ✅✅❌❌✅)\n\n**Event:** Eurocup: Buducnost - Ulm, 19:00\n\n**POTD:** Buducnost to win by 10 or more, 1.90, 1.5u\n\nBuducnost needs this win to stay in the fight for the first 2 places and direct 1/4 final. Home crowd means a lot to them, and they have a big support in Moraca. 4 straight wins, 2 of those at home, they beat Besiktas, probably the best team in this group, by 3. Their form is going upwards, one could say, with 8 in the last 9 games (all competitions).\n\nOn the other hand, Ulm has 3 losses in the last 4, and a lucky 87-86 win against London at home. Last round, they lost to Bourg 64-96 at home. That loss was devastating, combined with 4 straight losses in the German BBL and the Cup game against Alba. \n\nThese losses come, among other reasons, due to injuries. Tommy Klepeisz, Chris Ledlum - best scorer this season - was injured against Bonn; he slipped on the wet part of the floor. Nelson Weidemann - didn't play against Bourg, questionable. \n\nThey don't have that deep roster, and have played some kids from the ProB league against Bourg.\n\nBuducnost also has some injury problems, but their roster is deeper, and they can cover it better. Going with 1.5 units, more confident than usual on this one, I really don't think Ulm can hope for anything.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npgo5bs/"
    },
    {
      "created_utc": 1763454755.0,
      "author": "Busy_Presentation463",
      "text": "Record: 6-0\n\nNet Units: +18.22U\n\nRange of units per bet: \\~3-5U\n\nPrevious Pick: [Daniel Carlson under 2.5 XP (Win)](https://www.reddit.com/r/sportsbook/comments/1oyzejm/comment/npbhvpw/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) (Gonna start linking previous POTD so yall dont think my record is fishy)\n\nPOTD: Ace Bailey over 10.5 Pts (1.95) (Stake)\n\nBet 4U to win 3.8U\n\nAs you see I have the screenshot just to prove that YES THIS IS REAL!! The line last game was 13.5 but it massively dropped after a foul heavy game from ace where he scored 5 pts in the first 3 mins then proceeded to get in foul trouble then eventually foul out but the games prior to that he has scored WAY beyond this line, so the risk here is whether he is going to be in foul trouble or not and getting almost a 2x bet on whether someone will be in fould trouble or not is INSANE VALUE to me\n\nI'm not even gonna bother researching for other picks that I could use as my POTD because this is literally free. Now this isn't the most confident I'll ever be in a pick just because rookies are always yk... but probably the most value logically I have given in this sub by far. Also I am gonna be laddering this play which is something I almost never do just cuz of the value\n\nTo sum up: PLACE THIS BET NOW BEFORE THE LINES CHANGE ASAP\n\nLets keep this undefeated streak going and as always never financial advice and always bet within bankroll limits and BOL!!\n\nhttps://preview.redd.it/7aetpd0r6z1g1.png?width=454&format=png&auto=webp&s=463ab5f12c2b821f95a50cd654956bc639960466",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npgnbak/"
    },
    {
      "created_utc": 1763453726.0,
      "author": "tokcliff",
      "text": "Event: Australia Open Men's Double\n\nPOTD Record: 136w 90l 2p \n\nDate: 18 Nov SGT\n\nNet Profit = +49.19 units\n\n\n\nLee/Yang -6.5 points at 1.77 @ 1.25 units (vs Choong/Haikal)\n\n\n\nDifference in class here. Ranked 12 vs Ranked 34\n\n\n\nBTW if anyone wants to follow my blog where I do some reflection about badminton betting\n\n[https://tokkidokkie.wordpress.com/](https://tokkidokkie.wordpress.com/)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npglo43/"
    },
    {
      "created_utc": 1763453240.0,
      "author": "TheLocpickz",
      "text": "**Record:** 1-1\n\n**Net Units:** \\+0.84u\n\n**Last Pick:** Czech Republic vs Gibraltar - Tomás Soucek to score anytime - @ 2.42 - Won\n\n**Last Pick Writeup:** Easy win for Czechia (6-0), as expected, and one of the goals should be from Soucek, who is in great shape.\n\n**Todays Event**: Soccer/Football - Brasileirão Série A/Brazilian First Division - Botafogo vs Sport Recife - 6:30 PM ET\n\n**Todays pick**: Both Teams To Score: NO - 2u - @ 1.64\n\n**Writeup:** This fixture presents us a very likely Botafogo win. Sport has been mathematically relegated last round with one of the worst campaigns in Brasileirão's history with only 17 points in 33 matches. Botafogo is fighting for a spot in next year's Libertadores and has a very solid defense, with a 3 game clean sheet streak and Sport shouldn't be the one to break it.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npgkvpp/"
    },
    {
      "created_utc": 1763450043.0,
      "author": "OliveCritical5134",
      "text": "**Record: 22-13**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅✅✅✅❌❌✅✅\n\nSport: ⚽ / World Cup Qualifiers - Group J / Wales - North Macedonia\n\n**Net Units/ROI:** \\+27.27 / 31.34%\n\n**Previous Pick:** Northern Ireland to win @ 1.70 -- 2 units✅\n\n**Summary:** 1 penalty just before halftime did it for us. Close one but a hit nevertheless!\n\n**Today's Pick:** *Most Shots on Target: Wales + Most Shots: Wales @ 1.83 -- 2 units*\n\n**Write up:**\n\nThis group is the one where there is still something on the line. Wales and North Macedonia are both on 13 points looking to get that second place behind Belgium. North Macedonia is the team with the best goal difference. I think that because of this they will sit back and defend as a draw will see them through to the World Cup. Wales have to win here, and if they do not score an early goal they will have to attack to get that win and that will cause them to be in the opponent's penalty area a lot, meaning they will get a lot of shots off.\n\n**Best of luck if tailing!** 🍀\n\n**PS:** If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npgflq0/"
    },
    {
      "created_utc": 1763448506.0,
      "author": "this_guy9",
      "text": "**POTD Record:** 5-4\n\n**Net Units:** \\+1.02\n\n**Previous Pick:**  [🪝 VJ Edgecombe o14.5 Points -116](https://www.reddit.com/r/sportsbook/comments/1oyzejm/comment/npa9ws7/?context=3)\n\nCan't script a worse hook, man...   \nEdgecombe, a 70% FT shooter, goes to the line at 14 points and misses both.   \nAll my PotD losses on hooks. Can't blame ya if you want to watch from a distance, I'mma keep shooting.   \nOn the bright side, haven't lost 2 in a row yet.\n\n**🏀 De'Aaron Fox o2.5 Threes -111** vs the Memphis Grizzlies\n\nThis pick looks great. Castle and Wemby are out. \n\nExpecting heavy usage out of Fox to put the game on his shoulders. And he never hesitates to shoot.\n\nGrizzlies are ranked worst in the league (30/30) in allowing Threes to PGs, last three PGs got 3 (Lonzo), 5 (Pritchard), and 6 (Brunson).\n\nCashed in L2/2 with 4 Threes each while playing with Castle. He's hitting at a high clip almost 50% of attempts.\n\nShould be a gritty game with no Ja, Wemby, or Castle so let's see Fox takeover.\n\nFull Stats if you'd like to do additional research: [https://www.statpick.ai/31796031/deaaron-fox-threes](https://www.statpick.ai/31796031/deaaron-fox-threes)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npgcunv/"
    },
    {
      "created_utc": 1763447417.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 172-128\n\nSeason record: 9-5\n\nLast POTD: __Evan Mobley O3.5 Ast @1.80 1U__ ✅\n\nToday’s POTD: __De’Aaron Fox O33.5 PA @1.90 1U (Bet365)__\n\nNBA | Spurs vs Grizzlies | 🏀  \n\nSweat free work by Mobley who ended with 6 assists once again, 4-0 run \n\nI usually don’t like these high lines but this one makes sense, Spurs are without Wemby, Castle and Harper and they’ll need Fox to lead the way and I’m expecting big volume from him. Last game without Wemby he had 39 PA, 28 points on 20 FGA & 11 assists on 14 potentials. Game prior to that he had 34 PA, 24 points on 22 FGA & 10 assists on 14 potentials WITH Castle and Wemby playing.\n\nStarting to look like his old self again and gets a great matchup here against a Memphis side that’s ranked 5th in pace and is allowing 4th most PA to opposing PG’s this season & 2nd most points to PG’s.\n\nFox will be their main ball handler with both Castle and Harper out (both guards) and main scorer for the Spurs tomorrow with Wemby out. He’s coming into this game with good confidence and knows he’ll need to step up tomorrow, I like the trend to continue against a Memphis side that has the 7th worst defensive rating this season.\n\nIndividual split would be 25+ Points for me (alt) if PA isn’t available.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npgau4i/"
    },
    {
      "created_utc": 1763446652.0,
      "author": "Flashy-Literature423",
      "text": "Record: 11-5-1\n\nUnits: +14.4u\n\nLast 10: ❌-✅-❌-❌-✅-❌-✅-✅-✅-✅\n\nLast Pick: [Tyrese Maxey Over 39.5 PRA (-115) Bet 2.5u to Win 2.17u](https://www.reddit.com/r/sportsbook/s/jt6anMwDJ2)✅\n \n76ers found themselves trailing in this one which lead Maxey taking care of business in the 2nd half and gave us an elite performance finishing with 48PRA.\n\nGS Warriors @ ORL Magic  | 7PM EST\n\nNext Pick: **Franz Wagner Over 24.5 Pts** (-112) Bet 2u to win 1.79u\n\nWe come back to good old Franz for a player prop but this time around we’re not fading his points but actually backing it.\n\nWagner is averaging 23.1PPG however, this understates his actual scoring ceiling because it includes games when Banchero (the team’s primary scorer) is in the lineup.\n\n**Wagner has hit over 24.5 Pts in all 3 games so far when Banchero has been sidelined, averaging 27.3PTS during that stretch.**\n\nIt’s also clear that Wagner’s offensive usage, and MPG has also trended upward with Banchero’s absence\n\nWarriors allows 114PPG, tied for 7th worst in the league. Their perimeter defense ranks near the bottom as well for opponent three pt % and pts allowed from wings and guards.\n\n**This suggests more potential open looks and driving lanes for opposing wings like Wagner for this matchup.**\n\nWith that being said, I’m backing Franz Wagner for over 24.5pts.\n\nIf tailing, only risk what you can afford to lose. Best of luck family!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npg9fhx/"
    },
    {
      "created_utc": 1763442121.0,
      "author": "Dont_Tail_Me_Bro",
      "text": "Record: 7-8\n\nNet Units: -0.86u\n\nLast pick: Georgia -36.5 ❌ Georgia 2/26 from 3. 8%. Can't even make this stuff up. \n\nNCAAB // Champions Classic (MSU vs Kentucky & Kansas vs Duke)\n\n**Pick: Kentucky ML + Duke ML (-149) 1u**\n\n  \nThe Champions Classic is here! College basketball is in full swing! Keeping this pick simple and going on straight eye test and gut feeling. Kentucky and Duke are the better teams in these match ups. Michigan State found themselves in a battle with Colgate toothpaste into the second half. Kansas got man handled after giving up a double-digit lead against UNC. Kentucky has looked good so far and lost a tough one on the road against a great Louisville team. Duke has looked unstoppable so far granted against lackluster competition. \n\n  \nKentucky #4 in KenPom\n\nMichigan State #32 in KenPom\n\nDuke #2 in KenPom\n\nKansas #26 in KenPom\n\n  \nI see Kentucky and Duke scoring early and often and I'm not sure MSU and Kansas have the firepower to hang with them. \n\nGet your bets in and park yourself on the couch because this event must watch TV!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npg0gjh/"
    },
    {
      "created_utc": 1763442066.0,
      "author": "Vander_chill",
      "text": "**POTD Record:**  95 – 60 - 9\n\n**Previous:**  Ireland Over 2.5 cards – WINNING!\n\n**Recap:** In one of the most extraordinary finishes in Ireland’s history, they steal a victory from the Hungarians in the 96^(th) minute to obtain a playoff spot for the next world cup.  Worth watching the highlights for any sports lover, especially anyone of Irish descent.\n\n**New Event:**  Japan vs Bolivia &  Brazil vs Tunisia\n\n**Pick:**  Japan -1.5 & Brazil -1 @ 2.00 (Usual 3 units)\n\nI normally avoid “friendlies”, but in preparation for the next World Cup these friendlies have not been so friendly.  Just look at the brawl between USA and Paraguay and the number of cards being drawn in the matches.  At the end of the day players are trying to secure their spots for the big tournament and are playing lights out.  These two matches should be no exception.\n\n**Leg 1: Japan -1.5 vs Bolivia**\n\nTwo picks ago I had South Korea -1 to beat Bolivia and they won 2-0.  Now Bolivia are in Japan playing a much stronger side than that of the Koreans.\n\n* Japan has 21 straight home matches without a loss.  Last loss was March 2023.\n* Japan has scored at least 2 goals in their last 6 home matchs.\n* Recently, Japan travelled to South Korea and beat them 1-0.  South Korea then hosted and beat Bolivia 2-0.  Now Bolivia travel to Tokyo for this match.\n* Another interesting fact is Brazil also went to South Korea and Japan recently.  South Korea lost 5-0 while Japan won 3-2.  (Bolivia did beat Brazil 1-0, but that was in Bolivia at 14,000 feet above sea level)\n* Bolivia are a different team when not playing at altitude where they hold advantage over their rivals. They have only won 2 out of 25 away matches since 2021.\n\n**Leg 2 Brazil vs Tunisia**\n\nThe Brazilians are playing Tunisia in Lille, France where a large Tunisian crowd awaits.  However, the Brazilians are simply stacked and have a super deep bench to choose talent from.  Despite Tunisia’s recent good form, they will be overrun by Brazil.\n\nNot enough data to support facts here and post bullet points of significance, but suffice to say it’s Brazil and am confident they will secure a victory especially after losing to Japan recently in a match where they had 67% possession but simply did not convert.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npg0c8l/"
    },
    {
      "created_utc": 1763440498.0,
      "author": "ptrckfrnndz",
      "text": "+6.625\n\n2 - 0 \n\nSports: Tennis\n\nPrev: Amy sucha vs. Alice robbe ML @1.69 5units ✅️\n\nPick: merel vs ulyana ML @ 1.833 5 UNITS\n\n\nTime: about 24hrs from posting\n\nReasoning: either you regret seeing this for not tailing or be happy with me tomorrow and enjoy our cash!\n\nMomentum, play, style, court to ulyana",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npfwvox/"
    },
    {
      "created_utc": 1763439872.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 16-6 (+11.5U)\n\nLast Pick: Cowboys -3 (-130) (1U) ✅\n\n[Cowboys write up](https://www.reddit.com/r/sportsbook/s/gz6ov7eFqc)\n\nCowboys got their boys back, the stars showed out! Dak played like dak! They were motivated from the jump! That’s just class right there baby. What a way to honor kneeland.\n\nEvent: Michigan State vs Kentucky (5:30pm central)\n\nPOTD: Under 154 (-115) (1U)\n\n-everything is bet to win unit amount-\n\nWrite up: \n\nTomorrow in the first game of the champions double header classic in NYC we have two dominant programs set to face off! Izzo and the Spartans will face mark pope and his wildcats to kick the night off and I expect this to be more of a rock fight than a firework show like the public thinks. This line opened at 154.5 and has since dropped to 153.5 despite heavy public action early on the over! The public has seen Kentucky put up over 90 points in almost all of their games and they saw the absolute shootout that went down in Louisville and immediately thinks why the hell would I not take it here?!\n\nLet’s dive into some stats here…Kentucky plays at the 85th ranked adjusted tempo in cbb and Michigan state plays at the 267th ranked adjusted tempo in cbb. For instance, being on the road in Louisville for Kentucky, Louisville was able to establish how they wanted to control the game, and they play at the 26th adjusted tempo in the nation. The wildcats rank 144th in possessions per game while the Spartans sit at a lowly 311th in the nation in possessions per game. In terms of offensive rating per kenpom Kentucky sits at 8th in the nation, Michigan state is at 57th. However both teams are elite at defense ranking 10 and 13th respectively.  \n\nHere’s where things get even better for our under,  Michigan state is 255th in the nation in effective field goal percentage at 47% and is damn near dead last in college basketball when it comes to shooting the three ball at 353rd in the nation sitting at a lowly 21%. The funny thing is these guys still hoist up 20+ threes a game as a lot of their players believe they can shoot the rock. I have watched many of their games and they are just pitiful from behind the arc. They are 118th in the nation in two point percentage as well. Not to mention they only shoot around 67% from the free throw line as well. With all this being said Kentucky is 17th in the nation in opponent effective fg% holding their opponents to just 40.9% and teams are shooting just 26% from behind the line against them, and just 41% from two point range! \n\nNow you may be thinking Kentucky -5.5 is the play after all that being said (and I do like that as well) however… the Spartans and izzo do know how to beat teams without shooting the ball well and that is what makes izzo and the Spartans such a dangerous team. They managed to beat Arkansas shooting 41% from the field and just 7% from three! That game ended with a total of 135 points! Kentucky is shooting 59% effective fg% at 20th in the nation and around 34% from three which is average at about 144th in the nation. However like I said, the Spartans are relentless on defense and hold their opponents to 48% effective fg% (which is what the Spartans themselves shoot) and 31% three point range. \n\nBoth teams have some real size and matchup very well with each other on paper as they are both top 17 in the nation in total rebounds per game. \n\nI do not think the Spartans can afford to turn this into a shootout and izzo without a doubt knows this. If they want to have a shot to take down Kentucky tomorrow they are going to have to slow this game down, limit possessions, relentless defense, and taking the time to actually get a quality shot up each possession which does nothing but  bleed clock. The Spartans do not have the three point range to turn this into a game in the 80s and I think they will do a great job of keeping it the way they want to play, and if shit hits the fan I don’t think they’ll do enough to force this game over the total either. \n\nWith sharp money on our side, reverse line movement, and a clear gameplan for the under I believe we have a solid POTD for ourselves. We have been having a great year in cbb and all sports in general! As always, cheers 🍻 \n\nIf you enjoy the picks and want to leave a tip: https://venmo.com/ben_wrigley they are greatly appreciated!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npfvgao/"
    },
    {
      "created_utc": 1763438994.0,
      "author": "InternationalRest542",
      "text": "**POTD Record**: 6 - 1\n\n**Net Profit** : +7.9 Units\n\n**Previous Pick**: Tre Tucker Over 3.5 Reception @ 1.80 3.3u to win 2.6u💵✅\n\n**Event**: NBA | Warriors @ Magic\n\n**POTD**:  Draymond Green Over 10.5 RA @ 1.67 3.5u to win 2.3u\n\n**Write Up**:    \n\nIf Dray’s out there playing his usual minutes and doing his thing, his rebounds and assists are pretty reliable. He’s not some random role guy — he’s a big part of how the Warriors run their offense, and the ball is in his hands a lot. On defense he’s always around the action, boxing out, crashing the glass, and doing all the little things that lead to extra rebounds.\n\nAnd honestly, based on his season averages, if the game plays out normally he should land over 10.5 RA more often than not. He’s sitting around 11.7 on the season, so he’s already right above that line.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npfte3f/"
    },
    {
      "created_utc": 1763432085.0,
      "author": "milionzenit",
      "text": "POTD Record: 7-1\n\nLast Pick: Croatia vs Montenegro. Will A Goal Be Scored In Both Halves? Yes. (-160) ✅\n\nFixture: Denmark vs Scotland (World Cup Qualifiers) 11:45am PST Time\n\nPick: BTTS. Yes. (-125) \n\nReasoning: Scotland and Denmark are both fighting for first place in the group to automatically qualify for the 2026 World Cup. Being said BTTS has landed in Denmarks last two games against Greece & Belarus. Additionally, Denmark has scored in four consecutive World Cup qualifiers. Scotland also have scored in four consecutive World Cup qualifiers & BTTS has occurred in their last three qualifiers. With both teams fighting to automatically qualify for the World Cup, the teams will be eager & highly aggressive in pushing up the field and getting a lead. \n\nCheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npfaq5x/"
    },
    {
      "created_utc": 1763431603.0,
      "author": "dreamchasing1",
      "text": "Record: 225-212 Net Units: -26.79 47-50 on 1.5u plays, 37-39 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [World Cup qualifiers] Northern Ireland vs Luxembourg\nLast pick: Asian total cards over 3.5 @ 1.85 win\n\n\nEvent: Soccer/Football, [World Cup qualifiers] Belarus vs Greece\n\n\nPick: Belarus over 2.5 corners @ 1.80\n\n\nA great result away from home vs Denmark has Belarus pretty inspired going into a game with no stakes for both sides. Belarus has had 3 or more corners in 4/5 games in the group, 3 and 4 vs Denmark, 2 and 6 vs Scotland and 7 vs Greece in the reverse matchup. Greece have allowed 3 or more in all group games so far. As mentioned, Belarus had 7 in Greece, although Belarus don't exactly play at home, they definitely have enough for 3 corners here against a Greek side with nothing to lose.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npf9cvi/"
    },
    {
      "created_utc": 1763430816.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 5-2\n\n**Previous Pick:** Nick Woltemade ATGS (+110) ✅️\n\n**Today's Event:** UEFA World Cup Quals | Scotland vs Denmark (11:45AM PST)\n\n**Pick:** John McGinn 1+ SOT (+110) 1 units to win 1.1 units\n\n**Write Up:** Love me a sweat free plus money cash! Woltemade came through in the 19th minute with a header from a corner to net Germany their first of 6 goals on the day and clinch their spot in the World Cup. We also hit a +640 ATGS Parlay in the soccer thread. Great day overall! \n\nToday we head to Scotland where our hosts face off against Denmark in another winner take all match to decide the group. Winner goes to the World Cup, loser heads to the 16 team playoffs in March, where only 4 teams will make it in. Of additional note is that Denmark goes through with a tie, so Scotland will need to be on the attack here at home. I'm expecting an end to end match here with both teams needing (and expecting) a win here. I'd be shocked if we wind up 0-0 like the reverse fixture in Denmark back in September. \n\nDenmark have had a mildly disappointing World Cup Qualifier thus far, in a group that they were expecting to run away with, and are coming off a disappointing draw against Belarus at home a few days ago. Now here they are, fighting for a spot at the World Cup away from home. They will be aggressive and want the win here and likely control the ball much of the match (73% possession in their last match), which much like our Kvaratskhelia pick, suits us just fine for this pick. \n\nJohn McGinn, the captain of Aston Villa and 5th most capped Scotland player of all time, is my favorite kind of player to back. If you read any of my other write ups you'll notice a theme, but I really do like to back hard working midfielders/strikers who don't shy away from a challenge and always sprint to attack on breaks. Our guy McGinn obviously falls into this bucket and is a fun guy to watch on both ends of the pitch. McGinn has played all 90 minutes in every world cup qualifying match here and is the back-up captain for Scotland, so I see him playing the full 90 here again. We are getting good odds here as he has only hit this line in 2 of the 5 WC qualifying matches. But I've noticed a pattern that he tends to take more shots in the 2nd match of international breaks, hitting 1 SOT in all 3 of these matches this year. I'm also backing the intangibles a bit here, in that I like him to leverage his experience in the big game, take a few shots, and work hard to get his country to their first World Cup since 1998. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npf75ag/"
    },
    {
      "created_utc": 1763430106.0,
      "author": "NVSBETS",
      "text": "POTD Record: 8-1\n\nNet Units: +6.78u ROI: 48.46%\n\nPrev POTD: Oleksandra Oliynykova 2:0 -165✅ +1u\n\nSport: Tennis Tournament: Sydney Challenger Time: 12:00AM EST (3H from now)\n\nPOTD: Takuya Kumasaka +6 games -180 (b105)\n\nAnalysis: this is genuinely an egregious line and mainly a system play fading Bolt coming off a perfect weekend where he AND his girlfriend both won titles! Obviously once in a lifetime moment and Alex was rightfully posting airport beers with his girlfriend as he prepped to fly from Brisbane to Sydney. Alex Bolt is obviously the better player but I have to wonder where A) his head is at B) how fatigued his body is [this will be his 6th game in 7 days]. This line is way too wide and *at worst* I get a push off a 6-3,6-3 loss. BUT I also wouldn’t be shocked to see Alex come out flat footed and Takuya snags a sneaky S1. This is gonna be alot closer than the books are predicting. We’re on a silly streak right now come ride the hot hand and see why they NVS 🌟 \n\nIf you guys have cashed with my crazy streak and want to support: [BMAC☕️](https://buymeacoffee.com/nvsbets) [BTC](https://pastebin.com/0Lf0mHqu) [ETH](https://pastebin.com/D2QRi3Bx)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npf56c2/"
    },
    {
      "created_utc": 1763428887.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 53-26-1 (+56.55u)\n\n__Previous Pick:__ [❌ Jaylen Warren o79.5 rushing yards (-115), 3.45u](https://www.reddit.com/r/sportsbook/s/7meV84KrBw)\n\n__Event:__ NCAAF: Western Michigan @ Northern Illinois 7pm EST\n\n__POTD:__ Western Michigan -5.5 (-115 on FanDuel), 3.45u to win 3u\n\n__Write Up:__ We’ve got some Tuesday night MACtion baby! I spent the day taking care of my dog post surgery & we watched Western Michigan & Northern Illinois film while he was high on meds. He & I both agreed that this is the play. The Western Michigan Broncos (6-4, 5-1 MAC) are traveling to Dekalb, Illinois to take on the Northern Illinois Huskies (3-7, 2-4 MAC) at Huskie Stadium. Northern Illinois has had a brutal season this year, huge 180 after having a solid 8-5 season & winning the Idaho Potato Bowl. Now this season they are disqualified from the bowl eligibility & have been a punching bag all season. Last week NIU blew out UMass 45-3, seems like they’re turning it around right? False. UMass is the worst team in college football, with an 0-10 record, & an average scoring margin that ranks last in the NCAA (-30.0). The week before NIU lost to Toledo 3-42. Western Michigan beat Toledo 14-13 earlier this season. The week before NIU beat Ball St 21-7, WMU beat them 42-0. Week before that NIU got wrecked by Ohio 21-48, WMU just beat Ohio 17-13 last week. Ohio is a good MAC team. Ohio & Central Michigan were both tied for 1st place with WMU in the MAC Standings. WMU just beat them both the last 2 weeks to take the lead in the MAC standings. WMU has only 1 conference loss & their only other losses came in nonconference play against Michigan State, Illinois, & North Texas. North Texas is 9-1 & ranked 22nd in the country in the AP polls, & they had to come back & win in OT to beat WMU. Western Michigan has a good team & with a win this week they’ll improve to 6-1 & will lock up a spot in Detroit in the MAC Title Game. __WMU have been covering machines this year with a (7-3) ATS record. Western Michigan has covered every time (3-0) as a 5.5 point favorite or greater this year. Northern Illinois on the other hand is (3-7) ATS record so far this season. Northern Illinois has just 1 win ATS (1-3) as a 5.5-point underdog or more this year.__ The Huskies are going to have a tough time this week vs a Western Michigan team that is rolling & looking to lock their spot in the MAC Ship.\n\nWestern Michigan has had a successful season this year due to an elite MAC defense. They are an incredibly defensive 1st team. __The Broncos allow 291.4 yards per game, 12th in the nation. They rank 7th in FBS in passing yards allowed (161.1), 34th in yards per carry allowed (3.9 ypc), & 16th in scoring defense allowing just 18.9 points per game.__ They are even more elite in their EPA (Expected Points Added) defensive numbers. __WMU has #2 EPA defense in the MAC, one of just 2 teams that have held their opponents to a negative EPA (-0.029). They have the 2nd best EPA/run allowed in the MAC. But they rank #1 in EPA/pass allowed in the MAC (-0.055), 40th best in the nation (which is crazy for a MAC team).__ That doesn’t bode well for an NIU team that hasn’t been able to pass all year. The NIU offense has been brutal this year. __Northern Illinois ranks 130th in offensive EPA & are the 2nd worst in EPA Margin in the MAC (-0.335). They have the 2nd worst EPA/pass in the nation & rank just 104th in epa/run. They haven’t had a QB top 90 yards in their last 3 games. NIU is averaging just 108.1 passing yards per game, 3rd fewest in the nation. Averaging even fewer at home with 76 yards per game, 2nd fewest.__ That normally would mean that they have an elite run game. __However, they faced a defense similar to WMU in Toledo 2 weeks ago (both ranked 52 & 53 in EPA), & NIU had just 62 yards on 36 carries. That’s an average of just 1.7 yards per carry.__ NIU has had obvious QB trouble all season. Last week Jalen Macon (6-5, 230) took over at QB for Josh Holst. He's thrown just 4 times all year, but he is a dual threat QB who uses his legs more than his arm. Still, it doesn’t look like this offense has any desires to pass the ball with Macon. Last week he threw just 4 passes vs the 2nd worst pass defense in the MAC. He completed 3 of those throws for 73 yards, but 67 of those yards came on 1 pass in busted coverage. If WMU takes a lead NIU doesn’t have the ability to come back with no pass game. It doesn’t help that WMU has a stout DLine either. __WMU ranks 31st in pressure rate in the NCAA & will eat this weak NIU OLine alive.__ NIU’s offense just can’t do anything vs solid defenses. __Despite scoring 42 points last week, NIU still ranks 132nd in scoring offense at just 15.5 points per game.__ Where Northern Illinois struggles the most is on 3rd down. __NIU ranks 127th in 3rd down %, converting 32% of the time for a 1st down. WMU ranks 23rd in the country in 3rd down defense, allowing its opponents to convert at just 33.6%.__ They’ll have their hands full with this defense, but this game is going to come down to Western Michigan’s offense.\n\nLast week Western Michigan faced Ohio, both teams were 4-1 & were playing for 1st place in MAC standings. __Ohio had the #2 ranked EPA Defense in the MAC & WMU had a highly efficient offensive performance. WMU ranked 10th in the country last week in offensive success rate (57.1%). They outgained Ohio 336-287 in yards & won the turnover battle 1-0.__ There was a QB competition earlier this year between Broc Lowry and Brady Jones, Lowry took over & now has a 7 to 1 TD/INT ratio with a 64.7% completion rate & is the team’s leading rusher in yards, carries, & rushing TD’s. Most importantly he has taken great care of the football in this rushing offense. __Lowry is the highest graded QB in the MAC with a 82.1 grade (per PFSN).__ But where WMU does their damage on offense is on the ground. __WMU has averaged 177.7 rushing yards their last 3 games, 2 of which were against the best 2 defenses in the MAC. NIU has the 132nd EPA/run defense in the nation, 114th vs the pass.__ Western Michigan’s biggest weakness on offense has been ball control. __WMU has lost 8 fumbles this year. But that’s not going to be a problem vs an NIU defense that has just 3 fumble recoveries on the season & had only recovered 33% of fumbles (118th). WMU has been elite at recovering fumbles, snagging 56% of them (39th).__ NIU doesn’t have any advantages on either side of the ball. *Ran out of room but wanted to focus more on WMU’s defense.* \n\nWestern Michigan has both a better offense & defense with a +3.4 point differential, as opposed to Northern Illinois who has -6.7 point differential.\n\nBroncos Country, let’s ride.\n\n__Western Michigan -5.5__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial) - [PayPal](https://paypal.me/joeinglesofficial) - [Bitcoin](https://pastebin.com/raw/GEXAsA2S)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npf1uk8/"
    },
    {
      "created_utc": 1763428838.0,
      "author": "VAM89",
      "text": "Record: 25-16\n\nForm (old to new): ✅ ✅❌✅❌ \n\nNet Units: +16.03\n\nYesterday's Pick: Netherlands v Lithuania. Netherlands -5 corners. 3u @ $1.85 ❌  \n\nSuper annoying. The Netherlands attacked the entire game. It was disappointing to see them just constantly recycle possession outside the box instead of putting a few balls in or getting some long shots away. \n\nI got on a hedge early in the second half, so I didn't lose money, but I was disappointed to miss the POTD. \n\nToday's Pick: Belgium to win to nil AND Romania to win to nil. 4u @ $1.78\n\nNot a hell of a lot to say here. Backing the two worst teams in Europe to not score and lose is pretty safe to me. Also, I got on this yesterday at $2.17, and it's already down to $1.78, so I'd expect it to go down more too. \n\nHowever, for the sake of the write-up. \n\nTop of the group, Belgium play at home against the bottom of the group, Liechtenstein. \n\nLichtenstein have lost every game and are yet to score, conceding 24 in the process. Last time these guys played, Belgium won 6-0. \n\nRomania had the wind knocked out of them against Bosnia a few days ago (great for us though). Even with that, I can't see them doing anything silly vs San Marino. \n\nThey might not be going at 100%, but San Marino to not score is always a good bet. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npf1pnu/"
    },
    {
      "created_utc": 1763428413.0,
      "author": "InconsolableBrat",
      "text": "POTD Record: 154-102 | Profit: +110.62u | ROI: 14.9%\n\nSeason Record: 14-6 | Profit: +23.36u | ROI: 34.9%\n\n \n\nLast Pick: Toronto Raptors -5.5 vs Indiana Pacers @ 1.93. 3U. ✅\n\nNo matter what line you took, you cashed comfortably. That brings us to a SIX GAME WINNING STREAK.\n\n \n\nNext Pick: **Desmond Bane (Magic) O18.5 Pts @ 1.84**. 3U play.\n\nBane has been shooting poorly all season, and in fact, has shot above 50% just once in his L10 games. Why am I taking his over you ask? Because he’s gaining confidence with every game, and the missed shots aren’t reducing his FGAs nor his aggression. He’s also a near-perfect free throw shooter, and I expect he’ll do quite a bit of that against the Warriors. He’s taken between 15-20 FGAs in each of his last 4 games, and with Paolo out, he’s taken on more responsibility for the offense. He’s shooting just 27% from 3 with the Magic, but I attribute that to his adjustment to a new system and new team. It's only a matter of time. As a final vote of confidence, he is over this line in 4 straight games for the Magic, and all 3 games against the Warriors in 2025 (with the Grizz). Between the high FGAs, free throws, 3pt mean reversion and a favorable matchup, he has many paths to get over this line. \n\n\n\n*If you’ve enjoyed these picks, tips are always appreciated:* [Link](https://www.buymeacoffee.com/TheBrat)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npf0jm8/"
    },
    {
      "created_utc": 1763428020.0,
      "author": "bigtime-operator",
      "text": "Record: 55-44\n\n**Flensburg - Potaissa Turda** 🤾 Handball EHF European League\n\nPick: **Pințoiu Total Goals Under (4.5)** @ 1.85\n\nThis line is higher than expected! 3.5 would have been a more reasonable option. I see value here. Pințoiu is important in Turda's 9-meter line (especially LB/CB), but he's not the primary ball carrier. Shots are shared more evenly between Mošić and R. C. Ghiță; Kbilashvili is predominantly active on 7-meter shots. This limits \"easy scoring\" opportunities. Flensburg's central defense and goalkeeping quality (against 6-meter and 9-meter shots) should challenge Pințoiu. Below are his goals scored this season.\n\n| Universitatea Cluj | 35-32 | 0 goals\n\n| HC Buzău (D) | 29-32 | 0 goals\n\n| Dinamo București | 29-24 | 2 goals\n\n| CSM Sighișoara (D) | 33-23 | 4 goals\n\n| Bidasoa Irun | 33-34 | 7 goals\n\n| Saint‑Raphaël (D) | 24-42 | 2 goals\n\n| SG Flensburg‑Handewitt | 26-33 | 2 goals.\n\n\\*\\*\\*Track my sports betting picks on \\[POTD.LOL\\](https://www.potd.lol/handicapper/bigtime-operator-UqbzCr?utm\\_source=mdembed&utm\\_campaign=bigtime-operator) (since 09/01/25).\\*\\*\\*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npezgt0/"
    },
    {
      "created_utc": 1763427789.0,
      "author": "Hsil18",
      "text": "\nPOTD RECORD: 28-8\n\nPOTD TOTAL RETURNS: +28.21 Units 🤑\n\nLAST PICK: Northern Ireland ML + Germany ML @ 2.0 2U✅✅\n\nTODAYS FIXTURES: Romania v San Marino & Austria v Bosnia (both 19:45UK / 14:45pm EST)\n\nPICKS: Romania -2.5 goals + Austria ML @ 1.84 (2.5U)\n\nWRITE UP: \n\nGreat win on the last one with Northern Ireland seeing off Luxembourg and Germany as predicted, dismantling Slovakia 6-0 to claim top spot in the group.\n\nToday..\n\nPICK 1 - Romania -2.5 goals (win by 3 or more) vs San Marino. It comes as no suprise that San Marino are not given a great chance tomorrow. Sitting bottom of the group with a record of 0-0-7 with 1 goal scored and 32 goals against.. Romania on the other hand have missed the chance to qualify for the World Cup via the group and will have to settle for the playoffs. It appears they will field a strong team tomorrow and I would be suprised to see them win by 5+. However, I think the -2.5 handicap is the sweet spot, just incase they take their foot off the gas late on.\n\nPick 2 - Austria ML. Austria come into this game knowing a win or draw vs 2nd place Bosnia see’s them win the group and go to the World Cup. They come into the game with a record of 6-0-1 in the group having scored 21 goals and conceded only 3, impressively not conceding a single shot on target in their last game vs Cyprus. \n\nAustria are starting to look a very strong side under Ralf Ragnick and come into this game with no fresh injury concerns. Bosnia however have 3 players suspended. \n\nBosnia are a half decent side but it as very much been a case of them being the best of the rest in the group and Austria should be able to take control of the game and get the job done. I predict a 2-0 win for the hosts. \n\nAs always nothing is guaranteed in sport so bet responsibly.. but the facts point towards this being a winning play on a very regular basis.\n\nIf you appreciate my picks and are making money, any tip is appreciated link below for the research etc.\n\nhttps://paypal.me/PaymePlease9937\n\nBOL to those tailing and as always, see you on the other side  🫡🫡🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npeyu0m/"
    },
    {
      "created_utc": 1763427630.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Tuesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ozy59f/pick_of_the_day_111825_tuesday/npeyeeh/"
    }
  ]
}