{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 2/13/26 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/",
  "target_date": "2026-02-13",
  "timezone": "America/Chicago",
  "collected_utc": "2026-02-13T02:45:23.292642+00:00",
  "comments": [
    {
      "created_utc": 1770950468.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 32-43-5 (Avg Odds +125)\n\n**Last 5:** (most recent on left) ❌️✅️✅️✅️❌️\n\n**Previous Pick:** Dango Ouattara 1+ SOT (+115)❌️\n\n**Today's Event:** English FA Cup (Soccer) | Hull City vs Chelsea (11:45 AM PST)\n\n**Pick:** Chelsea TT O2.5 Goals (+100)  1 unit to win 1 unit\n\n**Write Up:** Well I will say Ouattara had a great game for Brentford, but opted to pass/cross the ball every time he got it in a dangerous area, including one time where he had a close chance at goal he could have scored. Disappointing but I still think it was a good read and I'd play it again. \n\nFA Cup action is back and we've got one Friday match where Championship side Hull City host EPL side Chelsea in this 2nd round matchup. In the previous round, Chelsea beat Charlton (another Championship side) 5-1 away. I actually backed Chelsea for a similar play in that match. While Hull City is significantly higher up on the Championship table than Charlton was, they actually have a worst defensive record and have conceded 5 more goals than Charlton this season. \n\nChelsea will likely follow their typical early cup round blueprint, they will send out almost their entire 2nd team and hope they can do the job. If at halftime they aren't up by a few goals, they'll bring in their big names and take control of the game. Last round they scored four 2nd half goals, as an example. With that said, don't be shocked if they don't score much in the first half, but having been knocked out of the Carabao Cup, they'll take this game seriously as coach Rosenior will want silverware in his first season.\n\nI love the value here for Chelsea to get 3 goals at even money. BOL and happy Friday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53hvvc/"
    },
    {
      "created_utc": 1770950068.0,
      "author": "DuckDuckGooseBANG",
      "text": "Record: 7-7 (-1.94u)\n\nLast: USA -3.5 PL - ✅\n\nPOTD: Olympic Hockey: Canada v Switzerland, Celebrini Anytime Goal Scorer (1u to win 1u)\n\nWrite Up: Time to start getting a streak going. Today we’re going with Canada v Switzerland. Macklin Celebrini is a young gun who’s going to show he has what it takes to keep up with the best. Last time I picked him to score a goal in the NHL season it didn’t go right for me. That game though, he didn’t have Conor Mcdavid on his line. He scored on Thursday and played very well. He’s on a line with Connor Mcdavid (the best player in the league right now) and Tom Wilson. Mcdavid seems to be choosing to be a play maker over a goal scorer which helps this pick even more. I’d also like to add this was this teams first time playing with each other. You could see from the start to the end the progression they had playing with each other.\n\nBOL if Tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53gt07/"
    },
    {
      "created_utc": 1770949756.0,
      "author": "DescriptionGood8718",
      "text": "Where is sp 😭",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53fyoi/"
    },
    {
      "created_utc": 1770946465.0,
      "author": "micahpugh",
      "text": "POTD Record: 100 - 52\n\nLast POTD: ADM u12.5 games - W\n\nPick: Tallon Griekspoor vs Felix Auger-Aliassime Fist Set score after 4 games 2-2(-190 odds via FD) 1U\n\nEvent: ATP Rotterdam Quarterfinals 12:30 P.M. CST\n\nDon’t have a ton of facts or numbers to back this one up, more of a gut feeling play. FAA is in top form coming off a tournament win in Montpelier, where he loves playing indoor, anywhere. On the other side, Griekspoor loves playing at home and all we are asking for is 2 service holds from each to start this one. I don’t expect this one to be one sided but a pretty competitive match.\n\n[PayPal](https://www.paypal.me/micahpugh?locale.x=en_US)\n\n[Venmo](https://venmo.com/u/Micah-Pugh)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o5371bc/"
    },
    {
      "created_utc": 1770946117.0,
      "author": "222benz",
      "text": "Record: 10-14-1\n\nNet Units: -11.08u\n\nROI: -11.60%\n\nLast Pick: Arsenal ML ❌\n\nSport: eSports | Dota 2\n\nEvent: BLAST Slam VI Playoffs | Falcons vs. Liquid & Yandex vs. Heroic\n\nTime: 9:00 AM EST \n\nPOTD: Parlay: Falcons ML + Yandex vs Heroic Over 3.5 Maps @ 1.88 odds (5u)\n\nWrite Up:\n\nTeam Falcons are simply the better team. In a Best-of-5, you can't cheese your way to victory, you need a deep hero pool, strategy and superior macro. Falcons have all of 'em. Liquid might steal a game or two, but Falcons will win the series.\n\nOn the other hand, Yandex is playing with Malik instead of Noticed. While Malik is good, playing with a stand-in usually causes some communication breakdowns. That makes a clean 3-0 sweep for Yandex very unlikely. Heroic just beat Tundra by playing pure chaos Dota. They are scrappy enough to take at least one map off anyone. We don't need to pick a winner here. We just need both teams to win at least one map. Given Yandex's firepower and Heroic's momentum, a 3-1 or 3-2 scoreline is almost guaranteed.\n\nFalcons win, and the other series turns into a brawl. We cash.\n\nBOL.\n\nhttps://buymeacoffee.com/222benz",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o5363n2/"
    },
    {
      "created_utc": 1770945400.0,
      "author": "ken-kilos",
      "text": "Lifetime Record: 12W-9L\n\n2026 Record:\n\nhttps://preview.redd.it/1mncrnbbx5jg1.png?width=379&format=png&auto=webp&s=a6e8f834df8feba3467cb347a79c7e8cb81fd8ef\n\n[](https://preview.redd.it/pick-of-the-day-2-12-26-thursday-v0-al1xd95sfyig1.png?width=373&format=png&auto=webp&s=5b3ad4e06d78652035a53f1c66f48a836226fe95)\n\nStreak: ✅✅✅✅✅❌❌❌ <--- Latest\n\nFootball | Bundesliga | 19:30 (GMT)\n\nGame: Borussia Dortmund vs Mainz\n\nPick: Borussia Dortmund Win + Over 1 corner in the 2nd Half for Borussia Dortmund - 1.95 (Bet365)\n\n*Recap: Arsenal just had to bottle the lead. Oh well. On to the next.*\n\nWrite Up:\n\nI'm headed for the league with clearly defined hierarchies and a status quo that doesn't deviate often.\n\nDortmund are phenomenal at home having not lost a single game there (8W-2D-0L). They drew against Stuttgart and Leipzig, two very strong opponents. However, their opponent today is far from strong.\n\nMainz have managed just 2 away wins in the Bundesliga and honestly, I don't see them even managing a draw in this game. I expect a barrage of attacks from Dortmund that'll hopefully lead to goals and a good number of corners in each half.\n\nGood luck if you tail! 🍀",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53457u/"
    },
    {
      "created_utc": 1770945154.0,
      "author": "lordestros",
      "text": "Last 5 POTD : ✅️✅️✅️❌️❌️\n\n**Previous pick**: Dougie Hamilton over 3.5 shots (+135) ❌️ (3 shots)\n\n**POTD Record**: 23-21\n\n**Today's Pick:** Switzerland vs Canada 3:10 pm EST (Olympics/Hockey)\n\nUnder 6.5 goals (-135)\n\nAlthough Canada has the better team, Switzerland (#3 in IIHF world rankings) has always been a threat on the international level. With now notable NHL players like Roman Josi, Timo Meier, Nico Hichsier, Nino Niederreiter and J.J Moser on the team, I expect Switzerland to put up a good fight and keep it under 6 goals especially after a great 4-0 performance against France yesterday. I know France isn't Canada but Canada has always struggled against Switzerland in the Olympics so I expect them to not take their opponents lightly and not go for a super aggressive game.\n\nIn net for Switzerland will either be Leonardo Genoni who is a Swiss legend and has brought Switzerland to a 2nd place in 2024 and 2025 at the IIHF World Championships while dominating the Swiss league over the years or it will be Akira Schmid who although hasn't had the best stats this year in the NHL has played very well with the Swiss team in 2024 with a 3-0 record .946 percentage and 0.86 goals allowed on average.\n\nAlso only one of the men's hockey game in this year's Olympics went over the 6 goals line!\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o533gs0/"
    },
    {
      "created_utc": 1770944252.0,
      "author": "Traditional_Pay_7871",
      "text": "Record 4-3\n\nLast pick:  Roma -1 Asian handicap @1.85 ✅\n\nEvent: Pisa vs Milan\n\nTime: 2:45 Pm EST\n\nPick: Milan -1 asian handicap @ +100\n\n\nMilan is back after a long break, unfortunately they have a lot of injuries in attack, Leao will miss the game most likely, the only other alternative is Loftus-cheek as per the last game, that's why the odds are so juicy, but Pisa is a very weak team defensively, Inter scored 6 against them just a few weeks ago, I expect Milan midfield to step up, with Rabiot and Modric shooting and serving balls all over, Allegri struggles against defensive teams so we might see goals until the second half (I will probably sprinkle something at halftime)  Pisa has no arguments to get a draw like they did in the previous match between these 2 teams, they are one of the teams that will get relegated, Milan will at least win by 1, if we get a push I'll take it but the odds are too good to let it pass.\n\nIn boca al lupo",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o530yz3/"
    },
    {
      "created_utc": 1770943965.0,
      "author": "Synaptic_Snowfall",
      "text": "**POTD Record: 2-1**  [Net Units:  **+2.23**]\n\n**Previous Pick: J. Pegula vs. M. Kostyuk M. Andreeva/M. Kostyuk Total Games OVER 21.5**❌️\n\n***Today's*** **Event: ATP 500 Rotterdam | B. van de Zandschulp v. A. de Minaur | 8:10 AM EST**\n\n***Today's*** **Pick: B. van de Zandschulp + 4.5 Games @ 2.00 / +100 (Hard Rock) | 3 Units**\n___\n\nADM is, understandably, the heavy favorite here but I do think he's overvalued.  Van de Zandschulp has been playing some of his best tennis lately.  In the AUS Open, despite losing in straight sets, he frustrated the hell out of Djokovic — who was playing out of his mind.  He has a remarkably high court IQ, which shows in his ability to manipulate his opponent's position on the court and create tough angles.  ADM owns the H2H here 3-0, but their last meeting a year ago ended 6-4, 6-4, which would net us a win here.  Van de Zandschulp just surprised bettors in his massive upset of Tsitsipas, and I expect him to maintain that momentum going into these quarterfinals.  He should be able to overpower and outplay ADM in a sufficient number of points in order to keep this one close and get us back into the win column.  BOL.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o5305pf/"
    },
    {
      "created_utc": 1770943431.0,
      "author": "kab1218",
      "text": "Record: 27-34-1\n\nLast 5 recent on the right: ❌❌❌✅✅\n\nNet: -33.3\n\nPrevious: Switzerland | Swiss Super League | 230pm Eastern | FC Thun vs Lausanne-sport | BTTS O2.5 goals 3U @ -105\n\nThun dominated this game but let Lausanne get one in. Moving on.\n\nToday: France | Ligue 1 | 305pm Eastern | Monaco vs Nantes | Monaco to win & O 1.5 goals | 3U @ -136\n\nMonaco have historically had the edge in this matchup and are typically much stronger at home. They create more chances, score more consistently, and usually control games against mid-to-lower table sides like Nantes. From a win probability standpoint, Monaco are generally in that 55–60% range here.\n\nAs for the goals, this fixture regularly produces at least two. Over 1.5 goals hits at a high rate in their head-to-head history, and Monaco alone are often capable of covering that line. With Nantes tending to concede on the road, a 2-0 or 2-1 type result feels statistically aligned with the trends.\n\nOverall, you’re backing the better team in a matchup that usually sees multiple goals — a logical and data-supported angle.\n\n\n\nBOL if tailing ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52ymqw/"
    },
    {
      "created_utc": 1770943056.0,
      "author": "wes2211",
      "text": ">**Record:** 131-121\n>**Net Units:** +16.66 units\n\n>**Curling** | **Olympics - Women's** | **8:05AM EST**\n\n>**Pick:** Sweden -2.5 @ 1.83\n\n>Sweden picked up two wins on Thursday, 8-4 over Japan and 9-4 over USA. They really seem to have the ice figured out early here. Their opponent, Denmark, were dominated by Canada in their opener and managed to squeak out an extra end win over Japan, despite being outplayed. Sweden looked very strong day one but Denmark looked like the weakest team in the field. Sweden should have little issue covering -2.5 against Denmark after doing so against two stronger teams yesterday.\n\nEDIT: FD put up Sweden -1.5 @ 1.94 so go play that instead.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52xjhn/"
    },
    {
      "created_utc": 1770941836.0,
      "author": "FookinFootball",
      "text": "**Record:** 1-0-0\n\n**Net Units:** +1.05U\n\n**L10** 💰\n\n**Last Pick:** Thun ML +105\n\n**Soccer | Netherlands Eredivisie  | 2:00pm / EST**\n\n**Pick: PSV -1.5 -167**\n\n**Write Up:** PSV currently sit a top of the table.  In 22 matches they have scored 66 goals and only given up 26.  Thats an average of 3 goals per match while giving up just over 1 per match.  They are in great form in their last 5 averaging 2.8 goals per game while giving up 1. Dating back to 1994  they have never lost to FC Volendem and have only tied twice.  In that time they have met 20 times and only 4 times PSV hasnt covered -1.5 goals.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52u0sg/"
    },
    {
      "created_utc": 1770941370.0,
      "author": "I_am_Aspect",
      "text": "* **Current Record:** 4W - 3L\n* **Form:** ❌✅✅✅❌❌✅\n* **Last Bet:** Nigma Galaxy ML (Winner ✅)\n* **Sport:** eSports | Dota 2\n* **Event:** BLAST Slam VI\n* **Match 1:** Team Liquid vs. Team Falcons — **Over 3.5 Maps**\n* **Match 2:** Team Yandex vs. Heroic — **Over 3.5 Maps**\n   * **Combined Odds:** 1.90\n* POTD: Liquid vs Falcons OVER 3.5 maps + Yandex vs Heroic OVER 3.5 maps @ 1.90\n* **Unit Stake:** 5 Units\n\n# \n\nWrite-up: Back with Dota 2 Blast slam VI playoffs, very excited because this is a **Best of 5 (Bo5)** match and value parlay. For the \"Over 3.5\" to hit, we simply need the underdog in each match to win at least **one map**.\n\nSince it's Bo5, I don't like to bet on maps over/under without seeing the draft live. However both of these matches are closer than the odds suggest. Team liquid won against Falcons in their group stage match a couple of days ago. Heroic as well; they took a map off of Yandex in a 28-minute stomp game. Both of the underdogs won their matches in the group stage. Falcons have also been very shaky and inconsistent after their TI win; I can totally see Liquid putting up a good fight. at the same time Heroic has been the biggest trap team in Dota; they always somehow turn up in Bo3-Bo5 playoffs and play great. We just need both matches to not finish 3-0. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52so8r/"
    },
    {
      "created_utc": 1770940989.0,
      "author": "defiant_degen",
      "text": "\nOverall record 75W-49L\n\nDecided to come back with a pick, been a very busy few months and with work and not had the time to commit to this like I did before, will come and go with picks but not as frequently as before.\n\nUnits +47.9\n\n\nLast pick: unknown?\n\nSome time ago I can't recall....\n\n\n\nToday's pick:\nLeague of Ireland Premier Division.\n\nDerry City vs Dundalk\n\nDerry City win and over 1.5 goals\n\n(1.95) 3 units\n\nThe Candystripes host their 2nd game of the season, after a strong performance that even got the better of Sligo Rovers.\n\nDerry City have a ridiculous financial advantage over the rest of the teams in the league of Ireland who outside Shamrock Rovers general struggle to generate any revenue.\n\nDerry is owned by a self made Billionaire, who has bailed them a few years back and invested not a crazy amount but they did have a solid transfer window bringing in local legend James McClean and the impressive James Clark in midfield from Bohemians.\n\nThey finished last season very strong, if it wasn't for a poor start to the season they would have challenged Shamrock Rovers for the title, with the squad they have assembled they could very win the league this season.\n\nDundalk managed to get promoted back to the top division, but they have had financial issues the past few years which is why they got relegated last season, they have not managed to sign anyone that  stands out on paper, and they would do well to not finish bottom imo.\n\nThe weather in Dundalk has been absolutely brutal the last couple of weeks, they had their first match with Shamrock Rovers postponed due to a waterlogged pitch\n\nDerry have 2 competitive match under their belt, looking strong from the small sample so far. Dundalk haven't played since their friendly loss to Shelburne 23 days ago, they will lack that sharpness and the very heavy rainfall has left training facilities in poor condition also.\n\nBetween the clear gulf in class, Dundalk's obvious lack of preparation and match fitness and the ridiculous financial gap between these sides, I see this being a one sided match. I would be very surprised if Derry didn't manage at least 2 goals and they should manage a comfortable win at home to make it 2 wins from 2 in the league to add to the win against rovers before that in the Super Cup.\n\nCoffee's appreciated if you have found my write ups and bets useful ☕\n\nhttps://buymeacoffee.com/willo77\n\n**BOL and only bet what you can afford to lose!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52rki3/"
    },
    {
      "created_utc": 1770940077.0,
      "author": "Easy_Independence811",
      "text": "**POTD Record**: 8-1-36 (HIGH ODDS PLAYER HERE)\n\nFrom oldest to newest: ✅❌✅❌❌❌❌❌✅❌❌❌❌❌❌❌❌❌✅❌❌❌❌❌❌✅❌❌❌❌❌✅❌❌❌❌❌🅿️❌✅❌✅❌❌❌\n\n\\+7,5 units (translated all dollars to units).\n\nLast pick : **Celtic -1,5 handicap first half** vs Livingston at **2,81** odds ❌\n\n**CET 20:00 Football Eredivisie**\n\nToday: Volendam vs PSV. **First half result 0-3** at **12** odds\n\nExplanation: Not alot to explain, other than PSV being on a completely different level compared to their opponents and leading big on H2H record. I do believe that they will end this game in the first half by going all out, and not do the same mistake as last time. They were losing 1-0 vs Gronningen in their last game and then managed to win it in the second half. The scenario here is that they will be focused to the max and dominate in possession, chances created and xG. They will have at least 2-0 here in the first half. But I do suspect a 3-0 score more. Let´s get this one in!\n\nOn the side note: My tactics won’t change by lowering the odds. The goal is to find high odds to play here. I’m trying to keep track of the results in all of the top leagues. We will **always aim for** **long term** gains here and make sure to manage your bankroll. I will try to post another pick in the coming days. Seems like a good week is coming, with lots of league football to pick from. Good luck everyone.\n\nBookie: **Coolbet** and a **5** unit bet. Gamble **responsibly**!\n\nAppreciate all the support:\n\n[https://buymeacoffee.com/longterm123](https://buymeacoffee.com/longterm123)\n\n[paypal.me/LongTerm123](http://paypal.me/LongTerm123)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52owq8/"
    },
    {
      "created_utc": 1770937903.0,
      "author": "damagebabee",
      "text": "**POTD** Record 135-04-108\n\n\n\nGKS KATOWICE VS LEGIA\n\nDate: 13 FEBRUARY 2026 at 20:30\n\nBET ON: Match odds- LEGIA\n\nOdd: 2.23\n\n\n\n\\- Backing Legia Warsaw to win against GKS Katowice is strongly supported when combining injuries, motivation, and tactical signals from recent Polish media coverage. Coach Marek Papszun has made it clear in press conferences that excuses are over — despite absences like Rafał Augustyniak, Jean-Pierre Nsame and Rúben Vinagre, he has emphasized visible structural progress, improved defensive organization, and intensive work on set pieces and compactness within the 3-4-2-1 system. Legia’s recent performance in Gdynia showed better spacing between lines and greater midfield control, suggesting the breakthrough is close. Crucially, the motivational edge lies with the Warsaw side: the pressure to collect points has created a “reaction game” mentality, with players publicly speaking about responsibility and restoring standards. Meanwhile, GKS Katowice are also weakened (Jirka, Paluszek, Rejczyk absent), limiting their pace in transition and defensive stability, and their recent messaging has been more cautious than assertive. With Legia tactically tightening up, drilling defensive discipline, holding historical superiority in head-to-head meetings, and entering this fixture with heightened urgency, the value clearly leans toward a Legia victory.\n\n",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52ihxs/"
    },
    {
      "created_utc": 1770937804.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 51-26-1\n\nSoccer\n\nLast Pick: Thun ML & Midtjylland to score @ 2.4 ✅\n\nLast Pick Write Up: A nice plus money win to make up for that annoying loss the other day. You know I do everything for you. I love you, even the guys who started crying in my DMs when a pick lost.\n\nNow for today..\n\nPick: NK Slaven Belupo-NK Lokomotiva BTTS & Dortmund/draw @ 2.05\n\nWrite Up: \n\n1. In their last 10 H2H since late 2023, BTTS has hit 8/10 times. Slaven has hit BTTS in L5/7 overall and Lokomotiva has hit BTTS in their last 4/5. These two played a month ago and the score went 4-2 for a Lokomotiva win - both scored two goals in the first half!\n\n2. 2nd place Dortmund has not lost at home all season - I don’t expect them to lose to 14th place Mainz.\n\nBOL!\n\nShow your boy some love: https://buymeacoffee.com/yeahicreatedsomethin\n\n￼​",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52i777/"
    },
    {
      "created_utc": 1770937222.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52gffm/"
    }
  ]
}