{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/17/25 (Wednesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/",
  "target_date": "2025-12-17",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-17T17:45:05.021131+00:00",
  "comments": [
    {
      "created_utc": 1765981578.0,
      "author": "Laird87",
      "text": "POTD Record: 208-208, -79.43 Units\n\nCurrent streak: ❌❌❌❌❌\n\nLast 10: ❌❌❌❌❌✅❌❌✅❌\n\nWho woke up ready to fade???\n\nChicago Bulls ML vs. Cleveland, +164, 1 Unit, 8:00 PM EST\n\nGeorgi Tech didn't suck as badly as I thought.  I'll still be betting against them later because they still suck.  Moving on to an NBA team that really does suck, the Cleveland Cavaliers.  This team BARELY beat the Wizards on the road and just got fucked by the Hornets at home.  They don't care and the Bulls will win.\n\nBOL, tail or fade! Tip Jar: [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuil4ee/"
    },
    {
      "created_utc": 1765980605.0,
      "author": "DiveBarFan",
      "text": "POTD Record = 0-0-0\n\nGame = Old Dominion vs USF (CFB)\n\nPick = USF ML (-145 on DK)\n\nDD = I think both teams are fairly evenly skilled but the reason I like USF is because both teams are playing with a backup QB. OD’s Qb is a freshman playing in the biggest game of his career. USF backup is a senior Qb who was on an SEC roster for the last 5 years. The game is also in Florida \n\nIt should be noted USF has an interim coach this game but I would like to think he knows how to coach this team being an assistant for so long.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuii83w/"
    },
    {
      "created_utc": 1765979306.0,
      "author": "Donloppa",
      "text": "Record: 8-2\n\nNet Units: +9.51 units\n\nPick: NCAAB\nSouth Florida vs Alabama Bet 365 -110\n\n6:00pm MST\n\nOVER 181.5\n\n2 units to win 1.81 units\n\nPotd won again yesterday. Thats 6 in a row, let's keep the streak rolling. \n\nMy model analyzes line movement with where betting is going and tells me the play to go with.\n\nThis is the play its telling me to go with today. I feel crazy playing this when the line is so high but here goes nothing. If your joining on this play be prepared for a possible sweat. \n\nI will also post a few other plays that I currently have in the ncaab thread later today. \n\nFeel free to fade",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuiegbj/"
    },
    {
      "created_utc": 1765978030.0,
      "author": "Savings-Dig8902",
      "text": "POTD RECORD (1-1)\n\nKeldon got the boards it wasn’t pretty but he managed to grab three in the first quarter and 1 in the 3rd to cash his prop. \n\nPOTD: Donte Divinenzo O14.5 points +105\n\nToday we move to Minnesota where the TWolves have been without Ant. But playing well making them 7-3 in their last 10 and 9-4 at home. Donte has hit this line in 4/4 games without Ant and 7/10 games played. Memphis ranks 19th in points versus SG and 12 in points against giving Donte a neutral edge against this line with +money odds. \n\nI’m new to this POTD thread let me know if there’s anything I can do to brush up on my explanations and what not. Thanks BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuiau23/"
    },
    {
      "created_utc": 1765976038.0,
      "author": "coltysports",
      "text": "__POTD Record:__ 4 - 2 __+1.5u__\n\n__Previous Pick:__ Louisville +2.5 ❌️\n\nLouisville's best player went out 15 min before game time. If I would've known he was questionable I would've left it alone. Tennesee played great D. You win some you lose some 🤷🏼‍♂️.\n\n__Event:__ Vanderbilt @ Memphis 7pm EST\n\n__POTD:__ Vanderbilt -7.5                       \n\n__Reasoning:__ I like Vandy staying in Tennessee vs a 4-5 Memphis today. I'm thinking their high powered offense keeps on rolling and they win by 10+. \n\n__Bets:__ .5u\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nui5in1/"
    },
    {
      "created_utc": 1765972646.0,
      "author": "Ralphjinasseater",
      "text": "Record : 16-14-2  \n\nNet units:(-0.81 units)\n\nLast pick: Karl-Anthony Towns under 31.5 points and rebounds ✅✅\n\nPick of the day : Jaylen Wells under 14.5 Points (-125) hard rock \n\nReason • \n\nSeems Risky (Last 5 games he went over )Wells draws a BRUTAL matchup versus this Timberwolves defense.\n\nWells scores 43% of his points from spot up, where the Timberwolves rank FIRST BEST defensively. We have seen Wells go under this line in 9/11 starts this season against top 15 spot up defenses, including going under in all 9/9 WITHOUT Edey.\n\n47% of Wells shots come from C&S, where the Timberwolves rank 9th BEST defensively and we have seen Wells go under this line in 7/9 matchups this season against top 15 C&S defenses. Wells get’s another 30% of his shots come from <10 feet, where the Timberwolves rank 8th BEST defensively.\n\nA combined 48% of Wells points come from ATB 3’s and the RA, where the Timberwolves rank 5th BEST and 10th BEST defensively. \n\nWells has gone under this line in 6/7 matchups this season against team that rank top 15 in BOTH C&S and ATB 3 defense, with him recording 10 or fewer points in 6/7 of those games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuhxq2i/"
    },
    {
      "created_utc": 1765971112.0,
      "author": "Longshot2069",
      "text": "POTD Record: 1-0-0 [+2.4 Units]\n\nAll Plays 1 Unit\n\nPrevious Play: Tue Win +2.4 Units Lucas Raymond 2+ Points @ +240\n\nPOTD - Wednesday Dec 17th, 2025\nNHL: Utah vs Detroit @ 7:30pm Est\n\nProp - 2 Player Prop Parlay -101\nAlex DeBrincat 1+ Point\nLucas Raymond 1+ Point\n\n- Same story as yesterday's pick, both these guys have been 🔥 last 10 games, and I don't see things changing with Utah coming into town as opponents scoring 3+ goals in last 6 or 9 games they played.  \n\nGood Luck 👍",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuhuk4k/"
    },
    {
      "created_utc": 1765970189.0,
      "author": "kab1218",
      "text": "PoTD 7-6 woooo\n\nNet: +0.5\n\nPrevious: EFL Cup 1pm MTN Chelsea @ Cardiff city. Chelsea to win and O 1.5 goals 2u @ -168\n\nWrite up: Chelsea dominate the end of the game. Moving on. \n\nToday: Celta de Vigo vs Albacete (Celta moving on) + Villarreal v Racing Santander (Villarreal moving on) 2U @ +116\n\nWrite up: MOVING ON IS NOT ML. If they go to penalties, the game ends in a draw and will lose the bet. Taking safer options in case either go to penalties. \n\nCelta de Vigo is the significantly stronger side here, they should win. Celta is 6th in La Liga while Albacete are 14th in Santander. Celta have won 3/4 of their last away games. I don’t see them losing this but I want to play it safe. \n\nVillarreal is also stronger here. They are 3rd in La Liga and Racing are 1st in Santander. Even being first in Santander, they aren’t a strong La Liga side. Villarreal are 3/4 in their last 4 away games. Racing are 2-0-2 at home in their last 4. I see Villarreal seeing this pit as well. \n\nBOL if tailing",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuhsrij/"
    },
    {
      "created_utc": 1765966894.0,
      "author": "Lyx97",
      "text": "Record: 16-6-2\n\nNet Units: +5.00\n\n*Prev Pick : Wealdstone Asian Handicap 0 @ 1.77 (1u) --> Loss \\[God knows what went into this game, but they had to break their 7 match losing streak only when we bet. But, such is the way of betting on lower leagues\\]*\n\nFootball | Champions League Women | Paris FC W vs Barcelona W | in \\~9.5hrs\n\nFootball | Champions League Women | Leuven W vs Arsenal W | in \\~9.5hrs\n\nParlay Both matches Over 2.5 goals @ 1.6 (1u)\n\nWrite Up : Not going to the FA cup, since both the bets i had were already posted (-1.5 City & btts in the other match). So, this took some looking (didnt want to bet on Celtic), and finally settled on another risky league - the women's CL, where nothing goes as per plan.\n\nStill, i feel both these matches will see over 2.5 goals due to the below reasons\n\n1. Six of the last eight games of Barcelona W ended with three or more goals & Four of the last five home games of Paris FC ended with over 2.5 goals.\n\n2. Leuven W have seen over 2.5 goals in 2 of their last 3 home matches & Arsenal Women have seen over 2.5 goals in 4 of their last 6 matches\n\nAs I said, please do be careful about this bet, since women's footy is known to be unreliable. Do bet only what you can lose.\n\nHope we go back to winning ways & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuhmssj/"
    },
    {
      "created_utc": 1765966282.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 5-6-2 *Yet another push in a row for another good read. Real Madrid Castilla scored barely 3 minutes into the game and were all over Man City, but couldn’t get that second. In the second half they proceeded to concede a goal against the run of play, and then a red card sealed their fate. 1-1 means our unbeaten streak lives to see another day but I’d really want to see us start grabbing some wins asap*\n\n**Event:** Jordan Division 1, Ma’an v Kfarsoum, 7:30 am EST\n\n**POTD:** Kfarsoum DNB +110, 3.5 units\n\n**Write Up:** I browsed some obscure leagues and found this value play gem in the Jordan league. Kfarsoum might be sitting near the relegation zone while their opps are midtable, but the **difference in form** is staggering. Kfarsoum have **comfortably won their last two while Ma’an have 2 losses and a measly draw in their last three.** The recent uptick in form and the fact a win would put them **out of the relegation fight** for the time being, I can see Kfarsoum fighting teeth and nails and nabbing a narrow win here. Another good point about this team is that they’ve **been able to find the back of the net semi-reliably (20 goals in 12 games)** and they actually have **more goals scored than the home team**. Ma’an do boast a strong defence, allowing just 9 goals in the 12 games they’ve played so far, so I could see this game ending in a draw, hence the DNB at good odds to cover us. BOL if you do tail and let’s break this push curse 🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuhlqzv/"
    },
    {
      "created_utc": 1765965873.0,
      "author": "rednak6",
      "text": "Record: 0–0 | Net Units: 0.00u\n\n\n\nFootball | Copa del Rey | Racing Santander vs Villarreal CF | 21:00 CET\n\n\nPick:\nBTTS + Over 2.5 @ 1.95\nUnits: 1u\n\n\nFirst POTD. Been here a while and finally giving it a try. \nRacing are in decent form and usually play open at home. Villarreal have more quality going forward but haven’t been solid defensively. Cup game, different levels, both sides should get chances. Once the first goal goes in, this should open up. Price looks fair.\n\n\nBOL if you tail. Tracking starts today.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuhl1ib/"
    },
    {
      "created_utc": 1765962651.0,
      "author": "donjavogosca",
      "text": "POTD Record: 22-15, +4.1u, (ROI +8.8%)\n\nPrevious Pick: Vojvodina to win -10.5 spread, 1.80, 1.5u ❌️, (last 5: ✅️✅️✅️❌️❌️)\n\nEvent: WABA, Partizan - Orlovi, 16:00h\n\nPOTD: Partizan to win the first half -17.5 spread & Partizan to win the game -32.5 spread, 2.65, 1.5u ✅️\n\nBig risk, big reward play, at least with these odds. If Partizan can cover the half, the game handicap should come easily. 43-71 against Orlovi in the middle of October, and 9 lead after the half. Back then, the odds were much more favorable for Orlovi; of course, Partizan was still the favorite.\n\nSince then, the Orlovi crisis has deepened, and it is clear they haven't done a good job with this roster. They lost big in their last away game against Buducnost. It was 51, and their last two were at home. Lost both, by 22 and 25.\n\nEdit: 104-40, 46-18 halftime",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuhfn31/"
    },
    {
      "created_utc": 1765962079.0,
      "author": "wes2211",
      "text": ">**Record:** 123-99\n>**Net Units:** +29.93 units\n\n>**Curling** | **Canadian Open** | **1:00PM EST**\n\n>**Pick:** Team Epping ML @ 2.15\n\n>Team Epping face Team Jacobs on the second day at the Canadian Open. Team Jacobs' first game didn't go their way as his team fell 5-4 to Team McEwen in a shootout. Hebert struggled a bit with his draws and Jacobs' hitting accuracy was off as well which led to poor play when they had hammer. Team Epping, on the other hand, took care of business against a very good Team Muskatewitz in the opening draw and looked very strong in doing so. These are two elite teams that are typically close to a coin flip matchup anyway so based on the opening draw eye test favouring Team Epping, we'll take the plus money value here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuhep1g/"
    },
    {
      "created_utc": 1765960170.0,
      "author": "Plastic_Permission81",
      "text": "POTD Record: 3–2–0\n\nNet: +5.71 units\n\nROI: 30.1%\n\nForm (Last 5): ✅ ✅ ✅ 💩 💩\n\nLast Pick Reflection: Golden State −4.5 was a bad pick. I rushed into it and could have just passed. That one is on me. There were better picks that day like Hawks +2.5 first quarter, Cavs first quarter -4.5, and 76ers first quarter ML, which I did separately and all hit. Ironically, I took a break after that from posting my picks and on NFL Sunday I went 7/7… Had chargers, vikings, and broncos as upsets, and then bills, rams -5.5, and bears -2.5 first quarter and -7.5 full game… I should’ve just stuck the process and kept giving picks each day, but I needed a chance to recalibrate. Anyways, onto the POTD!\n\nEvent: NHL | Winnipeg Jets at St. Louis Blues | 7:00 PM CT\n\nPick: Winnipeg Jets −1.5 (+172) for THREE units\n\nWrite Up: Winnipeg has been the more complete team in this matchup, showing better structure and consistency at five on five. They generate steady pressure and have shown the ability to turn small advantages into separation.\n\nSt. Louis has struggled against teams that control tempo and play organized hockey. At plus money, the puck line offers better value than the moneyline in a spot where Winnipeg should have chances to pull away late.\n\nUnit win rate:\n\n5 Unit Plays: 2–1\n\n3 Unit Plays: 1–0\n\n1 Unit Plays: 0–1",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuhbhyz/"
    },
    {
      "created_utc": 1765959931.0,
      "author": "Rest_Few",
      "text": "Record: ✅✅✅✅\n\nPrevious pick: Cardiff vs Chelsea BTTS\n\nNet Units: 1U\n\nEvent: Farense vs Benfica\n\nPick: Total over 2.5 goals (1.70 odds)\n\nWrite Up: We are on a roll! 4 games now all won back to back! I hope we keep the vibe going ! \nThanks for the support and upvotes! \n\nSo here we go for today! Benfica’s attacking prowess shines through with over 2.5 goals in 5 of their last 6 matches and both teams scoring in all 6, while they’ve failed to keep a clean sheet in 6 straight games. Farense contribute to high-scoring trends, with no clean sheets in recent outings and both teams scoring frequently.\nHead-to-head history adds weight: Benfica dominate the last 8 meetings (6 wins, 2 draws), often producing goals. \n\nPlus I love mourinho ! \n\n\nIf this helps you out, a small tip is always appreciated 😊\n\n[Tip Jar](https://www.paypal.com/paypalme/FaisalGidado)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuhb3ka/"
    },
    {
      "created_utc": 1765959367.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 27-17-1\n\nSoccer\n\nLast Pick: St. Gallen VS Sion - BTTS at 1.6 odds - ✅✅\n\nLast Pick Write Up: Both teams put ball in net.\n\nNow for today..\n\nPick: Radnicki 1923 vs Cukaricki - BTTS at 1.68 odds\n\nWrite Up: Another trend based bet. These teams have played 8 times since 15th of August 2022. BTTS has hit in every one of those matches. In last 6/7 Cukaricki games, BTTS has hit. \n\nStreaks cannot last forever, but I think 1.68 are fair odds that this one will keep going for one more game.\n\nNot a part of the POTD, but I’m also doing a side bet of BTTS + Cukaricki/draw at 2.4 odds since the score went 1-1 the two last times these teams played and Cukaricki are higher in the tables with a not-horrible away form.\n\nEdit: BTTS hit easy ✅ the side bet isn’t looking too good though",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuha4uf/"
    },
    {
      "created_utc": 1765957133.0,
      "author": "Dramatic-Fox-4826",
      "text": "**POTD Stats:**\n\n**Record**: 47/37  \n**Profit in Units**: 43.7u  \n**Average Odds**: 2.07\n\n**The pick:**\n\n**Sport**: Soccer  \n**League**: Netherlands - KNVB Beker  \n**Time**: 21:00 ( GMT +2 )  \n**Event:** Fortuna Sittard v Almere City  \n**Pick**: Home Win & BTTS Yes **@ 2.82**  \n**Stake**: 3 Units\n\n**Write up:**\n\n**The pick:**  \nI’m playing **Home & BTTS – YES** here because the match fits a **home-control profile**, but not one that fully shuts the game down.\n\nThe odds place Fortuna Sittard as a clear favorite, and this profile consistently shows the **home side winning most of the time**. However, despite being labeled a *“1-0 Specialists”* profile, the deeper numbers tell a slightly different story. In this setup, **BTTS lands in 4 of 6 matches**, which means the away team often manages to score even when the home side is in control.\n\nGoal-wise, this profile is very reliable for **Over 1.5**, and many games move into **2–1 or 3–1 type scorelines** rather than clean, low-risk wins. The home team usually scores first, but the structure allows a response before control is re-established.\n\nSo instead of backing a straight home win or expecting a clean sheet, combining **home victory with BTTS** fits the actual behavior of this profile — **home dominance with a goal conceded**.\n\n**My Model in general:**  \nMy model is built around the idea that matches follow **recurring patterns**, not randomness.  \nInstead of predicting games in isolation, it groups matches by **odds profiles** and studies what *actually* happens when similar games are played.\n\nBy clustering historical matches with the same **home–draw–away odds**, I track how games usually unfold — goals, BTTS, scorelines, and game flow. From there, the model identifies **motives**: situations where teams are more likely to attack, trade goals, or avoid clean sheets.\n\nEvery pick comes from **data-backed profiles, not opinions** — combining odds structure, score patterns, and streak behavior to find spots where the market regularly repeats itself.\n\n***Il post more picks on the soccer thread!***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuh68r5/"
    },
    {
      "created_utc": 1765955990.0,
      "author": "DaggyNC",
      "text": "Record: 0-1\n\nNet Units: -1\n\nLast Pick: Ducks ML (Anaheim Ducks vs. Columbus Blue Jackets) - A close game, but Anaheim couldn’t control the puck in overtime and gave up a great scoring chance that Columbus capitalized on).\n\nHockey | NHL | Carolina Hurricanes @ Nashville Predators\n\nPick: Carolina Hurricanes -1.5 (+143)\n\nWrite Up: Carolina won 6-3 at home vs. the Predators earlier in the season, and looks to break out of a stretch of overtime games by striking hard and fast. The shaky defense of the Predators should give way to plenty of scoring chances for a Hurricanes team that takes many more shots per game than their opponents and dominates in both scoring chances and offensive zone possession.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuh47mr/"
    },
    {
      "created_utc": 1765954306.0,
      "author": "this_guy9",
      "text": "**POTD Record:** 17-15\n\n**Net Units:** \\+2.31\n\n**Previous Pick:** [✅ Dylan Harper o10.5 Points -112](https://www.reddit.com/r/sportsbook/comments/1pnq84i/comment/nuap4wz/?context=3)\n\nMonster game by Harper. Led all Spurs in Points. Lets keep this streak going.\n\n**🏀 Donovan Mitchell o30.5 Points +100** vs the Chicago Bulls\n\nMitchell's attempts are just insane these days. Over his L5, he's averaging 24.8 attempts a game. He's cashing about 44% of those buckets for an average of 31 points.\n\nCombine that with the atrocious Bulls defense and we're looking at a big game. Bulls' worst defensive zone is the above the break 3, where Mitchell shoots 44% of his shots. \n\nOverall, Bulls rank 28th overall in defensive rating and 29th in Points allowed to SGs. Mitchell averages 30 points against the Bulls on 20 attempts so with an average of 4-5 more, I see this line cashing.\n\nOver/Under set surprisingly high at 243.5. Expecting Cavs to shoot 3s and Bulls to push pace to keep up.\n\nFull stats if you'd like to do additional research: [https://www.statpick.ai/14870509/donovan-mitchell-points](https://www.statpick.ai/14870509/donovan-mitchell-points)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuh13qm/"
    },
    {
      "created_utc": 1765953086.0,
      "author": "UserMSDGCRS",
      "text": "Record: 1-2\n\nStreak: 1L\n\nNet Units: -3u\n\nLast Pick: Wealdstone Moneyline (+140 DK) 2u to win 2.8u ❌\n\nEvent: NBA Memphis @ Minnesota 5:00 PM 12/16/25\n\nPOTD (12/16/25): McDaniels Over 2.5 Assists (-136 DK) 4u to win 2.94u\n\nWrite-Up: McDaniels has consistently been getting 35-40 minutes a game, even when Edwards is healthy. With the T-Wolves at home against a worse Memphis team, I expect scoring to happen, and he should grab some assists just by being in the game so much if he plays as much as I expect him to.\n\nOver the last 5, McDaniels has averaged 3.4 assists per game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugytd6/"
    },
    {
      "created_utc": 1765951832.0,
      "author": "Whole_Job2709",
      "text": "Ewww wtf was that",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugweg8/"
    },
    {
      "created_utc": 1765951478.0,
      "author": "Mikeyxy",
      "text": "Joe, baby, where are you.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugvpc0/"
    },
    {
      "created_utc": 1765951352.0,
      "author": "Hey52511",
      "text": "NBA POTD 13-11\n\nLast Pick: Jalen Brunson Over 29.5 Points, that hurts 11-27 from the field, ends on 25 points.\n\nToday's Pick: **Josh Giddey over 7.5 Assists**\n\nA lot of picks on the board, but if I had to narrow it down to one, **Josh Giddey over 7.5 assists** stands out. Giddey ranks **top three in potential assists**, averaging **16.3 potential assists per game**, while still producing **8.8 actual assists per game**. That gap matters because it shows the opportunity is consistently there even when results fluctuate.\n\nIt is no secret the Chicago Bulls are leaning into a Pacers-style offense built on pace, ball movement, and three-point volume. There has even been chatter that the Bulls may have found their own version of Tyrese Haliburton. Giddey fits perfectly into that identity as a pass-first guard who thrives when shooters are active and decisions are quick.\n\nThere are pros and cons here, but the biggest reason I like this spot is the bounce-back angle. In the previous game, Giddey got into foul trouble early and played just **eight minutes in the first half**. Chicago trailed shortly after he left the floor, which highlighted how much the offense depends on his facilitation. That game skews recent perception and helps explain why this line feels slightly deflated.\n\nThe matchup further supports assist volume. The Cleveland Cavaliers are in poor recent form, nearly losing to the Washington Wizards, losing to the Charlotte Hornets, and dropping a game to a depleted Golden State Warriors. Over their last three games, Cleveland has allowed **15.3 made threes per game** on **41 three-point attempts**, both bottom-five marks in the league over that span.\n\nThat matters because Chicago attempts roughly **37 to 39 threes per game**, and Giddey’s assist totals are directly tied to that volume. At home, he still averages **15.7 potential assists per game**, showing the creation remains strong even if conversion varies night to night. The opportunity is there, and a home shooting environment generally stabilizes outcomes.\n\nPace and game environment push this further. Chicago currently rank **2nd in the league in pace**, playing at roughly **103.5 possessions per game**, and the game total is set at **243.5**. That combination points to a fast, offense-friendly script with elevated possession counts, which naturally increases assist opportunities for a primary facilitator like Giddey.\n\nThe only real con here is role-based variance. If Cleveland switches Darius Garland onto Giddey, the size mismatch could encourage him to look for his own scoring more aggressively. There is also the chance some possessions end in hockey assists or teammates initiate earlier in the shot clock. None of these remove the underlying opportunity, but they do introduce some volatility.\n\nOverall, this sets up as a strong buy-low spot. Giddey’s role is secure, his creation volume is elite, Chicago’s pace is among the fastest in the league, Cleveland is allowing heavy three-point volume, and recent foul trouble has helped keep the line reasonable. If teammates knock down shots at even an average rate, **over 7.5 assists** seems reasonable.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugvgb1/"
    },
    {
      "created_utc": 1765951285.0,
      "author": "Whole_Job2709",
      "text": "Tiebreak ima have to shower after this",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugvbnf/"
    },
    {
      "created_utc": 1765950302.0,
      "author": "Ghost_eggs",
      "text": "**POTD Record:** 4-1\n\n**✅✅✅**❌**✅**\n\n**Net Units:** \\+7.92\n\n**Previous Pick:** Josh Hart o 1.5 Steals + Blocks (-132 on DK); 4 units **✅**\n\n**Previous Pick Reaction:** Hart continues his defensive intensity, collects two steals by the early part of 2Q to cash us out. He disappeared for a bit (injury management?) in the middle of the game but then reappeared in the 4Q and blocked a shot right away just to ice the bet. All the sweeter that my Knicks got the W and the first Knicks trophy since disco was a thing.  \n\n**Today's Event:** NBA 🏀 Cleveland Cavs @ Chicago Bulls (5:00pm PST)\n\n**Today's Pick:** Lonzo Ball u 1.5 threes made (-109 on DK); 2 units\n\nIt's easy to hate on Lonzo given the hype he received coming into the league and that abomination of a shooting form he used to have, but I actually like what he contributes as a defender and playmaker.\n\nThat said, I will gladly fade his 3-point shooting while he is on a cold-streak in an already terrible shooting season (even for him). \n\nBall is under this line in 5 of L5 despite playing over 23 mpg, shooting a remarkable 17.4% (4/23) from three in that span. This stretch includes some pretty easy defensive matchups too, such as the Wizards and Hornets. A Hornets game, mind you, that went to OT and in which Lonzo played 32 minutes. Still under.\n\nThis is telling of his shooting struggles since joining the Cavs, shooting 26% from three this season, by far a career low. And it is exacerbated by other injuries to CLE's best perimeter shooters, Strus and Merrill, who might have otherwise drawn more defensive attention and given Lonzo more open looks. \n\nIn terms of matchup, while CHI isn't great defensively, they do give up 8th fewest 3PM to opposing point guards. And the Bulls have some solid on-ball defenders among their bench guards in Tre Jones and Ayo Dosunmu (listed as GTD) - not spectacular but good enough to keep Lonzo to his poor outside shooting. \n\nIndeed, in his only prior matchup against CHI this season, Lonzo went 0/3 from three. So the \"revenge game\" theory against his former team doesn't seem to be an issue.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugtcn5/"
    },
    {
      "created_utc": 1765950060.0,
      "author": "ptrckfrnndz",
      "text": "Choke incoming 🫠🫠🫠",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugsurt/"
    },
    {
      "created_utc": 1765949407.0,
      "author": "Technical-Primary302",
      "text": "CFB Cure Bowl\n\n Overall: 0-0\n\n\nPrevious: N/a \n\nPOTD: Old Dominion Vs South Florida Under 52.5\n\nWith two backup QBs replacing 1,000-yard rush dual threat qbs, an interim staff at USF, and ODU's top-20 scoring defense, the offensive \"explosiveness\" of both teams is effectively neutralized. Expect a grind-it-out game where the clock runs fast and touchdowns are hard to come by.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugri1b/"
    },
    {
      "created_utc": 1765948984.0,
      "author": "PogRashy",
      "text": "Record 0-0\n\nPick - Ventspils ML (1,6)\n\nReasoning - Spread should be 10+, but bookies are overrating the home court advantage",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugqltg/"
    },
    {
      "created_utc": 1765948407.0,
      "author": "deerhilldr",
      "text": "Record: 1-0 \n\nPrevious: NCAAB | 4PM PST Pick: U157 Louisville vs Tennessee (-110) 1U\n\nPick:  NCAAF South Florida -2.5 (-110) vs Old Dominion @ 2PM PST\n\nWrite Up: There’s some injuries floating around on both sides but I just like the way USF played this season and think they are the better proven team. Competitive and multiple blowout performances, just riding with the team that was ranked, still pissed about it, wanting that bowl ring.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugpcv4/"
    },
    {
      "created_utc": 1765944281.0,
      "author": "MainDonDada",
      "text": "To all the people saying they can’t/couldn’t find it. His name on FanDuel is listed as Daiki Yoshimura, not the way it was posted in here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nugfnzz/"
    },
    {
      "created_utc": 1765941904.0,
      "author": "ColdTub10",
      "text": "**Record**: 4-5 (-2.12u) \n\n**Last Pick:** (NFL) Devon Achane over 17.5 Carries (L - Miami just doesn't want to win football games)\n\n**Event**: (NBA) Cleveland Cavaliers vs. Chicago Bulls @ 8:10pm ET\n\n**POTD**: **Deandre Hunter OVER 18.5 Points + Rebounds** | 2.75u to win 2.12u | -*130 on FD*\n\n**Reason:** Hunter has been in a slight slump compared to his production earlier this season, but this is a great matchup for him to get back to his beginning of the season efficiency. This season, **Hunter has gone over this line 12 out of 23 games.** The **first 16 games of the season, he went over this line 11/16 times**. He then went on a 5 game slump where he went under this line. \n\n**All this slump has really been is him not being able to find nylon.** He is averaging slightly lower field goal attempts compared to the beginning of the season, but just shooting a lot worse. **Chicago ranks 25th in defensive efficiency, and allows the 27th most points + rebounds to opponents (forwards specifically).** \n\nAll it is going to take is for Hunter to start seeing a couple shots go down and he will start averaging a consistent 15-17ppg. A slow Chicago defense and a slight rebounding advantage overall, I believe Hunter can find his groove and be the consistent role player Cleveland would really love to use. \n\nBOL.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nug9ipx/"
    },
    {
      "created_utc": 1765941571.0,
      "author": "awkward__fly",
      "text": "2-0-1 (+2 units)\n\nLast Pick Chelsea vs Cardiff City BTTS ✅\n\n*Could have gotten more out of this one by parlaying Chelsea to win on top of BTTS, but I'll take the playing it safe win\n\nToday's POTD's Pick of the day\n\nNewcastle vs Fulham - BTTS (via KneeExisting2384) & Double chance - Newcastle to Win or Tie (inspired via TennisFantic101)  1.1 units @ -110 odds \n\nI initially went with just BTTS but adding a little extra juice with the double chance almost gives me even odds. \n\nNewcastle has defensive injuries and a confident attacking form. Let's see what happens. See the two people listed for even more in depth analysis. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nug8na5/"
    },
    {
      "created_utc": 1765938998.0,
      "author": "Substantial-Pay-4591",
      "text": "\nPOTD Record 10-6 (+4.02u)\n\nTuesday’s Pick- ✅ Minnesota Wild ML vs Capitals -122 (1.22u to win 1u)\n\nWednesday’s Pick - Florida Panthers -1.5 +190 (1u to win 1.9u) vs LA Kings\n\nThe 2 time champs are starting to turn it around. Bobrovsky has now won 4 in a row when he’s in net and there’s a good chance he’s back in net tomorrow. He’s year to date goalie metrics aren’t great, but he’s been trending up here recently.\n\nAs for the Kings, they suffered a blow to their starting goaltender Darcy Kuemper and will need to lean on their backup Anton Forsberg, who has a sub 90% save percentage this year. \n\nIf you want lighter risk, the money line is around -135 to -140, but I’ll take the extra risk here with teams seemingly trending in different directions.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nug1kyj/"
    },
    {
      "created_utc": 1765938815.0,
      "author": "Best_Accountant_5471",
      "text": "Record: 51-37 (+26.9 units)\n\nLast 10 (most recent on right):  ❌❌❌❌❌✅❌❌❌❌\n\nLast Pick: Shaanxi Tianze (W) vs Jiangsu Phoenixs (W) U162.5 points ❌\n\nEvent: Türkiye Ligi Women 🏐\n\nPick of the Day: Aras Kargo (W) vs Vakifbank (W) O129.5 points 1.2 units to win 1U @ 1.83 (Bet365)\n\nWrite-up: This is getting downright hilarious now and I’m here to test the limits of variance. I am indeed ironically the worst accountant currently (or Vegas agent, fade of the day… choose your pick) and my God is it painful. I appreciate you guys for sticking with me and showing support during this run, losing my money is one thing but losing yours is even tougher to accept. So anyways the pick lost by 0.5 (68-95) after Jiangsu sank a 3 at the buzzer to finish with a 27 point lead. Sweet.\n\nOk we’ve officially hit rock bottom going for a play like this. However, the stats are mental and I couldn’t let an opportunity like this slip by. Taking our talents over to peak sports betting obscurity, Vakifbank are top of the division and are coming in as extremely heavy favourites against the home team Aras Kargo who are 7th (out of 14). The travelling side have seen this line clear in their last 17/18 matches on the road (94%) which makes up 12/13 (92%) in the league. Meanwhile the hosts have covered the over in their last 9/10 (90%) home games, 8/9 (89%) in the league . Those numbers are very convincing but I will flag that this game last year produced 129 points (I stg if this happens again). Other than that, their only previous fixture gave us 167 points. Despite all the stats involved I would still probably fade at the moment since, logically, the under is going to narrowly win. BOL!\n\nhttps://preview.redd.it/c66drprheo7g1.jpeg?width=1179&format=pjpg&auto=webp&s=24cf0827c02167ff9229b46f2b3e4046107247f3",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nug125o/"
    },
    {
      "created_utc": 1765936756.0,
      "author": "dreamchasing1",
      "text": "Record: 242-223 Net Units: -20.45 55-54 on 1.5u plays, 40-41 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [English EFL Cup] Cardiff vs Chelsea\nLast pick: Cardiff total shots over 8.5 @ 2.00 - 2 Units won\n\n\nEvent: Soccer/Football, [Malaysia Super League] Kuala Lumpur City vs Johor DT\n\n\nPick: Total corners over 8.5 @ 1.72\n\n\nJohor dominate this league and average 9.70 corners for in 10 games played. They've gone over 8.5 in 7/10 games. In the AFC CL, they covered in 5/5 games. Last 6/6 games between these two teams went over this line, 4 of those games last year. This is the most competitive game Johor get in the league, which is good as they usually win very easily against everyone.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nufvbly/"
    },
    {
      "created_utc": 1765935978.0,
      "author": "Vander_chill",
      "text": "**POTD Record:**  100 – 63 - 10\n\n**Previous:**  NCAAF Veterans Bowl - Jacksonville State +3 (Alt line) vs Troy @ 1.75 – WINNING!  \n  \n**New Event:**  EFL Cup – Manchester City vs Brentford\n\n**Pick:**  Man City -1 Asian Handicap @ 1.75 (Usual 3 units)\n\nWe have an EFL Cup Quarterfinal match between Man City hosting Brentford at the Etihad Stadium.  I don’t have much to add other than there is a significant discrepancy in the squads of these teams.  While Brentford sit 15^(th) in the Premier League table trying to stay out of the relegation zone, the Citizens lead the league in goal differential at +22 and are just 2 points shy of league leaders Arsenal.\n\nA Man City win should prove to be a great omen to coach Pep Guardiola’s hunt for silverware this season, as the team has actually moved on to win the EFL trophy after winning each of their last six quarter-final matches. These matches however, being a single elimination usually keep a tight scoreline and a single goal difference is all that is necessary to advance.  Therefore, City may show some rotation in their squad. \n\nJeremy Doku will be out, as will John Stones, Rodri, Kovacic, Marmoush and Ait-Nouri.  Nonetheless, the depth of talent to choose from is quite remarkable and they should have no shortage of players to introduce.  Meanwhile Brentford only have a couple of shortages as Outtara nad Onyeka will be absent to play at the African Cup of Nations.\n\nWhile Brentford will present mostly their strongest starting 11, that same team could not beat Leeds this past weekend.  Also in the last two weeks, they also lost to Tottenham and Arsenal in multiple goal shutouts.   On the flip side, within the last week Man City beat Real Madrid in Spain and then travelled to Selhurst Park and beat Crystal Palace by 3-0.\n\nI will side with Man City to advance in 90 minutes here.  Should they win by only 1 goal, it’s a push.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuft6dg/"
    },
    {
      "created_utc": 1765933795.0,
      "author": "Section1ne0h4our",
      "text": "2-0, +1.90u\n\nLast 5: ✅✅❓❓❓\n\n(Previous play review at end of post)\n\nToday’s play:\n\nNHL - New Jersey @ Las Vegas\n\nTotal u5.5 -110 1u\n\nSwitching things up and going solo today, with a pick jumping out at me from the National Hockey League. Simple and plain, this is a gut play, so be aware that I’m mostly getting this out early because I project the price to change.\n\nBoth teams are travelling west on a few days rest which means sloppy hockey is possible. Both teams are trending under in back to back games, & in the last FOUR games between these teams, the total has been under 4.5, let alone 5.5.\n\nVegas alone have been under 5.5 in 4 of their last 5 games, and whether it’s Schmid or Hart, they seem to be confident to play defensive hockey and take their chance the Vegas way.\n\nFun fact: both teams are 16-16 vs the total this season.\n\nLast play review: ELC: Cardiff - Chelsea\nBTTS/o2.5 (-105) 1u ✅\n\n(Chelsea crucially made a pair of halftime subs to open up the game a bit and get us a second win in a row. Full credit to Cardiff for frustrating Chelsea, responding themselves, and then going for it rather than holding for the draw. Sorry for the lost value on this combo, I got this pick in late and hope you were able to find the BTTS at a better price)\n\nBOL if you’re tailing, and if not BOL in general!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nufn8ik/"
    },
    {
      "created_utc": 1765933569.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 14-9-2 (Avg Odds +128)\n\n**Previous Pick:** Estevao ATGS (+180) 🅿️\n\n**Today's Event:** EFL (Carabao) Cup | Man City vs Brentford (11:30 AM PST)\n\n**Pick:** Haaland to Score and City to Win (-110)  1.1 units to win 1 units\n\n**Write Up:** Short writeup today - because we've backed Haaland twice before and cashed both times. We're on the big Norwegian again to score in this EFL cup match. The teams on both sides will be heavily rotated, but with Marmoush off to AFCON, City really don't have anyone to sub in for Haaland so I expect he starts. As always, please wait for lineups if you don't like this play if he does not start - as anything can happen with these cup games as we saw yesterday.\n\nCity is a deeper squad with more talent on the bench than Brentford and are playing at home, so I like the juice the ML adds to the ATGS. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nufmm8o/"
    },
    {
      "created_utc": 1765931111.0,
      "author": "The_Kendawg",
      "text": "⚽️ FIFA Intercontineltal Cup\n\n🕰️ Match: PSG v Flamengo\n\n🔒 Pick: PSG to score in both haves\n\n💵 Odds: 2.4 @ PointsBet\n\n📝 Write Up:\n\nThis is going to be an exciting match to watch, and we’ll see Flamengo trying to make a global statement against a PSG side that is built to dominate these occasion. PSG operate at a much higher competition level week-to-week, averaging roughly 2+ goals per match against elite European opposition, while Flamengo step up significantly in defensive difficulty here, meaning sustained pressure is almost guaranteed across 90 minutes. From a game-flow standpoint, if we model PSG’s scoring probability at ~70% in the first half (early intensity, quality gap, aggressive pressing) and ~75–80% in the second half (fatigue, tactical adjustments, space opening up), the combined probability of scoring in both halves still sits around 55–60%. Over 90 minutes, sustained possession, superior chance quality, and situational urgency make PSG goals in both halves a logical outcome and for 2.4, a very good price.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuffmlo/"
    },
    {
      "created_utc": 1765930916.0,
      "author": "KneeExisting2384",
      "text": "Stats:\nRecord: 0-0 ()\nNet Units: +0.00\nROI: 0.00%\n\nPOTD:\nNewcastle vs Fulham – Both Teams To Score (Yes)\nOdds: 1.77 / -129 (Unibet)\nUnits: 3.8u\n \nFirst time posting. We’re two roommates posting these POTD’s and both been tailing loads here. Surely two brains work better than one?\nNewcastle vs Fulham quietly sets up as one of the cleanest Both Teams To Score spots on the day. Newcastle host Fulham with both sides in strong attacking rhythm and neither showing much interest in clean sheets lately.\n\nBTTS has hit in 4 of Newcastle’s last 5 matches and 4 of Fulham’s last 5, with the only miss for both teams coming against Sunderland — a side notorious for slowing games down and sitting deep. Remove that anomaly, and the trend is clear: these teams trade chances.\n\nThe head-to-head backs it up, too. BTTS has landed in the last 3 H2H meetings, including the reverse fixture at St. James’ Park on October 25, where both teams produced over 1.5 xG each, proving this matchup consistently creates high-quality chances on both ends.\n\nNewcastle have been automatic at home. They’ve scored in every single home fixture this season, totaling 26 goals across 13 home matches — exactly 2.0 goals per game. Fulham aren’t shy on the road either, finding the net 10 times in 9 away matches, and they’ve turned it up recently.\n\nFulham come in hot offensively, scoring 10 goals in their last 4 matches, including 5 goals in their last 2 away games. Newcastle, meanwhile, were riding a 17-match scoring streak before their narrow 1-0 loss to Sunderland, another outlier given the matchup and game state.\n\nAll signs point to goals — but the defensive side seals the bet.\n\nNewcastle haven’t kept a clean sheet in 8 straight matches, with their last shutout coming against Bilbao in the Champions League — a Bilbao side that has only scored in 7 of 11 away matches across UCL and LaLiga this season. Fulham are no better defensively, failing to keep a clean sheet in 4 straight matches while conceding 10 goals in that span.\n\nBoth teams are comfortable committing numbers forward, both are vulnerable defensively, and both have clear, repeatable scoring trends. This isn’t a game where one side sits back — it’s one where chances come naturally.\n\nThe price hasn’t caught up.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuff25k/"
    },
    {
      "created_utc": 1765930311.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 21-15 (+3.72U)**\n\nROI: +7.75% \n\nLast POTD: NBA Cup Final: San Antonio Spurs +5.5 & Over 225.5 Total Points +129 (1U to win 1.29U)x\n\n**POTD: NBA: Cavaliers vs. Bulls Under 242.5 (1U to win 0.95U)**\n\nWrite up: Model has this as the highest confident Edge % and EV % for the day. \n\n• ⁠EV Information: Model’s estimate for the under 242.5 is set at 58.7% vs the 52.1% implied odds at -105 - EV shows this is roughly set at a 11-13% ROI bet\n\n• ⁠Personal Information: Model thinks this line is inflated because of the recent offensive form of both teams, implying the 242.5 set line - looking at both teams scoring all season, the average is in the low 230’s - showing that the 242.5 line may be inflated by the fact both offenses have been good as of late\n\n\nPOTD History: https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn\n\nBOL!\n\n**POTD: NBA: Cavaliers vs. Bulls Under 242.5 (1U to win 0.95U)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\nhttp://buymeacoffee.com/claysmiith\n\nhttps://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nufdahm/"
    },
    {
      "created_utc": 1765930000.0,
      "author": "Ned_Pepper",
      "text": "Darts 🎯- 2026 PDC World Championship \n\n🌶️ Overall: 53-33-1\n\n2026 PDC 🎯 World Championships: 2-1\n\nPrevious: \n\nMadars Razma (-161) v Jamai van den Herik ✅ \n\nMervyn King (+120) v Ian White ❌\n\nRicardo Pietreczko (-136) v Jose de Sousa ✅ \n\nPOTD: Matt Campbell (-149) v Adam Sevada\n\nGood stuff from our boy Pikachu yesterday, grinding out a 3-1 win against a very capable opponent. Ricardo going 11/25 (40%) on doubles really illustrates how valuable a high checkout % is in this format. \n\nOnly four matches on the board today, and each one fairly lopsided in terms of odds. Despite this, I will gladly back the North American #1 Matt “the Ginga Ninja” to defeat Adam “The Reaper” Sevada. \n\nFairly difficult to compare these two players, as Campbell has been cutting his teeth on the PDC Tour all year, while Sevada has mostly competed on the MODUS Super Series & CDC, with a few exceptions. In the end, i think one very large reason points me towards Campbell. \n\nIf you look at the #s for each player over the last 12 months, the averages, checkour %s, TV averages, etc. are all fairly close — 91.1 Campbell vs 89.6 Sevada; 40% Cambell vs 41.1% Sevada (per DartsOrakel)\n\nThe main difference bw the two has been their competition. Sevada is a world championship debutante, earning his spot in this year’s tournament by cementing his spot as the CDC’s highest ranking player. He beat up on lesser players for most of the year, and when a big moment came up at the US Darts Open, Sevada averaged 74.6 en route to a 2-6 loss vs Gerwyn Price. \n\nCampbell, on the other hand, has competed at the highest level darts has to offer since 2022. He reached the final 32 in the 2024 world championship, and reached the QF at this year’s European Darts Open. Campbell also reached the QF at the PDC Players Championship 33 & 34, which took place just two months ago. \n\nBig stage & big tournament experience largely favors Campbell, and his recent success a few short months ago gives me confidence locking him in this one. Honestly consider the (-149) price tag a bit of bargain, could see this one moving higher as the match draws closer. \n\nLastly - have had a few folks ask, so including details below for tipping. Absolutely no need, but always greatly appreciated 🌶️ \n\nVenmo- @Jake-Lazzo\n\nCashapp- $NedPepprr",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nufcdzy/"
    },
    {
      "created_utc": 1765929649.0,
      "author": "Background_Law8395",
      "text": "**Record**: 5-1-1 (Wins-Losses-Pushes) (+8.10u)\n\n**Last pick**: Cardiff City vs. Chelsea BTTS-YES 3u ✅\n\nThank you Cardiff for doing your thing against a much bigger club. Also my apologies, somehow I kept saying Cardiff and Lincoln were Championship teams even though they're in League 1. Anyways.\n\n**Event**: EFL Cup: Manchester City vs. Brentford 11:30am PST\n\n**POTD**: Manchester City Moneyline + Manchester City Goals Range 2-4 (-115) 2u\n\n**LINE EDIT** Shifted to +137, still taking\n\n**Write up**:\n\nDon't really feel like I need to touch on the moneyline aspect of this pick as it is pretty much a given that City win this game. They LOVE the EFL cup and have performed amazing in it for the last 10 years, winning it 5 times. I wanted to bet the straight goal range but its sitting at -150 which isn't amazing value for me personally.\n\nCity have scored 2-4 goals in 18/25 games played this season across all competitions, going 9/11 on this pick in their home games. They're also 2/2 on this pick in both EFL cup games played this season. City average close to 2.5 goals per match across all comps this season and have caught a lot of form recently. In their last 5 games, City are undefeated and have scored 2-4 goals in 4/5 (with the only game this not hitting being their 5 goals against Fulham). Although there will probably be some squad rotation, squad rotation for City means having first team quality players getting minutes they don't usually get. City have also scored 2-4 goals in 3/5 of their last games against Brentford.\n\nOn the other side here we have a struggling Brentford team, being 1-1-3 in their last 5 games and 1-0-4 in their last 5 away games (with the only win being the last round of the EFL cup against a League 2 side). In these last 5 away games, Brentford have conceded 2 goals in 4/5 with the only exception being that cup game where they held Grimsby to 0. Brentford allow on average 1.37 goals per match to their opposition across all comps and 1.6 goals allowed in all away games. Brentford have conceded 3 goals a few times this season but never more, and with the probable rotation for City ahead of some important Premier League games, I don't see the Blues scoring over 4.\n\nCity beat Brentford earlier this year 0-1 at Gtech Community Stadium, at a time that Cherki wasn't fully proven yet and Savio + Bobb were still starting almost every week. With the loss of Doku due to injury, this could be a match for Savio to finally prove his worth to City fans and get a contribution or two. Not to mention Marmoush (I believe) will not be apart of the squad because of AFCON which means big Erling should still start up top. Even if Omar is available and starts, I almost believe that to be a better outcome because he is dying for a contribution to show Guardiola he deserves more minutes this season. If I were to make a score prediction to this game it would probably be 3-0 or 3-1 to City. The only team that Brentford have beat of real quality are Newcastle which was a home game that was 1-1 until Newcastle picked up a red and conceded 2 goals. I wouldn't count the Villa game as this is when Villa were quite bad.\n\n**BOL!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nufbdcc/"
    },
    {
      "created_utc": 1765928852.0,
      "author": "ptrckfrnndz",
      "text": "+30.52\n\n15 - 6\n\nFORM: ✅️✅️✅️✅️✅️ (LAST 5)\n\nSports: TENNIS\n\nPICK: roger pascual ferra ML 5UNITS vs. Felix balshaw ✅️✅️✅️✅️✅️✅️✅️\n\nPICK: yoshimura daiki ML 5 UNITS VS. Sakamoto hiiro ❌️ \n\n❌️ What a choke 4-2 leading the third set and cant finish the game. He really cant composed himself when the game is getting him. Im sorry guys but i think hes still the right pick its just so many unforced error. I hope to bounce back tomorrow ❌️\n\nTime: abt 3 hrs from posting\n\nReasoning: first of all i want to thank the 2 people who sent me tip. Im so happy. I dont have to work for today since what u send is what i earn. Im really grateful for you guys.. I appreciate you all and all of your kind comments. Hoping to win another one for today and earn you all some cash\n\n\nWatched the game of yoshimura daiki from yesterday and i can tell that hes been really playing nice tennis, if its not just because of his frustrations to the umpire he would have won that match. Let me be honest i am tempted to cash out that time but when i saw him kicking the ball because of frustration i knew that mochozuki will win.\n\n\nNow, about his opponent, the last game he played was on the month of july.. he only played \n13 times compared to daiki 63 times on competition.. \n\n\nIf no rig shit will happen i believe daiki will win this thing\n\n\nBol\n\n\nMaybe you can tip me if i made you some money. So i can buy food for my self.. thank you\n\nhttps://www.paypal.me/ptrckfrnndz06",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuf91y8/"
    },
    {
      "created_utc": 1765928604.0,
      "author": "tennisfanatic101",
      "text": "💎POTD: Newcastle ML\nOdds: -145 on DraftKings\nWager: 1.75 Units\n\nRecord: 5-4\nNet Units: + .40 ✅\n\n⚽️ Fulham at Newcastle, 12/17/25 Wed, 3:15 pm Eastern Time\n\nExplanation: Newcastle can beat Fulham because St James’ Park has been a real edge for them this season, and the underlying chance numbers back it up. In the league, Newcastle are 12th on 22 points while Fulham are just behind on 20 (so overall quality is similar), but the home/away split is where it separates: Newcastle are 5-1-2 at home (16 points from 8) while Fulham are only 2-1-5 away (7 points), which is a big swing in reliability.   The performance data lines up with that too: Newcastle’s home xG is 14.90 vs 9.47 xGA across those 8 home league matches, meaning they typically create more and concede fewer “good chances” at home (the kind of profile that wins cup ties over 90 minutes).   \n\nThey’ve also already shown they can handle Fulham in this exact matchup recently, beating them 2–1 at home earlier in the season, which matters because it hints that Newcastle’s style (high tempo, pressure, and creating enough shots/chances in front of their crowd) can tilt the game.  The main worry is Newcastle’s defensive availability: Dan Burn reportedly suffered a fractured rib and lung damage in the Sunderland match and is likely out—so Howe may have to reshuffle, but this being a League Cup quarter-final at home still gives Newcastle a clear path: press early, win territory, and generate the higher-quality looks while Fulham’s away form has been shaky (they only just recorded a rare away win at Burnley).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuf8cj5/"
    },
    {
      "created_utc": 1765928437.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Wednesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pohcsg/pick_of_the_day_121725_wednesday/nuf7v9n/"
    }
  ]
}