{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/10/25 (Wednesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/",
  "target_date": "2025-12-10",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-09T23:40:07.994957+00:00",
  "comments": [
    {
      "created_utc": 1765323471.0,
      "author": "MrPunter500",
      "text": "**Record: 6-2**\n\n**Net Units: 2.91 units up**\n\n**ROI: 36.38%**\n\n**Most recent plays**\n\nKorpatsch vs Friedsam - Korpatsch ML @ 1.80 ✅ \n\nKorpatsch vs Rakhimova - Rakhimova ML @ 1.71 ✅\n\nKartal vs Pieri - Kartal Handicap -6.5 Games @ 1.71 ✅ \n\nBassols vs Leonard - Leonard ML @ 2.19 ✅\n\nClose match when it comes to serve percentages but I always felt like Leonard had the advantage and she ended up winning in straight sets. 4th win in a row for us!\n\n**Tennis** | **WTA 125 Limoges** | **11:30 AM (Eastern Time)**\n\nPlays will always be shared as 1 unit for fair record purposes\n\n**Pick:** **Kartal vs Kalinina - Under 19.5 Games @ 1.85**\n\nKartal is here after beating a really weak opponent in the first round by 6-1/6-0, where her level of play was quite high, which might be a sign that she's taking this tournament quite seriously, in order to try to climb some ranking spots before the start of the new season. \n\nKalinina did not play for 6 months before coming into this tournament and beating Deichmann in straight sets in the previous round, which was an expected win. By missing most of the 2025 season, she's now out of the top 150. \n\nWhen it comes to playstyles both players like to be aggressive and dictate the pace of each point, with Kartal being superior when it comes to pace absorption and point construction. Kalinina is considerably taller than Kartal but I don't consider the Ukrainian a better server. In my opinion, Kartal serves much more efficiently, with a disguised toss and decent accuracy. \n\nWith this, I'm expecting a one-sided match, especially because Kalinina hasn't gained much playing rhythm and is yet to face a player with Kartal's quality since her return. The under can work both ways but in summary, this play is focused on Kartal's quality.\n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt77zxv/"
    },
    {
      "created_utc": 1765322715.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Wednesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pimqm6/pick_of_the_day_121025_wednesday/nt75tdc/"
    }
  ]
}