{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/13/26 (Tuesday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/",
  "target_date": "2026-01-13",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-13T11:28:04.739785+00:00",
  "comments": [
    {
      "created_utc": 1768297928.0,
      "author": "Aizzel01",
      "text": "Record 0-0\n\nEvent: Miami Heat vs Phoenix Suns\n\nPOTD: Phoenix Suns ML\n\nOdds: 1.9\n\nBetting: 5units\n\nLong time lurker, first POTD hoping to cash and get some free food on the house. One thing about NBA is that when your pick makes perfect sense, the more chance it will lose. This pick is based off what I have watched from both teams this season.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzbsabp/"
    },
    {
      "created_utc": 1768297887.0,
      "author": "Dr_Tholan",
      "text": "POTD record: 33-25 (+6.60u)\n\nLast 5: WLLWL League: Modus super series. Lorraine Hyde - Fallon Sherrock\n\nPick: Fallon Sherrock ML @ 1.61. 1u. Starts in approx 3 hours\n\nWomen's week at Modus. Yesterdays result: Sherrock winning 2 out of 5 matches with a leg differential of -3. Hyde also winning 2 out of 5 matches with a leg differential of -1. If you look only at the results it looks like a 50/50 bet but if you look at the stats you can see that Sherrock performed way better. Sherrock averaged 80.42 with a checkout percentage of 24.32%. Hyde averaged 74.06 with a checkout percentage of 25%.\n\nIf I look at the stats the past months Sherrock is averaging 80.15 with a checkout percentage of 31.7%. Hyde is averaging 68.62 with a checkout percentage 26.12%. The scoring power difference is huge between the two so I don't see any problem Sherrock beating Hyde today. However, it is a short format, only going till 3 legs, meaning that small errors can cost games so only going 1u for this one.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzbs7ry/"
    },
    {
      "created_utc": 1768295115.0,
      "author": "zan12231",
      "text": "**POTD Record:** 3-8\n\n**Net Units:** \\-5,35 UNIT\n\n**Previous Pick:** Jaxson Hayes U0.5 blocks (-120), 1 UNIT ✅\n\n**Today's Event:** NBA: Rockets vs. Bulls\n\n**Today's Pick:** Kevin Durant O26.5 points (-110), 1 UNIT\n\nWrite up:\n\nRockets are facing Bulls in today's match. Statistics shows that Houston is 10th in points per game and Bulls are 26th in points allowed. \n\nDurant have 26.1 point per game in this season. But in last 10 games he have 27.9, so 1.4 higher than the line. He achieved this line in 5 of last 10 games. \n\nBulls allow 27.7 points on PF position on 49.3% FG. On this position they get the most points form opponents. Durants FG% is 52.1% this season, so if we calculate this we get that he will score 29.3 points on this kind of defense, so 2.8 points over the line. \n\nBOL.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzbnhod/"
    },
    {
      "created_utc": 1768290649.0,
      "author": "redditusernameuneak",
      "text": "Record: 7-6\n\nUnits: +3.99\n\nPrevious Pick: (NBL) Adelaide 36ers -6.0 ❌ game ended 36ers 72 - Jackjumpers 80\n\nEvent: (WNBL) Adelaide Lightning (W) vs Sydney Flames (W)\n\nPOTD: Sydney Flames (W) +5.5 (1.80 on Bet365, 5 units for 4 units) ❌ game ended Lightning 76 - Flames 65\n\nWrite-Up: The Flames (6-12) have been finding some recent form, as they come into this playing their best basketball this season in their last few games, starting from 23 Dec against Townsville. Lightning (4-13) have had it rough, with only 1 win out of their last 10, and that was against this very Flames team on 14 Dec. I think the Flames will be motivated to seek revenge and keep the score close.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzbfpe1/"
    },
    {
      "created_utc": 1768287201.0,
      "author": "Inevitable_Tough_255",
      "text": "Anyone else tail the Talia Gibson pick that has since been deleted? I thought the Jazz+5 pick vs the Hornets the other day was the worse POTD I’d ever seen, but I think this was worse. I swear some of these guys might be working for the books haha.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzb9bfe/"
    },
    {
      "created_utc": 1768286974.0,
      "author": "20k_rpm",
      "text": "PotD Record **:** **29** W **- 17** L\n\nNet Profit **:** \\+11.46 units\n\nPrevious Pick **:** Genone -1.5 map handicap vs CSDIILIT - **win**\n\nForm **:** ✅✅✅✅✅✅✅✅❌✅✅✅❌✅❌❌❌✅✅✅❌✅✅✅❌✅❌❌❌✅✅❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌\n\nEvent **:** Counter Strike **|** Blast Bounty **| Faze** vs **Eyeballers**\n\nPick **:** **Faze -1.5 map handicap** **|** 2 units **@ 1.8 odds**\n\nReasoning **:** Eyeballers is a low tier 2 team and faze is tier 1. The quality difference here is just way too much. Going only 2 units because the game is online where tier 1 teams occassionally struggle.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzb8vj2/"
    },
    {
      "created_utc": 1768284695.0,
      "author": "222benz",
      "text": "Record: 4-5\n\nLast Pick: FC Barcelona to win the cup @ 1.61 ✅ \n\nEvent: Roma vs. Torino | Deportivo de la Coruna vs. Atletico Madrid\n\nPOTD: Roma ML & Atletico Madrid ML @ 2.34 odds (2.5u)\n\nWrite Up:\n\nI'm parlaying these two because the spot is just too good to ignore. For the first leg, I'm taking Roma ML. They’ve finally found their form under Gasperini with back-to-back 2-0 wins, while Torino is in freefall right now losing two straight and looking terrible on defense. Then I’m adding Atletico Madrid ML. They just got knocked out of the Super Cup by Real Madrid, so they’ll be hungry to bounce back here. Both these teams are just way better than their opponents and need a win, so I’m taking on the favorites to get it done.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzb4czb/"
    },
    {
      "created_utc": 1768284581.0,
      "author": "mattmccuskerfan69",
      "text": "Record: 0-0\nNet Units: N/A\nROI: N/A\nBasketball | NCAAM | 8PM EST\nPick: UConn -5.5 1u -112\nWrite Up: 9 vs 43 in KenPom. Both these teams are top 10 in defensive rating this season and have been incredible, but the difference is huge offensively. I expect UConn to take control of the game early, and keep the Pirates out of reach.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzb44kz/"
    },
    {
      "created_utc": 1768282912.0,
      "author": "Noobdian1",
      "text": "Record: 102-87-5\n\n\n\nLast Pick: Lazio vs Fiorentina BTTS NO 1.73 (2U)(L)\n\n\n\nToday's Pick:\n\n\n\nHamburger SV vs Bayern Leverkusen Over 2.5 and BTTS 2.00 (2u)\n\n\n\nI'll be honest, last few picks, I do my analysis, then I ask chatgpt to compute what it thinks the line should be. And usually it agrees with my bet and says it has value. Today, It didn't. It said this bet should be priced at 2.10 but I'm still gonna run at.\n\n\n\nLook at Leverkusen's away results once, in 7 games they've scored 15 and conceded 14. Thats an average of 2 goals scored and conceded EVERY GAME. \n\n\n\nHamburger are relatively calmer on the  goalsheet at home as they've scored 13 and conceded 9 in 8 home games.\n\n\n\nBut with how open Leverkusen are when playing away I'm expecting 2 goals from atleast one of these teams, and the BTTS should take care of itself too\n\n\n\nScore prediction: 2-1 for either side\n\n\n\nGL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzb0ksk/"
    },
    {
      "created_utc": 1768282347.0,
      "author": "Money-Swimming2179",
      "text": "Record 8-0-5\nForm: ✅✅✅✅❌❌✅❌✅✅❌❌✅<-\n\nLast POTD: **Sevilla v Celta Vigo: Celta DNB @1.88✅**\n\nTodays POTD (2 game Parlay): **Royal Antwerp vs La Louviere: Antwerp DNB & Stuttgart vs Eintracht Frankfurt: Stuttgart DNB @1.90**\n\n*1: Royal Antwerp vs RAAL La Louviere*\n\nGoing with **Draw No Bet: Royal Antwerp**\nAntwerp are just the better side overall more quality, more experience, more control in games like this. La Louviere can be annoying and scrappy, so the draw cover is perfect. If Antwerp do what they’re supposed to, we cash. If it’s ugly and ends level, we get our money back. Simple.\n\n*2: Stuttgart vs Eintracht Frankfurt*\n\nPick is **Draw No Bet: Stuttgart**\nStuttgart at home are solid and hard to break down. Frankfurt are dangerous but inconsistent, especially away. This feels like a tight game, maybe even cagey, so again the draw cover makes sense. If Stuttgart edge it, we win. If it’s a stalemate, no stress, stake returned.\n\nNo crazy risks.\n\nTwo strong teams with safety nets.\n\nWe’re here to grow the bankroll, not donate it.\n\nBest of luck.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzazbgm/"
    },
    {
      "created_utc": 1768280307.0,
      "author": "Enigmaticwinner",
      "text": "Fuck Aaron!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzaujai/"
    },
    {
      "created_utc": 1768280104.0,
      "author": "Donloppa",
      "text": "Record: 22-12\n\nNet Units: +18.87 units\n\nPick: Tennis\n\nDaniil Glinka vs Luca Van Assche\n\nOVER 22.5 games Bet 365 -125\n\n4:00 pm MST (approx)\n\n3 units to win 2.4 units.\n\nGood day everyone. \n\nQuick write up as usual. Two mediocre players, past games tell me that each player will probably take a set from eachother. I do believe it'll see 3 sets. If you can get plus odds for 3 sets you can do that, but with the over 22.5 games even if it goes to just 2 sets there is still a chance of it hitting. \n\nEnjoy!\n\nIf you follow one of my picks and blame me for your loss, bad luck will follow you for eternity. \n\nFeel free to fade\n\nOr feel free to tip! [Buy me a beer](https://buymeacoffee.com/donloppa)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzau1gi/"
    },
    {
      "created_utc": 1768280017.0,
      "author": "FlatwormLanky2725",
      "text": "**Previous Pick:** **Vegas Golden Knights @ SJ Sharks ML (+145 on BET365 at time of posting), 1U for 2.45U LOSS**  \n**Record: 2-2**  \n**Net Units: -0.63**  \n**ROI: -15.75%**\n\n**Ice Hockey** | **NHL** | 7**PM EST**\n\n**Pick: Montreal Canadiens @ Washington Capitals ML 3-way (-115 on BET365 at time of posting), 1U for 1.87U**  \n\n\n**Previous pick recap:** I stand corrected. San Jose was clearly not up to the task as they got absolutely lit-up on home ice. Should've known better than to assume they'd be able to pull off 2 streak-breakers in the same weekend. But we move.\n\n**Write Up:** So I get to fade my team on this one. Had this game circled as a loss for a minute, here's why:\n\n1. Washington 8-1-1 in their last 10 vs with only 1 game going to OT. The only match-up so far this season was an 8-4 Washington win on November 20, 2025.\n\n2. Montreal's starter tomorrow is Sam Montembault, who is 2-5-0 in 10 games vs. the Caps, getting the hook his last 2 times out, including the Nov 20 game where he gave up 3 goals on 10 shots. Against Washington, he has a career GAA of 3.47 and an .890 SV%.\n\n3. On the flip side, Washington will likely start Logan Thompson, who is 5-1-1 lifetime vs. Montreal. In his 5 wins, he's given up 2 goals 3 times, and 1 goal twice. He has a 2.43 GAA and .915 SV% vs. Montreal. In the off-chance they start former-Canadien Charlie Lindgren, he's lifetime 4-1-0 H2H in 7 games (came on twice in relief), and holding a 2.98 GAA and .885 SV% vs. the Habs. But the Caps  don't have a B2B until Jan 23-24 in Alberta, so no reason not to start Thompson.\n\n4. Montreal won at home tonight 6-3 at home with an impressive 41-23 shot edge but have to travel right away (assuming the current snow allows travel tonight). They'll also be playing their 5th game in 7 days, and their 3rd set of B2Bs since Jan 3-4. Washington on the other hand haven't played B2B since Dec 31-Jan 1. Montreal is the youngest team in the league, so perhaps less susceptible to fatigue, but Washington should still have fresher legs. \n\n5. On the injury front, Montreal might be getting Josh Anderson back in the line-up Monday as he's DTD, but that doesn't move the needle much since he's -7 with 2 points in his last 10 vs. Washington. The Habs are still without mercurial sniper Patrik Laine and centres Jake Evans, Kirby Dach and Alex Newhook. Washington on the other hand should have D-man Jakob Chychrun back who missed last game with an illness, and is +10 with 6 points in his last 10 H2H vs. Montreal. Both right-wings Tom Wilson and Justin Sourdif are DTD, Wilson obviously being the more significant loss as he has 9 points in his last 10 H2H.\n\n6. Alex Ovechkin love to play vs. Montreal. He had a hat trick last time out, is 9G-5A-14P and +6 for his last 10 games with a 27.3% shot%, and is 42G-32A-74P and +13 in 61 career games vs. Montreal, averaging 4.27 shots/game. Dylan Strome (3G-13A-16P) and Aliaksei Protas (2G-7A-9P) over their last 10 H2H are also playing the Habs well. \n\nAll this to say, while I never root against Montreal, this is one of those where I'm thinking that my consolation prize will be to get back in the win column. \n\n**BoL and play responsibly. Comment if you tail or fade if that's your thing, or don't, I'm not your mom.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzattom/"
    },
    {
      "created_utc": 1768277872.0,
      "author": "r7465_",
      "text": "**Record:** 1-0-0 (+3u)\n\n**Last:** Mali vs. Senegal, 2X & under 3.5 goals - ✅\n\n**Pick of the Day:** Copa del Rey, Cultural Leonesa vs. Athletic Bilbao, 2W & under 4.5 goals (1.79)\n\n**Units:** 2U\n\n**Write Up:**   \n\\- Athletic are historically a strong cup side, I'd trust them in this game as much as I would trust Atletico and Real, they haven't been eliminated before the round of 16 since 2019, and have made the cup final 4 times since 2015\n\n\\- Athletic are not an explosive side, but they're not very open in defense. They have less goals conceded than 8/10 bottom half La Liga teams. Cultural are a 2nd division team.\n\n\\- These early cup games are usually played cautiously, teams want to win, but they don't want extra time. The biggest risk to this bet is extra time, but a team with as much flair as Athletic should be good enough to avoid it. Since they're chasing European spots in the league table, they have all the incentive in the world to not let the game head into extra time.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzaoacp/"
    },
    {
      "created_utc": 1768276921.0,
      "author": "vanillaturtle",
      "text": "Record: 3-3-0 (W-L-P)\n\nProfit: -1.71U; ROI: -17.1%\n\n\\---------------------\n\n**Last Pick:** ATP Hong Kong -  ATP Adelaide **- Vacherot ML vs Kecmanovic** \\[1U to win 0.91U (-110)\\] **Win**\n\n \n\n**Today's Pick:**\n\n**Tennis -** ATP Adelaide **- Etcheverry ML vs Borges**\\[1U to win 1U (+100)\\]\n\nTime: 1:10AM EST\n\nNo time for long writeup today but TLDR Etcheverry took a set off Musetti showing he's in good form. He has great movement as a clay courter but is one of those that have adapted his game to all surfaces. I think this one will be close but I like him at even odds. Give etcheverry around a 60% chance to win - he's very consistent and has a pretty powerful forehand (not as powerful as Rublev's though) and above average serve. He'll have to play well to outlast borges but I think he should be able to do it at the start of the season.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzaligu/"
    },
    {
      "created_utc": 1768273923.0,
      "author": "fielddesk",
      "text": "**Record:** 2-0\n\n**Net Units:** +1.57\n\n**Last Pick:**  TB Lightning ML @ -152 (1 Unit) \n\n**League:** NHL\n\n**Pick:** CGY/ CBJ U6.5 @ -116 (1 Unit)\n\n**Write Up:** Jet Greaves has been a top 10 goalie this year, on the other end Dustin Wolf is holding his own and his numbers are so-so. That paired with CGY decreased goal output this year leads me to believe this game will go under (4 for last 4 U6.5).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzachzu/"
    },
    {
      "created_utc": 1768273374.0,
      "author": "Yew32",
      "text": "**Record 1-0**\n\n**POTD:** Jamal Murray Over 8.5 Assists.\n\nI gotta say this is a very odd line to me maybe its a trap maybe not because this is such a off line to me. \n\nMurray is averaging around 20-25 Potential assists a game with Jokic gone now and New Orleans are the worst in the league, yes bottom 30th in the League at defending opposing PGs for assists. They are ranked 16th in guarding opposing PGs for points. I also like the fact the totals are set at 235.5 meaning a very fast game. Also they are bottom 5 in defensive rating meaning a lot of easy buckets should be given up. Keep in mind Herb Jones isnt playing so could mean Murray may score however I expect this to be a close game due to the nuggets not having anyone to deal with Zion.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nzaas10/"
    },
    {
      "created_utc": 1768273010.0,
      "author": "san_solares",
      "text": "Net Units: +59.25  \nROI: 16.01%  \nRecord: 42-19-12 (W/L/P)\n\nLast POTD: BTTS YES + Al Hilal DC (W)\n\nTracker on the bottom, as per.\n\nToday's POTD: Stuttgart v Eintracht Frankfurt - Bundesliga - 12.30 PM EST - BTTS YES + O 2.5 - (1.85) - 5U\n\nBTTS has hit in this exact matchup in 8/L10 matchups; and BTTS in the same 8/L10 games. Stuttgart has scored at least once 7/L8 last games while playing away. Just need one team to score twice and we should be golden.  Bundesliga is often known for its hyper attack, geigenpresses, and overall quick paced offensive games. Hope this is one of those. \n\nBOL and tail responsibly, as always.\n\n[TRACKER](https://docs.google.com/spreadsheets/d/1-PHX-U7eiB5neVpbTJVkzwquGE1KyGVQA5nfejcDT_A/edit?usp=sharing)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nza9op3/"
    },
    {
      "created_utc": 1768271726.0,
      "author": "WeightShift",
      "text": "**POTD Record 141-1-73 | +91.58**\n\n**Form:** WWWWLWLWLWLWLLWWWWWWWW\n\n**Tennis: ATP Adelaide - Quentin Halys H2H vs Jacob Fearnley 5U** $1.68 (Unibet) 2:00PM AEDT\n\nThese odds are just out of whack. Halys is in a purple patch of form and just swept through a bunch of players that play the exact style as Fearnley but at a much higher level (Bonzi, Popyrin, Majchrzak). Fearnley hasn't played a solid game of tennis since the Paris Masters. He even lost to Dane Sweeny... for a guy with a serve like his, that just shows how bad is form is at the moment\n\n  \nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nza5plp/"
    },
    {
      "created_utc": 1768270887.0,
      "author": "Lyx97",
      "text": "Record: 29-16-5\n\nNet Units: +6.78\n\n*Prev Pick : Saudi Arabia u23 vs Vietnam u23 BTTS @ 2.01 (1u) -> L*\n\nFootball | English U21 Professional Development League | Huddersfield u21 vs Sheffield u21 | in \\~10.5hrs\n\nFootball | English U21 Professional Development League | Wigan u21 vs Peterborough u21 | in \\~10.5hrs\n\nParlay: Huddersfield u21 vs Sheffield u21 (o2.5 goals) + Wigan u21 vs Peterborough u21 (o2.5 goals) @ 1.66 (1u)\n\nWriteup: Trying something different today, especially after yesterdays loss, when the Saudis had 7 SoT, but couldnt convert a single goal. Anyways, onwards we move to the English Youth competitions, where goals are plenty. All the teams selected today have seen majority of matches touch the 3 goal mark. In additiona, Peterborough & Sheffield are No2 & No1 in the league respectively, roughly separated by 10 places from their opponents. I expect goals to be scored and probably should hit the 3 goal mark. Ideally, would have wanted to take the 1st half asian line for 1 goal, but my bookie doesnt offer them, so stuck with the full time goals.\n\nHope we get the W & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nza33o3/"
    },
    {
      "created_utc": 1768270221.0,
      "author": "kab1218",
      "text": "PoTD 15-18-1 Last 5:  ✅❌✅✅✅\n\nNet: -13.25\n\nPrevious: England | FA Cup | 245pm Eastern | Liverpool vs Barnsley | Liverpool -2.5 | 1U @ EVEN\n\nLiverpool pull it off in the dying minutes of the game. Moving on. \n\nToday: England | Carabao Cup | 3pm eastern | Manchester City vs Newcastle United | BTTS & O 2.5 goals 3U @ -124\n\nWrite up: I’m very confident in this one. Newcastle vs Man City BTTS & O 2.5 with odds of -124. Newcastle have scored in every home game this season in every competition no matter who they played, even scoring against Barcelona. City have only been shut out away a couple of times all season and they rested almost all of their starters in the last game. In their last 5 against each other, they’ve both scored 3/5 and it’s gone over 2.5 in 3/5. They both have quite a few defensive injuries. Last game at Newcastle (earlier this year) ended 2-1. BOL if tailing ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nza0zpi/"
    },
    {
      "created_utc": 1768268671.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 22-22-5 (Avg Odds +128)\n\n**Previous Pick:** Liverpool -2.5 Spread (-110) ✅️\n\n**Today's Event:** England EFL Cup (Soccer) | Newcastle vs Man City (12:00 PM PST)\n\n**Pick:** Erling Haaland ATGS and 2+ SOT (+120) 1 unit to win 1.2 units\n\n**Write Up:** Today we've got the first leg of the two leg EFL cup semi final as Newcastle host Man City. This is a difficult cup to predict- City has not done overly well in this cup over the past few years, but this is the stage where teams start to take it seriously. Coming fresh off a 10 goal thrashing in the FA cup, I expect City to ride the momentum and go after this game as well. \n\nHaaland needs no introduction. We've ran with similar plays with the big Norwegian with great success and we're backing him here again today. Haaland only got the first half of their FA Cup match a few days ago, so I'm expecting him to be rested and start today. I also see City changing back to thr \"feed Haaland\" tactic they started the season with, with all of their creative players and the new arrival of Semenyo. He is coming fresh off an 8 shot, 4 SOT, 1 goal match in the EPL against Brighton. With 26 goals in all comps this season, I'm backing Haaland to add to his tally with an extra SOT and cash for us.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9w4nc/"
    },
    {
      "created_utc": 1768267380.0,
      "author": "Next-Application-244",
      "text": "**POTD Record:** 5-2\n\n**Previous Pick:** NFL -  Houston Texans @ Pittsburgh Steelers - Calvin Austin III OVER 1.5 Receptions - PENDING\n\n**Event:** NCAAB - Baylor @ Oklahoma St.\n\n**POTD:** Oklahoma St. +2.5\n\n**Write Up:** Playing at Gallagher-Iba Arena is historically one of the toughest road trips in the Big 12, and this season is no different; the Cowboys currently boast an impressive **11-0 home record**. While Baylor features a high-octane offense averaging over 88 points per game, it has struggled significantly in true road environments and enters this matchup on a **three-game losing streak** (losses to TCU, Iowa State, and Houston). Oklahoma State’s offense is equally potent, ranking 17th nationally in scoring ($90.2$ PPG), which should allow them to match Baylor’s pace in what oddsmakers expect to be a high-scoring affair.\n\nThe \"plus-points\" position is particularly attractive here because the Cowboys are the more disciplined team at the free-throw line—shooting over **75%** as a unit—which is critical for covering small spreads in the closing minutes of conference games. Baylor’s recent defensive lapses, where they allowed Houston to shoot nearly 40% while struggling to secure defensive boards.\n\nBOL if tailing, feel free to send a little love my way <3\n\nPaypal Link for tips: \n\n[https://docs.google.com/document/d/15WqXqliqJLfcYklFr8qcXC6RpYqnIdY91mB6jFzNGhs/edit?usp=sharing](https://docs.google.com/document/d/15WqXqliqJLfcYklFr8qcXC6RpYqnIdY91mB6jFzNGhs/edit?usp=sharing)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9s817/"
    },
    {
      "created_utc": 1768266604.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 81 - 83 Profit: -5.05 u \n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅❌❌️✅❌✅❌❌ ✅✅\n\nBayeux vs Olympique de Marseille, 3.5 goals @ 2\n\nBayeux vs Marseille looks ideal for goals, with Over 3.5 goals @ 2.00 offering solid value. Marseille’s attacking quality and depth should overwhelm the lower-league hosts, especially in a cup tie where rotation often leads to open play. Bayeux may struggle defensively but can still contribute on the counter. A dominant Marseille performance with multiple goals is expected.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9pw01/"
    },
    {
      "created_utc": 1768264848.0,
      "author": "jakedeltoro",
      "text": "**Overall Record**: 4-1 \n\n**Form**: ❌✅✅✅✅\n\n**Net Units**: +6.76u\n\n**Last Pick**: [Liverpool -2.5 ✅ (-128 on FanDuel) 4u to win 3.13u (WIN 💰)](https://www.reddit.com/r/sportsbook/comments/1qaeo3q/comment/nz6wspo/?context=3&utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n**Today’s Pick**: (2 Leg Parlay) Borussia Dortmund ML & Atletico Madrid ML (-108 on Bet365) 4u to win 3.7u\n\n**Match**: Borussia Dortmund vs. Werder Bremen & Deportivo La Coruna vs Atletico Madrid\n\n**League**: German Bundesliga & Spanish Copa Del Rey\n\n**Last Pick Summary**: Well, shit. That was a fuckin’ sweat and really had no need to be. I am not sure I have ever seen a more idiotic defensive play in my life than the one we saw by Szoboszlai. Barnsley had a couple early chances, but that was a very undeserved goal. Liverpool had their fair share of chances but really didn’t take advantage of all the opportunities. We caught a lifeline in the 90’+4’ with Liverpool 4th goal that helped us cover and end on the right side of this one. I’ll be staying away from this Liverpool side for a bit. That being said, hit my prediction with 4+ for Liverpool and 1 or less for Barnsley.\n\n**Today's Write Up:** Today we are rocking a classic European 2-legger so that we can get 2x as sweaty while two matches rage on simultaneously. First leg at 1:30 PM CT is Dortmund ML over Werder Bremen. Dortmund at home and Dortmund away are quite different squads. This season, Dortmund has 5 wins and 2 draws in 7 matches at home, with 4  wins, 4 draws, and 1 loss away. They are a top tier Bundesliga team, but their home win rate has far surpassed their away win rate. On the other side of the pitch, Bremen has been awful away, coming up with only 1 win, 3 draws, and 4 losses on the road. This season on the road, they lost 4-0 to Bayern, 2-0 to RB Leipzig, and 4-1 to Eintracht Frankfurt; which are their most similar road matches against the top ⅓ of the table. I’ll be riding Dortmund ML on a matchup like this 10 times out of 10. Give me Dortmund to score 2-4 goals and Bremen to score 1 or fewer.\n\nOur second leg is Atletico Madrid ML vs Deportivo La Coruna in the Spanish Copa Del Rey. There isn’t a ton to say here other than we have a top 4 La Liga squad in Atletico against a La Liga 2 team. Atletico just lost 2-1 to a really good Real Madrid squad(who just kept it very close with Barcelona in the Spanish Super Cup Final 3-2), and are looking to [rebound.](http://rebound.as) As an interesting point of reference, Atletico Madrid just drew away at Real Sociedad 1-1. Deportivo la Coruna recently played at home against Real Sociedad 2 (the B squad) and lost 3-0. I could probably go on for awhile about reasons why Atletico should win this easily, but I’ll leave it at that. I love Atletico to have a clean sheet here, but if they have a mental lapse, I’ll take them to win by at least 1. Expecting 1-3 goals for Atletico and zero (maybeee 1 for DLC).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9kihs/"
    },
    {
      "created_utc": 1768264290.0,
      "author": "lordestros",
      "text": "Last 5 POTD : ✅️❌️✅️✅️❌️\n\n**Previous pick**: Connor McDavid over 3.5 shots (-170) ❌️ (plenty of shots for the Oilers like predicted but Mcdavid wanted to pass instead)\n\n**POTD Record** : 14-10\n\n**Today's pick** : Dallas Stars vs Anahein Ducks at 10:00pm EST (NHL/Hockey)\n\nDallas Stars ML (-110)\n\nI'm going with Dallas on this one. I think betting sites have it wrong by putting them at -110. While I do see that the Stars are struggling just like the Ducks, the stats say a completely different story. Stars are 3-7 in their last 10 games with 37 goals scored and 35 goals allowed while the Ducks are 1-8-1 with 26 goals scored and **48 goals allowed**!! For me this is just a Dallas Stars team in a slump (who are still 2nd in the whole league btw) while the Ducks are showing their true colors by being a top 5 team for the draft.\n\nYou could tell me the argument that the Stars will be tired from their back-to-back games wellllll the exact same scenario happened the last time they played this season (December 19) with Dallas playing the day before while the Ducks came in fresh. The result? The Ducks got destroyed 8-3. \n\n\nDallas will also have Jamie Benn back in the lineup while I saw at Ducks practice that one of their top forward, Leo Carlsson, left early and did not return so there's a chance he doesn't play or plays injured (which might be the case already). Troy Terry will also not play for the Ducks so they might play without their 1st and 2nd best forwards.\n\nI see this as a back and forth game that the Stars will ultimately win because of their experience and better goaltending(I know DeSmith has been leaky lately but both Ducks goalies have been way worse).\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9irkl/"
    },
    {
      "created_utc": 1768263481.0,
      "author": "Agitated-Ad3361",
      "text": "Record: 4-3 (+2.98 units)\n\nPrevious pick: Julian Brandt 1+ Shot on Target ✅\nCashed fast — Brandt hit a shot on target within 25 minutes.\n\nSoccer | Bundesliga 🇩🇪 | Borussia Dortmund vs Werder Bremen\nDate: 13 January 2026\nTime: 20:30 (Amsterdam time)\nPick: Julian Brandt 1+ Shot on Target  \n@bet365 -200 @betcity(🇳🇱) +112 @Bally(🇺🇸)+112 \n\nStake: 2 units\n\nWrite Up:\n\nLast pick cashed early, so I’m going right back to it.\n\nI’m backing Brandt 1+ shot on target again. At this price, I just can’t ignore it. Dortmund are heavily favored at home, and Brandt’s role in this team right now is perfect for this kind of prop.\n\nThe head-to-head is what really sells it for me. In the last six games against Werder Bremen, Brandt has had at least one shot on target in every single one. That’s too strong of a trend to just overlook.\n\nAdd to that his current form — 1+ SOT in his last four games and 4 goals scored — and it’s clear he’s confident, involved, and constantly getting into good positions around the box.\n\nAt +112, I’m happy to keep riding this until the wheel falls off. \n\nJulian Brandt 1+ Shot on Target\n2 units\n\nLet’s run it back.\n\nEdit: Betcity (🇳🇱)has it at +112 and Bet365 at -200. I see I am already getting downvoted for not noticing this. Proof is in the comments. Still like it at -200 though, and if u add Dortmund u almost hit +money. And if u are also Dutch u should definitely take this one because it is way overvalued right now.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9g8eq/"
    },
    {
      "created_utc": 1768263377.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 9-28-3 *Back to the usual shenanigans we go, Ronaldo did show up and scored to take Al-Nassr up front, but then they stupidly got a red card and conceded* ***two*** *penalties. We move and what better way than to a potential giant killing in the Spanish cup. Will I hit 30 losses before 10 wins? Let's find out* *^((wondering what the odds would be on something like that))*\n\n**Last Five:** ❌✅✅❌❌\n\n**Event:** Copa del Rey, Deportivo La Coruna v Atletico Madrid, 3:00 pm EST\n\n**POTD:** Deportivo La Coruna Win or Draw, +162, 1 unit\n\n**Write Up:** European domestic club competitions are back and they haven't disappointed, already giving us some crazy underdog stories, most notably the 6th tier Macclesfield knocking out the holders Crystal Palace, and Paris FC stunning their Parisian rivals. I think this trend is going to continue in the Spanish cup and I feel like Atletico are going to be the (un)fortunate victims of an upset. Their **form has been patchy** and their playstyle often hot and cold, with their **clunky slow build ups** that have become predictable. Their key players are either **out of form, like Griezmann and Alvarez,** or **injured, like Barrios and Lenglet.**\n\nMeanwhile, their opponents, Deportivo are close to the top of the second Spanish division, fighting for an automatic promotion spot, *although their form has also been anything but stellar* as of late. Still, they're not a pushover in the slightest and I back them to at least reach extra time against a what should be a tired and **heavily rotated Atletico Madrid** side that had travelled all the way to Saudi Arabia to face Real Madrid in an intense match just a few days ago (which they lost, so **their morale is at a season low).** They're definitely not going to be at their best and I seriously believe they're in for a rude awakening when they clash with Deportivo. Taking the morale, energy, injuries, poor individual and collective form, and rotation into consideration, I think these odds that cover two outcomes are absolutely golden. If you want to sprinkle a cheeky BTTS Yes here, I certainly don't mind that either, but the odds are already more than tasty enough imho. Going in with just the standard unit once again, as the bankroll has expectedly been spread rather thin. BOL and let's watch some weird cup madness ☘️🫡\n\n☘️ If I've made you some money through fades, please consider dropping a tip: [https://buymeacoffee.com/sigmabale](https://buymeacoffee.com/sigmabale)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9fwn8/"
    },
    {
      "created_utc": 1768262881.0,
      "author": "dreamchasing1",
      "text": "Record: 255-236 Net Units: -21.34 60-62 on 1.5u plays, 44-41 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Italy Serie C] Salernitana vs Cosenza\nLast pick: BTTS @ 1.83 - 1.5 Units Loss\n\n\nEvent: Soccer/Football, [Wales Cymru Premier] TNS vs Colwyn Bay\n\n\nPick: total corners over 9.5 @ 1.80 - 2 Units\n\n\nCovered with 11 total in the reverse matchup this season, TNS have covered in 8 straight home league games, 8/10 total. Colwyn in 8/10 away games, both sides averaging great with 11 total for TNS at home, 11.50 for Colwyn Bay in away games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9eczg/"
    },
    {
      "created_utc": 1768262475.0,
      "author": "nigerianPriince0",
      "text": "**Record: 102 W  - 88L**\n\n**Today's Pick: Newcastle or Draw @ 1.68**\n\n**Game: Newcastle VS Man City - 3:00 PM EST**\n\n**Really loving the odds on this, especially considering Newcastle’s recent home form and Manchester City’s drop in form, coupled with their defensive injuries.**\n\n\\---\n\nSt. James’ Park in a cup match is not an easy place to go, regardless of who is fit. It’s a ground where even in-form players can disappear in key moments. Newcastle come into this game on a three-game home winning streak, and I can tell you right now that place will be bumping tomorrow.\n\nBefore Manchester City’s emphatic win against League One side Exeter, they drew three straight matches against Premier League opposition - Sunderland (0-0, A), Chelsea (1-1, H), and Brighton (2-2 ,H). City have started to adapt to being more open and allowing teams more time on the ball, but the issue is that opponents still find themselves in behind and in one-on-one situations with City defenders far too often. You can tell the back line is nervous about conceding late — and ironically, they still ended up conceding late goals against both Chelsea (90' + 4) and Brighton (60').\n\nA significant development here is that City lost both of their starting centre-backs to injury just over a week ago (Dias and Gvardiol). Alleyne has looked solid, but St. James’ Park is no joke — especially when you’ve only played one Premier League match so far with your new back line.\n\nI see the Exeter game painting over some defensive cracks that will resurface against athe riled up  Magpies, not saying City will lose but considering this is leg 1 of a 2-game tie, I see Newcastle throwing the kitchen sink at it\n\n**BOL**\n\n![gif](giphy|KF2UlEZDfMBVDrrtfx)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9d3jm/"
    },
    {
      "created_utc": 1768261887.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 19-20 (-1.44)\nJanuary Record 3-6 (-3.46u)\n\nMonday’s Pick - Kenneth Gainwell u28.5 rush yards -114 (1.14u to win 1u)\n\nTuesday’s Pick - Dallas Stars ML -110 (1.1u to win 1u)\n\nDallas has been struggling recently, but this a good bounce back spot for them. The Stars will be on the second half of a back to back likely DeSmith will be in goal. He was roughed up in his last outing, but was good in his two starts before that. \n\nThe Ducks have been on a pretty rough run over their last 10 games, winning only once. It seems their beginning of the year run wasn’t the real Ducks. \n\nRegardless of who is in net, these are 2 different class of teams, despite being a pickem game\n\nGood Luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9ba9f/"
    },
    {
      "created_utc": 1768261725.0,
      "author": "SP7988",
      "text": "**Record:** 35-18-1 (+15.72u)\n\n**Last:** (CBB) Illinois -1 (1.5u) - ✅\n\n**POTD:** (CBB) No. 12 Michigan State (-6.5) vs. Indiana\n\n**Start Time:** 7:00 PM ET (Peacock)\n\n**Odds:** \\-106 (FanDuel)\n\n**Units:** 1.5U\n\n**Reasoning:** Death. Taxes. Sparty respecting our coin.\n\nFor those of you who’ve been along for the POTD ride since last February, it’s a phrase you’ve heard me repeat quite a bit. For good reason too, as Michigan State has had a knack for delivering the goods whenever we’ve backed them. And although some of the familiar faces from last year’s squad no longer remain, this year’s Spartans (14-2) are more than capable of taking up the baton.\n\nIt all starts with a defensive unit that, believe it or not, is even better than the year before.\n\nThrough 16 games, Michigan State ranks 5th in opponent field-goal percentage (38.4%), 11th in scoring defense (64.5 PPGA), 14th in defensive efficiency (0.923) and 45th in opponent three-point shooting (30.3%). Those numbers have looked even better as of late, as the unit has conceded just 58.3 points per game on 34.1% shooting—27.5% from beyond the arc—over its last three contests. Sure, Indiana presents a tough out offensively, ranking 26th in offensive efficiency (1.185), 41st in field-goal percentage (48.3%), 42nd in scoring (84.5 PPG) and 57th in three-point shooting (36.3%). However, the Spartans defense has proven it can match wits with the best of them.\n\nDon’t take my word for it, just take a look at how the unit has fared in its seven matchups (5-2) against offenses ranked in the Top 70 in offensive efficiency:\n\n* **Arkansas (15th):** 66 points, 39% shooting (25% from three)\n* **Duke (18th):** 66 points, 38% shooting (31% from three)\n* **Iowa (20th):** 52 points, 38% shooting (30% from three)\n* **Kentucky (38th):** 66 points, 35% shooting (23% from three)\n* **Nebraska (53rd):** 58 points, 34% shooting (36% from three)\n* **North Carolina (54th):** 58 points, 38% shooting (17% from three)\n* **Northwestern (66th):** 66 points, 38% shooting (23% from three)\n\nConversely, here’s how the Hoosiers (12-4) have fared against opponents who rank in the Top 60 in defensive efficiency:\n\n* **Nebraska (20th):** 77 points, 46% shooting (37% from three)\n* **Louisville (22nd):** 78 points, 41% shooting (32% from three)\n* **Kentucky (43rd):** 60 points, 34% shooting (17% from three)\n* **Minnesota (54th):** 64 points, 40% shooting (30% from three)\n\nNot only did Indiana lose all four of those games by six points or more, those numbers in Saturday’s matchup with Nebraska are a little misleading. While the team did shoot lights out during the first half, the Hoosiers only managed to shoot a meager 36.7% from the field during the second half while coughing up a 16-point lead in the process. Not surprisingly, the team is still seeking its first Quadrant 1 victory after falling short in each of its first three opportunities.\n\nLook for Michigan State’s interior presence to loom large on Tuesday night.\n\nPer KenPom, the team ranks 22nd in average height and 20th in effective height. Not surprisingly, the Spartans have made their impact felt down low, ranking 24th in second-chance points (14.6 per game) and 32nd in blocks (4.8). That advantage shows up on the glass as well, as the team ranks 5th in total rebounding (42.7), 8th in defensive rebounding (27.6) and 12th in offensive rebounding (12.3) while also ranking 4th in opponent total rebounding (29.1), 6th in opponent offensive rebounding (6.6) and 17th in opponent defensive rebounding (19.3). That should present more than a handful of problems for an Indiana team that ranks just 105th in total rebounding (36.8), 122nd in opponent offensive rebounding (8.6) and 167th in opponent second-chance points (11.1).\n\nHowever, if there was one Achilles heel for Michigan State, it’s turnovers.\n\nOn the season, the team has struggled mightily to keep control of the ball, ranking 214th in turnovers (12.4 per game), 235th in turnovers per possession (17.8%) and 279th in opponent steals (7.6). That imperfection was really put on display during the Spartans’ disaster of a first half last time out against Northwestern, where the team turned it over eight times. Fortunately, the Hoosiers defense doesn’t appear to be equipped with much bite in that area, ranking just 229th in turnovers forced (11.4), 236th in opponent turnovers per possession (16.0%) and 298th in steals (5.6). Those numbers have been even worse over the team’s last three outings, dropping to 7.7, 11.3% and 2.7 respectively.\n\nLook for Michigan State to put together two full halves of clean, dominant basketball in front of the home fans on its way to a comfortable victory.\n\nBOL if tailing, and as always, please do so respectfully. One bet should not be enough for you to crash out.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9aryf/"
    },
    {
      "created_utc": 1768261586.0,
      "author": "damagebabee",
      "text": "**POTD** Record 130-03-101\n\n\n\nHAMBURGER VS BAYER LEVERKUSEN\n\nDate: 13 JANUARY 2026 at 20:30\n\nBET ON: Over / Under- Over +2.50\n\nOdd: 1.65\n\n\n\n\\- HSV have conceded heavily all season and continue to show defensive vulnerability — their last five matches all saw more than 1.5 goals and goals at both ends, reflecting a systemic issue in transition and structure that coach Merlin Polzin hasn’t fully fixed yet. Even with absences (Glatzel, Poulsen, Elfadli suspended), Polzin’s 3-4-3/3-4-2-1 setup invites open play with wing-backs pushing high and frequent transitions, often leaving space at the back that opponents can exploit.\n\n\\- Leverkusen, under Kasper Hjulmand, openly acknowledge a need for improvement after their recent 1-4 home defeat against Stuttgart and are motivated to score more — Hjulmand stressed before the game that the team must perform “much better than Saturday” and that he expects a tough, open match against a speedy Hamburg side. With Patrik Schick hopeful of returning from injury to boost the attack, Leverkusen’s offensive firepower increases, but they historically concede in phases when trying to maintain high possession and press aggressively.\n\n\\- Combining these factors — HSV’s ongoing defensive lapses and direct style, Leverkusen’s need to respond offensively after recent setbacks, and both coaches’ public confirmation that the match will be competitive and demanding — strongly indicates a game with multiple scoring chances and goals on both sides. Recent statistical trends in German Bundesliga data also show both teams contributing to higher-scoring matches, making Over 2.50 goals a convincing market choice.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz9acer/"
    },
    {
      "created_utc": 1768260759.0,
      "author": "Best_Accountant_5471",
      "text": "2026 record: 3-3 (+0.9 units)\n\n2025 record: 55-41 (+26.5 units)\n\nLast 10 (most recent on right):  ✅❌✅❌❌❌✅❌✅✅\n\nLast Pick: Vitinha 1+ tackle vs Cagliari + Krasava ENY Ypsonas U1.5 team goals vs Olympiakos Nicosia ✅\n\nEvent: Germany Bundesliga I ⚽️\n\nPick of the Day: Miro Muheim 1+ fouls won AND 2+ tackles vs Bayer Leverkusen 4 units to win 3.8U @1.95 (Bet365)\n\nWrite-up: Vitinha got his tackle in the first half and ended on two (both won) whilst Krasava took an early lead and held out for a 1-0 win. \n\nExpected to start at LWB, direct opponent expected/hopefully Arthur at RWB\n\nMuheim foul won:\n\n- 13/15 matches this season (+ last 9) averaging 1.8 per game\n\n- As LWB vs RWB: foul won in 6/7 (average 1.7)\n\nArthur foul committed: \n\n- 13/16 matches averaging 1.5 per game\n\n- As RWB: foul in 8/11 (average 1.4)\n\n- As RWB vs LWB: foul in 2/2 (average 2.5)\n\nMuheim 2+ tackles:\n\n- 13/15 matches this season (average 2.1 per game)\n\n- As LWB vs RWB: 7/7 (average 2 per game)\n\nLWB’s have had 2+ tackles vs Arthur in 1/2 matches (1.5 average) - one didn’t clear because Mwene only averages 0.6 tackles per game\n\nPick a book that voids if a player doesn’t start (Muheim is heavily predicted to start though). BOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz97szy/"
    },
    {
      "created_utc": 1768260587.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Tuesday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qbazyx/pick_of_the_day_11326_tuesday/nz979vi/"
    }
  ]
}