{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/26/26 (Monday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qmyn9n/pick_of_the_day_12626_monday/",
  "target_date": "2026-01-26",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-25T23:43:41.921218+00:00",
  "comments": [
    {
      "created_utc": 1769383769.0,
      "author": "SP7988",
      "text": "**Record:** 41-20-1 (+22.02u) | L5: 3-2 (1L)\n\n**Last:** (CBB) Florida -11.5 (1.5u) - ❌\n\n**POTD:** (CBB) No. 1 Arizona (-2.5) at No. 13 BYU\n\n**Start Time:** 9:00 PM ET (ESPN)\n\n**Odds:** -110 (FanDuel)\n\n**Units:** 1.5U\n\n**Reasoning:** No other team in college basketball has a bigger target on its back right now than undefeated Arizona.\n\nNight in and night out, the Wildcats (20-0) are consistently on the receiving end of their opponents’ best shot. But the team doesn’t just absorb the contact, it counters with a knockout blow of its own. And it isn’t just a bunch of slouches that Arizona has been beating up on, as the team has racked up a national best eight Quad 1 victories, including wins over then-No. 3 Florida, No. 3 UConn, No. 12 Alabama, No. 15 UCLA and No. 20 Auburn. It all leaves the Wildcats just one win shy of their best start since 2013-14 and two shy of matching the program-best 22-game win streak set from 1914-17. \n\nIt’s been a multi-pronged attack on offense that has led the way for Arizona.\n\nOnly once this season has the same player led the team in scoring in back-to-back games with seven different players topping 20+ points this season. The combined effort has the Wildcats among the nation’s best offensively, ranking 5th in field-goal percentage (51.6%), 7th in offensive efficiency (1.207), 8th in scoring (89.8 PPG) and 54th in three-point shooting (36.4%). The unit will be challenged against a stiff BYU defense that enters ranked 23rd in defensive efficiency (0.955), 37th in opponent field-goal percentage (41.0%), 71st in scoring defense (70.1 PPGA) and 85th in opponent three-point shooting (31.8%). However, the unit has been a little more generous as of late, conceding 78.9 points on 44.5% shooting (38.9% from beyond the arc) over its last four games.\n\nFurthermore, take a look at how Arizona has fared against opponents who rank Top 50 in defensive efficiency: \n\n* UConn (8): 71 points on 46% shooting (20% from beyond the arc)\n* Cincinnati (13): 77 points on 43% shooting (23% from beyond the arc)\n* TCU (31): 86 points on 51% shooting (44% from beyond the arc)\n* West Virginia (32): 88 points on 53% shooting (43% from beyond the arc)\n* Florida (41): 93 points on 49% shooting (40% from beyond the arc)\n\nNot only did the Wildcats still average an impressive 83 points per game, but the team topped 46% shooting in all but once of those games. Not to mention, outside the contests against the Huskies and Gators, the rest of the games were decided by 13 points or more.\n\nFortunately for the Cougars (17-2), they pack a punch of their own offensively.\n\nThrough 19 games, the team ranks 20th in offensive efficiency (1.183), 20th in scoring (86.8 PPG), 25th in field-goal percentage (49.1%) and 99th in three-point shooting (35.4%). Fresh off a 43-point effort on Saturday, star freshman AJ Dybantsa will look to stay hot. Unfortunately, Arizona has just the defense that can fan the flames, ranking 5th in defensive efficiency (0.908), 13th in opponent field-goal percentage (39.2%), 31st in scoring defense (67.6 PPGA) and 71st in opponent three-point shooting (31.4%). Not only is the unit coming off consecutive games of holding opponents below 60 points and 35% shooting, but in seven contests against offenses ranked in the Top 100 in offensive efficiency, the Wildcats have conceded a respectable 73.6 points on just 40.3% shooting (32.2% from deep). Conversely, in six outings against opponents who rank Top 100 in defensive efficiency, BYU has managed just 75.5 points on 43.3% shooting (32.5% from beyond the arc). \n\nLook for Arizona’s size to prove to be a difference-maker in this one. \n\nPer KenPom, the Wildcats rank 7th in average height and 30th in effective height. That size has paid dividends especially on the glass, where the team ranks 2nd in total rebounding (43.4 per game), 3rd in defensive rebounding (28.5) and 6th in offensive rebounding (12.4) while ranking 2nd in opponent defensive rebounding (17.8), 9th in opponent total rebounding (29.9) and 70th in opponent offensive rebounding (8.2). That could make life difficult for a Cougars defense that ranks just 116th in opponent points in the paint (30.2 PPG), 130th in opponent offensive rebounding (8.6) and 289th in opponent second-chance points (12.4 PPG). To make matters worse, Arizona just so happens to rank 2nd in points in the paint with 45.9 points per game. \n\nIn what should be a back-and-forth game, look for the battle-tested Wildcats to pull away when it matters. \n\nBOL if tailing, and as always, please do so responsibly. One bet should not cause you to crash out all over Reddit.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qmyn9n/pick_of_the_day_12626_monday/o1ptnu5/"
    },
    {
      "created_utc": 1769383311.0,
      "author": "LolPropKing1",
      "text": "POTD Record: 216-164\n\nUnits Won: +104.89u\n\nLast Pick: Oner>Raptor Map 1 Kills + PerfecT U 4.5 Kills Map 1 (-111) ✅\n\n**Today's Pick: Viper O 3.5 Kills (-139)** 5u\n\nhttps://preview.redd.it/3u3wnv0zwkfg1.png?width=273&format=png&auto=webp&s=2b32732fb9d748539fd4211773a7f7eb7d96cfc5\n\n  \nTeams/Time: BLG vs. JDG (6:00 AM EST.)\n\nWriteup:\n\n* Error line on Thunderpick, not sure why this got traded to 3.5 but is a huge mistake, as is GALA line at 2.5. ADC's have the highest kill share of any role and are currently set way too low in both cases. Earlier on when this line opened, Viper was 5.5/6.5 at + money. \n* Viper is averaging 5 kills per map so far this split. Last split in LCK Viper averaging 5.3 kills in Summer split, both well above this line. BLG are currently between -200/-220 favorites to win this series so they are decent favorites coming into this game\n* Viper has a 8/12 hitrate so far this split for BLG with 7/8 cover rate in wins with the only miss being a hook. JDG just beat BLG 2-0 and in this series Viper got the least kills of mid/jungle/adc. This isn't a normal trend for this team and expecting them to make the adjustment and focus on getting Viper kills/resources in this series the second time around\n* In map wins viper is averaging 6.12 kills per map so far, as said above most adc lines that are favorites is set to 5.5 kills at lowest you will see 4.5, this line is an error, BLG should win this series and are the better team overall. \n* Slamming this pick and also laddering O 4.5 Kills at + money is insane value. As said above Gala line is also currently an error on Thunderpick, would highly recommend playing both lines as their is almost 100% guarantee 1/2 hit their error line and both hitting is very likely with both being 2 kills lower then what they should be.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qmyn9n/pick_of_the_day_12626_monday/o1ps2ck/"
    },
    {
      "created_utc": 1769383296.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 26-25 (+0.1u)\nJanuary Record 11-12 (-1.92u)\n\nSunday’s Pick - Rashid Shaheed o4.5 rush yards -122 (1.22u to win 1u)\n\nMonday’s Pick - Shelton 1st set + ML +110 (1u to win 1.10u)\n\nBen has been playing excellent tennis so far this tournament. He’s won all 3 matches in straight sets despite having a pretty tough draw so far. He has always done well in this tournament and has a lot of points to make up for his ranking. With Sinner likely waiting in the quarters, he will want to be as fresh as possible for a chance at an upset.\n\nHe’s going up against Ruud, who has also been playing well in this tournament. His only lost set so far was to Cilic in the last round. However, he’s never advanced farther than the 4th round here in Australia, and I suspect that to continue here. Ben has more weapons and if he is playing well, I don’t see Ruud being able to do much to stop it.\n\nGood Luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qmyn9n/pick_of_the_day_12626_monday/o1ps0fx/"
    },
    {
      "created_utc": 1769383041.0,
      "author": "FlatwormLanky2725",
      "text": "![gif](giphy|6uGhT1O4sxpi8)\n\nMe looking for picks while everyone's watching football...",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qmyn9n/pick_of_the_day_12626_monday/o1pr46y/"
    },
    {
      "created_utc": 1769382401.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Monday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qmyn9n/pick_of_the_day_12626_monday/o1posg2/"
    }
  ]
}