{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 1/29/26 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1qpr22u/pick_of_the_day_12926_thursday/",
  "target_date": "2026-01-29",
  "timezone": "America/Chicago",
  "collected_utc": "2026-01-28T23:49:55.765019+00:00",
  "comments": [
    {
      "created_utc": 1769644105.0,
      "author": "NukDatJuke",
      "text": "**POTD: 5-0 (+7.82u)**\n\n**Event:** **League of Legends (LOL) - LCK Cup 2026 - DN SOOPers vs BNK FearX**\n\n**Pick: Map 1 - BNK FearX -5.5 Tower Handicap (2.00) 1.5u to win 1.5u**\n\n**Start Time:** 17:00 KST, \\~8 hours from posting\n\n**DISCLAIMER: I took this same line at -4.5 @ 1.72 a few hours before this thread was created, it has moved up to -5.5 on my main sportsbook before I could post POTD. -5.5 is still good value, especially now that the odds are higher, BUT please exercise caution and lower your usual bet size. I have lowered the usual 2u bet to 1.5u for that reason as well.** \n\n**If it goes up higher to -6.5, its an automatic fade for me. If you can find it anywhere at -4.5, that was the original intended line for this pick and you can increase your units. Gamble responsibly and only bet what you can lose.**\n\n**Writeup:**\n\nDN SOOPers (1-3) are lacking in firepower. All of their players are just about outside of their primes and they are simply regressing. This roster five years ago would've been legit, but the next generation are already making waves and these old fellas aren't cutting it. They're second last in their group and only marginally better than HANJIN BRION who have ZERO match wins.\n\nBNK FearX (2-2). What more can I say about this team that hasn't been covered in previous POTDs. I'm loving how this team is right now and their playstyle. They can play slow, turn up the pace, and challenge the top teams all in one. They're playing great League of Legends.\n\nComing into this match, I fully expect FearX to take Map 1, and it'll just come down to the manner in which they execute. Just like most games, FearX will most likely make early game plays botside to give their star player Diable a lead. If they can end the first 10-15 minutes of the game ahead, DNS will have a tough time breaking through the line to destroy towers.\n\nIn order for the tower handicap to win, FearX must destroy six MORE towers than DNS. In all losses, DNS average -7.14 tower difference, meaning they destroy seven LESS towers on losses. In all wins, FearX average +5.4 tower difference, meaning they destroy five MORE towers on wins. FearX's schedule has been really rough and a lot of their wins are from behind so this number should be higher based on their ability.\n\nIn losing efforts, DNS aren't staying in the game and taking these towers which speaks to their lack of ability to claw back deficits. On the other hand, FearX likes to take the game slow from winning positions, which includes slowly breaking down the map and taking towers. If FearX gets ahead, I suspect they'll smash the over easily. If it's close, I expect FearX to play it slower and still comfortably hit the over. And if they're behind, I'm not convinced in DNS' ability to get snowball a lead so they won't destroy too many towers before FearX fights back. BOL!\n\n**Map 1 - BNK FearX -5.5 Tower Handicap (2.00) 1.5u to win 1.5u**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qpr22u/pick_of_the_day_12926_thursday/o2bd4as/"
    },
    {
      "created_utc": 1769642457.0,
      "author": "SP7988",
      "text": "**Record:** 42-21-1 (+21.87u)\n\n**Last:** (CBB) Houston -5.5 (1.5u) - Pending \n\n**POTD:** (CBB) No. 9 Illinois (-12.5) vs Washington\n\n**Start Time:** 9:00 PM ET (FS1)\n\n**Odds:** -108 (DraftKings)\n\n**Units:** 1.5U\n\n**Reasoning:** No hurdle has proven to be too tall for this year’s Illinois squad. \n\nLost senior guard Kylan Boswell to a broken hand? Junior Andrej Stojakovic responded with a career-high 30 points in a commanding 89-70 victory over Maryland. Down 11 to then-No. 4 Purdue—which started 14-of-18 (77.8%) from the field—on the road? Freshman Keaton Wagler took the reins, pouring in an eye-popping 46 points on 13-of-17 shooting to help pull off the 88-82 upset. Now, off the high of that victory, and with a Sunday road trip to No. 5 Nebraska looming, surely this has all the makings of a letdown spot?\n\nMeh. Trap game, smap game. \n\nThe Fighting Illini (17-3) might very well be the best offense in the country right now, ranking 1st in offensive efficiency (1.247), 25th in scoring (85.5 PPG), 65th in field-goal percentage (47.1%) and 68th in three-point shooting (36.0%). The team leads the nation in adjusted offensive efficiency (130.5), owning what currently stands as the highest offensive rating in the history of the kenPom era (since 1996-97). Furthermore, Illinois seems to feed off the energy of the home fans, averaging 90.3 points on 49.1% shooting while boasting a +24.1 scoring margin in 11 home contests. That’s very concerning for a middle-of-the-pack Washington defense that enters ranked 80th in opponent three-point shooting (31.7%), 108th in defensive efficiency (1.020), 118th in opponent field-goal percentage (43.3%), 140th in scoring defense (73.3 PPGA). \n\nUnfortunately for the Huskies (11-9), they lack the kind of offensive firepower to keep up. \n\nThrough 20 games, the team ranks 97th in scoring (79.0 PPG), 101st offensive efficiency (1.100), 162nd in field-goal percentage (44.9%) and 288th in three-point shooting (31.4%). Although the Illini don’t boast elite numbers defensively—25th in opponent field-goal percentage (40.4%), 41st in scoring defense (68.3 PPGA), 68th in defensive efficiency (0.997) and 77th in opponent three-point shooting (31.6%)—the team does step it up against sub-par offensive units. In nine contests against opponents that rank outside the Top 100 in offensive efficiency, Illinois has conceded just 63.1 points on a porous 37.3% shooting from the field (29.6% from beyond the arc). That includes allowing just one opponent to top 40% shooting and holding all but three to 65 points or less. \n\nBut if the Illini want to cover the double-digit spread, it’s imperative that they continue their dominance on the glass.\n\nOn the year, Illinois ranks 7th in offensive rebounding (12.2 per game), 11th in total rebounding (41.6) and 17th in defensive rebounding (26.4). That includes holding a double-digit rebounding edge in each their last three games. However, if there’s one downside, it’s the team’s tendency to cough up second-chance opportunities to opponents, ranking just 194th in opponent offensive rebounding (9.2). This is an area Washington will look to pounce, as the team ranks 44th in offensive rebounding (11.0), 49th in total rebounding (38.3) and 65th in defensive rebounding (24.3). Limiting the team’s impact on the glass will be critical for the Illini. \n\nAll things considered, look for Illinois to put it together on both ends of the floor for a convincing victory. \n\nBOL if tailing, and as always, please do so responsibly. One loss should not have you crashing out all over Reddit. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qpr22u/pick_of_the_day_12926_thursday/o2b7uef/"
    },
    {
      "created_utc": 1769641505.0,
      "author": "222benz",
      "text": "Record: 6-8-1\n\nNet Units: +0.30u\n\nROI: +0.6%\n\nLast Pick: Rekonix ML + Nemesis +1.5 @ 2.03 ✅\n\nSports: eSports | Dota 2\n\nEvent: PGL Wallachia Season 7 Qualifiers | Nemesis vs. PlayTime\n\nTime: 12:00 AM EST\n\nPOTD:  Over 2.5 Maps  @ 1.95 (5u)\n\n\nWrite Up:\n\nThe stakes here are massive. Both rosters are desperate to reach the Grand Finals because neither team has qualified for a major event yet, and losing here means waiting months for the next opportunity. Nobody is rolling over or calling GG early with their season on the line.\n\nIf you look at the rosters, this is basically a SEA All-Star match. On one side, you have the PlayTime veterans (Gabbi, Armel, Kuku, DJ, Akashi). On the other side, Nemesis is absolutely stacked with firepower (23savage, Mac, Jabz, Q, Jaunuel). When you have this much talent and this much desperation on the server, sweeps are rare. Nemesis has the raw carry potential with 23savage to take over a game, but PlayTime’s shot-calling usually drags matches into the late game where things get messy.\n\nBoth teams are prone to clown fiestas and throwing leads. I expect them to trade games, with the veterans stealing one and the young guns taking another, forcing a decisive Game 3.\n\nBOL.\n\nhttps://buymeacoffee.com/222benz",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qpr22u/pick_of_the_day_12926_thursday/o2b4r0t/"
    },
    {
      "created_utc": 1769641413.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1qpr22u/pick_of_the_day_12926_thursday/o2b4fy5/"
    }
  ]
}