{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 2/13/26 (Friday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/",
  "target_date": "2026-02-13",
  "timezone": "America/Chicago",
  "collected_utc": "2026-02-13T14:34:13.765914+00:00",
  "comments": [
    {
      "created_utc": 1770991799.0,
      "author": "giiltyspark",
      "text": "Record: 0W - 0L\n\nNet Units: n/a\n\nROI: n/a\n\nBasketball | NCAAM | 18:00pm CST\n\nPick: Quinnipiac @ Siena u143.5 (-110) - 1u\n\nNew here.. I’m just a guy who loves betting cbb unders. This game sets up as a slower, half-court matchup anchored by Siena’s deliberate tempo. Neither offense consistently generates easy points, and both teams rely more on structured execution than transition scoring. With limited foul inflation and a tight spread, the game environment points toward fewer possessions and controlled scoring rather than volatility.\n\nThe main risk would be an unexpected pace spike or both teams shooting well from three, which could push efficiency above typical expectations. \n\nLooks like a great combination for an under to me and I’m not so worried about the risk, so I’m rolling. BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o55zxtb/"
    },
    {
      "created_utc": 1770986586.0,
      "author": "Jpswatt",
      "text": "ZAZA NASCAR BETS! BOOGITY BOOGITY BOYS LETS GO GAMBLING!\n\nRecord: 9-7 🏁🏴🏁🏴🏴🏁🏴🏁🏴🏴🏁🏁🏁🏴🏁🏁\n\nNet Units: +3\n\nNASCAR | truck series | 7:30 (fs1) / est\n\nPick: Carson Hocevar top 5 +180\n\nWrite up: Carson Hocevar is the only full time cup driver dropping down to race on Friday night. This might be the most anticipated truck field in years with Tony Stewart and Cleetus McFarland racing in the field. Hocevar has won in the trucks before even winning a season championship back in 2023. He has 5 wins across 81 truck starts and 34 top 10s. I see him using veteran experience against a younger truck series field that pushes him to victory",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o55kwg9/"
    },
    {
      "created_utc": 1770984078.0,
      "author": "MississipiGrind",
      "text": "POTD record: 0W - 0L (+0.00u) \n\n\\[I haven't posted here since 2020 so let's start fresh - My bank it's 50 units so I usually just play 1 to 5u bets\\]\n\nLast 10: --\n\nGame: Rennes vs PSG\n\nPick: PSG 1H @ 1.86 x 3u\n\n**Write Up: What's there to say, two worlds apart regarding individual talent and teams performance.**   \n**I'm going with the pretty solid odds of 1.86 at halftime thinking that with a tricky game next Tuesday (Monaco vs PSG for UEFA Champions League), PSG will start strong and fast trying to settle this on the 1st half.**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o55ewwb/"
    },
    {
      "created_utc": 1770982435.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Record: 92 - 101 Profit: -7.25 u \n\n\nForm(old to new): ✅✅✅✅❌✅✅❌❌✅❌✅❌✅✅❌❌✅❌✅✅❌✅✅✅❌✅✅❌✅✅✅❌✅❌✅✅✅✅❌✅❌✅✅✅❌❌✅❌✅✅✅❌✅❌✅✅❌✅✅❌✅❌❌✅✅❌❌❌❌❌❌✅❌❌️✅❌✅❌❌✅✅✅❌❌️❌️✅✅✅❌️❌️❌️✅❌️❌️❌️❌️❌️✅❌️❌️✅✅❌️❌️✅❌️❌✅❌️✅❌❌️\n\n\nRennes vs Psg , over 3.6 goals @2\n\n\nPSG matches are rarely quiet, especially against attacking sides like Rennes who are strong at home and willing to press high. When PSG score early, games often open up quickly with space on the counter. Both teams have the quality in attack to contribute, and Ligue 1 fixtures involving PSG regularly produce high totals. Over 3.5 goals offers strong value in what could be an open, entertaining game",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o55be42/"
    },
    {
      "created_utc": 1770980351.0,
      "author": "Dr_Tholan",
      "text": "POTD record: 37-26 (+8.54u)\n\nLast 5: LWWWW League: Modus super series: Ashley Coleman - Jonathan Platt\n\nPick: Ashley Coleman -1.5 handicap @ 1.72. 1u. Starts in approx 3 hours\n\nSecond day of group C in modus super series. Coleman finishing 4-1 with leg differential of +11 and Platt finishing 1-4 with a leg differential of -9. Platt always plays one week in the Modus super series and his average is always around the 77. Yesterday was not any different. He averaged 78.53 in those 5 games, with a checkout percentage of 31%. Coleman is an average player, averaging 85 in the last 12 months. Yesterday, he had an average of 85.26 with a checkout percentage of 42%. I expect to see the same stats today. I don't see any reason why Coleman shouldn't be able to cover this one.\n\nIt is a short format, only going to 4 legs, so only betting 1u.\n\nBOL\n\n  \nEdit: L Coleman blow of course",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o557bch/"
    },
    {
      "created_utc": 1770978720.0,
      "author": "DerpVonGroove",
      "text": "**Record:** 2L\n\n**Net Units:** \\-6 units\n\n**ROI:** – 0%\n\n**Todays pick**\n\n**Event:** Men's Cross Country Skiing | **League:** Winter Olympics 2026 | **Time:** 11:45 PM GMT+1\n\n**Pick:** 3u: Johannes Hoesflot Klaebo to place (1-3) + Mathis Desloges to finish top 10 @ 1.56 (B365) ✅\n\n**Write Up:** The top three athletes will most likely be Norwegians and while I consider one of them a \"lock\", the odds are too low and the value is just not there. Instead, the value is at Hoesfot Klaebo. Those of you who've been following the Winter Olympics have probably noticed Desloges performances and I recon he's the main danger for the Norwegians. I'll be laddering Desloges to place 1-3 as well.\n\nMy POTD is a parlay of **Johannes Hoesflot Klaebo to place (1-3)** \\+ **Mathis Desloges to finish top 10** **@ 1.56 (B365).** ✅\nEdit: Sweat free win! Congrats if you tailed and an extra big win if anyone laddered Desloges to place 1-3 @ 7.00 (+600) as he placed 2nd! 💰\n\nBOL and tail responsibly",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o55495c/"
    },
    {
      "created_utc": 1770977771.0,
      "author": "mtxghost",
      "text": "**Record:** 4-1-0; +2,1u\n\n**Last pick:** Győri ETO + o1,5 goals @ 1,75 ✅\n\n**Event:** Dortmund vs Mainz\n\n**POTD:** Dortmund ML + o1,5 goals @1,81\n\n**WriteUp:** Dortmund is a menace at home in the Bundesliga. They won their last 5 games, they scored at least 2 goals in their last 7 games, they are in great form. They are the most in form team in the last 6 games in the Bundesliga. My only concern is Mainz is gaining momentum in their home games, but away they are atrocious - only beating Leipzig (while being worse in every stat during the game + Mainz had a penalty) since 2025 September.  They also had a lucky draw in december against Bayern who had 4,5 xg and scored 2 goals compared to mainz's 0,6 xg and 2 goals. They were completely outclassed.\nAll things considered I don't think Mainz can get points against the 2nd best team in the league in front of their home crowd.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o552jwp/"
    },
    {
      "created_utc": 1770975163.0,
      "author": "SharpEagle77",
      "text": "Record: 8-0-3\n\nForm: WLWWLWWWWWL\n\nMatch: Hull City v Chelsea & Rennes v PSG\n\nTime: 20:45 & 19:00 CET\n\nPick: Chelsea ML + PSG ML (1.73)\n\nReasoning: \n\nEven away from home, the quality gap here is significant. Chelsea have far greater squad depth and come from a borderline shocking draw against Leeds so they will want to bounce back. Rosenoir has been great since coming in as the head coach of the Blues and doesn’t seem to rotate a lot. Even though some rotation will for sure take place, even the second team of Chelsea is capable of beating Hull today. I don’t see them throwing the FA Cup tonight, they have the depth to compete in all competitions. Hull may compete physically at home, but over 90 minutes the technical and tactical superiority should show.\n\nPSG are still operating at a different level than most domestic opponents. Their attacking output remains among the highest in the league, and they consistently create high xG chances regardless of venue. Lens is only two points behind them so there is no place for mistakes. I would think they want to have a comfortable lead before their UCL campaign starts again. On top of that Rennes has been in terrible form  and I don’t think they are a match here for PSG who battered them 5-0 on their previous encounter this season.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o54xy03/"
    },
    {
      "created_utc": 1770974705.0,
      "author": "Pazha_vilk",
      "text": "**Record:** 0✅️ 0❌️\n\n**Today's Pick:** \n\nEuroleague\n\nZalgiris vs Hapoel Tel-Aviv\n\nA.Tubelis over 0.5 three pointers made @ 1.57\n\n2 units\n\n**Short Write Up:** \n\nThis hit 4 out of 5 last games (including domestic) so I value it 80% possibility of hitting\n\nBooks value it at 1.57 that means 1/1.57=63%\n\nSo our pick edge is 17%\n\nTubelis is becoming the main man for Zalgiris when it comes to scoring while Francisco is becoming more of a playmaker and while getting double teamed every possession he opens shooting opportunities for his team mates including our man\n\nTubelis is playing 25-30 minutes out of 40 available that's plenty of time for a player to score at least 1 three while shooting 3-5 three pointers per game",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o54x5qt/"
    },
    {
      "created_utc": 1770973519.0,
      "author": "WeightShift",
      "text": "**POTD Record 152-1-75 | +112.80u**\n\n**Form:** WWWWWWWWLLWWW\n\n**Pick: NBL (Wildcats v Bullets) Dylan Windler over 24.5 PRA 2u** $1.80 (Bet365) 9:40PM AEDT\n\nWith the guards back for Perth, Windler should resume his natural forward position and will be in a position to crash the boards a lot more, not having to initiate with ball in hand. \n\nBrisbane are gonna jack up shots. And they havent been very good at hitting them. With Harrison back and Holt a big body, the thin Perth centers will need all the help they can get with rebounding. \n\nBrisbane don't have anyone this athletic at the forward position and given how nice his shot has been recently, this line seems low. He has slowed down with the 3s but with no McDaniel bothering him, he should find his way to the rim quite easily. Once he has that threat, the 3 should open up and hes been knocking them down at a decent rate lately. Doolittle and Duke will find him. \n\n2U only because Brisbane sucks and a blowout is on the cards.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o54v3an/"
    },
    {
      "created_utc": 1770969860.0,
      "author": "donjavogosca",
      "text": "POTD Record: 54-38, +12.8u, (ROI +10.6%)\n\nPrevious Pick: Barcelona to win the game & over 169.5 points, 1.82, 1.5u ❌️ (last 5: ✅️❌️❌️✅️❌️)\n\nEvent: IBL Indonesia: Pelita Jaya - Hangtuah, 13:30h\n\nPOTD: Pelita Jaya -13.5, 1.86, 1.5u ✅️\n\nPelita remains unbeaten, 7-0. They had a really hard last 2 games, Rans Pik and Satria Muda, both as guests, both close wins.\n\nHangtuah started strong, but as the league progresses, it seems to be coming back to its place. They still have a decent 5-4 score, but they are definitely not a top 5 team in this league. A comfortable 20-point loss against Satria 57-77 showed this; they may hold on in the first half, but I don't see them keeping this under 14-15 points, if Pelita plays it strong until the end of course.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o54olpa/"
    },
    {
      "created_utc": 1770966638.0,
      "author": "donantuan",
      "text": "POTD 1-4\n\nLast POTD: Bar Biryukov +1.5 Sets v Nagal @1.70✅\n\nFirst win let's gooo. Bar eventually won 2-1 as i expected. Took him after the first set around @7.20\nSweet. Onto the next one.\n\nEvent: Tennis Baton Rouge Challenger 18:00 CET\n\nPick: Pieczkowski +1.5 Sets v Dostanic @2.20\n\nWrite-up: Not much to say here. I'm sticking to my words from my last post. Whoever can hold the ball for more than 10 shots against Dostanic is gotta win and i think Pieczkowski is him. He comfortably defeated Vandecasteele in 2 last match and i expect him to at least give Dostanic some trouble. The only thing a bit concerning about all this is the high odds that feels like a trap, but im assuming the bookies still hold Dostanic as a strong favorite cuz of his pretty good run after the US Open being 16-4, but all those wins came against average opposition so taking a set off of him is gonna be achievable for Pieczkowski. And at 2.20 there's plenty value so I'll take it. \n\nGood luck to all who tail",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o54iqrb/"
    },
    {
      "created_utc": 1770960508.0,
      "author": "One-Development8345",
      "text": "Record 0-0\nPick of the Day - Hailey Baptiste vs Zhang Under 21.5 Games Odds -115\n\nTrying to start something here. I want to track my own record. I also like Christopher O connel under 9.5 games won against Ugo Hunbert. \nTail at your own risk, good luck!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o546hm0/"
    },
    {
      "created_utc": 1770957731.0,
      "author": "Ashamed-Warthog6654",
      "text": "**Record: 15-3**\n\n**Last 5 POTD** : ✅️✅️✅️✅️❌\n\nLast Pick\\*\\*:\\*\\* ❌ Atletico Madrid (W) Vs Man Utd (W) corner 9 UNDER (1U to win 0.85U)\n\n**ROI:** **58.3**%\n\n**Pick:**  Kongsvinger Vs KFUM corner 8.5 **OVER** (1U to win 0.875U)\n\n**Write Up:**  A new chapter starts with soccer. It is a friendly match starts at 8:00AM and these 2 teams usually combined with 10.93 corners and sportsbook opens with 8.5 which I see they might be profitable around 39%.\n\nConfidence: 74%\n\nThis is only a demonstration too.....Unless stated everything is Asian total Corners from Bet365\n\n[https://www.potd.lol/handicapper/Ashamed-Warthog6654-sHDqbt](https://www.potd.lol/handicapper/Ashamed-Warthog6654-sHDqbt)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o5407p5/"
    },
    {
      "created_utc": 1770956580.0,
      "author": "RawFish00",
      "text": "Record: 92W-84L-4P\n\nROI: +15.11, 8.10%\n\nLast POTD: 2/5 Marchessault over 0.5 points ✅\n\nGame: Winter Olympics Hockey- Sweden vs Finland (5:00 AM CST)\n\nPick: Rasmus Dahlin over 0.5 pts -162 (BetRivers)\n\nOdds started out at -146, then kept tumbling. I'm taking it at -162 before it drops further.\n\nDahlin is a top defenseman for Sweden. He had the 2nd most TOI and 3 points last game against Italy. Dahlin is expected to be the lone blue-liner for the Swedish PP1.\n\nAs an NHLer, Dahlin ranks 13th (out of 187 defensemen w/ 500+ TOI) in xGF/60 and 17th in actual GF/60. He's 7th among D-man in points.\n\nFinland did not look good against Slovakia, despite being heavily favored. They ended up losing 4-1, so the Swedes should get their chances on offense.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53xhv0/"
    },
    {
      "created_utc": 1770956506.0,
      "author": "Lyx97",
      "text": "Record: 44-29-7\n\nNet Units: +9.81\n\n*Prev Pick : Gamba Osaka Asian Handicap 0 (DNB) @ 1.58 (1u) -> Push*\n\nTennis | WTA 125k Oeiras Open | D Vidmanova vs D Gàlfi | \\~9hrs\n\nCricket | Asia Cup Rising Stars Women | India A women vs UAE women | in \\~2.5hrs\n\nParlay: India A women ML + Gàlfi ML @ 1.75 (1u)\n\nWriteup - Galfi has already beaten Kalinina here and these Oeiras courts are not standard fast indoor courts, instead they play medium slow, which helps players with good rally tolerance. Galfi is playing quite well here, while Vidmanova is struggling and huffing her way to victories, with her poor return play and her serve not suiting these conditions.  \nI see this being a very routine 2 setter and wouldnt be surprised if Galfi covers a big spread like a -4.5 or better here. My only worry here would be WTA being WTA :)\n\nThe 2nd bet is a very low odds, backing the favourites bet, to boost our overall odds for the day. Unless India really tanks, their player quality should get them an easy win, even if it's their B team\n\nHope get the W & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53xbhj/"
    },
    {
      "created_utc": 1770955723.0,
      "author": "X_Underscore_X",
      "text": "**POTD Record:** 11W-0P-12L (+11.07u)\n\n**Previous Pick:** Gamba Osaka or Draw + BTTS:NO@2.69 (Betsmith) | **Stake: 1.5u ❌❌❌**\n\n**Recap:** Can't complain too much when Steelers score a goal like that\n\n**Today's Event:** J1 Special Tournament | Vissel Kobe vs Nagasaki | 11:00 GMT +2\n\n**Pick:** BTTS@1.90 (Coolbet) | **Stake: 3.5u** \n\n**Write Up**:\n\nVissel Kobe opened the season with a 1-1 draw away against Kyoto Sanga that finished 3rd in the league last season, before winning the game on penalties and securing two points. Kobe also played on Tuesday as they had little problem beating FC Seoul in the ACL 2-0 and should have done it with a bigger scoreline. \n\nNagasaki got somewhat humbled by Sanfrecce Hiroshima that beat them 3-1 at their own ground in their return to top division football, it was a pretty decent game and could quickly have seen more goals for both teams. \n\nIt looks like Skibbe has eased in pretty nicely as Kobe manager and hasn’t really changed much yet on the team, it does look like they will use this Special Tournament to figure out the team a bit before going big before the real season starts. However, it is still important to do well in this cup as a spot in the ACL for next season is on the line. Nagasaki of the newly promoted teams has done the most business in winter and does look like the best team to cope with this new level.\n\nI think Vissel Kobe should win this in regular play, but Nagasaki definitely has enough about them to make this “fun”. The odds on BTTS have fallen a bit, but as long as it is above 1.80 I think it holds value. \n\n",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53vfur/"
    },
    {
      "created_utc": 1770953862.0,
      "author": "jaysial",
      "text": "Cricket 🏏 Picks\n \nOverall: 68💰- 29 ❌\n\n+45.27\n\nLast 10: \n\n🥇🥇🥇🥇🥇🥇🥇💔🥇🥇\n\nTodays pick:\n\nNetherlands v USA\n\nNetherlands win @ 1.76\n\nStarts in about 10 Hours ⏳\n\nUnits: 3\n\nhttps://www.buymeacoffee.com/JaySial\n\nReasoning:\n\nFew injuries in USA squad\n\nThey are more familiar with conditions at Chennai.\n\nNetherlands is 3-0 in t20s against USA\n\nNetherlands performed really well against Pakistan and have the batting depth.\n\nWinning the toss and batting second will boost the chances of winning due to dew factor.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53qtdo/"
    },
    {
      "created_utc": 1770951217.0,
      "author": "dreamchasing1",
      "text": "Record: 268-253 Net Units: -28.22 66-68 on 1.5u plays, 45-44 on 2u plays, 2-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Belgian Cup] Antwerp vs Anderlecht\nLast pick: Asian total corners over 9.5 @ 1.85 won\n\n\nEvent: Soccer/Football, [Portugal Liga Revelacao u23] Portimonense u23 vs Leiria u23\n\n\nPick:  Asian total corners over 10.0 @ 1.95 - 2 Units. This is a push if exactly 10 corners, win if 11+.\n\n\nElite corner matchup here. Portimonense at home have covered in 9/11, push in 1, averaging a total of 13 per game, 6 for them. Leiria away covering in 9/10 games, averaging 12.70 total per game, 5 for them. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53jwrl/"
    },
    {
      "created_utc": 1770950468.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 32-43-5 (Avg Odds +125)\n\n**Last 5:** (most recent on left) ❌️✅️✅️✅️❌️\n\n**Previous Pick:** Dango Ouattara 1+ SOT (+115)❌️\n\n**Today's Event:** English FA Cup (Soccer) | Hull City vs Chelsea (11:45 AM PST)\n\n**Pick:** Chelsea TT O2.5 Goals (+100)  1 unit to win 1 unit\n\n**Write Up:** Well I will say Ouattara had a great game for Brentford, but opted to pass/cross the ball every time he got it in a dangerous area, including one time where he had a close chance at goal he could have scored. Disappointing but I still think it was a good read and I'd play it again. \n\nFA Cup action is back and we've got one Friday match where Championship side Hull City host EPL side Chelsea in this 2nd round matchup. In the previous round, Chelsea beat Charlton (another Championship side) 5-1 away. I actually backed Chelsea for a similar play in that match. While Hull City is significantly higher up on the Championship table than Charlton was, they actually have a worst defensive record and have conceded 5 more goals than Charlton this season. \n\nChelsea will likely follow their typical early cup round blueprint, they will send out almost their entire 2nd team and hope they can do the job. If at halftime they aren't up by a few goals, they'll bring in their big names and take control of the game. Last round they scored four 2nd half goals, as an example. With that said, don't be shocked if they don't score much in the first half, but having been knocked out of the Carabao Cup, they'll take this game seriously as coach Rosenior will want silverware in his first season.\n\nI love the value here for Chelsea to get 3 goals at even money. BOL and happy Friday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53hvvc/"
    },
    {
      "created_utc": 1770950068.0,
      "author": "DuckDuckGooseBANG",
      "text": "Record: 7-7 (-1.94u)\n\nLast: USA -3.5 PL - ✅\n\nPOTD: Olympic Hockey: Canada v Switzerland, Celebrini Anytime Goal Scorer (1u to win 1u)\n\nWrite Up: Time to start getting a streak going. Today we’re going with Canada v Switzerland. Macklin Celebrini is a young gun who’s going to show he has what it takes to keep up with the best. Last time I picked him to score a goal in the NHL season it didn’t go right for me. That game though, he didn’t have Conor Mcdavid on his line. He scored on Thursday and played very well. He’s on a line with Connor Mcdavid (the best player in the league right now) and Tom Wilson. Mcdavid seems to be choosing to be a play maker over a goal scorer which helps this pick even more. I’d also like to add this was this teams first time playing with each other. You could see from the start to the end the progression they had playing with each other.\n\nBOL if Tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53gt07/"
    },
    {
      "created_utc": 1770949224.0,
      "author": "IsawTeddyBallgame",
      "text": "***My POTD is college basketball Ivy League game. Wager 1.1 units to win 1 unit that the total score of game between Brown ( 1-7 in conference) and Harvard (6-2 in conference) will be 132 or more points***\n\n\\*\\*\\*.\\*\\*\\*Game time is 7:00 PM Eastern Standard Time. This wager can be found on Americas Card Room sports book. BOL to all.\n\n I'm going to watch the Wisconsin game with Mich. State, but I think the above game will be the safest bet.  These teams only scored 128 points between them in their first meeting.  But Harvard had an off day.  Brown has since been scoring in the high 60's, low 70's.   I think these two teams will cover easily with a few minutes left to play.\n\n\n\n2025-26 college basketball record 1 win 0 Losses\n\nUnits wagered 1.15 Units won 1 unit lost 0 units\n\n ***ROI to date: 86.9%  (This is a meaningless number, its based on just one game***\n\nMy present streak is 1 win\n\n***I always welcome contrary opinions in the replies here, please don't hesitate to reply with a contrary opinion (I'm sure all others reading this post will welcome them also.*** BOL to all.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53eiwr/"
    },
    {
      "created_utc": 1770946465.0,
      "author": "micahpugh",
      "text": "POTD Record: 100 - 52\n\nLast POTD: ADM u12.5 games - W\n\nPick: Tallon Griekspoor vs Felix Auger-Aliassime Fist Set score after 4 games 2-2(-190 odds via FD) 1U\n\nEvent: ATP Rotterdam Quarterfinals 12:30 P.M. CST\n\nDon’t have a ton of facts or numbers to back this one up, more of a gut feeling play. FAA is in top form coming off a tournament win in Montpelier, where he loves playing indoor, anywhere. On the other side, Griekspoor loves playing at home and all we are asking for is 2 service holds from each to start this one. I don’t expect this one to be one sided but a pretty competitive match.\n\n[PayPal](https://www.paypal.me/micahpugh?locale.x=en_US)\n\n[Venmo](https://venmo.com/u/Micah-Pugh)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o5371bc/"
    },
    {
      "created_utc": 1770946117.0,
      "author": "222benz",
      "text": "Record: 10-14-1\n\nNet Units: -11.08u\n\nROI: -11.60%\n\nLast Pick: Arsenal ML ❌\n\nSport: eSports | Dota 2\n\nEvent: BLAST Slam VI Playoffs | Falcons vs. Liquid & Yandex vs. Heroic\n\nTime: 9:00 AM EST \n\nPOTD: Parlay: Falcons ML + Yandex vs Heroic Over 3.5 Maps @ 1.88 odds (5u)\n\nWrite Up:\n\nTeam Falcons are simply the better team. In a Best-of-5, you can't cheese your way to victory, you need a deep hero pool, strategy and superior macro. Falcons have all of 'em. Liquid might steal a game or two, but Falcons will win the series.\n\nOn the other hand, Yandex is playing with Malik instead of Noticed. While Malik is good, playing with a stand-in usually causes some communication breakdowns. That makes a clean 3-0 sweep for Yandex very unlikely. Heroic just beat Tundra by playing pure chaos Dota. They are scrappy enough to take at least one map off anyone. We don't need to pick a winner here. We just need both teams to win at least one map. Given Yandex's firepower and Heroic's momentum, a 3-1 or 3-2 scoreline is almost guaranteed.\n\nFalcons win, and the other series turns into a brawl. We cash.\n\nBOL.\n\nhttps://buymeacoffee.com/222benz",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o5363n2/"
    },
    {
      "created_utc": 1770945400.0,
      "author": "ken-kilos",
      "text": "Lifetime Record: 12W-9L\n\n2026 Record:\n\nhttps://preview.redd.it/1mncrnbbx5jg1.png?width=379&format=png&auto=webp&s=a6e8f834df8feba3467cb347a79c7e8cb81fd8ef\n\n[](https://preview.redd.it/pick-of-the-day-2-12-26-thursday-v0-al1xd95sfyig1.png?width=373&format=png&auto=webp&s=5b3ad4e06d78652035a53f1c66f48a836226fe95)\n\nStreak: ✅✅✅✅✅❌❌❌ <--- Latest\n\nFootball | Bundesliga | 19:30 (GMT)\n\nGame: Borussia Dortmund vs Mainz\n\nPick: Borussia Dortmund Win + Over 1 corner in the 2nd Half for Borussia Dortmund - 1.95 (Bet365)\n\n*Recap: Arsenal just had to bottle the lead. Oh well. On to the next.*\n\nWrite Up:\n\nI'm headed for the league with clearly defined hierarchies and a status quo that doesn't deviate often.\n\nDortmund are phenomenal at home having not lost a single game there (8W-2D-0L). They drew against Stuttgart and Leipzig, two very strong opponents. However, their opponent today is far from strong.\n\nMainz have managed just 2 away wins in the Bundesliga and honestly, I don't see them even managing a draw in this game. I expect a barrage of attacks from Dortmund that'll hopefully lead to goals and a good number of corners in each half.\n\nGood luck if you tail! 🍀",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o53457u/"
    },
    {
      "created_utc": 1770945154.0,
      "author": "lordestros",
      "text": "Last 5 POTD : ✅️✅️✅️❌️❌️\n\n**Previous pick**: Dougie Hamilton over 3.5 shots (+135) ❌️ (3 shots)\n\n**POTD Record**: 23-21\n\n**Today's Pick:** Switzerland vs Canada 3:10 pm EST (Olympics/Hockey)\n\nUnder 6.5 goals (-135)\n\nAlthough Canada has the better team, Switzerland (#3 in IIHF world rankings) has always been a threat on the international level. With now notable NHL players like Roman Josi, Timo Meier, Nico Hichsier, Nino Niederreiter and J.J Moser on the team, I expect Switzerland to put up a good fight and keep it under 6 goals especially after a great 4-0 performance against France yesterday. I know France isn't Canada but Canada has always struggled against Switzerland in the Olympics so I expect them to not take their opponents lightly and not go for a super aggressive game.\n\nIn net for Switzerland will either be Leonardo Genoni who is a Swiss legend and has brought Switzerland to a 2nd place in 2024 and 2025 at the IIHF World Championships while dominating the Swiss league over the years or it will be Akira Schmid who although hasn't had the best stats this year in the NHL has played very well with the Swiss team in 2024 with a 3-0 record .946 percentage and 0.86 goals allowed on average.\n\nAlso only one of the men's hockey game in this year's Olympics went over the 6 goals line!\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o533gs0/"
    },
    {
      "created_utc": 1770944252.0,
      "author": "Traditional_Pay_7871",
      "text": "Record 4-3\n\nLast pick:  Roma -1 Asian handicap @1.85 ✅\n\nEvent: Pisa vs Milan\n\nTime: 2:45 Pm EST\n\nPick: Milan -1 asian handicap @ +100\n\n\nMilan is back after a long break, unfortunately they have a lot of injuries in attack, Leao will miss the game most likely, the only other alternative is Loftus-cheek as per the last game, that's why the odds are so juicy, but Pisa is a very weak team defensively, Inter scored 6 against them just a few weeks ago, I expect Milan midfield to step up, with Rabiot and Modric shooting and serving balls all over, Allegri struggles against defensive teams so we might see goals until the second half (I will probably sprinkle something at halftime)  Pisa has no arguments to get a draw like they did in the previous match between these 2 teams, they are one of the teams that will get relegated, Milan will at least win by 1, if we get a push I'll take it but the odds are too good to let it pass.\n\nIn boca al lupo",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o530yz3/"
    },
    {
      "created_utc": 1770943965.0,
      "author": "Synaptic_Snowfall",
      "text": "**POTD Record: 2-1**  [Net Units:  **+2.23**]\n\n**Previous Pick: J. Pegula vs. M. Kostyuk M. Andreeva/M. Kostyuk Total Games OVER 21.5**❌️\n\n***Today's*** **Event: ATP 500 Rotterdam | B. van de Zandschulp v. A. de Minaur | 8:10 AM EST**\n\n***Today's*** **Pick: B. van de Zandschulp + 4.5 Games @ 2.00 / +100 (Hard Rock) | 3 Units**\n___\n\nADM is, understandably, the heavy favorite here but I do think he's overvalued.  Van de Zandschulp has been playing some of his best tennis lately.  In the AUS Open, despite losing in straight sets, he frustrated the hell out of Djokovic — who was playing out of his mind.  He has a remarkably high court IQ, which shows in his ability to manipulate his opponent's position on the court and create tough angles.  ADM owns the H2H here 3-0, but their last meeting a year ago ended 6-4, 6-4, which would net us a win here.  Van de Zandschulp just surprised bettors in his massive upset of Tsitsipas, and I expect him to maintain that momentum going into these quarterfinals.  He should be able to overpower and outplay ADM in a sufficient number of points in order to keep this one close and get us back into the win column.  BOL.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o5305pf/"
    },
    {
      "created_utc": 1770943431.0,
      "author": "kab1218",
      "text": "Record: 27-34-1\n\nLast 5 recent on the right: ❌❌❌✅✅\n\nNet: -33.3\n\nPrevious: Switzerland | Swiss Super League | 230pm Eastern | FC Thun vs Lausanne-sport | BTTS O2.5 goals 3U @ -105\n\nThun dominated this game but let Lausanne get one in. Moving on.\n\nToday: France | Ligue 1 | 305pm Eastern | Monaco vs Nantes | Monaco to win & O 1.5 goals | 3U @ -136\n\nMonaco have historically had the edge in this matchup and are typically much stronger at home. They create more chances, score more consistently, and usually control games against mid-to-lower table sides like Nantes. From a win probability standpoint, Monaco are generally in that 55–60% range here.\n\nAs for the goals, this fixture regularly produces at least two. Over 1.5 goals hits at a high rate in their head-to-head history, and Monaco alone are often capable of covering that line. With Nantes tending to concede on the road, a 2-0 or 2-1 type result feels statistically aligned with the trends.\n\nOverall, you’re backing the better team in a matchup that usually sees multiple goals — a logical and data-supported angle.\n\n\n\nBOL if tailing ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52ymqw/"
    },
    {
      "created_utc": 1770943056.0,
      "author": "wes2211",
      "text": ">**Record:** 131-121\n>**Net Units:** +16.66 units\n\n>**Curling** | **Olympics - Women's** | **8:05AM EST**\n\n>**Pick:** Sweden -2.5 @ 1.83\n\n>Sweden picked up two wins on Thursday, 8-4 over Japan and 9-4 over USA. They really seem to have the ice figured out early here. Their opponent, Denmark, were dominated by Canada in their opener and managed to squeak out an extra end win over Japan, despite being outplayed. Sweden looked very strong day one but Denmark looked like the weakest team in the field. Sweden should have little issue covering -2.5 against Denmark after doing so against two stronger teams yesterday.\n\nEDIT: FD put up Sweden -1.5 @ 1.94 so go play that instead.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52xjhn/"
    },
    {
      "created_utc": 1770941836.0,
      "author": "FookinFootball",
      "text": "**Record:** 1-0-0\n\n**Net Units:** +1.05U\n\n**L10** 💰\n\n**Last Pick:** Thun ML +105\n\n**Soccer | Netherlands Eredivisie  | 2:00pm / EST**\n\n**Pick: PSV -1.5 -167**\n\n**Write Up:** PSV currently sit a top of the table.  In 22 matches they have scored 66 goals and only given up 26.  Thats an average of 3 goals per match while giving up just over 1 per match.  They are in great form in their last 5 averaging 2.8 goals per game while giving up 1. Dating back to 1994  they have never lost to FC Volendem and have only tied twice.  In that time they have met 20 times and only 4 times PSV hasnt covered -1.5 goals.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52u0sg/"
    },
    {
      "created_utc": 1770941370.0,
      "author": "I_am_Aspect",
      "text": "* **Current Record:** 4W - 3L\n* **Form:** ❌✅✅✅❌❌✅\n* **Last Bet:** Nigma Galaxy ML (Winner ✅)\n* **Sport:** eSports | Dota 2\n* **Event:** BLAST Slam VI\n* **Match 1:** Team Liquid vs. Team Falcons — **Over 3.5 Maps**\n* **Match 2:** Team Yandex vs. Heroic — **Over 3.5 Maps**\n   * **Combined Odds:** 1.90\n* POTD: Liquid vs Falcons OVER 3.5 maps + Yandex vs Heroic OVER 3.5 maps @ 1.90\n* **Unit Stake:** 5 Units\n\n# \n\nWrite-up: Back with Dota 2 Blast slam VI playoffs, very excited because this is a **Best of 5 (Bo5)** match and value parlay. For the \"Over 3.5\" to hit, we simply need the underdog in each match to win at least **one map**.\n\nSince it's Bo5, I don't like to bet on maps over/under without seeing the draft live. However both of these matches are closer than the odds suggest. Team liquid won against Falcons in their group stage match a couple of days ago. Heroic as well; they took a map off of Yandex in a 28-minute stomp game. Both of the underdogs won their matches in the group stage. Falcons have also been very shaky and inconsistent after their TI win; I can totally see Liquid putting up a good fight. at the same time Heroic has been the biggest trap team in Dota; they always somehow turn up in Bo3-Bo5 playoffs and play great. We just need both matches to not finish 3-0. BOL!\n\nMy other bets for today\n\nhttps://www.reddit.com/r/sportsbook/s/c6HAdIgIFL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52so8r/"
    },
    {
      "created_utc": 1770940989.0,
      "author": "defiant_degen",
      "text": "\nOverall record 75W-49L\n\nDecided to come back with a pick, been a very busy few months and with work and not had the time to commit to this like I did before, will come and go with picks but not as frequently as before.\n\nUnits +47.9\n\n\nLast pick: unknown?\n\nSome time ago I can't recall....\n\n\n\nToday's pick:\nLeague of Ireland Premier Division.\n\nDerry City vs Dundalk\n\nDerry City win and over 1.5 goals\n\n(1.95) 3 units\n\nThe Candystripes host their 2nd game of the season, after a strong performance that even got the better of Sligo Rovers.\n\nDerry City have a ridiculous financial advantage over the rest of the teams in the league of Ireland who outside Shamrock Rovers general struggle to generate any revenue.\n\nDerry is owned by a self made Billionaire, who has bailed them a few years back and invested not a crazy amount but they did have a solid transfer window bringing in local legend James McClean and the impressive James Clark in midfield from Bohemians.\n\nThey finished last season very strong, if it wasn't for a poor start to the season they would have challenged Shamrock Rovers for the title, with the squad they have assembled they could very win the league this season.\n\nDundalk managed to get promoted back to the top division, but they have had financial issues the past few years which is why they got relegated last season, they have not managed to sign anyone that  stands out on paper, and they would do well to not finish bottom imo.\n\nThe weather in Dundalk has been absolutely brutal the last couple of weeks, they had their first match with Shamrock Rovers postponed due to a waterlogged pitch\n\nDerry have 2 competitive match under their belt, looking strong from the small sample so far. Dundalk haven't played since their friendly loss to Shelburne 23 days ago, they will lack that sharpness and the very heavy rainfall has left training facilities in poor condition also.\n\nBetween the clear gulf in class, Dundalk's obvious lack of preparation and match fitness and the ridiculous financial gap between these sides, I see this being a one sided match. I would be very surprised if Derry didn't manage at least 2 goals and they should manage a comfortable win at home to make it 2 wins from 2 in the league to add to the win against rovers before that in the Super Cup.\n\nCoffee's appreciated if you have found my write ups and bets useful ☕\n\nhttps://buymeacoffee.com/willo77\n\n**BOL and only bet what you can afford to lose!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52rki3/"
    },
    {
      "created_utc": 1770940077.0,
      "author": "Easy_Independence811",
      "text": "**POTD Record**: 8-1-36 (HIGH ODDS PLAYER HERE)\n\nFrom oldest to newest: ✅❌✅❌❌❌❌❌✅❌❌❌❌❌❌❌❌❌✅❌❌❌❌❌❌✅❌❌❌❌❌✅❌❌❌❌❌🅿️❌✅❌✅❌❌❌\n\n\\+7,5 units (translated all dollars to units).\n\nLast pick : **Celtic -1,5 handicap first half** vs Livingston at **2,81** odds ❌\n\n**CET 20:00 Football Eredivisie**\n\nToday: Volendam vs PSV. **First half result 0-3** at **12** odds\n\nExplanation: Not alot to explain, other than PSV being on a completely different level compared to their opponents and leading big on H2H record. I do believe that they will end this game in the first half by going all out, and not do the same mistake as last time. They were losing 1-0 vs Gronningen in their last game and then managed to win it in the second half. The scenario here is that they will be focused to the max and dominate in possession, chances created and xG. They will have at least 2-0 here in the first half. But I do suspect a 3-0 score more. Let´s get this one in!\n\nOn the side note: My tactics won’t change by lowering the odds. The goal is to find high odds to play here. I’m trying to keep track of the results in all of the top leagues. We will **always aim for** **long term** gains here and make sure to manage your bankroll. I will try to post another pick in the coming days. Seems like a good week is coming, with lots of league football to pick from. Good luck everyone.\n\nBookie: **Coolbet** and a **5** unit bet. Gamble **responsibly**!\n\nAppreciate all the support:\n\n[https://buymeacoffee.com/longterm123](https://buymeacoffee.com/longterm123)\n\n[paypal.me/LongTerm123](http://paypal.me/LongTerm123)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52owq8/"
    },
    {
      "created_utc": 1770937903.0,
      "author": "damagebabee",
      "text": "**POTD** Record 135-04-108\n\n\n\nGKS KATOWICE VS LEGIA\n\nDate: 13 FEBRUARY 2026 at 20:30\n\nBET ON: Match odds- LEGIA\n\nOdd: 2.23\n\n\n\n\\- Backing Legia Warsaw to win against GKS Katowice is strongly supported when combining injuries, motivation, and tactical signals from recent Polish media coverage. Coach Marek Papszun has made it clear in press conferences that excuses are over — despite absences like Rafał Augustyniak, Jean-Pierre Nsame and Rúben Vinagre, he has emphasized visible structural progress, improved defensive organization, and intensive work on set pieces and compactness within the 3-4-2-1 system. Legia’s recent performance in Gdynia showed better spacing between lines and greater midfield control, suggesting the breakthrough is close. Crucially, the motivational edge lies with the Warsaw side: the pressure to collect points has created a “reaction game” mentality, with players publicly speaking about responsibility and restoring standards. Meanwhile, GKS Katowice are also weakened (Jirka, Paluszek, Rejczyk absent), limiting their pace in transition and defensive stability, and their recent messaging has been more cautious than assertive. With Legia tactically tightening up, drilling defensive discipline, holding historical superiority in head-to-head meetings, and entering this fixture with heightened urgency, the value clearly leans toward a Legia victory.\n\n",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52ihxs/"
    },
    {
      "created_utc": 1770937804.0,
      "author": "yeahicreatedsomethin",
      "text": "Record: 51-26-1\n\nSoccer\n\nLast Pick: Thun ML & Midtjylland to score @ 2.4 ✅\n\nLast Pick Write Up: A nice plus money win to make up for that annoying loss the other day. You know I do everything for you. I love you, even the guys who started crying in my DMs when a pick lost.\n\nNow for today..\n\nPick: NK Slaven Belupo-NK Lokomotiva BTTS & Dortmund/draw @ 2.05\n\nWrite Up: \n\n1. In their last 10 H2H since late 2023, BTTS has hit 8/10 times. Slaven has hit BTTS in L5/7 overall and Lokomotiva has hit BTTS in their last 4/5. These two played a month ago and the score went 4-2 for a Lokomotiva win - both scored two goals in the first half!\n\n2. 2nd place Dortmund has not lost at home all season - I don’t expect them to lose to 14th place Mainz.\n\nBOL!\n\nShow your boy some love: https://buymeacoffee.com/yeahicreatedsomethin\n\n￼​",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52i777/"
    },
    {
      "created_utc": 1770937222.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Friday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1r38ddd/pick_of_the_day_21326_friday/o52gffm/"
    }
  ]
}