{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/14/25 (Sunday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/",
  "target_date": "2025-12-14",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-14T20:16:13.614152+00:00",
  "comments": [
    {
      "created_utc": 1765740909.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 4-6-0 *3 wins in a row? We actually have a lil winning streak going and I don’t intend on snapping it tonight*\n\n**Event:** LaLiga Deportivo Alaves v Real Madrid, starts 25 minutes from now\n\n**POTD:** Real Madrid ML -164, 3.5 units\n\n**Write Up:** We’re looking at yet another heavily inflated line due to Real Madrid’s poor recent form. Yes, they’ve been all over the place recently, and we even successfully faded them recently, but this game’s a do or die one, and I’m positive they’ll come out swinging. Deportivo Alaves is a team they should realistically be killing off pretty easily based on the difference in quality, position on the league table, perceived match importance, and their H2H. A line of -164 shouldn’t be a thing in this kind of matchup, but here we are. BOL if you’ve caught this early enough and decided to tail ☘️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu12rac/"
    },
    {
      "created_utc": 1765738759.0,
      "author": "EzPickzz",
      "text": "Record: 16-8\n\nUnit record: +21u\n\nLast pick: eagles -2 ❌\n\nPOTD 💎: Panthers ML\n\nFanduel: -146 (+2u)\n\nTime: 3:25pm @Saints",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu0vcit/"
    },
    {
      "created_utc": 1765737827.0,
      "author": "Ecstatic-Dog-9873",
      "text": "Bayern vs Mainz, DRAW @ 5",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu0rzt2/"
    },
    {
      "created_utc": 1765736623.0,
      "author": "slickniick26",
      "text": "Record: 7-1 (+5.9U)\n\nLast Pick: San Jose State +8.5 ✅ 1.1 Units for 1 Unit\n\nEvent: North Texas at South Alabama (NCAAB) (2:30pm Pacific)\n\nPOTD: South Alabama -1.5 (-110) 1.1 Units for 1 Unit\n\nWrite Up:\n\nGood fight from San Jose State on Saturday as they had a chance to win outright, but lose 86-82 against Stanford. \n\nGoing into Sunday, lots of interesting games featuring some quality mid-majors including our matchup in Mobile, Alabama between North Texas and South Alabama.\n\nNorth Texas is 6-3 against D1 competition with tons of close calls against Loyola Chicago, Oregon State, Eastern Washington and Prairie View A&M. Daniyal Robinson as Mean Green head coach have been no strangers to these tight games in clutch time, but I believe this team is due for some negative regression.\n\nSouth Alabama is 7-2 against D1 squads and is quietly emerging as one of the more intriguing mid-major teams in the sport. They have secured notable wins at Jacksonville State, at Toledo and against New Mexico State. The Jaguars only two losses have come on the road at East Tennessee State and UAB, places that are difficult to win at.\n\nGiven the resumes of these teams and current form I’d favor South Alabama on a neutral, so the fact that we’re getting a near PK on the Jaguars home floor I believe presents value. Jaguars win by two possessions or more in this one.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu0np9i/"
    },
    {
      "created_utc": 1765734854.0,
      "author": "Easy_Independence811",
      "text": "**POTD Record**: 6-27 (HIGH ODDS PLAYER HERE)\n\nFrom oldest to newest: ✅❌✅❌❌❌❌❌✅❌❌❌❌❌❌❌❌❌✅❌❌❌❌❌❌✅❌❌❌❌❌✅❌\n\n\\+13,25 units (translated all dollars to units).\n\nLast pick :  A **-2,5 handicap in the first half** for PSV vs Heracles at **5** odds ❌\n\n**CET 21:00 Football La Liga**\n\nToday: **Alaves** to win vs Real Madrid at **6,4** odds\n\nReason: Real Madrid is out of form with injuries. Something is really going wrong here. Xabi might get fired really soon and the players might make it go faster by losing this one. The players are either doing it on purpose or actually having a hard time applying his tactics with their egos. This team is incredibly hard to coach and Xabi is unlucky to experience it. I really expected him to go far after his legendary coaching in Leverkusen and hoped for more success. Real Madrid was a step too soon for him, and he should have gone to another top club instead. Alaves on the other hand has a perfect opportunity to pull of this win at home and the scoreline might be low, such as 1-0, 2-1 etc. They sit on 13-15 in goals scored vs goals conceded at the moment, so they keep it tight most of the time. I'm basically taking advantage of the current situation and expecting either a powerful performance by Real where they completely wake up or the opposite, which is more likely for me. Good luck everyone.\n\nBookie: **Unibet** and a **5** unit bet. Gamble responsibly!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu0hl5i/"
    },
    {
      "created_utc": 1765734374.0,
      "author": "OkGuarantee1024",
      "text": "POTD Record: 1-0 (+2.15u)\n\nPrevious Pick: ✅ Union Berlin ML + 2.15\n\nEvent: Saints vs Panthers \n\nPOTD: Saints ML +125\n\nThis is a more popular pick than ill typically go for but the saints just beat the panthers at home as 5.5 point dogs. Holding them to 7 points. Previous home favorites where the line was between -4.5 to -6.5 and are now away favorites of under a field goal are 3-7 all time and 0-5 SU in their last 5 games. WHO DAT",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu0fysh/"
    },
    {
      "created_utc": 1765731356.0,
      "author": "Donloppa",
      "text": "Record: 5-2\n\nNet Units: +4.08 units\n\nPick: Monmouth vs Fairfield Bet 365 -120\n          UNDER 145.5\n          2 units to win 1.81 units\n\nPotd won yesterday and went 6-3 in the comments. Let me know if youd like to see my other picks as well.\n          \nWrite Up: Feel free to fade, model is showing me this is the play for today.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu06357/"
    },
    {
      "created_utc": 1765731091.0,
      "author": "No-Cryptographer2490",
      "text": "Record: 9-5\n\nL5: ❌✅✅✅❌\n\nNet Units: +7.12u \n\nAll bets are 1U unless otherwise stated\n\nLast pick: Paolo Points Over 19.5 ❌\n\nSport: Football  League: NFL Event Time: 1pm ET\n\nPick: Derrick Henry rushing attempts over 17.5 (1.8x , bet MGM) 3U\n\nLast bet: Paolo had 16 going into the 4th, and only scored one basket finished with 18 bad beat. Bane went crazy scoring 15 points and taking 8 shots in the quarter. Was between Paolo and the under and of course the game finishes 10 points under … but we move. \n\nWrite Up: I’m going to the national football league. Choosing my Ravens here Derrick Henry rushing attempts over. The Ravens lost to the bengals two weeks ago and Henry only had 10 rushing attempts as the Ravens abandoned the run after falling behind. The bengals have the leagues worst rushing defence I think Todd Monken returns to the run and the Ravens win and pound the rock. I will be personally running this up to 20.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu0583w/"
    },
    {
      "created_utc": 1765730160.0,
      "author": "Rdeiro",
      "text": "78.5 -125???? Would you take",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu0248u/"
    },
    {
      "created_utc": 1765729965.0,
      "author": "ThotDropper",
      "text": "Record: 0-0 || Long time in this sub thought i’d throw a couple picks and see how I do.\n\nEvent: Bills @ Patriots (NFL) 1pm est\n\nPick: Bills ML (-130) Risk 1.3u to win 1u\n\nWrite Up: Taking the Bills on the ML. Patriots have been great but they’ve had one of the easiest schedules. I don’t see the Pats beating the Bills 2x in one season and Josh Allen is playing amazing. Give me the Bills to win this and keep their division chances alive.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu01gso/"
    },
    {
      "created_utc": 1765729704.0,
      "author": "EthicalGambler",
      "text": "**My Record:** 71-62-3 (+1.85u)\n\n**Today’s Pick:** Luka Doncic o0.5 Blocks (Lakes vs Suns) \n\n**Odds:** +132 \n\n**Units:** 1.0\n\nTip off is 5:10 PST. Picking up on another system I have running this season where Luka gets over 1 block. Since returning from injury in February Luka has not gone more than 3 games in a row without a block. Currently he is 1 game without getting a block. \n\nShould this not hit I will continue the system until it does. \n\n**Previous Pick**: De’Aaron Fox o1.5 steals (Spurs vs Thunder) ✅\n\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/EthicalGambler-U6cnjV?utm_source=mdembed&utm_campaign=EthicalGambler) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nu00l6v/"
    },
    {
      "created_utc": 1765727099.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 21-13, +6.28u, (ROI +14.8%)\n\n**Previous Pick:** San Miguel over 108.5 points, 1.96, 1u ✅️, (last 5: ✅️❌️✅️✅️✅️)\n\n**Event:** ABA league: Crvena Zvezda - Spartak, 19:00h\n\n**POTD:** Crvena Zvezda -6.5 spread & over 152.5 points, 1.82, 1u ✅️\n\nI wanted to play originally the over on player (McIntyre), but for some reason, the offer is still not out.\n\nI don't quite like the standard spread and points, so I went with a bundle on this one. Spartak is a rather good team, but they showed some weaknesses in a 3 games loss stretch. If Cedevita was expected, Bosna and Ilirija could have gone better.\n\nZvezda is coming out of a hard loss against Partizan in Euroleague and is looking to bounce back. They have to show stability and win here. They don't want losses to pile up.\n\nEspecially if the next game on the schedule is an away game against Hapoel as guests in 2 days, where the loss is very likely.\n\nThe other reason for a must win situation is the actual table in ABA. They have 5-3 win/loss, the same as Spartak.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntzryej/"
    },
    {
      "created_utc": 1765726518.0,
      "author": "candede93",
      "text": "LENS ML, MARSIELLE ML, INTER ML, BRENTFORD ML, ALAVES AND DRAW",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntzq3gb/"
    },
    {
      "created_utc": 1765726379.0,
      "author": "Timely-Conclusion532",
      "text": "Record: 295-182\n\nForm: ❌❌✅✅✅✅✅✅✅✅✅✅✅✅✅✅❌❌✅✅❌❌✅❌❌❌✅✅❌✅✅✅✅✅❌❌❌❌❌✅✅❌✅✅✅❌✅✅✅✅❌✅✅❌ ❌❌❌❌✅✅✅✅✅✅✅❌✅❌❌✅❌✅✅✅✅❌❌✅✅✅✅✅✅❌✅✅✅✅❌✅❌✅❌✅✅❌✅✅❌❌❌✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅✅✅❌✅✅❌✅✅❌✅✅❌❌✅❌✅✅❌❌❌❌❌✅✅✅✅✅❌✅✅✅❌✅❌✅❌❌✅❌✅❌✅❌✅✅✅✅✅✅❌✅❌✅❌✅✅✅❌❌✅❌✅❌❌❌✅✅✅✅❌❌✅❌❌✅✅✅❌✅❌✅✅✅✅✅✅✅✅✅✅❌✅✅✅✅✅✅✅✅❌❌✅✅✅✅❌❌❌✅❌✅✅✅❌✅✅❌✅❌❌❌❌✅❌✅✅✅✅✅❌✅✅❌✅✅✅✅✅✅✅✅❌✅❌✅❌✅❌❌❌❌✅✅✅✅❌✅✅❌✅✅❌✅✅✅✅❌❌✅✅✅❌✅❌✅✅❌❌✅❌✅❌❌✅❌❌❌✅✅❌✅✅❌✅❌✅❌❌✅❌❌❌✅✅✅✅❌✅✅❌✅✅✅✅✅❌❌✅✅✅❌❌❌❌❌❌✅❌✅✅✅✅✅✅✅✅❌✅❌❌❌✅❌✅✅❌✅❌❌✅❌✅✅✅❌✅✅❌✅❌✅ ✅❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅❌✅✅❌✅✅✅✅✅✅✅✅✅✅✅✅❌✅❌✅✅✅❌✅❌❌❌✅✅❌❌✅✅✅❌❌✅❌✅❌✅❌❌✅❌❌❌❌✅✅✅✅✅✅❌✅✅❌❌❌❌✅✅❌❌❌❌✅✅✅✅❌✅✅❌❌✅✅✅❌✅✅\n\nNet Units: +3.32 units (All plays 1 unit)\n\nYesterday’s Pick: (NCAAF) Washington Huskies -6.5 alternate spread vs Boise State Broncos (-172) ✅\n\n**POTD: (NFL) Baltimore Ravens vs Cincinnati Bengals over 47.5 alternate points (-188) (1:00 PM EST)**\n\nReasoning: Playing the over in the matchup between the Baltimore Ravens and Cincinnati Bengals today. We have strong H2H trends, as the over is 7-3 in the last 10 meetings between these two teams. Line movement has also moved in favor of the over, opening at 49.5 and now currently sits at 51.5. The money and bet percentages also are aligning in our favor and to the line movement, which is what we want to see. The over is getting 60% of the bets and 71% of the money. Without going into the math and to further the reasoning, my rough projection using a formula that consists of plays per game and offensive and defensive points per play for both teams, projects the total to be 53 which exceeds the 51.5 total line where it currently stands. The reason I’m taking over 47.5 is to avoid key numbers, 48, 51 and 52, which are common in the NFL. **If you prefer better odds, take over 49.5 or 50.5** So with a strong H2H trends, line movement, betting splits, and my projection for this game all favoring the over, let’s play the over 47.5 total points in this game. Game starts in a hour in a half.\n\n👇\n\nhttps://preview.redd.it/15z3wxj2v67g1.jpeg?width=1170&format=pjpg&auto=webp&s=83bdfb4a3f0fbc8ce2e060ca887179836c6ae978",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntzpnq9/"
    },
    {
      "created_utc": 1765726025.0,
      "author": "LouieV335",
      "text": "LouieV debut - welcome to the party!!! Record: 0-0 \n\n  \nToday's pick: Noah Fant ATTD +900\n\nBurrow loves the big boys in the RedZone. I think Fant is going to be a random, right guy at the right time in the back of the end zone with everyone's eyes on Chase due to Higgins being out.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntzok36/"
    },
    {
      "created_utc": 1765725685.0,
      "author": "CMDVN",
      "text": "Today's pick: Brentford @ 2.00 (Unibet) - 200EU\n\nLast pick: Chelsea @ 3.60 (Unibet) - L\n\nProfit: +€822.50\n\nOkay, enough degen bets. Back to my serious bets.\n\nBrentford is shite, on the road. But oh boy, are they some team at their own stadium. This season they are the 5th best home team in the PL with a 5-1-1 15:8 record. Now look at their opponents, a team which is fucking shite on the road. Leeds are 1 place from last this season with a 1-0-6 away record.\n\nSo if 2+2 = 4 then today Brentford will prevail. Up the Bees!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntznhw5/"
    },
    {
      "created_utc": 1765725333.0,
      "author": "coltysports",
      "text": "__POTD Record:__ 3 - 0 __+2.5u__\n\n__Previous Pick:__ Nebraska +10.5 ✅️\n\n__Event:__ E Illinois @ Iowa State 1pm EST\n\n__POTD:__ E Illinois/Iowa St Over 143.5                        \n\n__Reasoning:__ I believe Iowa State can easily score 100, which leaves E Illinois little damage to do to hit the over. UK and Purdue beat E Illinois by a combined 94 points, with overs both above 150.\n\n__Bets:__ 1u\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntzmfhh/"
    },
    {
      "created_utc": 1765722087.0,
      "author": "wekillsports",
      "text": "POTD record (1-0)\n\nPrevious play - Brunson ov36.5PRA -160 bovada Write\n\nEvent - Ravens @ Bengals 1pm\n\nPlay - Ravens ml -165 bovada\n\nWrite up - big body Brunson got it done I got ravens to beat the bengals in a desperate spot to stay in the playoff race.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntzd4jp/"
    },
    {
      "created_utc": 1765721537.0,
      "author": "devilsadvocado",
      "text": "**POTD Record:** 0-0\n\n**Sport:** NFL  \n**Game:** Baltimore Ravens @ Cincinnati Bengals  \n**Date/Time:** Sunday, Week 15, 1:00 PM ET  \n**Pick:** Isaiah Likely OVER 37.5 Receiving Yards  \n**Odds:** \\-120 (1.83)  \n**Units:** 2 units\n\nCIN is having a historically tough time against TEs this season and it hasn't been getting any better for them in recent weeks:\n\n* **Bills (Week 14):** 11 catches, 137 yards, 2 TDs\n* **Ravens (Week 13):** 10 catches, 159 yards\n* **Patriots (Week 12):** 10 catches, 154 yards\n* **Bears (Week 9):** 7 catches, 128 yards, 2 TDs\n\nThis is not a one-off...it’s a structural problem with Cincinnati’s linebacker and safety coverage.\n\nLines are still pricing Likely as a TE2 behind Mark Andrews, and if you look only at snap share then, yeah, TE2 is accurate...but his role and matchup suggest he's elevating to more of a co-TE1. Over the last six games, Likely:\n\n* has the same number of targets as Mark Andrews (24)\n* has fewer snaps, but more yards per game\n* is averaging \\~37 yards per game in that span\n\nBaltimore has been increasingly attacking the middle of the field, and Likely’s route tree (seams, sit routes, crossers) aligns perfectly with Cincinnati’s biggest defensive weakness.\n\nAlso...the freezing weather of today's game favors short to intermediate throws.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntzbn44/"
    },
    {
      "created_utc": 1765721500.0,
      "author": "Mental_Group_6314",
      "text": "Record: 3-2 \n\nNet Units: +0.82 \n\nROI: 16% \n\nFootball | NFL | 1:00 p.m. / ET \n\nPick: Houston Texans -9.5 (-110) - 1 Unit \n\nWrite Up: The Houston Texans -9.5 stands out as the pick from today’s slate, with the Texans (8-5) riding a hot streak after starting 0-3 and boasting the NFL’s No. 1 scoring defense (16 PPG allowed) that’s primed to overwhelm the struggling Arizona Cardinals (3-10), who are on a five-game skid with offensive woes (averaging around 21.7 PPG overall, dipping lower in defeats) and a banged-up lineup including key absences like Marvin Harrison Jr. (heel, out) and offensive lineman Paris Johnson Jr. (knee, out). Houston’s offense, led by C.J. Stroud (averaging about 218 passing yards per game this season) and a rushing game able to exploit Arizona’s run defense (allowing 4.5 yards per carry, among the bottom half of the league), should build an early lead at NRG Stadium, where the Texans are strong against the spread this season. Projections model a 27-17 type blowout, covering comfortably, supported by Houston’s 7-6 Against the spread overall and Arizona’s 5-5 against the spread as underdogs; the line has held around -9.5 to -10 across books and experts are consensus on the Texans dominating this mismatch",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntzbjex/"
    },
    {
      "created_utc": 1765721278.0,
      "author": "MaxxHysteria",
      "text": "Record 2-0\n\nPick of the Day \n\nPelicans +5.5 \n\nWith two 2-8 in their last 10 games the value is on the Pels, Bulls have lost their last 3 games at home and the Pels are coming off a dominant win over the Blazers. With Poole back and Murphy and Queen heating up this feels like a solid play.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntzaxwt/"
    },
    {
      "created_utc": 1765719659.0,
      "author": "AdAggressive6388",
      "text": "Record: 7-6\n\nSport | NFL Colts vs Seahawks\n\nPick: over 41.5 (-112)\n\nWrite Up: this is a low total for the Seahawks because they will be playing 44 year old fresh from retirement Philip Rivers and the Seahawks defense is one of the best in the league. While a lot will fall on Rivers, running back Jonathan Taylor is a big reason the colts have been able to score this season and I think that he will be able to get into the end zone and create the space for Rivers to move the ball downfield. On the other side of the ball Seahawks offense on the other hand has been a well oiled machine as we saw last game they put up 30 in a half. I expect the Seahawks to put up those numbers again and the Colts will push this game over with one or two scores.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntz6q2u/"
    },
    {
      "created_utc": 1765716623.0,
      "author": "Hey52511",
      "text": "NBA POTD 12-9\n\nLast Pick: Knicks -4.5\n\nFranz out and OG locking up Banchero, Suggs being amazing and injured like usual, the Knicks win by 12.\n\nTodays Pick: **Jalen Johnson over 9.5 Boards.**\n\nTLDR: Ranked 6th in Giving boards to PF, Had 14 Boards against Philly, Hit in the last 5/5 plus hes also a match up merchant like Murray.\n\nWrite Up: A lot of teams are following the formula of having your ball handler grab the rebound so you can run the floor immediately and get in transition which is evident with Atlanta and 76ers having a 142-132 Game score. Now I expect the hawks to chuck up a LOT of threes and to try blow by Joel Embiid, most teams have smashed the first quarter with 30 points in the first quarter, but dropping the ball in the later quarters leading to low scoring games. \n\nNow why is this important to note? THE HAWKS ARE MASSIVE NOW with trae young now out and its a home game. The 76ers have played against a lot of below .500 teams at home, making them look amazing, even then they nearly lose a 20 point lead to the starterless warriors. Now this is important as the Hawks are actually very talented and love to run the ball evident by being top 6 in pace. This will likely force the 76ers in an uncomfortable position to try and play at their speed, meaning a lot of contested or forced jumpers. Furthermore Jalen Johnson averages around 16.5 rebound chances a game, that is insane to put it into perspective he is ranked 18th who has more chances then Mobley, Ayton, Claxton, Davis, Poetl honestly I could go on, but you get the point. Atlanta is also ranked top 10 in limiting threes allowed, but ranked bottom 10 in paints allowed to score in the paint which is exactly where Joel Embiid does damage. Less threes means a better chance to fall into the Forwards/centers. \n\nJalen Johnson is a very winning player and honestly more willinging to get everyone involved then score himself, however the one thing he must do like Jokic, Luka and similar players is they must be involved whether it's getting the board, the assist or scoring.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntyzkvs/"
    },
    {
      "created_utc": 1765716393.0,
      "author": "Certain-Challenge202",
      "text": "Record: 59-41 (+13.5)\n\nLast Pick: Gary Anderson Most 180s v Adam Hunt\n\nToday’s Pick: Wenig ML v Plaisier\n\nSport: World Championship Darts\n\nReasoning: Wenig profiles better for this format: he scores heavier over 12 months, hits significantly more 180s, and has already shown he can handle the pressure with a deep run at the Grand Slam. Plaisier’s small checkout edge and market momentum don’t compensate for that scoring gap, so Wenig is priced generously at 11/10.\n\nOdds: 11/10\n\nUnits: 1",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntyz391/"
    },
    {
      "created_utc": 1765715135.0,
      "author": "OnlyPicks",
      "text": "Record: 16W-11L\nBalance: +8.39\n\nLast 5 picks: ✅❌❌❌✅   \nLast pick: FC Midtjylland vs Genk , FC Midtjylland to win @ 1.70 [1 unit] ✅\n\n\nTODAY'S PICK:\nGame: Oddset Pokalen | AGF vs OB\n\nAGF to qualify @ 1.80 [1 unit]\n\nWhy?\n\nAgg. score is 0-1, that goal was a penalty, but this is AGF at home. AGF has been crazy good this season in the league, and won 7 out of 10 last home games against some of the best teams - currently #1 in the league. OB is #6 and has been performing well in away games but has also played against teams that are not nearly as good as AGF. AGF should absolutely win this one with more than 2 goals and qualify for the next round of the cup. \n\nGame starts in 1 hour and 35 minutes, sorry I’m late.\n\nBET RESPONSIBLY!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntywhw5/"
    },
    {
      "created_utc": 1765712230.0,
      "author": "InitialRegular1043",
      "text": "**Record**: 1-0  \n  \n**Net Units**: +1.47u  \n  \n**ROI**: 100%  \n  \n**Previous Pick**: Richmond Spiders ML (-205 / 1.49) (3u) ✅\n\n**Sport | League | Event Time / Time Zone**  \n  \nBasketball | NCAAB | Sunday, Dec 14 @ 5:30 PM ET  \n  \n**Pick**: South Alabama Jaguars ML (-148 / 1.66) (3u)  \n  \n**Write Up**: This is a classic strength-on-strength matchup that pits South Alabama’s efficient, mistake-free offense against North Texas’s gritty, snail-paced defense. The Jaguars are currently playing their best basketball of the season, sitting at 8-2 and riding a 5-game home winning streak at the Mitchell Center. They have turned their home floor into a legitimate fortress, remaining undefeated (2-0) there this season while shooting significantly better in their own gym. The biggest factor in this game is pace and possession management. South Alabama ranks #1 in the entire nation in ball security, averaging just 8.0 turnovers per game. This is an elite metric that allows them to maximize possessions and prevents opponents from getting easy transition buckets. They are facing a North Texas squad that, while 7-3, has looked like a shell of itself away from Denton. The Mean Green are 0-2 on the road this year, where their offensive efficiency plummets and their turnover issues (11.7 per game, 210th nationally) become glaring.  \n  \nThe Jaguars are led by their dynamic scoring guard Adam Olsen, who is averaging 16.4 points per game and has been the catalyst for an offense shooting 46.9% from the field (top 120 nationally). Olsen is complemented by Chaze Harris, a slasher who is averaging 14.2 points and shooting an absurd 48.6% from the floor for a guard. This duo gives South Alabama the shot creation needed to break down a North Texas defense that holds teams to around 65 points per game. The issue for UNT is that they simply cannot score enough to keep up if the game hits the 70s. Their offense ranks in the bottom third of the country in effective field goal percentage on the road, and they rely too heavily on Je'Shawn Stevenson (16.0 PPG) to bail them out late in the shot clock. When you combine North Texas’s road struggles—losing their away games by an average margin of 8 points—with South Alabama’s elite turnover margin and home-court shooting splits, the Jaguars have a clear statistical edge in what should be a tightly contested game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntyr0qz/"
    },
    {
      "created_utc": 1765704894.0,
      "author": "kab1218",
      "text": "PoTD Record 5-5 breaking even finally\n\nNet units: +1.5\n\nPrevious pick: Coventry ML v Bristol City + Norwich v Southampton O2.5 2U @ +143\n\nCoventry takes a measly 1-0 at home for the win while Southampton and Norwich go 2-1 to cover for us. We move on. \n\nToday’s pick: Feyenoord @ Ajax - O 2.5 Goals + double chance Feyenoord/Draw 2U @ +117\n\nApologies 4 hours from now Eredevisie Soccer 630am MTN\n\nWrite up:\n\nFeyenoord have been goal machines this year scoring 41 in Eredevisie alone, only allowing 18. They are second in the league and will want to keep it that way over Ajax. In their past 20 games Feyenoord have hit this line 14/20, 4/5 of their last away games. Ajax have been very inconsistent this year, home and away, with a record of 7-5-3. I trust Feyenoord will be able to keep the goals up in this one and giving us the best 2/3 chances to win with a Feyenoord W/D. \n\nBOL if tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntyee1n/"
    },
    {
      "created_utc": 1765702997.0,
      "author": "Ok-Actuary-4654",
      "text": "POTD Record: 9-3-0 (+33.50 units)\n\nStreak: 2L\n\nLast 10: WWWWWWLWLL\n\nLast Pick: Phoenix Suns ALT +8.5 (+200) 4 units vs Oklahoma City Thunder\n\nLast Pick Reflections: Just a disastrous pick on my part. Booker ended up not playing and this game wasn’t even close from the get-go. Thinking about ways I can be better with potential players sitting out and waiting closer to game time to lock picks. 3 losses in my last 4 is uncharacteristic and I apologize. Looking forward to starting a new streak after a few days break to regroup!\n\nEvent: New England Patriots vs Buffalo Bills NFL\n\nPOTD: Patriots Moneyline (+106) 5 units\n\nRationale: The pats have had a scorching season after a disastrous 1-2 start. Pairing Drake maye with Josh Mcdaniels and bringing in Vrabel to set the tempo of this locker room has made a world of difference to their attitude and approach toward games. Keep in mind Maye has yet to throw for 300 yards in a game but has been very efficient with the football and is step for step with stafford in the mvp race. They’re a fundamentally sound team reminiscent of the belichik days. With an additional week off with the bye week, I think this will be a hungry motivated team that will continue to set the stage for why they belong among the AFCs best. What’s most impressive about me is how complimentary their offense, defense, and special teams play. I expect Maye to have his first 300 yard game tomorrow, you know Diggs wants the W against his former team, and I think this will be an absolutely electric 60 minutes of football from the Pats.\n\nOther leans I like for tmrw include browns +7.5, chargers +6, cardinals +10, bengals +3, broncos Ml.\n\nJust to reiterate, in conjunction with my model, I use the eye test as well as my gut feeling to play what I believe is the most-valuable pick on the slate. Cheers to a great game, and please remember to gamble responsibly and to only wager what you can afford to lose.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntyb961/"
    },
    {
      "created_utc": 1765701266.0,
      "author": "Lyx97",
      "text": "Record: 14-5-2\n\nNet Units: +4.44\n\n*Prev Pick : Hobart Hurricanes Women Win @ 1.622 (1u) --> Win* \n\nFootball | EPL | Brentford vs Leeds | in \\~8hrs\n\nBTTS @ 1.95 (1u)\n\nWrite Up : Going a little risky, but feel the line is too much to ignore. Brentford at home has been an amazing team, scoring in 6 of their 7 games, with the only non scoring game against City. Similarly, Leeds matches are always seeing goals, even against quality opposition (scored in all 5 previous games & 8/10 last games). Both teams will be looking to get points and stay clear from the relegation teams and will likely play attacking football. I think o2.5 is also a good shout, but going with BTTS here\n\nHope win continue the wins & BoL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nty8d29/"
    },
    {
      "created_utc": 1765699499.0,
      "author": "Rest_Few",
      "text": "Record: 1-0-0\n\nPrevious pick: Football Scotland league 2 Annan Athelic vs Forfar Athletic over2.5 goals ✅ \n\nNet Units: 1U\n\n\nEvent: Premier L, Crystal Palace vs Man City\n\nPick: Man City to score 1.5+ goals (1.74 odds)\n\nWrite Up: Yesterday was amazing as we boomed our first prediction here and hoping this is the beginning of a glorious run here \n\nCity are banging in goals for fun right now with the team just beating Madrid ! Confidence is at a high for sure , top scorers by miles, and they’ve smashed 2.5+ goals in their last three Prem games. \nPalace are flying high in 4th, but they played Thursday in Europe and look a bit leggy after those games. City’s fresher, deeper squad, and historically they dominate this matchup, averaging over 2 goals a game against Palace.\nI expect City to exploit that and bag at least 2 today, probably more.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nty5exe/"
    },
    {
      "created_utc": 1765697282.0,
      "author": "PurpleDragonBets",
      "text": "Record: (116-77-11) \\[+14.22\\]\n\nPOTD⭐️:🏈Panthers -2 (-125) \\[BallyBet\\]\n\nStart Time & TV: 4:25pm EST (FOX)\n\nUnits: 3 Units\n\nReasoning: For this NFL Sunday well be going with the Carolina Panthers (7-6) facing off against the New Orleans Saints (3-10). The Panthers have all in the world to play for in this game after the Buccaneers loss on the Thursday Night Football and with a win here against the Saints it puts Carolina in first place of the NFC South and they get to face a bottom tier opponent without their starting runningback as the Saints will be without Alvin Kamara in this game. The Panthers are coming off a very solid win against a stout Rams team where they put up 31 points and forced 3 turnovers on defense. The Panthers are also coming off a bye week so they are well rested and have had two weeks to prepare for this road test against the Tyler Shough led offense. This Panthers team has been very productive on the ground this year with just over 125 rushing yards per game which is top 10 in the league while the Saints rush offense is quite the opposite ranking 28th out of 32 teams and also one of the worst scoring offenses in the league only averaging 15 points per game. Carolina is getting some key players back from the injured list as starting center Cade Mays is returning on offense for them and starting safety Trevon Moehrig will be back on defense for them. The Panthers also lead the Saints on the defensive side of things in rush yards per game, points allowed per game and turnovers per game so I like taking the Panthers in this one coming off the bye week as I think an extra week of preparation in a massive game for them will be a big benefit.\n\nPrediction: 23-17 Panthers\n\nLast pick: 🏈Navy ML/Washington ML💰Great second half from Navy and we got a no sweat from Washington!\n\nBest of luck to everyone tailing and remember to bet responsibly! If you are an NFL fan I hope your team comes out on top today!💜🍀🐉\n\nhttps://preview.redd.it/gmbimzijg47g1.jpeg?width=1170&format=pjpg&auto=webp&s=c52e4f652b5cddd5582b23d0eb3999d75bbb146d",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nty1oe0/"
    },
    {
      "created_utc": 1765697220.0,
      "author": "ProperBettor",
      "text": "POTD RECORD : 4-4❌✅✅❌✅❌❌✅\nNET UNITS : +1.3U\n\nPrevious pick : Bayern Munich -1.5 handicap vs Sporting @1.59)and (Barcelona -1.5 handicap vs Frankfurt @1.42) Parlay - - @2.25 ❌\n\nPOTD : Cricket - India vs South Africa 3rd T20I \nMatch sixes over 17.5 @ 1.85 2U❌ \n\nWrite up: Back to cricket after another close loss in football.\n\nAfter a strong South Africa response in 2nd match, we now move to the most beautiful cricketing venue in India - Dharmasala. Regardless of how pitch is going to behave, I expect another high scoring match here with plenty of sixes being hit. India's top order will be under pressure and they will look to score big this time around. Shubman Gill especially will be under serious scrutiny if he fails again as he's the one taking the most underserved spot in the team. Surya would want to regain his form too. Although his spot is not under danger with World Cup coming soon, he knows he has to do better nevertheless.  Abhishek Sharma is yet to bring out the fire he has and this will be a good opportunity to do so and take the lead in the series. India does have plenty of batsmen who can hit big sixes. Hardik, Jitesh, Axar down the order. There isn't a single batsman in the team that is incapable of hitting a six. India can easily clear 10-12 sixes if they bat first if the pitch is decent enough for batting.\n\nAs for South Africa, they can go at it again and put India under pressure. They completely nullified Bumrah in the second match. They took advantage of the dew factor and India's bad bowling. India may not give another such chance here but I still expect South Africa to be aggressive and get a few sixes. De kock is back in form, Brevis can hit some of the biggest hits. Markram, Jansen, Stubbs, Miller, Ferriera. Mind you these are some of the best six hitters in world cricket and play around the franchise cricket all year. Indian pitches tend to be a bit more batting friendly than anywhere in the world, so naturally batsmen fancy themselves to hit big shots and play some nice strokes. \n\n\nThe only way this bet wouldn't work is in an instance where South Africa bat first and Bumrah bowls really well. Otherwise I expect sixes in both innings! Good luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nty1kns/"
    },
    {
      "created_utc": 1765697192.0,
      "author": "cellarseller",
      "text": "Events: Bayern vs Mainz \\[Bundesliga\\] 11:30am and Lens vs Nice \\[Ligue 1\\] 11:15am \nPOTD: Bayern o2.5 (-280) and Lens ML (-220), total odds -103, 3 units *edit - tough loss, Bayern had loads of chances with even an xG of 4.24.. going to avoid betting on them for a bit\n\nBayern playing at home is always hungry to score goals, Mainz is last in the Bundesliga. Nice is messed up internally and in poor form, and Lens is playing well atm, bonus bet is Villarreal ML against Levante (last in La Liga and poor home form unfortunately for them).",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/nty1iwu/"
    },
    {
      "created_utc": 1765696034.0,
      "author": "Emergency_Emu_891",
      "text": "Record: 15-4, +20.83u, 42.30% ROI\n\nForm (oldest -> newest): ✅✅✅❌✅❌✅✅✅❌✅✅✅✅✅✅✅❌✅\n\nLast Pick: Josh Giddey o6.5 reb v CHA, Michael Porter Jr o19.5 pt v DAL, -135 on DK at time of writeup, betting 2u ✅\n\nGiddey had 3 rebounds going into Q4 but got 4 in the final frame to cash. This is why I like betting on the top players on a team in games that should be close. MPJ torched the stat sheet again and dropped 34 points.\n\nToday's Pick: Las Vegas Raiders TT u17.5 v PHI, Puka Nacua o69.5 rec yd v DET, -149 on DK at time of writeup, betting 5u MAX BET\n\nThis is my biggest play yet. I can only play it for 5u here, but I’m playing it for even more than that personally. Let’s start with the Raiders. The Raiders are horrible. They are a completely dysfunctional team. They have no offensive line. 24th in red zone TD rate. 29th in plays per game. 30th in success rate. 29th in EPA per pass. Last in EPA per rush. Last in sack %. 29th in INT %. Last in PPG. This team is not good. To make things worse (better?), they are starting Kenny Pickett instead of Geno Smith. Most of his stats against DEN last week came in garbage time. This team has scored over 17 points one time since week 4, in that weird OT loss to JAX. They are playing PHI, a team also facing offensive struggles. However, their defense is very good. Held DET to 9, GB to 7. Their offense put them in horrible spots in their past 3 losses to DAL, CHI, and LAC. PHI on defense has the 4th best red zone TD rate, 7th best EPA per pass, 10th best success rate, 18th best EPA per run, and 9th best opp PPG. These numbers would be even higher if their offense wasn’t selling against quality opponents, and giving their opponents many extra possessions. This is a must have spot for the PHI offense. This is the game where they need to get something going on offense. They are playing at home for a crowd that is angry with their performance. Their defense is mostly healthy, except for Jalen Carter, who is obviously critical to them. Jalen Carter is not playing in this game. Jalen Carter did not play last week against LAC, who scored 19 points in regulation, despite Jalen Hurts throwing 4 INTs. PHI only allowed 1 TD in that game. I could see LV scoring 0 TDs this week. Even if they get 1, they would need 4 FGs to clear 17.5. If they get 2, they still need 2 more FGs. I don’t see any way that one of, if not the worst offenses in football can put up more than 2 TDs and 1 FGs against one of the best defenses, playing on the road against a motivated squad with a backup QB. Now, how vulnerable are we to bullshit, like a short field from a turnover or a D/ST TD? Well, I’m sure ball security is going to be the #1 sticking point of emphasis in practice this week after 4 INTs last week. LV is a middling team in INT %. LV hasn’t scored a defensive TD this year. LV hasn’t had a kick or punt return TD this year. Even if PHI has a dumb turnover or 2, they are good at stopping red zone TDs, and they should have field position advantage all game. I wouldn’t worry about some non-standard LV offense vs PHI defense ruining this TT under. There will likely be snow, it will feel like 10 degrees, and it will be windy. I feel very confident in this pick.\n\nNow, let’s go to DET v LAR. Puka Nacua is in a good spot to produce. We have a non-100% Davante Adams (who should still play). We have Puka, who has 70+ yards in all but 2 games this year: missing with 64 against SF and that weird 17-3 win over BAL. He was also dealing with an injury, but seems to be back to full form now, with 11 targets and 167 yards last week against ARI. Their safeties Kerby Joseph and Brian Branch are out. We have a very high total at 54.5. A lot of people I follow like DET in this game, both ATS and SU. This should be a close shootout. DET has the 4th best EPA per rush on defense, and 15th best EPA per pass. This points to another game where Stafford will throw the ball a lot. Last week, Lamb and Flournoy on DAL dropped 115+ yards each. Wicks and Watson dropped 80+ yards each the previous game. Wandale dropped 156 the game before that. Puka has 19 receptions of 20+ yards this year. His volume is returning to his pre-injury level. He is a physical player who can run through a DET defense that couldn’t tackle Jameis Winston on a trick play. Big plays, volume, Adams not 100%, bad and injured defense giving up big yardage to WR1s in recent games, high total in a potentially nailbiter shootout. Give me the Puka over 70 yards. \n\nCombine these picks, and we are at -149. I am very confident in these two alt line picks. Give me both together for a max bet. REMEMBER NOTHING IS A LOCK, bet only what you can afford to lose. BOL to all tailing. I'm about to go on vacation, so this will likely be my last bet for a few days.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntxzjpj/"
    },
    {
      "created_utc": 1765694636.0,
      "author": "ptrckfrnndz",
      "text": "+18.62\n\n12 - 6\n\nFORM: ✅️✅️✅️✅️\n\nSports: Tennis\n\nPick: broadus/shaikh ML VS. Bartashevich/bartone @ 1.83 5UNITS✅️\n\nPick: shaikh ML @1.9 ✅️✅️✅️✅️✅️✅️ congrsts for 5 in a row... all at decent odds.. if i made u some money leave some kind ckmments\n\n\nMaybe u can also tip me so i can buy myself some rice and food tonight.. tnxxxx\n\nTime: abt 9hrs from posting\n\nReasoning: LETS RIDE OUR BABE SHAIKH.. i slowly following shaikh and also watched both semi finals of this tourney. I can see more determination on shaikh. So i dc if line move. I think she will give her all on this..bol\n\nBol\n\n\nI hope u leave some thanks on comment if i made u some money",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntxx2jd/"
    },
    {
      "created_utc": 1765693276.0,
      "author": "gihrivr",
      "text": "**Record:** Debut\n\n**Net Units:** N/A\n\n**ROI:** N/A\n\nAmerican Football | NFL | Buffalo Bills at New England Patriots 1pm Eastern\n\n**Pick:** New England Patriots ML ( +100 ) , 1u to win 1u\n\n**Write Up:** Today we see divisional rivals the Buffalo Bills and the New England Patriots play in New England. These two teams have already played earlier in the year on October 3rd where we saw the Patriots come away with a three point win in a relatively close game. The Patriots are currently 5-2 at home versus the Bills away record being 3-3. Admittedly the Pats only two losses on the season are at home, however this happened at the start of the season and they are currently on a 10 game win streak. This 10 game win streak has been against arguably weak competition, however the bills have had a very similar schedule, playing against mostly struggling teams bar Tampa at the time who turned out to also be struggling. \n\n  \nNew England currently allow the 3rd fewest rushing yards in the league at 89.5 yards a game. This run defense should contain arguably one of the best running backs in the league, James Cook, contained which is a huge part of this bills offense. In their meeting in October, the Bills managed to rush for 118 yards which is above the average allowed by New England. However it is below their average of 157 per a game,. In this game we only saw Cook rush for 49 yards, which is far below his average of 121 yards a game. Josh Allen rushed for a majority of the yards and will remain a threat. On the flip side, New England has had their own struggles running the ball, largely due to a rotating cast of running backs due to injury, however in recent weeks their run game has improved through the breakout of rookie Treyvon Henderson. The Bills currently  allow the 5th most rushing yards per a game at 135.2 yards per a game. I expect with Rhamondre Stevenson back from injury to work in tandem with Henderson, similar to their most recent game against the Giants, to punish the run defense from the Bills and keep them honest.\n\nNow onto the passing part of the game. We see a quarterback battle between MVP Josh Allen vs MVP Hopeful Drake Maye. Maye has had a phenomenal season, finding large success in the air, currently boasting the 2nd most passing yards in the league behind Dak Prescot. While Allen has had a decent year himself sitting in 8th. New England currently sit in the middle of the pack at 206.9 passing yards allowed a game. The Bills however sit in second place at 171.8 passing yards allowed. Maye has found phenomenal form, passing for over 250 yards a game for 10 out of 13 games and hasn't passed below 200 all year. I expect him to keep passing it well, especially with recent news of the Bills best cornerback, Christian Benford, walking around in a boot (as of writing still questionable to play). This should allow either Boutte or Diggs more freedom in catching the ball as well as potentially allow Henry some easy catches should the Bills double team Diggs. On the flip side we see Josh Allen who although is putting up numbers in the air, has seen his fair share of turnovers, seeing 10 interceptions as well as a number of fumbles. He also has been inconsistent, either passing well below 200 yards or passing nearly/over the 300s. \n\n  \nThis game means a lot for both teams. The Bills are currently fighting to stay in playoff contention while the Patriots are in an apparent two way race for a bye week with the Denver Broncos. I expect this to be a close game and there is a significant risk to bet on, however given the playoff implications and the expectation of it being a good game, I cant pass up the opportunity. Given Drake Maye's recent form, the Pats success in recent weeks with the run game, as well as playing at home, I have to give the slight edge to the Patriots to eek out a victory. \n\nBOL, bet only what you can afford to lose",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntxum37/"
    },
    {
      "created_utc": 1765692236.0,
      "author": "Zulubat",
      "text": "Record: 0-0\n\nEvent: Call of Duty, Major 1 Qualifiers, Miami Heretics vs Cloud 9 New York @ 4:30 pm est.\n\nPick: Miami Heretics ML @ 1.77 (Bovada)\n\n5U.\n\nThis line is really odd to me. Cloud 9 has played two matches so far and both showings have been subpar. Their first match vs G2 Minnesota they looked very lost on SND and Overload. They won both Hardpoints but the games were played close. They just played vs Surge and won 3-0. At first glance a 3-0 is very nice, but if you look at Surge's roster and how close the games were this was a very very bad showing. Surge to me is basically just an amateur team. They have Lqgend who just came over from halo and is struggling hard. The overall Surge roster does have pace but their lack of experience shows and will prove tough for them to find wins if any. That being said the little bit of pace that Surge showed was a struggle for Cloud 9 in their series, they kept the HP within 10 points, SND in 2 rounds, and Overload they won by one going into OT. Cloud 9's overall gameplay does not bode well for any team they play that has playoff potential. Looking at Miami Heretics they are off to a bad record being 0-2 but they are showing to have really good potential. This team has the skill to be in top 6 contention and have a superb core. Once Traixx starts getting reps this team will be a true competitor. Heretics are coming off a very close series to Optic who are the current #1 team and a decent series vs KOI. I'll give some leeway for the KOI series since they had very little practice and Traixx is new to their team this year. Although they got demolished in Game 1, they came back in SND keeping it close and were able to show good life on the 2nd hardpoint. Building on that series they went to 5 games vs Optic and showed that their Hardpoint has improved from their series vs KOI. They had a fairly good showing in the SND and showed massive improvement in Overload keeping it close vs Optic only losing 4-3 when last series was 8-0. With them being able to take both hardpoint maps off of Optic and keeping SND/Overload close it bodes really well for their match vs Cloud 9. Overall this team has really good pace and should be able to take this series. Each of their game modes has improved over their past series and with Cloud 9's subpar showing vs the bottom of the league this should be a 3-0 maybe 3-1. At the end of the day it is online cod. https://x.com/ZuIubat",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntxsntz/"
    },
    {
      "created_utc": 1765691530.0,
      "author": "Pefkov",
      "text": "Record: 16-9\n\nNet Units: +6.08\n\nLast Pick: Rachaad White o15.5 Rushing Yards (-117 on DK) 1u to win 0.86u ✅\n\nTodays Event 🏈 NFL Sunday Football Ravens @ Bengals 12 PM CST 🏈\n\nTodays pick: Mark Andrews Any Time Touchdown (+150 on DK) 1u to win 1.5u\n\nWriteup: Rare ATTD pick once again. Ravens face against the Bengals for the second time this season and despite being on the road and getting stomped last matchup, they are expected to win this matchup. Andrews originally got on the injury report for some glute problems but has been fully practicing and is expected to fully play this game. \n\nLets give some facts. Mark Andrews leads the Ravens in red zone targets with some estimates saying he gets nearly 1/3rd of them. He's been playing 2/3rds of the offensive snaps this season still taking top spot over Isaiah Likely who has also been out and about. Andrews also averages just under 3 receptions, and his line sits at 3.5 for this game. Plenty of opportunity to take one in\n\nBengals have the one of if not the worst scoring and red zone defenses. Not only that, they have given up the highest amount of touchdowns to tight ends at 15 this season, coming directly off a game where they gave up touchdowns to two different tight ends against the bills. Bengals tend to play zone 2/3rds of the time, an area which Andrews thrives in, though not at all bad against man coverage either.\n\nRavens touchdown total right now is sitting at 3.5. Honestly the stars of the show who are bound to fill those up are Derrick Henry and Mark Andrews, ready to bruise up an all time bad defense. If I had to pick any this game it'd be one of them.\n\nBOL everyone tails",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntxradv/"
    },
    {
      "created_utc": 1765689676.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 21-12 (+18.39$)**\n\nLast POTD: NBA Shai Gilgeous-Alexander Over 31.5 Points -106 (2.50$ TO WIN 2.22$)x\n\n**POTD: NFL Drake Maye 230+ Passing Yards -130 (2.50$ TO WIN 1.90$)**\n\nWrite up: Drizzy Drake Maye! This is the model’s top play for NFL Sunday. Let’s roll. \n\n• ⁠Model has this hitting at 55.7%\n\n• ⁠Model likes Bills ML mirroring the over for Maye \n\n• Model says his line should be at o/u 245.5 \n\n• Model shows he has hit this line over 90% this year\n\n\nHappy Sunday & Go Bills. GL\n\nBOL!\n\n**POTD: NFL Drake Maye 230+ Passing Yards -130 (2.50$ TO WIN 1.90$)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntxniu6/"
    },
    {
      "created_utc": 1765684782.0,
      "author": "UserMSDGCRS",
      "text": "Record: 0-0 (First Time Picker here!)\n\nNet Units: 0\n\nEvent: EPL Soccer Tottenham @ Nottingham Forest 9:00 AM EST\n\nPOTD (12/14/25): Tottenham Over 4.5 Corners (-145 DK) 3u to win 2.06u\n\nWrite-Up: I am a Tottenham fan, and we have been in a good run of form lately winning our last 2 for the first time in awhile. Forest comes in with more sporadic form going from wins to losses regularly.\n\nI think this line is too low; Tottenham has hit this, and many times easily, in their last 5 games. Forest sit 15th in the league, and while Tottenham sit 11th, we are only 4 pts from top 4. I expect Tottenham to be putting on the pressure and forcing corners and wouldn’t be surprised to see their total corners at 6 or 7+ by end of game.\n\nSince Forest are playing at home, I wouldn’t expect them to sit back as much as if they were playing away, and this should allow for the game to be a little more open which tends to make corners more common.\n\nBOL, and I will try to be around for more soccer picks in the future!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntxccq2/"
    },
    {
      "created_utc": 1765684347.0,
      "author": "ColdTub10",
      "text": "**Record**: 4-3 (+1.88u)\n\n**Last Pick**: (CBB) Kansas (+2.5) @ NC State | (W +2.63u)\n\n**Event**: (NFL) Detroit Lions vs. LA Rams | 4:25pm ET \n\n**POTD**: **Jahmyr Gibbs OVER 40.5 Receiving Yards** | 2u to win 1.75u | -114 on FD\n\n**Reason**: Gibbs has been getting much more involved in the pass game the last 4 games averaging **61.7 receiving yards the last 4 games** (107 against Philadelphia and 77 against Dallas). The Rams run defense has been pretty solid ranking 11th in rush yards allowed per game, which may give Dan Campbell more of a reason to get Gibbs involved in the passing game. I think Campbell does like seeing Gibbs receiving the ball more now that he is the one calling plays. His target share has increased as well the past few games, and for Detroit to win this game, Gibbs is going to have to make some noise. \n\nI also think due to the fact that the Rams rely heavy on the passing game and the Lions pass defense is below average, the tempo of the game will be a lot faster which will increase the odds Gibbs gets targeted. **The Rams also rank 26th in targets allowed to running backs**, and with Gibbs being so elusive, if he gets past the linebackers, he could easily go for 40 in one play. \n\nBOL.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntxbb63/"
    },
    {
      "created_utc": 1765683770.0,
      "author": "domadilla",
      "text": "POTD record 86-5-65 (W-P-L)\n\n**CS2: Vitality to win against Faze -1.5 maps handicap, 2u @ -118**\n\nThis Vitality team has been the dominant force in Counter-strike all year with an incredible win rate- they have won half of the tournaments they have entered (7 trophies out of 15 tournaments). Faze on the other hand hasn’t won anything all year and this is their first tournament final of the year. It’s really a Cinderella story and I expect Faze to put up a really good fight here so rather than bet on a 3-0 we will take a one-map buffer and if Vitality win 3-1 this bet will still cash. The prediction is 3-1, Vitality have too much experience and talent for scrappy underdogs Faze. Here are some other stats:\n\n* Vitality win rate over 3 months: 75% (Faze at 56%)\n* Vitality win rate in Bo5 finals in 2025: 7-2 (Faze 0-0)\n* Vitality bo3 wins over Faze in 2025: 3-0 (2-1 each time)\n\nhttps://preview.redd.it/c4ov6ksz837g1.jpeg?width=1170&format=pjpg&auto=webp&s=39dabcc8c1d61c47eeb2d1dd372f81f64ca90213",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntx9wat/"
    },
    {
      "created_utc": 1765683597.0,
      "author": "Slip_Merchant",
      "text": "**POTD Record:** 0-1 (-2.2u)\n\n**Previous Pick:** ❌Navy -5.5\n\n**Event:** Cardinals @ Texans 1pm EST\n\n**POTD:** Jayden Higgins o3.5 receptions (+100), 3u to win 3u\n\n**Write Up:** All things considered — Jayden Higgins has consistent target volume, multiple recent games with 4+ catches, and he is playing a middling-to-weak Cardinals pass defense. Higgins has hit this line in **4 of his last 5 games and 6 out of his last 9 games**. Since Week 8 he has **averaged 6 targets a game with a 61.9% completion rate**. \n\nThe **Arizona Cardinals pass defense** in 2025, allows roughly **237 opponent passing yards per game.** Currently the Arizona Cardinals have listed 4 defensive players OUT. **In the last 7 games, Higgins has a 16.1% target share**.\n\n  \nI think the cardinals will play this one closer than a lot of people think, and with Woody Marks & Nick Chubb banged up, I think they will rely on short check downs in 3rd down or short yardage gain situations.\n\n  \nApologies for the first pick. Hopefully we can gain back what we lost and then some on this one.\n\n  \nTo your success,\n\nSlip Merchant",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntx9gse/"
    },
    {
      "created_utc": 1765681643.0,
      "author": "222benz",
      "text": "Record: 1-3\n\nLast Pick: Spirit MW & Tidebound MW ❌\n\nEvent: Dota 2 DreamLeague Season 27 | 9:30 AM EST\n\nPOTD: OG +1.5 Map Handicap vs Team Falcons @ 1.55 odds (2.5u)\n\nWrite Up:\n\nOG is currently playing championship-level Dota. They are undefeated in the Swiss stage and coming off a massive 2-0 sweep against Team Spirit yesterday. Their playstyle has improved significantly, especially their team fighting skills, which looked flawless in that series.\n\nWhile Team Falcons are also undefeated, they have looked slightly more vulnerable, dropping maps to lower-tier teams like Pipsqueak+4 and Passion UA earlier in the week. With the momentum OG has and their upgraded coordination, it is extremely unlikely they get swept 0-2 here.\n\nI'm actually so confident in their form that I even throw a few extra units on the OG Moneyline as a sprinkle.\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntx4hsd/"
    },
    {
      "created_utc": 1765681142.0,
      "author": "oneilmatt",
      "text": "**Record:** 5-2\n\n\n**Previous Pick:** Travis Etienne o51.5 rushing yards ✅️ \n\n\n**Game:** NFL - Jets @ Jaguars, 12pm CDT\n\n\n**POTD:**  Brian Thomas Jr. longest reception o20.5 yards (-118 on FD)\n\n\n**Rationale:**\n\nSince his return from injury, BTJ appears to have shaken the early-season demons. His drops have reduced, and he has made several incredible grabs. In his first game back, his long was 18 yards, and last week he had 3 receptions over 21 yards.\n\nWith Meyers proving a reliable option over the middle, BTJ has evolved into the primary field stretcher. When Trevor wants to take a shot, it is probably going to BTJ.\n\nThe Jets have given up at least 2 catches over 21 yards in almost every game this season, and I expect BTJ to continue his quest to get his swag back tomorrow.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntx37di/"
    },
    {
      "created_utc": 1765678096.0,
      "author": "Superior_pT",
      "text": "Record: 22-15-1 (🚫💰🚫🚫🚫💰💰💰💰➖💰💰💰🚫🚫💰💰💰🚫💰💰🚫💰💰💰💰💰💰🚫🚫💰🚫🚫🚫💰💰🚫)\n\nNet Units: +12.03 units\n\nLast Pick: NCAAF Army vs Navy Over 38.5 \\[-110\\]/4 units🚫\n\nSport: NFL CLE vs CHI @ 10AM PST\n\nPick:  Total Under 39.5 \\[-113\\]/3.5 units\n\nWrite up:  \nThe biggest thing for me is the weather. The forecast for Chicago calls for sunny but temps will be around 12 degrees and gusts up to 25 mph. That’s the kind of cold/wind combo that makes passing efficiency and ball security worse, and it’s not exactly a friendly kicking environment either.  \n\nOn top of that, Cleveland’s offense is walking into this game banged up in key “keep the drive alive” spots. The Browns’ official injury report ruled out Jack Conklin and David Njoku (among others) and also listed Denzel Ward out, with more names on the report overall. It’s hard to love points when an offense is missing protection and reliable chain-movers, especially in those conditions. \n\nChicago also has a profile that can naturally help an under when they’re in control. They’re near the top of the league in time of possession (32:03, 4th), and that matters because fewer plays/drives is your best friend on a low total. \n\nThe “under script” gets even cleaner when you factor in how Chicago’s defense creates short fields the wrong way for the over. The Bears lead the league with 18 defensive interceptions, which tells you they’re opportunistic, and opportunistic defenses often force offenses into more conservative decisions in bad weather. \n\nThe one way this under gets wrecked is the obvious one: non-offensive points (pick-six / scoop-and-score) or a couple of short-field touchdowns that skip the “hard part” of moving the ball in the cold. That’s the risk you’re always taking here, but if this plays like a normal game, the weather + Cleveland injuries + clock-draining Chicago tendency all point the same direction.\n\nThat’s my read: low temps, real wind, and an injury-hit Browns offense make the under the most natural side. If you can shop around and find a better number, even better. Best of luck, only gamble what you can afford to lose. \n\n\\----- Statistics -----  \nMLB: 17-10-1 (2025) +15.38 units\n\nNCAAF: 3-4 (2025) -5.49 units\n\nNFL: 2-1 (2025) +2.17 units",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntwvejf/"
    },
    {
      "created_utc": 1765677685.0,
      "author": "Best_Accountant_5471",
      "text": "Record: 51-34 (+30.8 units)\n\nLast 10 (most recent on right):  ✅✅✅❌❌❌❌❌✅❌\n\nLast Pick: Alejandro Catena (Osasuna) 2+ fouls committed vs Barcelona ❌\n\nEvent: Portugal Primeira Liga ⚽️\n\nPick of the Day: Joao Carvalho (Estoril) 1+ shot on target vs Famalicao 1.7 units to win 2U @ 2.20 (Bet365)\n\nWrite-up: Only one foul late on unfortunately from Catena, just how the ball rolls sometimes. Osasuna did well to hold out for 70 minutes before the pressure eventually allowed Barcelona to get their breakthrough as they ended up winning 2-0. Had Barça scored earlier it maybe would’ve increased foul opportunities due to how deep Osasuna were but I can’t be mad.\n\nI had quite a few picks to choose from today but I’ve gone with this one as it seems to be the best value to me. Carvalho is predicted to start on the right wing against Estoril but has played left wing and attacking mid. He’s been averaging 1.1 shots on target this season in the league, clearing the line in 10/12 (83%) of those. In away games his average has been of 1.2 - covering a shot on target in all six and in his last 8/8 matches. With Joao being predicted to start on the right, Famalicao have been conceding an average of 1.3 SOT’s from his flank this season at home, conceding one in 6/7 games (yes I know I’ve just opened a can of worms with that). He’s pretty much nailed for 90 minutes as well and overall this price is one that screams value based on all factors even with the price coming down from the 2.50 it opened at. BOL !\n\nNote: on the off-chance that Carvalho doesn’t start, choose a book that voids the pick. It could save you a lot of money.\n\nhttps://preview.redd.it/qmlcoss9u27g1.jpeg?width=1179&format=pjpg&auto=webp&s=d8148480625e36e7158c2cbf7621dfe385cc2d4b",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntwuct4/"
    },
    {
      "created_utc": 1765677560.0,
      "author": "damagebabee",
      "text": "**POTD** Record 124-02-98\n\nBW LINZ VS RAPID VIENNA\n\nDate: 14 DECEMBER 2025 at 14:30\n\nBET ON: Over / Under- Over +2.50\n\nOdd: 2.00\n\n\n\n\\- Both teams go into this fixture with a clear tactical imperative to take the game to the opposition, which supports an Over 2.50 goals scenario. Blau-Weiß Linz’s coach is under intense pressure to arrest their slide, and his predicted 3-4-2-1 aims to maintain width and offensive outlets despite defensive frailties and long-term absences like Anderson and Goiginger, which have disrupted defensive cohesion and wing play. Their form suggests they often keep games close early but fade after halftime, opening spaces and creating transitional chances for both sides. Rapid Vienna’s interim coach Stefan Kulovits has publicly demanded belief and a fighting mindset, stating that those not committed should “go home,” underlining his motivation to spark an urgent offensive reaction and reinvigorate his squad tactically after a poor run. Rapid also plan to control via a 4-2-3-1, but multiple defensive and attacking absences (including Dahl and uncertainty over Kara) force improvised defensive structures and reliance on creative midfield interplay rather than a settled shape. With both coaches pushing for attacking rectification, weakened defenses likely to be exposed, and recent trends showing space and goals once intensity increases, this match has tactical conditions that strongly favor over 2.50 goals.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntwu182/"
    },
    {
      "created_utc": 1765676286.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 29-13 (+19.2U)\n\nLast Pick: Arkansas ML (+110) (1U) ✅\n\nWhat a great game. Brazille is him.\n\nEvent: Ravens @ Bengals (NFL) (12PM central)\n\nPOTD: Ravens +5.5 (alt line)/ over 44.5 (alt line) 2 leg parlay (-120) (1U)\n\n(Bet to win 1U)\n\n\nWrite up:\n\nRavens +5.5\n\nThis rematch is a perception-versus-reality spot. The public is glued to that recent loss in Baltimore, where the Bengals handled the Ravens at their place, and they’re piling on Cincy because it feels easy. Yet the market is still hanging Baltimore as a short road favorite—despite that home loss to this very opponent—which is a tell that the matchup fundamentals and power ratings lean toward the Ravens. Baltimore’s defense tightens in key spots, their run game controls pace, and Lamar’s legs stress a Bengals front that’s been leaky against sustained drives. Baltimore also profiles as a classic bounce-back team: they win in the margins (field position, penalties, situational calls), and they’re built to travel with a physical identity that holds up outdoors in December. +5.5 gives us protection against early swings and late-game chaos while aligning with the deeper signal the number is sending. The public can have the Bengals; the favorite on the road is there for a reason—even after that home loss. Baltimore still averages 5.6 yards per play to the bengals 6.3 yards per play allowed and the raves have a 37% third down conversion rate to the bengals 47% rate allowed. Derrick Henry and co have also averaged 5.2 yards per carry and the bengals are near the bottom of the league in yards per rush. Let not forget the ravens also turned it over a ridiculous 6 TIMES on Christmas including a fumble in the endzone resulting in a touchback which completely changed the course of that game. And the total still reached 46 despite these stalled drives which brings me to my next point…\n\nover 44.5\n\nThis total sets up as a game-state mover. Both teams have paths to explosives: Baltimore can create chunk plays off play-action and quarterback runs, while Cincinnati forces tempo through its passing game and red-zone aggression. The Bengals’ defense has been vulnerable to breakdowns at the second level and coverage busts when forced to defend extended plays; Baltimore can punish that with designed movement and layered route concepts. On the other side, Cincinnati’s offense isn’t shy about pressing downfield and is capable of quick-strike scoring, which naturally lifts possessions and snaps. In a rematch, you also get built-in adjustments—more scripted answers early, more fourth-down aggression late, and fewer conservative punts (especially with two teams with little to lose)—which tends to add points. Dropping the total to an alternate 44.5 captures the volatility and raises the floor: even if one offense stalls for a quarter, a couple of explosive drives plus short fields can still push this over the number. The bengals have also allowed a ridiculous 26 points per game over their last 3 and 31 per game on the year compared with a league low 61% allowed red zone scoring percentage for touchdowns. And the ravens did allow a ton of yards to the Steelers last game despite holding them to multiple field goals. But I’m not so sure the bengals will be settling for as many in the red zone tomorrow.\n\nThe ravens are favored for a reason tomorrow and I like getting them over 5. And I believe this will go over 44.5 comfortably.\n\nLet’s continue our streak. As always, cheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntwqsk8/"
    },
    {
      "created_utc": 1765676060.0,
      "author": "Ghost_eggs",
      "text": "**POTD Record:** 2-0\n\n**✅✅**\n\n**Net Units:** \\+4.26\n\n**Previous Pick:** Jalen Brunson 30+ points (-104 on DK); 2 units **✅**\n\n**Today's Pick:** NBA 🏀 Philadelphia 76ers @ Atlanta Hawks (3:00pm PST)\n\nJalen Johnson o 18.5 R+A (-114 on DK); 3 units\n\nAnother sweat-free cover, Brunson comes out aggressive with 25 points in 1H, reaching 30 just a couple minutes into 3Q. \n\nToday I'm going with another Jalen, who has flourished this season without Trae Young and turned into a triple-double machine. \n\nJJ is over this line in 9 of L10 (and six games straight without KP), just as a general trend. But I like this spot in particular. \n\nFirst, Hawks are poised for a bounce-back at home after getting blown out by the Pistons by almost 30. The last time the Hawks got embarrassed like that against the Wizards, JJ came back with 24 R+A in the following game. \n\nSecond, 76ers give up 3rd most rebounds to the PF position so far this season. Although they don't rank quite as high in assists given to opposing PFs, they do give up 8th most assist to opposing teams overall, many of which should go to JJ as ATL's assist leader. \n\nThird, this should promise to be another close game, so blow-out threat is limited. \n\nI should caution that in their only matchup against PHI this season, JJ did cover the line but only because the game went to OT (had not yet covered by end of regulation). However, now playing at home in a bounce-back spot, I'll back the trend on JJ's R+A line.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntwq7sx/"
    },
    {
      "created_utc": 1765673791.0,
      "author": "Square-Johnson",
      "text": "Record: 11-5 +12.45\n\nForm: 💰❌💰❌💰💰💰💰💰💰💰❌❌❌💰💰\n\nRecent pick: Andrew “Brown Finger” Gilding to WIN vs Cameron “I have 🦀’s” Crabtree @ -120 for 3u to win 2.5u on FD 💰\n\nEvent: PDC World Championship 1:15pm est\n\n“UNDERDOG ALERT” 🚨🚨🚨 Pick: Lukas Wenig to WIN vs Wesley Plaisier @ +112 for 2u to win 2.24u\n\nReasoning/ Writeup: I’ll start off with apologizing to Ned “Chili Dog” Peppers, I didn’t mean to dog you, I have respect for you and I’ve tailed you multiple times. Please, forgive me father, for I have sinned… now that I got that off my chest….\n\nTomorrow, Lukas Wenig feels like a really solid pick here, especially with what he’s put together this year. He’s had a proper breakout stretch in 2025…quarter-final run at the Grand Slam, some strong Euro Tour appearances, and a steady climb up the rankings that shows he’s doing it week in and week out, not just in flashes. His game has been sitting around the low-to-mid 90s, with doubling generally in the high-30% which should be plenty to get past the fist round at Ally Pally. He’s also been comfortable in short formats, which is huge in a best-of-five where you don’t get much time to settle.\n\nWhat really sells Wenig is how he hasn’t been panicking when things done go his way( gets broken, etc.. he scores solidly without needing to go crazy, and tends to take his chances when looks at a double come. On the big stage this season he’s shown he belongs, and that confidence matters a lot under World Championship chaos. If he turns up anywhere near his usual level, keeps the scoring ticking and doesn’t miss sitters, Wenig’s got all the tools to get the job done and book his spot in round two. And at plus odds I like putting 2 units down.\n\nAs always best of luck! Bet or fade responsibly, and let’s fling on!!\n\nhttps://preview.redd.it/eh6joowoi27g1.jpeg?width=960&format=pjpg&auto=webp&s=7932f9edfa68c8d915d4d2a53a83b5df2287fb1d",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntwke9k/"
    },
    {
      "created_utc": 1765672943.0,
      "author": "Substantial-Pay-4591",
      "text": "POTD Record 7-5 (+2.02u)\n\nSaturday’s Pick - Dallas Stars -1.5 +180 (1u to win 1.8u)\n\nSunday’s Pick - Puka Nacua longest reception o27.5 yards -120 (1.2u to win 1u)\n\nPuka is just so consistent. He’s been able to hit this in his last 3 games and he’s going up against a banged up Lions secondary that gives up a lot of big plays. With such a high over under, the game is expected to be a shootout with lots of opportunities for Puka to break off a long one. \n\nGood luck!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntwi4z0/"
    },
    {
      "created_utc": 1765672199.0,
      "author": "Fair-Asparagus-9264",
      "text": "Record: 3-3 (-2.36u)\n\nLast Previous - NFL  - Chase Brown + James Cook Over 150 yards Rushing (-138) 3U L\n\nPOTD: Lions at Rams NFL 16:25pm (EST) **Stafford + Goff over 525 yards passing (-137) 5U**\n\nHuge game with massive playoff implications featuring two of the best offenses in the league. O/U is 54.5 and everyone is expecting points. I don't foresee Dan Campbell punting unless its 4th and 20+\n\nGoff (3334) and Stafford (3354) have the 4th and 5th most passing yards in 2025. Rams give up 230/game while Lions are closer to 240 - both worse than middle of the pack but importantly for this game way both worse than their run defenses (where they each give up less than 80 yards/game).\n\nI can see both offenses marching up and down the field on long yardage drives picking up large chunks scoring quickly and often. Whoever is behind in the late 3rd-4th quarter will, I predict have a 300+ yard passing game - the problem is we cant be certain who that will be. Hence the combined yardage bet. If one of these passers gets close to 300 all the other needs is 225 which is very very doable with either set of receivers. I'm personally laddering this up to 550/575/600 the way I did the Cousins/Mayfield game on TNF (they eventually combined for 650 yards in that game).\n\nYou can find this bet on Draftkings under Passing -->Combined Passing Yards **Goff+Stafford 525+ yards** or if you want a little better juice under H2H-->pass yards over 535.5 (-112). BOL if Tailing.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntwg5pj/"
    },
    {
      "created_utc": 1765671583.0,
      "author": "dreamchasing1",
      "text": "Record: 240-222 Net Units: -23.10 54-54 on 1.5u plays, 39-41 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Israel Liga HaAl] Ashdod vs Hapoel Jerusalem\nLast pick: BTTS @ 1.80 - 2 Units loss\n\n\nEvent: Soccer/Football, [English Premier League] West Ham vs Aston Villa\n\n\nPick: total corners over 10.5 @ 2.10\n\n\nWest ham get an average 6.30 corners for them at home and have averaged a 13 total this season, covering in 6/7 home games. In general, they've covered in 12/15 matches so a great team for corners. Villa average 5 for and around 10 total in away games, covering in 5/7 games away this season. Villa failed to cover vs Leeds and Liverpool in away games, Leeds - the worst matchup for corners, Liverpool around average.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntweik4/"
    },
    {
      "created_utc": 1765670141.0,
      "author": "Dmyers9099",
      "text": "Record: 2-1 (+0.77)\n\nPrevious: Navy 210+ rushing yards ❌\n\nEvent: ⚽️ Pescara v Frosinone (Italy Serie B) 11:15am EST\n\nPOTD: Frosinone ML -125\n\nFrosinone visits Pescara tomorrow for league play. They currently sit at the top of the league table with a goal differential of +16 while Pescara sits dead last at 20th with a differential of -11.\n\nFrosinone have won 5 of their last 6 including 3 away games. Pescara have lost 3 of their last 5 including their last 2 home games.\n\nIn the last 5 matches, Frosinone have scored 11 goals and allowed 4. Pescara have only scored 4 while allowing 12.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntwap7u/"
    },
    {
      "created_utc": 1765669827.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 13-8-1 \n\nStreak: 2W ✅\n\nNet units: +3.16u All bets are 1 unit.\n\nLast POTD 12/11/25: Bijan Robinson O35.5 receiving yards (-115 Bet365) ✅\n\nToday's POTD 12/14/25: D'andre Swift rushing attempts O12.5 (-102 FanDuel)\n\nEvent: Browns @ Bears 11:00MST\n\nWrite Up: D'andre Swift and the Bears run heavy offense will be looking to pound the rock against this banged up Cleveland interior line in this frigid and windy matchup.\n\nThe Cleveland Browns just recently placed their DT Maliek Collins on IR last week and just gave up a stellar rushing performance to the 2nd worst rushing team, Tennessee Titans. Tony Pollard rushed the ball 25 times in that game and continually carved the Browns defense through 4 quarters.\n\nIt's going to be a freezing cold and windy day in Chicago. Given the conditions and the offensive tendencies for both teams, this has all the makings for a run heavy contest. The winds will be expected to be between 10-20MPH with a wind-chill below 0°. With these conditions, it makes it difficult for any team to be able to find any consistency through the air. This Chicago offense is built for cold weather and will be content winning this game in the trenches.\n\nD'andre Swift has hit this line in 9/12 games this year and averages 14.4 carries per game. I expect Swift and Monangai to split carries throughout this game. But I predict both players will each be given over a dozen opportunities to run the ball.\n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntw9v49/"
    },
    {
      "created_utc": 1765669703.0,
      "author": "JoeInglesOfficial",
      "text": "\n__POTD Record:__ 63-30-1 (+73.25u)\n\n__Previous Pick:__ [✅ Army TT o14.5 (-120), 3.6u](https://www.reddit.com/r/sportsbook/s/wtraTTsmLv)\n\n__Event:__ NFL: Cardinals @ Texans 1pm EST\n\n__POTD:__ Nico Collins o73.5 receiving yards (-115), 3.45u to win 3u\n\n__*Update: 28 yard reception to cash it called back in the 2nd quarter on an illegal formation penalty. Brutal.__\n\n__Write Up:__ The (3-10) Arizona Cardinals are traveling to Houston to take on the (8-5) Texans on Sunday. We have 2 teams trending in completely different directions. The Cardinals come into this matchup having lost 5 straight games & sit in last place in the NFC West. The Texans have won 6 of their last 7 games, including 5 straight & are battling for the divisional title in the AFC South, 1 game behind the Jags.\n\nNico has had 75+ yards in 5 of his last 6 games. He is averaging 100.4 yards over his last 5 games. In that span he has had 40% of Texans air yards (11th among WR’s), 27% of Houston’s targets (WR11), & has averaged 2.66 yards per route run (4th among WR’s). Arizona’s defense runs Cover 3 & Cover 4 over 50% of their snaps. Collins has lit up those coverages for 2.6 yards per route run. Arizona secondary is banged up missing some key guys, with outside CB Max Melton not practicing this week, as well as 2 safeties including Jalen Thompson. Arizona’s defense has a 51.5% success rate defending passing plays, 3rd worst in the NFL. Arizona ranks 27th in PFF's defense grade & 23rd in defensive EPA. In their last 5 games Arizona has allowed a 68.5% completion rate (3rd most in the NFL), 8.7 yards per pass (most in NFL), 8.7% TD rate (most), & allowed a 15.2 yards per catch to opposing WR’s (most). They just allowed Puka Nacua to go off for 7 catches for 167 yards last week. Arizona has allowed 2.60 points per drive over their past 7 games, 29th in the NFL. Now they face a Houston offense that is a home favorite with their highest Vegas total of the year (26 ppg), while Arizona allows 26.8 ppg (26th). CJ Stroud averages nearly 40 more passing yards at home vs away the last 2 years, his home/away splits are unbelievable. 2 completely different QB’s. This has naturally led to Nico Collins to performing better at home compared to away. Nico averaged 16.54 yards per catch at home, 3rd most among players with 20+ receptions. He has had 7 catches for 20+ yards at home in 5 games. On the road he averages 2.51 yards less at 14.03. In the CJ Stroud Era, Collins has averaged 5 catches for 84 yards at home compared to 4 catches for 66 yards on the road. He has been on fire lately, earning 10+ targets in 5 of his last 7 games. He had 121 yards last week & it could’ve easily been 180 if Stroud didn’t underthrow him on a deep ball. The Texans RB’s Woody Marks & Nick Chubb are banged up so that could also force the Texans to lean more heavily on Collins & the passing game in a crucial game for their playoff hopes. In a vertical offense vs a weak injured defense I think Stroud peppers him again. Even if the Texans take a lead, they’ve still continued to target him in the past. Arizona may even keep it close, they are 5-1 against the spread on the road (2nd) compared to a league worst 1-6 ATS at home. Arizona passes it the 2nd most in the league on 65.33% of their plays, while will lead to more Texans possessions. Houston is projected to run 63.5 plays this week, 3rd most in the NFL. They average 64.5 (7th most). This all benefits Collins. Think he may break 100 this game again.\n\n__Nico Collins over 73.5 receiving yards__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial)  [PayPal](https://paypal.me/joeinglesofficial)  [Bitcoin](https://pastebin.com/raw/GEXAsA2S)  [Venmo](http://Venmo.com/mackenzie-botz-1)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntw9jae/"
    },
    {
      "created_utc": 1765668685.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 12-9-1 (Avg Odds +129)\n\n**Previous Pick:** Bukayo Saka 2+ SOT (+110) ❌️\n\n**Today's Event:** English Premier League | Crystal Palace vs Man City (6:00 AM PST)\n\n**Pick:** Haaland ATGS and 2+ SOT (+110) 1.0 unit to win 1.1 units ✅️\n\n**Write Up:** Fairly unlucky match for us as Arsenal simply fell flat. Lots of forced passes over the top and wildly off target shots, rather than smooth buildup play. Saka got the whole match as expected and created both Arsenal goals, but it wasn't enough. We move on. \n\nWe revisit our Wednesday pick today as Man City visit Crystal Palace. I'm a firm believer in if it ain't broke, dont fix it. We're getting this play again at plus money and the odds are too good to skip. Haaland has had a monster start to the season, netting\n15 goals in 15 EPL matches. He has come back to life after a minor downturn (by his standards), netting in 2 of his last 3 in all comps. He also scored and had 2 + SOTs in this fixture in each of the last 3 seasons. \n\nPalace have had a great start to the season as well and currently sit in 5th. They have allowed the 2nd fewest goals in the EPL this season, just 12 in 15 matches. We've got a case of the unstoppable force meets the immovable object, as City are the league top scorers with 35 goals. We're getting the odds we are here because of Palace's defensive record, but I just dont see them keeping Haaland out. \n\nToday we right the ship and start the next winning streak, BOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntw6sxl/"
    },
    {
      "created_utc": 1765668536.0,
      "author": "Background_Law8395",
      "text": "**Record**: 3-1 (+3.65u)\n\n**Last picks**: Borussia Monchengladbach ML (+100) vs. Wolfsburg 3u ❎\n\nReally unlucky outcome today. As someone who's watched both of these play at least 3 times this season, this was by far the best I've seen Wolfsburg play and by far the worst I've seen Gladbach play. With that being said to all the nice people on this sub I do apologize for the loss here. At the end of the day we're gambling, not generating free money. Not gonna trip over 1 loss. Anyways, to the important stuff...\n\n**Event**: English Premier League: Crystal Palace vs. Manchester City 6:00am PST\n\n**POTD**: Manchester City ML (-118) 2u ✅\n\n**Write up:**\n\nManchester City started off the season pretty rocky but have finally found their form as of late. Coming off a massive 1-2 win over Real Madrid and a nice 3-0 against Sunderland on the weekend, City have been rolling recently. After the result of the Arsenal game today, City and Pep know that tomorrow is a must win game if they want to raise the trophy this year. City haven't been great away from home in the Prem this season, being 3-1-3. With that being said, 2 of the losses came against Villa and Newcastle who are third and fifth in home games this season respectively. City are 4-0-1 in their last 5 premier league games with a goal difference of +7. Palace have given City a lot of trouble the past few years but as someone who's watched all of those games, it was ALWAYS because of Eze. \n\nPalace have been deceivingly good this season, sitting 5th place as of now. With that being said, their only real competition so far this season was Aston Villa (before they got good again). Palace sit 15th in the table at home this season, with a home record of just 2-4-1 and a goal difference of +2. Palace are also missing quite a few key players (Muñoz being the most prominent) and I see Haaland absolutely thrashing that back line without him. Palace have only beat Brentford and Liverpool at home, two pretty poor teams this year. \n\nAssuming City start the same lineup they've gone with the last 2 games, their attacking threat will be too much for a Palace backline missing one of their best players. Assuming Haaland, Doku, Cherki, and Foden all start, I wouldn't be surprised if they score 3 or 4 against this Palace team. In their last 5 games away at Crystal Palace, City are 2-2-1. Again, this Palace team is very very different without Eze and I don't see them performing the same way they have in the past. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntw6ehz/"
    },
    {
      "created_utc": 1765668478.0,
      "author": "tennisfanatic101",
      "text": "💎POTD: Buffalo Bills Moneyline\nOdds: -118 on FanDuel\nWager: 2.5 Units\n\nRecord: 4-3\nNet Units: -.17\n\n🏈 NFL, Bills at Patriots, 12/14/25 Sun, 1 pm Eastern Time\n\nExplanation: The Bills can beat the Patriots tomorrow because Buffalo’s offense has been consistently more explosive and efficient than New England’s, and that matters a lot in a game where the market expects scoring. Buffalo is averaging 28.9 points per game (5th in the NFL), while New England is scoring 27.0 points per game.\n\nMore importantly though is that Buffalo is one of the league’s best in efficiency (about +0.13 EPA/play) , and with Josh Allen producing 3,083 yards, 22 TD, and a strong completion rate, plus James Cook over 1,300 rushing yards, that can be a problem for the Patriots. \n\nBuffalo’s offense has been strong against more “normal” competition, and the Patriots have had a soft schedule, so don’t let the 11-2 record fool you. They’re a good team, but don’t let it fool you.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntw68yj/"
    },
    {
      "created_utc": 1765667988.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Sunday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1plz03x/pick_of_the_day_121425_sunday/ntw4y4k/"
    }
  ]
}