{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 11/20/25 (Thursday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/",
  "target_date": "2025-11-20",
  "timezone": "America/Chicago",
  "collected_utc": "2025-11-20T16:19:38.102591+00:00",
  "comments": [
    {
      "created_utc": 1763655158.0,
      "author": "EthicalGambler",
      "text": "#*I am tracking cappers who post in these threads and will continue to do so for the foreseeable future. [Here is the new document which started tracking 09/01/25](https://www.potd.lol/today?utm_source=redditpost).*\n\n**My Record:** 68-60-3 (-2.80u)\n\n**Today’s Pick:** Rienk Mast o15.5 points (New Mexico vs Nebraska)\n\n**Odds:** -125\n\n**Units:** 2.5u\n\nTip off is 4:00pm PST. Today the 4-0 Cornhuskers are facing the 3-1 Lobos in this in-season NCAA Hall of Fame Classic tournament game. \n\nRienk Mast is one of the more exciting college vets to watch this season. The Dutch big man has been lighting it up by shooting 53.3% from 3. It's another case of a center who masquerades as a point guard. \n\nThe Lobos do not guard well against teams that have a winning record. They allowed UC Riverside shoot over 50% from the 3 point line. Meanwhile Mast seems to thrive when facing top teams. He put up 26, in the most recent game, vs the now 2-2 Oklahoma Sooners.\n\nSince there is a lot on the line for this match - namely the tournament and their perfect 4-0 record) I expect to see the Dutchman going off quickly. \n\n**Previous Pick**: Svi Mykhailiuk o1.5 three points made (Hawks vs Jazz) ❌\n\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/EthicalGambler-U6cnjV?utm_source=mdembed&utm_campaign=EthicalGambler) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npv4o6d/"
    },
    {
      "created_utc": 1763654650.0,
      "author": "taj4y8",
      "text": "**POTD Record:**  **2-1 (But its been over a year since my last post here)**\n\n**Previous Pick:** N/A\n\n**Event:** NBA: Kings @ Grizz\n\n**POTD:** Cedric Coward o16.5 PTS -114 (1u)\n\n**Write Up:** With Ja still out and JJJ doubtful for tonight, the upstart rookie will most likely be the center of the Grizz offense.  He hit this number in the previous game against the spurs with a hobbled JJJ still playing. The Kings defense is some of the worst in the league and their front court doesn't move mountains either. \n\nI also like his PRA number of 26.5 but that's only if Sabonis doesn't suit up again tonight.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npv2w5y/"
    },
    {
      "created_utc": 1763652040.0,
      "author": "Immediate_Yam_9331",
      "text": "Davis mills O 8.5 rushing yards, free",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nputxex/"
    },
    {
      "created_utc": 1763651877.0,
      "author": "Emergency-Set-7661",
      "text": "This may be the most beautiful parlay ever constructed\n\nhttps://preview.redd.it/wgfkq87iif2g1.jpeg?width=1179&format=pjpg&auto=webp&s=1b28c8a4e92a2c8e42bc3e02204f56202f7e7d2d",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nputdwo/"
    },
    {
      "created_utc": 1763649576.0,
      "author": "JK18207",
      "text": "Record: 1-0\nNet Units: +0.77\nROI: 76.92%\n\nPrevious Pick: ✅Alperen Sengun (Rockets) O16.5 Rebounds + Assists @ -130. 1U\n\n\nToday’s POTD: James Harden (Clippers) O26.5 Points @ -114. 1U\n\n\nWrite Up: He has a great matchup today, the Magic allow 28 points per game to opposing point guards. Harden has gone over this mark in 4 of his last 5 games while averaging 32.8 points per game. In his last 10 games he has averaged 27.5 points per game. He averages 26.2 points per game on the season so we are just asking him to perform slightly better than his average. No Kawhi and no Beal to eat into his touches and production. He has been averaging almost 40 mins per game in his last 5, while averaging 22 shot attempts. Throw in the fact that he’s been getting to the free throw line over 10 times per game in his last 4 games. Between his matchup today, his recent volume and production, I like James Harden to score some points.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npum08i/"
    },
    {
      "created_utc": 1763648560.0,
      "author": "Laird87",
      "text": "POTD Record: 207-202, -69.91 Units\n\nCurrent streak: ❌\n\nLast 10: ❌✅❌❌✅❌❌✅❌✅\n\nLast Pick: Penn State -9.5❌❌\n\nYou just can't depend on college kids for much these days.\n\nToday's Pick: 2 Pick Parlay:  Atlanta Hawks +7.5 (-272) and Detroit Red Wings +1.5 (-360), -135 Combined Odds, 8:00 and 7:10 PM EST starts, respectively, 1 Unit\n\nFirst time trying a parlay today and I like both of these teams to win outright.  The Spurs still held strong without Wemby but the Hawks have been really good on the road.  Detroit is a weird team this year and the Islanders have some good wins in their pocket but their win streak cooled off in Colorado and they have to be somewhat tired after bouncing around the Western Conference stopping in Vegas, Utah, Colorado and Dallas.  \n\nBOL, tail or fade! Tip Jar: [buymeacoffee.com/lairdsports](http://buymeacoffee.com/lairdsports)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npuiy1s/"
    },
    {
      "created_utc": 1763648136.0,
      "author": "kab1218",
      "text": "POTD 0-3\n\nNet: -3u\n\nLast picks: Greece ML (v Belarus) + Holy Cross +3.5 (v Brown)\n\nGreece had something like 13+ shots, just couldn’t convert. Holy Cross got blown out. We move on. \n\nToday: Orlando Magic -2.5 (v Clippers)\n1Unit @ -180\n\nClippers have been on the road for 3 games, losing them all. I don’t see anything different happening here. Magic have won 4 of their last 5, 3 of those being at home. Just keeping it simple. \n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npuhnnf/"
    },
    {
      "created_utc": 1763641511.0,
      "author": "ThatCherry7173",
      "text": "Record: 12-2\n\nNet units: +11.85\n\nOdds: -142\n\nSports: American football and Basketball\n\nLeagues: NFL and NBA\n\nTime: 7:15 PM Central and 6:00 PM Central\n\nPick: Buffalo Bills ML and Orlando Magic +4.5\n\nBet 1 unit to win .7 units\n\nWhy: Bills should win this game but it may be close. Texans have a good defensive presence but they're missing CJ shroud this game. I'm hoping the Bills take advantage of scoring opportunities and walk away with the win. This game will absolutely be a dog fight.\n\nThe Magic are doing surprisingly well right now. They've won 4 out of their last 5 and they're getting contributions from Desmond bane, Wagner, and a few key pieces off the bench. The clippers on the other hand are shorthanded. They're struggling to create an offense outside of James Harden. My gut tells me to take Magic ML (and not the teased spread) - but this is my 'lesser' confidence pick of the two, so I teased it to +4.5 but you absolutely don't have to. Just try to assess the risk/line offered and you should be okay :) \n\nbest of luck if tailing.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nptzsvm/"
    },
    {
      "created_utc": 1763641389.0,
      "author": "AK24AK24",
      "text": "***Record:*** 7-1\n\n***Last Pick:*** (Win) Bennedict Mathurn +2.5 pts vs LaMelo Ball (Draftkings -123)\n\nThis one wasn't really even close. Ball was awful all night lol\n\n***Today's Pick:*** Joel Embiid -1.5 pts vs Myles Turner (Draftkings -117)\n\n***Reason:*** This line is so close because Giannis is out tonight and they expect Turner to be more of a scorer in his absence, however Turner has not impressed me this year. Embiid is averaging 19.7pts in the 6 games since his return and Turner is averaging 12.3pts. Embiid is still on limited minutes, but he's still had 20 or more points in the last 5 games. Myles Turner has only had two 20+ pt games all season.. If Embiid can shoot the ball just halfway decent tonight, I think this will be a pretty easy win. GL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nptzisu/"
    },
    {
      "created_utc": 1763640714.0,
      "author": "colourfulpotato30",
      "text": "POTD Record: 12-14-1 (W-L-P)\n\n(oldest) WLWLWWWLLLLLWWWLWLLWLWLLPWL (newest)\n\nLast Pick: Texas TT u21.5 @ 1.90 2U L\n\nEvent: NBA Sacramento Kings @ Memphis Grizzlies\n\nPick: Sacramento Kings ML 2U @ 2.20\n\nPivoting over to the NBA to a scene I'm more familiar with and taking the Kings over the Grizzlies. We have 2 of the worst teams in the league going head to head, and a line which I don't quite understand, but see tremendous value in. Both teams have lost 5 straight so not much to go from there. Kings have Sabonis as probably for the game as well as possibly having Keegan Murray back from a thumb injury. On the other hand, Grizzlies are going to be very short handed. No Small, Clarke, Jerome and importantly Morant who are all sidelined due to injury as well as possibly Jaren Jackson Jr who is currently listed as doubtful for the game as well due to an ankle sprain. Going from that alone you get rookie Cedric Coward being the top player currently active for the Grizzlies for the game. As well as he has been playing, I don't see how he can take the Grizzlies over the Kings. On that note as well, the Kings have also been horrendous, but the amount of firepower and quality of players on their roster is night and day. While their offense is nothing short of disastrous at the moment the difference in talent should carry them over a very short handed memphis team. \n\nTail or fade your choice not mine.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npty0tg/"
    },
    {
      "created_utc": 1763636306.0,
      "author": "Vet100",
      "text": "Record: 17-10\n\nNet Units: +5.10\n\nROI: 18.9%\n\nPick: NBA 76ers v Magic \n\n1U Embiid O17.5 points @ $1.87, Sportsbet (Aus) \n\nWrite-Up: People hate betting on Embiid, but this year he’s been solid money. Cleared his points line 5/6 and his 1st quarter points line 4/6. He’s still reliable, but you just adjust to him playing 23-25 minutes a game. Not asking for 30 points! \n\nHe’s gone 20, 25, 20, 20, 29 since his terrible season opener, going for 114 points in 120 minutes in those 5 games. So barring an injury/fall that limits him to sub 17 minutes, he should get this at more or less a point a minute rate. \n\nI think maybe he’s rusty early as he’s missed the last few games so I’ve gone away from the 1Q bet and think as the game develops he can blow off some cobwebs. \n\nOn the match-up, Giannis is out. So he’ll have Portis & Turner largely to deal with. Don’t mind that at all",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nptpckw/"
    },
    {
      "created_utc": 1763628538.0,
      "author": "donjavogosca",
      "text": "**POTD Record:** 8-2, +5.8u\n\n**Previous Pick:** Cedevita to win by 17 or more, 1.84, 1u ✅️, (last 5: ❌❌✅✅✅)\n\n**Event:** Euroleague: Panathinaikos - Dubai, 20:15\n\n**POTD:** Panathinaikos to win by 8 or more, 1.81, 1u\n\nThe spread is set to a bit higher limit than I would like, but it should still be doable.\n\nPanathinaikos has it warm-cold since the beginning of the season, with injuries of Yurtseven, Lessort, and Holmes it is expected, but it looks like coach Ataman adjusted and found his mojo again.\n\n4 straight wins, 2 of those in Euroleague and both in away games against Real Madrid and Paris are a good sign that Pao is back. Currently, they are rotating 8 players, all of whom are really good and experienced EL players.\n\nI watched Dubai in the ABA league the other day against FMP, and I wasn't impressed. They still need a few months at least to get things in order. When Musa is not playing - injured, it is unclear who is the top player. Not sure if they play, but questionably absent are also Kabengele and Avramovic - the two best players against Zalgiris in their last home win.\n\nThey also have some great players, but they are not quite there just yet.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nptcj0c/"
    },
    {
      "created_utc": 1763627723.0,
      "author": "Ralphjinasseater",
      "text": "Record 6-5-2\n\nLast pick: Bennedict Mathurin OVER 19.5 Points (-120 HR) ✅\n\nCategory:🏀⛹️basketball NBA\n\nPick of the Day: James Harden under 8.5 Assists(-119 DK)\n\nBeal, Kawhi and Derrick Jones are all OUT here and Harden has gone under this line in 4/6 starts this season WITHOUT Beal and Kawhi.\n\nNow Harden faces the Magic, who allow the 3rd LEAST total assists and the 6th LEAST assists to opposing PGs.\n\nWithout Kawhi, Beal and Jones we have seen Harden see a huge increase in points and FGA and a decrease in playmaking and assists, I expect that to stay the same here especially against a defense that allows the 3rd MOST points to PGs and ranks 7th WORST defensively versus PnR Ball Handlers.\n\nHarden get’s a combined 60% of his assists from the RA and ATB 3’s, where the Magic rank 2nd BEST and 10th BEST defensively.\n\nhttps://preview.redd.it/hj5fambnid2g1.jpeg?width=1170&format=pjpg&auto=webp&s=8289106afeb17b98f2874edc69545364294b3ff6",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nptb831/"
    },
    {
      "created_utc": 1763626594.0,
      "author": "PrisonPicksLCKNASOCK",
      "text": "POTD RECORD 2-4 (+0)\nLast pick Abuwhateverthefuck vs Fail…Loss\nErhard -160 v Fellin ML +120🔒 🎾 \n1unit=$100  4Am eastern \n\nSo basically both of these young players are pretty decent whipper snappers but when it comes down to it I believe Fellin is the better player on Hard courts with much more experience. I think he wins in 2 sets honestly and not to mention his name rhymes with Felon..so I have to go with the dog on this 1 guys lol.\n\nBeen awhile since I’ve posted but thought I’d try to get back on track with this pos pick…not much time to do a write up for u guys but here is your 🔒 of the day!!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npt9ek2/"
    },
    {
      "created_utc": 1763622704.0,
      "author": "OliveCritical5134",
      "text": "**Record: 23-14**\n\n❌❌✅✅✅✅✅✅✅❌✅✅❌✅❌❌✅✅✅❌✅✅❌❌❌❌✅✅✅✅✅❌❌✅✅✅❌\n\n**Sport:** ⚽ / UEFA Women's Champions League / PSG (W) v Bayern (W)\n\n**Net Units/ROI:** \\+25.93u / 28.18%\n\n**Previous Pick:** *OL Lyoness to win + over 2.5 goals @ 1.53 -- 3 units ❌*\n\n**Summary:** What rollercoaster, OL screwed us from the getgo going 3-0 down in the first half when Juve was just clinical, but they almost came back..\n\n**Today's Pick:** *Bayern Munich (W) to win or draw + over 1.5 goals @ 1.57 -- 2 units*\n\n**Write up:**\n\n**PSG (W) v Bayern Munich (W) (20.00 GMT)**\n\nBayern is a pretty decent team and only lost to Barcelona so far this season. PSG also have had to face some difficult opponents so far: Wolfsburg, Real Madrid & Manchester United. But the thing is, Bayern is an opponent that we can scale at that same level of difficulty as those three teams and I don't see PSG getting a result here either and even if they do manage to get a draw, we still cover it with this pick.\n\nThere's also only been 3 games so far in Bayern's season where there were less then 3 goals. And we only need 2.\n\n**Best of luck if tailing!** 🍀\n\n**PS:** If you want you can check my record and units won on [https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ](https://www.potd.lol/handicapper/OliveCritical5134-qXXxJZ)\n\nIf you're enjoying the picks and write ups and are looking to support me you could do so here: [buymeacoffee.com/olivecritical5134](http://buymeacoffee.com/olivecritical5134)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npt2ujf/"
    },
    {
      "created_utc": 1763621259.0,
      "author": "jaysial",
      "text": "Cricket 🏏 Picks\n\nLast pick was a Loss\n\nOverall: 43💰- 26 ❌\n\n+6.47\n\nLast 10: L W W L L L L W L W W\n\nTodays pick\n\nSri Lanka v Zimbabwe \n\nStarts in about 6 Hours\n\nPick: Total Run outs Over 0.5 @ 1.56\n\n* Zimbabwe last four matches had a run out in every inning.\n* Sri Lanka had a run out in each of last 2 innings\n* Both teams are prone to batting collapses which often create chances for a run out",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npt0alj/"
    },
    {
      "created_utc": 1763621076.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 173-129\n\nSeason record: 10-6\n\nLast POTD: __Bennedict Mathurin 20+ Points @1.83 1U__ ✅\n\nToday’s POTD: __Jalen Suggs O4.5 AST @1.86 1U (Bet365)__\n\nNBA | Clippers vs Magic | 🏀  \n\nMathurin feasted yet again and has now cleared his points line every game this season, what a stud. 5-1 run\n\nClippers is a top matchup for guards to get their assists allowing MOST assists in the NBA to opposing PG’s. Paolo Banchero is still out for the Magic, which has led to Suggs taking a bigger facilitator role for this offense and has now gone over in 2/2 games without him so far this season with 6 & 8 assists on 12 & 11 potentials. In the last two games, Suggs is leading the team in Assists avg (8.0) and potentials (11.0) aswell as assists pts created (22.0), with that his minutes has increased aswell from his earlier minute limit logging 28 and 32 minutes avg 30.1 mpg compared to 21.4 mpg early on the season.\n\nAs I mentioned gets a top tier matchup to continue with his role of setting guys up, got good options in both Wagner and Bane to get the buckets against a recently poor defense without Kawhi & DJJ.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npszyfh/"
    },
    {
      "created_utc": 1763618655.0,
      "author": "Moist_Incident_3085",
      "text": "Overall record 23W-12L\n\nUnits: +6.43 (All picks are 1 unit)\n\nLast pick: Delaware ML + Islam Makhachev ML (-142) ❌\n\nIslam took care of business in a dominant showing with 19 minutes of control time in a decision win but Delaware somehow choked almost as hard as Oregon State did vs Sam Houston. They started the game 10-0 then forgot how to play the game, what's even worse is they crawled back and had a chance to win but just choked it but we move on.\n\nToday's match: Milwaukee Bucks vs Philadelphia 76ers (NBA)\n\nPick: Sixers ML (-125, Draftkings)\n\nTwo POTD's ago we backed the Nuggets vs the Clippers in an oddly priced line where the Nuggets were playable on just the ML alone against a terrible Clippers team who were on a 5 game loss streak and 1-9 ATS. That was mainly because they were on a b2b and on the road but it still seemed weird because the Nuggets were just the far better team in better form winning their last 5 in a row fully healthy vs a Clippers team without Kawhi. The Nuggets ended up winning by 14 which admittedly was a bit sweaty until the third quarter where they just took off.\n\nTonight I see similar value in this Bucks vs Sixers game, the Bucks will be without Giannis and when he is off the floor the Bucks are statistically one of the worst teams in the NBA. The Sixers will be on the second leg of a b2b and will be the away team but will most likely get fresh legs from Paul George who sat Wednesdays game out. They could potentially also get Joel Embiid back but I am not as confident as I am in him suiting up as I am Paul George who was listed as out for rest. Embiid has been practicing with the team so there definitely is a possibility he could be good to go tomorrow but I am still taking this bet assuming he won't play. BOL and bet responsibly.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npsvhfb/"
    },
    {
      "created_utc": 1763617204.0,
      "author": "mrbiinky",
      "text": "POTD Record 0-0\n\nThis my first ever time doing this so here we go. \n\nNFL Bills vs Texans\n\nPick : 2u on Davis Mills over 32.5 pass attempts -130\n\n\nTexans don’t have a consistent run game and mills has been throwing the ball well and feeding Colins as well as Shultz. I expect the texans to be trailing most of this game and be aggressive at home causing Mills to throw the ball more.  He has had 40+ in his last two starts. Lets ride with mills pass attempts.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npssn6t/"
    },
    {
      "created_utc": 1763616121.0,
      "author": "GlassCoyote",
      "text": "Listen up, this is going to sound fucking stupid to some of you blokes and I’m not here to receive your financial advice. I need to generate $7,000 aud by January 15th to keep my side hustle alive and we’re going to do it the good old fashion way. \nPosting here as I need to have that pressurised accountability to ensure my picks are as optimised as possible. So enjoy the ride with me, if we pull this off, you’re all in my business’ documentary. \n\n1 unit = $100aud\n\nRecord 0-0-0\n\nLeg: English Football - League One\n- Peterborough (H) v Stockport (A) - 7:00am AEST\n\nPick: 1U - Stockport W @ $2.00 (don’t ask me for your American -18362 margins, down under we use real men dollarydoo’s) \n\nStockport were unlucky to not get the win in the last game between these two. Just one of those games where nothing would go right for them. This though should be another day in the office. If you wanted to be cheeky I’d even say 2-0 Stockport but I’m not a betting man.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npsqeeh/"
    },
    {
      "created_utc": 1763615359.0,
      "author": "Chevre_",
      "text": "First time posting, but been tailing some of you guys, hit a $3k parlay tonight and figure I would try my luck + try to give back. I've been winning on my own bets, but I'm newer to the scene so I'm open to feedback! Here goes:\n\n**Previous Pick: I'm new!**\n\n**POTD Record:** 0-0\n\n**Net Units:** N/A\n\n**ROI:** N/A\n\n**NBA | Spurs @ Hawks 8:00pm EDT**\n\n**Pick:** Kelden Johnson Rebounds O 6.5 (+101), 5 units\n\n**Write Up:** Spurs vs. Hawks have the highest rebound differential on the slate (SAS 4th highest at +5.6 and ATL 6th lowest at -4.2), so we should see more rebounds go the way of San Antonio. Additionally, Keldon Johnson has covered his rebound line in 4 out of the last 5 games, so I think the books are a little off on him. He also has cleared 6 rebounds in 6 out of his last 7 games, continuing to get more action since the beginning of the season. One of those games at 6+ was against Houston Rockets, who allow the fewest rebounds to their opponents in the NBA. Johnson is averaging 6.2 reb over the season, but his stats early season were terrible. Wemby is out (RIP), Castle is out. I think that this line at plus money is solid value.\n\n**Take Kelden Johnson O 6.5 Rebounds**\n\n*Please tail at your own risk and only ever wager what you can afford to lose.*",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npsorkd/"
    },
    {
      "created_utc": 1763614307.0,
      "author": "Dont_Tail_Me_Bro",
      "text": "Record: 7-10\n\nNet Units: -2.86u\n\nLast pick: Illinois -3.5 ❌\n\nNCAAB // Northern Kentucky Norse @ Central Michigan Chippewas\n\n**Pick: Central Michigan -4.5 (-115) 1u**\n\n  \nTime to get a little sick with the pick here as these are two very bad teams. Both come in at 2-2 on the year and both have atrocious KenPom numbers. Central Michigan's 2-2 is more attractive as it has come all against DI opposition whereas Northern Kentucky has yet to get on the board for a win against anything other than DII competition. Against their two legitimate teams Northern Kentucky shot poorly and also allowed a high FG% against them. N. Kentucky sits at 218th in FG% allowed at 44.14%. Northern Kentucky hasn't really looked competitive yet this season and I don't see that starting with a road game as underdogs.\n\n  \nCentral Michigan #273 in KenPom\n\nNorthern Kentucky #290 in KenPom\n\nCentral Michigan 3-1 ATS (2-0 at home) with an average margin of +2.4ppg.\n\nNorthern Kentucky 0-2 ATS (0-2 on the road) with an average margin of -8.8ppg. \n\n  \nPlease do not watch this game.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npsmfzr/"
    },
    {
      "created_utc": 1763614002.0,
      "author": "Flashy-Literature423",
      "text": "Record: 11-7-1\n\nUnits: +9.9u\n\nLast 10: ❌-❌-✅-❌-✅-✅-✅-✅-❌-❌\n\nLast Pick: [Donovan Mitchell Over 5.5 Ast (+111) Bet 2.5u to win 2.78u](https://www.reddit.com/r/sportsbook/s/tVYcjqyr48)❌\n\nCavs offense was horrible first half, Mitchell really wasn’t his normal self either. He decided to step up in the 4th Q with his scoring but that clearly doesn’t correlate to more dimes. On to the next.\n\nLA Clippers @ ORL Magic | 7PM EST\n\nNext Pick: **Franz Wagner Over 23.5 Pts** (-108) Bet 2.5u to Win 2.31u\n\nGoing back to Franz here as the matchup looks favorable for him to bounce back from. Last game he put up 18 pts on 7/17 shooting but that was against Draymond Green and the Warriors switching defense which really restricted his looks especially from deep. He also only attempted 4 free throws last game when he averages just over 7 with elite scoring at the line.  \n\nThe Clippers don’t have perimeter stoppers with Kawhi and Derrick Jones both sidelined so Wagner’s volume should up tick here. \n\nBanchero (Magics leading scorer) also remains out for this match up. Expecting Franz to bounce back giving the circumstances. \n\nIf tailing, only risk what you can afford to lose. Best of luck family!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npslrcq/"
    },
    {
      "created_utc": 1763613152.0,
      "author": "PurpleDragonBets",
      "text": "Record: (112-70-11) \\[+20.39\\]\n\nPOTD⭐️:🏈Bills -5.5 (-120) \\[Bet365\\]\n\nStart Time & TV: 8:15pm EST (Amazon)\n\nUnits: 3 Units\n\nReasoning: Going with the Buffalo Bills (7-3) over the Houston Texans (5-5) in this Thursday Night Football contest. The Bills are coming off an explosive offensive performance in their win over the Buccaneers where they put up 44 points. Josh Allen completely turned it around from his previous outing against the Dolphins and he ran for three touchdowns and threw for three touchdowns as well. When the Bills win, they typically win by at least a touchdown with 6 out of 7 of their wins coming by at least 7 points so I like them to cover this spread of -5.5 as they are playing the Texans who will be without CJ Stroud who is out with a concussion. The Texans are coming off a win against the leagues worst Tennessee Titans where they struggled to find any offensive rhythm and could not establish the run but they squeaked by with a walk off game winning field goal. I dont think this Texans offense led by Davis Mills will be able to keep up with this high powered Josh Allen led offense and the Texans get alot of talk about their strong defense but the Bills actually rank as the leagues highest pass defense only allowing 185 passing yards per game. I think the Bills will be able to establish the run game early with James Cook as they also have the leagues best rated run games as they average over 147 yards on the ground per contest and with Gabe Davis back in the lineup for Bills I think that opens up the pass game more for the Bills.\n\nPrediction: 31-20 Bills\n\nLast pick:🏈Notre Dame ML/Georgia ML💰Dawgs and the Irish dominated, love it.\n\nBest of luck to everyone tailing and remember to bet responsibly! If you have any questions or comments shoot me a DM I usually am able to respond to everyone on here!🍀💜🐉\n\nhttps://preview.redd.it/r0gkobucbc2g1.jpeg?width=1170&format=pjpg&auto=webp&s=e401daf50f6b753554e4c2a038188af4849f358a",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npsjuo7/"
    },
    {
      "created_utc": 1763607882.0,
      "author": "Pefkov",
      "text": "**Record:** 13-7\n\n**Net Units:** \\+5.56\n\n**Last Pick:** Cowboys @ Raiders both teams to make a 33 yard or longer field goal (-125 on DK) 1u to win 0.8u ✅\n\n**Todays Event**: 🏈 NFL Thursday Night Football Bills @ Texans 7:15 PM CST🏈\n\n**Todays pick**: Woody Marks 15+ Receiving yards (+126 on DK) 1u to win 1.26 U\n\n**Writeup:** Marks takes the RB1 position this week over Nick Chubb as the face Buffalo at home.  He has really been hammering his role as a dual threat up and coming rookie despite his receptions varying from game to game. He's played 80% of the offensive snaps last week and have been climbing since week 4. Marks averages 19 receiving yards with 1.6 receptions per game.  He averages 12.2 Yards/Reception with 12.1 average YAC and his line sits at 1.5 receptions for this game, at very decent odds (-156) for the over which he's bound to clear. The Bills tend to give half that at 6.0 YAC, which would still allow decent yardage to Marks.\n\n While I'm sure Marks will have his time to shine rushing the ball, he will get his share of receptions. Woody Marks averages 34.8 rushing yards he averages 3.5 yards per carry, (2.3 yards average after contact) which is still low. His line sits as 15.5 rush attempts. Now the Bills come up with the 31st ranked rushing defense in the league giving up an average of 153 rushing yards a game, a glaring hole filled with injuries. It would be a bigger concern if Texans didn't have one of if not the worst O-line in the NFL currently. Last week Marks still only managed 44 yards in 18 carries against a pretty bad Titans defense.\n\n Bills are favored to win with a spread of 6.  The Bills have been looking much healthier recently and showing that they're contenders after some ugly losses to the Dolphins and Falcons. While still going against a tough opponent like the #1 defense Texans, the Bills could still easily get an early lead, causing the Texans to reduce their run game in favor of the passing. If Allen looks anything like he did against the Bucs, this will be cemented. One thing to note is that running backs get around 23% of the total receptions against the Bills this year. With their ranked second passing defense, it's easy to see why.  Bills give up just under 4 receptions on average per game to running backs at 3.89, on an average of 4.9 targets. Chubb has been taking less of a dual threat role with the Texans, leading to Woody getting more targets.\n\nDavis Millis has been averaging just under 39 pass attempts per game not counting the blowout vs Baltimore where he was put in at garbage time. He is expected to pass more when playing in more competitive games which he has been. There will be no difference in competition in this Thursday night game as there has been with the Titans, Jags, and Broncos.\n\nAll it will take is one or two good passes for Marks to hit the mark. I'm expecting another break out game for our Rookie!\n\nBOL Everyone Tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nps6u6m/"
    },
    {
      "created_utc": 1763606970.0,
      "author": "InconsolableBrat",
      "text": "POTD Record: 156-102 | Profit: +116.78u | ROI: 15.6%\n\nSeason Record: 16-6 | Profit: +29.52u | ROI: 39.9%\n\n \n\nLast Pick: Toronto Raptors +2.5 vs Philadelphia 76ers @ 1.91. 4U. ✅\n\nEasy cash, the Raptors win by nine. That brings us to an EIGHT GAME WINNING STREAK!!\n\n \n\nNext Pick: **De’Aaron Fox (Spurs) O36.5 PRA @ 1.85**. 3U play.\n\nThe Hawks and Spurs are both missing key players, and as Fox ramps back up from injury, this game is the perfect set up for him to go off in Wemby’s absence. The Grizz game he had a terrible first half but still got over his points line with a strong second half. His usage is going to be through the roof, and on most possessions he will either be driving or passing to an open man. He is averaging over 6 apg this season, and without Wemby that number is higher. The Hawks also give up a large number of board to PGs, and with Fox being the #1 option I can see him getting to 5+ with some uncontested boards. Put all this together, a fast-paced, close, high-scoring game, with Fox being the clear #1 option, and I expect he’ll get over this line.\n\n \n\n*If you’ve enjoyed these picks, tips are always appreciated:* [Coffee Link](https://www.buymeacoffee.com/TheBrat)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nps4bxq/"
    },
    {
      "created_utc": 1763606244.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 17-7 (+11.3U)\n\nLast Pick: UConn -5 (-120) (1U) 🙅‍♂️\n\n[UConn write up](https://www.reddit.com/r/sportsbook/s/qXC8P0BucI)\n\nNot one to make too many excuses but I’d beg to say that if Tarris Reed (20ppg, 9.8 rebounds per game, 2.7 blocks per game) doesn’t get ruled out 20 minutes before tip off that’s a different game. Nonetheless we have never lost two in a row before and that’s not gonna change!\n\nEvent: New Mexico vs Nebraska (6pm central)\n\nPOTD: Nebraska -7 (-125) (1U)\n\n-everything is bet to win unit amount-\n\nWrite up: \n\nNebraska -7 (-120) is a line that doesn’t capture the full gap between these two teams (yes I bought to -7 sue me yet again) The Huskers are averaging 89 points per game with a +22 scoring margin, while New Mexico sits at 75 points per game and a margin of just +11.5. Nebraska’s offense is built on both efficiency and volume: they rank inside the top 20 nationally in effective field goal percentage (59.4%) compared to New Mexico’s 50.2%, and they generate about three more field goal attempts per game. Add in the fact that Nebraska is shooting threes at a clip roughly 12% higher than the Lobos, and you’ve got a team that stretches defenses and consistently creates separation.\n\nTempo and possessions matter here too. Nebraska averages 74 possessions per game, while New Mexico is closer to 70, meaning the Huskers play faster without sacrificing efficiency. That extra pace, combined with superior shooting, translates into more scoring opportunities. On the glass, Nebraska pulls down 38.8 rebounds per game compared to New Mexico’s 36.0, with a stronger offensive rebounding rate (30.8% vs. 27.6%). Those second‑chance looks are a direct product of Nebraska’s size advantage — they can throw multiple 6’10+ bodies and even a 7‑footer at the rim, while New Mexico’s frontcourt depth doesn’t match that level of length or physicality.\nBall security is another separator. \n\nNebraska’s turnover rate sits at just 10.9%, one of the lowest in the country, while New Mexico turns it over at 14%. That’s the difference between a veteran team and one still finding its footing. Nebraska’s roster is loaded with experience — Rienk Mast (6’10”), Sam Hoiberg, and other upperclassmen who’ve been through Big Ten wars — and it shows in late‑game composure. Their comeback win over Oklahoma (a team that has some real offensive talent) was a perfect example: they stayed poised, turned defense into offense, and closed strong. New Mexico, on the other hand, is under a new coach and starting two freshman guards, which is a tough ask against Nebraska’s length on the perimeter and disciplined defense.\n\nSharing the ball is another area where Nebraska shines. They average 20.8 assists per game, compared to just 12.8 for New Mexico. That’s not just a stat — it reflects how Nebraska’s offense functions. They move the ball, find the open man, and generate high‑quality looks possession after possession. New Mexico’s offense is more stagnant, relying on individual creation, which is harder to sustain against a structured defense with size and veteran savvy.\n\nDefensively, Nebraska is imposing. They’re holding opponents to 41% shooting overall and under 30% from three. Nebraska’s size and length let them contest shots at the rim and close out on shooters, while their rebounding edge ensures opponents rarely get second chances. Combine that with their turnover discipline, and you get a team that controls both ends of the floor.\n\nWhen you put it all together — efficiency, pace, rebounding, turnovers, assists, veteran presence, defensive reliability, and a clear size advantage — Nebraska is simply the more polished and complete team. The market hanging -7 feels short when my power ratings make this closer to -9 Nebraska’s statistical profile screams separation, and against a youthful Lobos squad still adjusting under a new coach, the Huskers should cover comfortably. Let’s get back on track, as always, cheers 🍻\n\nUpdate: this line has moved from 6.5 from when I wrote it originally to now 8.5. If yall can get in at -8 I still like it as I believe Nebraska wins by 10+ or wait til possible buy back but just wanted to let yall know what was good",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nps2b1w/"
    },
    {
      "created_utc": 1763605001.0,
      "author": "herbobets",
      "text": "**Record:** 1-0-0\n\n\n\n**Net Units:** \\+2.44u\n\n\n\n**Last Pick:** W - Paris FC over 0.5 goals + VFL Wolfsburg over 0.5 goals (-205) - 5u\n\n\n\n**Form (last 5):** W\n\n\n\n**Streak:** 1W\n\n\n\n**Event(s):** Women's Champions League: PSG vs Bayern Munich (2:00 p.m. CST) + Chelsea vs FC Barcelona (2:00 p.m. CST) \n\n\n\n**Pick:** Bayern Munich over 0.5 goals + FC Barcelona moneyline (-135) - 5u\n\n\n\n**Write-up:** Similar to yesterday, I really like the odds I get with the Bayern Munich pick and I really like Barcelona in their matchup, as well. \n\nBayern have scored 6 from their 3 Champions League games and PSG have let in 8 over their 3 games. PSG have looked horrible in the Champions League this season losing all 3 matches so far. They have been against good opponents but that’s what you expect in the Champions League. Bayern on the other hand, have looked really good in the Champions League after their first defeat to Barcelona. They are also coming off a really good 3-2 win against reigning champions Arsenal. Not much of a doubt in my mind that Bayern will find the back of the net at least once in this match.\n\nBarcelona have looked spectacular this season in domestic play and International. They sit top of the table in Spain with a near perfect 10W-0D-1L. They have scored 51 goals in those games and given up only 2! In the Champions League, Barca will go 2 points ahead of league leaders Lyon with a win tomorrow and are the only Champions League team without a loss or draw yet. Chelsea have been decent in the Champions League this season beating Paris FC and St. Polten, but showed signs of weakness in their 1-1 draw against FC Twente. Also, these teams met in the semi-final of this competition last year and Barcelona won both legs 4-1 for an aggregate scoreline of 8-2. I think this game will go similarly and Barcelona will take the 3 points and become league leaders in the Champions League.\n\nI think Barcelona is the best team in the Champions League and I think they will show why tomorrow. I really like adding the Bayern pick on as well, just for that boosted payout as long as they bag at least 1 goal. If Bayern score tomorrow, you’re essentially getting the Barcelona moneyline pick at -135 and I’ll take that for sure.\n\nI use Bovada for my picks, if you’re using something like Draftkings or Fanduel, you will definitely get worse odds on the Bayern pick but that’s why I like the pick so much for my book.\n\n\n\nBOL and God bless.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npryu6z/"
    },
    {
      "created_utc": 1763604485.0,
      "author": "milionzenit",
      "text": "POTD Record: 8-1\n\nLast Pick: Denmark vs Scotland BTTS (-125) ✅\n\nFixture: Petersborough United vs Stockport County | England League One | 12:00pm PST Time\n\nPick: Stockport County vs Petersborough BTTS (-163)\n\nReasoning: League leaders Stockport County make their way to bottom of the table Peterborough United. As Peterborough is bottom of the table, a turn around for the better came around when new manager Luke Williams took charge. Since this, Petersborough has won 3 out of 3 matches under new management. The home side won their last fixture 5-0 against Wimbledon  & a 2-1 victory against Cardiff in the EFL Trophy.\n\n\nOn the other hand, Stockport has four wins in their last five matches netting a total of 8 goals. On their last league one match they suffered a 3-0 home defeat to Luton Town. The visitors are without a clean sheet in their last six matches, a run going back to 2008. On the bright side, Stockport has the best away record in League One. With this being said, I can see a huge bounce back from their recent loss. \n\nConcerningly for Peterborough regardless of their positive run, they have accumulated only seven points this season at home. The second lowest amount of points in the league, only one above Port Vale’s 6 points at home. Additionally, Petersborough only has one clean sheet at home this season. \n\nI can see this match easily resulting in both teams to score. Two teams fighting for two different things, avoiding regulation and promotion. With that being said, Petersboroughs impressive form and Stockports solid form this season will result in a head to head match with a lot of attacking opportunities for both sides.\n\nPs. If you want better odds, add the (+110) odds for Stockport County ML. I myself have a bet on this but wanted my POTD to be the safest option. \n\nCheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprxe05/"
    },
    {
      "created_utc": 1763604313.0,
      "author": "SoggyDatabase2348",
      "text": "***POTD Record: 8-2 (+23.82$)***\n\nLast POTD: CBB Alabama vs. Illinois U182.5 -112 (5$ TO WIN 4.46$)✅\n\n***POTD: Josh Allen O1.5 Passing TD's +116 (5$ TO WIN 5.80$)***\n\n*Write up: Bills fan here, and I do not think this game will go how everyone might think.*\n\n* *Josh MVP Allen coming off his best game of the year*\n* *Allen has hit this line in every game this year except for 3*\n* *If my math is right, he has hit 2+ passing TD's in about 68% of their away games*\n* *Texans give up a lot of redzone passing TD's*\n* *Watching every Bills game this year, they do pass more when they are in the redzone, rather than running it*\n* *It seems like Allen always finds a way to get his, the Bills have not been great by any means this season, and he has hit 2+ in a majority of games*\n* *The Bills are a top 5 team in the NFL when it comes to passing - 59%*\n* *Houston's run defense is solid, and I think they will be able to stuff Cook for most of the game*\n* *Bills have not played well on the road*\n* *Bills defense is, umm, pretty bad -I think Nico and Woody have a field day and the game stays close - which will lead to Allen throwing the ball even more*\n\n*Side note: I love Nico Collins tomorrow - I love Schultz tomorrow - that being said, the reason I am going with Allen and not those guys is because I think it will be a close game and I trust Allen more than I trust Mills. The former MVP has + odds to throw 2 TD's in a primetime game - give me the + odds. What do you guys think, I am always curious to hear your thoughts.*\n\n***POTD: Josh Allen O1.5 Passing TD's +116 (5$ TO WIN 5.80$)***\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. ***For any tips 10$+ I will be sending a sports card to your mailbox***\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\nVenmo: [u/claysmiith](https://www.reddit.com/user/claysmiith/)\n\nPayPal: [u/claysmiith](https://www.reddit.com/user/claysmiith/)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprwwzo/"
    },
    {
      "created_utc": 1763602364.0,
      "author": "dreamchasing1",
      "text": "Record: 225-213 Net Units: -27.79 47-50 on 1.5u plays, 37-39 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [World Cup qualifiers] Belarus vs Greece\nLast pick: Belarus over 2.5 corners @ 1.80 loss\n\n\nEvent: Soccer/Football, [Champions League Women] PSG W vs Bayern W\n\n\nPick: BTTS + Over 2.5 goals @ 1.90\n\n\nSo far, both teams have seen some pretty high scoring games in the CL - this line covered for PSG in 2/3 games, interestingly failing to score in a 0-4 loss away to Wolfsburg, where they should have scored at least 2 probably. Other than that game, PSG hit this in tough matchups vs Real and Man United and are in need of points. Bayern have covered this line in 3/3 CL games, they allowed a goal as heavy favourites vs Juventus, and hit btts + over 2.5 in more even games such as vs Arsenal, Wolfsburg. The two teams have met very often in the CL in recent years with last 5/6 games between them hitting the btts and over 2.5 goals.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprrkwj/"
    },
    {
      "created_utc": 1763601750.0,
      "author": "InternationalRest542",
      "text": "POTD Record: 8 - 1\n\n\nNet Profit : +13.2 Units\n\n\nPrevious Pick: Miles Bridges Over 21.5 @1.79 3u to win  2.3u 💵✅\n\n\nEvent: NBA | Clippers @ Magic\n\n\nPOTD:  John Collins Over 13.5P  @1.73 3u to win 2.19u\n\n\nWrite Up:  \n \n\nI actually like the John Collins over 13.5 tonight. He’s been super steady all season nothing crazy, but he lives in that mid-teens range almost every game. The books basically set the line at his “bare minimum” effort. Even on his slower nights he’s still around 12–14, so you’re never really dead.\n\n\nAnd the way he scores is what makes the line look good. He’s not out there chucking threes or relying on tough jumpers. Most of his buckets come from the paint cuts, rolls, putbacks the easy stuff that doesn’t really get taken away no matter who they’re playing. It’s matchup-proof scoring.\n\n\nAs long as he gets his usual 28–32 minutes, he should naturally land somewhere in that 14–18 range. He doesn’t need a heater to get there. It’s one of those props where you don’t have to sweat every single shot.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprpwhv/"
    },
    {
      "created_utc": 1763601203.0,
      "author": "Statistician11223",
      "text": "**POTD Record:** 10-5 (+7.13 units).\n\n2 Leg Parlay:\n\nEvent: NFL BUF @ HOU, 8:15 est.\n\nLeg 1: Alternate spread BUF -2.5 (-240)\n\nLeg 2: Josh Allen 1+ TD Pass (-490)\n\nFor **-155                  2 Units to profit 1.29 units**\n\nBills looked good against Tampa. With Josh Allen 3 throwing TDs. I don't think Houston can keep up especially with the back-up in.  Let's Hope A Win Comes.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprof5l/"
    },
    {
      "created_utc": 1763600631.0,
      "author": "ptrckfrnndz",
      "text": "+19.09\n\n5 - 0 \n\nSports: Tennis\n\nPrev: meritxell vs carmen guevara ML @1.68 5 fckn units ✅️\n\nPick: raluca vs anouck ml & sara tormo vs laura +1.5 set @1.874 5units ❌️\n\nIll be back with a win tomorrow ❤️‍🔥\n\nTime: \n\nReasoning: im about to throw a 2 or 3 unit pick but i realized people here will not follow that, some of yall will still smash this shit because they are degenerate so i decided i should do a better research and that i will treat your money as if its my own money,, so i will give your money some chance even if its your last unit or balance..\n\n\n2 leg parlay since im pressured doing this.. but still it is just based on stats, you can look it yourself on the internet but since youre busy and theres a tons of pick you i do it for you but still player may play differently on that day so tail carefully...\n\n\nReason for the pick: im tired typing but based on court played, momentum my money is on them..\n\n\nDont overthink.. we can win this",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprmuam/"
    },
    {
      "created_utc": 1763599823.0,
      "author": "DrRippples",
      "text": "POTD Record: 0-0\n\n(1st time poster, long time lurker)\n\nPick: **Nico Collins Over 74.5 Receiving Yards (-111) 1U**\n\n**TNF (Bills @ Texans) 8:15pm EST**\n\nNico Collins is the clearest advantage on the board because Mills has leaned on him heavily the past two and a half games. **Collins averages 12.5 targets and 114 yards in the last two games with Mills. Buffalo’s defense also consistently bleeds production to WR1s, allowing \\~90 yards per game to the position and giving up 75+ yards in 60% of their matchups**. When you combine Mills’ tendency to lock onto a single read with Buffalo’s willingness to concede intermediate and deep outside shots, Nico becomes the focal point of Houston’s entire passing offense. The matchup, the volume, and the filters all point in the same direction, making his yardage over the most appealing line I see in this game.\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprkkza/"
    },
    {
      "created_utc": 1763599792.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 5-5-1\n\nNet units: -0.79u All bets are 1 unit.\n\nLast POTD 11/17/25: Tyler Lockett O26.5 receiving yards (-110 Bet365) ✅\n\nToday's POTD 11/19/25: Total Match Points U43.5 (-110 FanDuel)\n\nEvent: TNF Bills @ Texans 6:15MST\n\nWrite up:  This Thursday's matchup has every making for a low scoring affair. There haven't been a lot of bright spots for the Bills offense this season outside of Josh Allen willing his team down the field. Even then, his lack of weapons have even made the 2024 MVP show his fair share of struggles throughout the length of the season. This week will not be any easier for them coming off a short week, on the road and against one of the toughest defensive units in the league. This year the Bills have hit the under in 3/4 games and have averaged 24 points in those matchups.\n\nThe Texans are also a majorly struggling offense and nothing is expected to change against Buffalo. With CJ Stroud already ruled out for the game, Houston will be relying on the backup once again Davis Mills for their offensive production. The biggest weakness the Bills defense exposes to their opponents is their ability to stop the run but Houston hasn't been able to run the ball well all season and ranks bottom 10 in every major category. This season the Texans are 3-6-1 vs. the under and have hit the over in only 1/5 of their home games this season. The Texans defense only averages a total of 16 points per game and have a total combined average of 38 points this season. \n\nMy prediction for this game is Bills 20 Texans 16.\n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprkht6/"
    },
    {
      "created_utc": 1763599451.0,
      "author": "Hsil18",
      "text": "\nPOTD RECORD: 29-9\nPOTD TOTAL RETURNS: +29.79 Units 🤑\n\nLAST PICK: Sydney Thunder W ML @ 1.76 (3U) ✅✅💰\n\nTODAY’S FIXTURE: SYDNEY SIXERS W v MELBOURNE STARS W (WBBL CRICKET)\n\n(PLEASE NOTE THIS IS EARLY — 08:10am UK / 3:10am EST)\n\nPICK: SYDNEY SIXERS W TO WIN @ 1.74 (2U)❌\n\nWRITE UP:\n\nNice result last time out with a comfortable Thunder win, it was never a sweat as cricket so often is, which was nice! \n\nSince all of us sickos enjoyed the lane switch up, and the buzz of waking up to wins. Since the usual world of football (soccer) and rugby is quiet, I thought I’d look again at the evil beast that is cricket. At the end of the day, good value is good value. \n\nThis one stands out more than people might expect. On paper, this looks like a tight matchup, but digging into form and bowler to batter matchups, the edge leans clearly toward the Sixers.\n\nFirst off, the Sixers have been the stronger side in recent meetings, taking the majority of the last several head-to-heads. Add to that the influence of big-game players who has been consistently impactful with both bat and ball, and you’ve got a team that shows up when it matters. Bowling-wise, the Sixers also hold the advantage and their bowling attack generally trend more reliable than what the Stars have produced so far. Case and point being their ability to bowl out the thunder in the last match for only 118 runs.\n\nMeanwhile, the Stars are heavily reliant on their star player Meg Lanning and her having a standout performance. And history shows that when a side needs one player to go big just to stay competitive, it’s always a red flag in a T20 matchup.\n\nThis is a spot where the Sixers should simply do the job. Better balance, more firepower, better recent form, home advantage and a stronger profile across the field. Confident backing them here and staking 2 units .\n\nBOL to those tailing see you on the other side and remember to gamble responsibly!\n\n**Let this serve as a reminder why nobody watches women’s sport**\n\n🫡🫡🫡🫡🫡🫡",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprjiuv/"
    },
    {
      "created_utc": 1763599331.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 54-27-1 (+57.35u)\n\n__Previous Pick:__ [❌ Illinois -3.5 (-110), 2.2u](https://www.reddit.com/r/sportsbook/s/Rn0NFBsnRy)\n\n__Event:__ NFL: Bills @ Texans 8:15pm EST\n\n__POTD:__ Nico Collins o5.5 receptions (-120), 3.6u to win 3u\n\n__Write Up:__ The Buffalo Bills (7-3) are traveling to Houston to take on the Houston Texans (5-5) in an AFC showdown on Thursday Night Football. Fresh off a 44 point performance in a home win vs the Bucs last week, the Bills are looking to catch up to the Patriots in the AFC East as they are 1.5 games back. The Texans are coming into this game having won 3 of their last 4 games, after starting the season 2-4. Texans starting QB CJ Stroud will now miss his 3rd straight game with a concussion. Backup QB Davis Mills has filled in for Stroud, & he’s surprisingly done really well. \n\nMills stepped in for Stroud & led the Texans to 2 straight wins vs inter divisional opponents. In the past Mills has been the typical game-managing backup QB, but Texans Offensive Coordinator & Playcaller Nick Caley is letting Mills air it out. __Mills has thrown the ball 41+ times & had 274+ yards & 1+ passing TD in both of his starts.__ Caley is in his first year with the Texans, having coached on offense in the past for both Bill Belichick & Sean McVay. He uses a lot of schemes from both coaches, with a blend of power running mixed with play-action, RPO’s, & quick passes. But the biggest strategy he has brought to this offense has been playing to the strengths of their personnel, just like he did with Sean McVay on the Rams. McVay’s offense created superstar WR’s over the years, with Cooper Kupp & Puka Nacua getting pretty much 75 targets a game. The Texans coaches said a few weeks ago that they want to get Collins the ball more. They designed a game plan to make Collins the heart of the offense. Then when backup QB Mills came in, they told him to just get the ball to Nico, & he did. In the 3 games Mills has played, he has targeted star WR Nico Collins an insane amount. __Nico has seen an increase of almost 10% 1st read share with Mills at QB. Collins has an incredible 36 targets over the last 3 games. He’s seen a target share of 28.2%. He’s had 7+ receptions in each of the past 3 weeks. Collins has had 10+ targets in 4 straight games. His targets over those games: 10, 15, 11, & 10. Without CJ Stroud this year Collins has 3 straight games of 75+ receiving yards (75, 136, 92). With CJ Stroud he's only had 2 games over with 75+ yards.__ Collins has been used a ton more in the slot lately, leading to a higher volume of targets & much better production. __In the last 2 games, he's been targeted 7 times from the slot, that’s more than he had in his first 7 games combined.__ In the past 2 weeks with Mills, Nico has been his go to target in critical situations. He’s found a way to sling the ball in Nico’s direction pretty much every time. Nico has also been a red zone target monster this season. __Collins is 6th in the NFL in red zone targets this year (14).__ Now he’ll face a Bills team that has been particularly weak to opposing offense’s WR1’s. __Buffalo has allowed an average of 6 receptions (4th most in NFL) & 86.9 yards per game (most in NFL) to WR1’s this season.__ To keep up with this high powered Bills offense, the Texans are going to have to find ways to get it into their best playmakers hands. Mills is going to continue to target him a ton.\n\nOn the other side we have one of the best offenses in the NFL. Led by reigning NFL MVP Josh Allen, the Bills come into this one averaging 29.2 points per game (4th in the NFL). They average 6.2 yards per play (2nd in the NFL). With the Bills favored by 6 points, the Texans are going to have to air it out to keep up. Mills has thrown it 41+ times in both starts & that was in games he won. In a game that they are expected to trail, he’s going to sling it. And the beneficiary of that is Nico. Nico is going to put up numbers, but I feel more comfortable with the reception line than yards.\n\n__Nico Collins o5.5 receptions__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial) - [PayPal](https://paypal.me/joeinglesofficial) - [Bitcoin](https://pastebin.com/raw/GEXAsA2S)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprj6hj/"
    },
    {
      "created_utc": 1763599126.0,
      "author": "NVSBETS",
      "text": "POTD Record: 9-1\n\nNet Units: +7.78u ROI: 49.27%\n\nPrev POTD: Takuya Kumasaka +6g -180✅ +1u\n\nThat makes 8 POTD’s in a *ROW* now🌟\nHottest handicapper in this subreddit\n\nSport: Tennis Tournament: Colina Challenger Time: 11:00AM EST \n\nPOTD: Laura Pigossi ML +142 1u\n\nAnalysis: the funny thing is I actually faded Pigossi last match with two positions. Now after watching her match vs Vergara Rivera, I feel confident to back her at this price vs Jeanjean.\n\nWe really got to see a glimpse of 2021 Pigossi in her 6-1/6-1 domination of AVR. She was *blasting* her forehand and painting lines I could swear I watched 20+ winners. Only landing a rusty 42% of first serves but they were solid serves winning 83%. Probably the craziest stat of the match is AVR was able to land a *very* high 74% of first serves… the only problem for her was Locked In Laura on the other side of the net sending back *72%* of those FS’s as her own point. It was a returning masterclass as she also won 73% of second serves on return. I think Pigossi is really gonna try to make a run here in the Colina altitude.\n\nPigossi and Jeanjean have actually met 4 times already. JJ won all 3 of the hard court encounters while Pigossi was able to beat her on clay (same surface as today’s meeting) @ Buenos Aires 3 years ago.\n\nJeanjean is *not* impressive. Shes at best a top 75 player but at 30 years old she’s likely to plateau at the T100 mark. One things for sure tomorrow, she should *not* be a -185 favourite in this spot tomorrow. I’m not convinced she’s back. She was playing consistent tournaments until the USO (Aug,25 R1 loss to Hon {semi-lol}) and then two weeks later São Paulo (another R1 loss to Tjen{valid}). Then two weeks later shes all the way in China losing *yet another* round one. This time to Lepchenko {big lol}. She demotes herself to entering a challenger while she’s in China to only get one win (vs Inglis who was a lucky loser LOL) and then bounced in R2. She tries one more in China and it’s a big one; Guanzhou. *Take a guess what happened*… yup, ANOTHER R1 loss to Seidel (valid).\nTo summarize Jeanjean across the last 3 months: \n6 tournaments \n2 Wins 4 losses\n*all played on hard court*\nNow she’s made a successful first match transition to clay in Colina beating Riera who’s been decent recently. \nStill, ALL things considered, nothing warrants Leolia Jeanjean being a -185 favourite over Pigossi in this spot. \nPigossi is playable all the way up until +110.\nTell me who you know confidently put a 8 win streak and 9-1 overall record on the line with a +142 ML? Thats why they NVS🌟 I’ll see you all at the cashier in 16 hours. \n\nIf I made you money this wild run and want to tip since I can’t promo my socials🍀: [BMAC☕️](https://buymeacoffee.com/nvsbets) | [BTC](https://pastebin.com/0Lf0mHqu) | [ETH](https://pastebin.com/D2QRi3Bx)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/nprile5/"
    },
    {
      "created_utc": 1763598994.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Thursday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1p1p0r2/pick_of_the_day_112025_thursday/npri7dh/"
    }
  ]
}