{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 2/21/26 (Saturday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/",
  "target_date": "2026-02-21",
  "timezone": "America/Chicago",
  "collected_utc": "2026-02-20T23:52:56.353032+00:00",
  "comments": [
    {
      "created_utc": 1771631303.0,
      "author": "ken-kilos",
      "text": "Lifetime Record: 13W-13L\n\n2026 Record:\n\nhttps://preview.redd.it/pkpmqtrqjqkg1.png?width=394&format=png&auto=webp&s=db0fbef4b0cd642537e87d42d7ea21770754dbed\n\n[](https://preview.redd.it/pick-of-the-day-2-17-26-tuesday-v0-qbz2xx87yxjg1.png?width=378&format=png&auto=webp&s=577ea88f840ab2b4d4cf86aa0bd44c53e98f8fc9)\n\nStreak (Last 10): ✅✅❌❌❌✅❌❌❌❌ <--- Latest\n\nFootball | La Liga & Eredivisie | 15:15 & 20:00 (GMT)\n\nGames: Real Betis v Rayo Vallecano & Ajax vs NEC\n\nPick: Real Betis to Win + Ajax vs NEC - Both Teams To Score @- 2.74 (Bet365)\n\nWrite Up:\n\nReal Betis are trying to close the gap with Atletico Madrid (who have dropped points recently) so I see Real Betis going all-out from the get-go and I don't see what Rayo Vallecano can do about it.\n\nAjax & NEC are tied on points so I see both teams doing their best to win but ultimately fighting for a draw bare minimum if necessary. I expect 2 or more goals.\n\nGood luck if you tail! 🍀",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6ikzy6/"
    },
    {
      "created_utc": 1771631130.0,
      "author": "kab1218",
      "text": "Record: 32-37-2\n\nLast 5 recent on the right: ✅✅✅❌✅\n\nNet: -29\n\nPrevious:  Korea | LCK | 3 am Eastern | DPlus Kia vs Dn Snoopers | DPlus Kia correct score 3-1 | 2U @ +200 \n\nJust as I wrote up, Kia takes a 3-1 win. \n\nToday: Korea | LCK | 3am Eastern | Gen.G vs Bnk FearX | Gen.G -2.5 | 5U @ +115\n\nI’m going to give a riskier pick for today but it’s one I do think will happen. I believe Gen.G is THE team right now. For the entirety of the LCK season this year including playoffs Gen.G have a record of  14-1 dropping one game in a best of 5. Bnk did defeat T1 and looked great doing it, but GenG is a different beast this year. Ruler at ADC paired with Chovy mid is difficult to beat as they will both enter the league Hall of Legends one day. The current meta is so very beneficial for both players. I see a Gen.G 3-0 tonight. \n\n\n\nBOL if tailing \n\n",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6iki88/"
    },
    {
      "created_utc": 1771630639.0,
      "author": "Disastrous-Ear-3099",
      "text": "Record: 0-0 \n\nPick: Alexander Hernandez vs Sean Strickland. Sean Strickland to win +220 (Hard Rock)\n\nWrite up: Sean has faced much tougher competition and is a former champion. This is a big step up for Hernandez and hes never faced anywhere near this competition. Sean has the exact style necessary to not only weather the take down storm of Fluffy Hernandez but also operates his offense with teeps and jabs which have caused Hernandez trouble in the past. Hernandez has almost been finished multiple times to body work from kicks and also Kevin Holland was able to finish him with precise strikes to the head--this is how Sean fights. Perhaps Hernandez has gotten that much better but I just dont see him winning minutes after the 2nd round. Give me Sean to pull off the upset.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6ij394/"
    },
    {
      "created_utc": 1771630377.0,
      "author": "lordestros",
      "text": "Last 5 POTD : ✅️✅️❌️✅️❌️\n\n**Previous pick**: Canada 1st period puck line -0.5 (-110) ❌️ (Sorry guys I get that it was not the safest pick but I genuinely thought Canada had it in them and I mean in the 2nd and 3rd period Canada had **31 shots** while Finland had 9 so they did show up just not in the first)\n\n**POTD Record**: 29-23\n\n**Today's Pick:** Finland vs Slovakia 2:30pm EST (Olympics/Men's Hockey)\n\nUnder 5.5 goals (-130)\n\nWell back to unders and overs since it seems to work better for me and everytime I take a puck line for a certain team they decide to not show up until the end. \n\nWrite up:\n\nBronze medal on the line and games like these usually are low-scoring because no one wants to be the first one that makes a mistake. Olympic rink is also smaller and NHL players aren't used to it so less space to make plays so the name of the game right now with these games is to control the neutral zone. Finland has proven that they can shutdown teams pretty well by doing exactly that. Except for the game against Italy, Finland went under that line in **all of their games in the Olympics**. Meanwhile Slovakia has proven that they can put up a fight against others teams in the tournament so I expect them to give Finland a good fight and not let this become a blow-out. Both teams also played the day before so more mistakes and broken passes combined with more fatigue. \n\n \n\nBOL some of my picks hit some of them don't. **Tail at your own risk**!\n\n[Buymeacoffee](https://buymeacoffee.com/lordestros)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6iice1/"
    },
    {
      "created_utc": 1771630181.0,
      "author": "dreamchasing1",
      "text": "Record: 271-257 Net Units: -30.67 67-69 on 1.5u plays, 45-45 on 2u plays, 2-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [Israel Liga Alef North] Ironi Baka vs Maccabi Nazareth\nLast pick: total goals over 2.5 @ 1.85 win\n\n\nEvent: Soccer/Football, [England National League] Aldershot vs Scunthorpe\n\n\nPick: BTTS + Over 2.5 goals @ 1.80\n\n\nHit in reverse matchup and in last 3 meetings between the two sides overall. 11/14 home games for Aldershot hit this line, Scunthorpe in 9/17, btts in almost every game for them, great matchup for an extra goal today as Aldershot average close to 4 total per game at home.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6ihs6x/"
    },
    {
      "created_utc": 1771630154.0,
      "author": "major-couch-potato",
      "text": "Record: 181-151, +4.75 units\n\nLast Pick: Jakub Mensik +5.5 games vs Jannik Sinner (-105, 1 unit): Win\n\nTennis | ATP Doha | 1:00 PM EST\n\nToday's Pick: Carlos Alcaraz vs Arthur Fils | **Fils +4.5 games at -115 (DK). 1 unit.**\n\nWrite-up: That one was a pretty good read in the midst of some rough form for me. Mensik ended up not only covering, but winning outright as a huge underdog! En\n\nThe organizers of this tournament reportedly paid $1.2 million each for Alcaraz and Sinner to appear at this tournament, but ended up getting only one of them in the final. Alcaraz stated before this tournament that he still sees weaknesses in his game that he wants to improve and planned to take things \"match by match.\" In many ways, it's been a \"match by match\" tournament for him in that he has had at least some struggles in all of his matches (with 3/4 opponents covering this spread), but has still managed to get over the line in each of them. Now, he faces a familiar face for the title in Arthur Fils, who pushed him extremely hard in the quarterfinals of Monte-Carlo on clay last year. Fils is one of the most talented players in the Alcaraz/Sinner generation, and seemed to be on a really nice trajectory in 2024 and 2025 before a back injury halted his progress and forced him off the tour for the back half of the 2025 season. He's slowly been working his way back into things, though, and now seems to be at full strength three tournaments into his comeback. Here in Doha, Fils has posted excellent performance ratings (7.0, 8.11, 8.53, 8.3). There's been a clear upward trajectory in his level, and his most impressive match was probably the semifinal against Mensik, who had just scored a massive upset over Sinner a round earlier. Fils is best known for his incredible forehand, which allowed him to dominate Mensik from the baseline by targeting that exchange. However, he has also been serving well (7.2, 8.3, 7.7, 8.2), which will be key in covering this handicap. Alcaraz's return, meanwhile, was a bit off against the biggest server he played in Arthur Rinderknech (6.6), though he's since rebounded (8.3, 8.5, 8.4). This isn't quite the same as the Mensik handicap, as I do think Fils is going to need to break serve at least once to cover here. However, I also think he has a solid chance of competing with Carlos from the baseline. The easiest way to lose quickly to Carlos is not being able to compete with him off the forehand. However, Fils obviously has that shot, and we've already seen Carlos struggle a bit with the powerful forehands of Khachanov and Rublev. Fils also hits his forehand with a lot more spin and margin than either of those players, meaning it's less likely to randomly be off for a game or two. It will be a bit tougher for him to keep up on the backhand, but the hope is that he can run around it given that these aren't the fastest courts. The weather in Doha tomorrow is expected to be quite nice, as it has been all week, so I don't expect the wind or humidity to affect this matchup. Fils's match finished later than Alcaraz's, so he'll have slightly less time to recover, but this one doesn't start until 9:00 PM local time, so both players should be fine in that regard. Alcaraz has also historically struggled a bit more at night than during the day, as the ball bounces lower, limiting his ability to tee off and increasing the amount of patience required in rallies. Overall, I expect this to be a close match, and I think this handicap is a bit too wide. \n\nNote: The [POTD Capper Tracker](https://potd.lol), which you may remember from its Google Sheet days, is finally back in a cleaner, more robust website format! If you have any questions or suggestions regarding the site, feel free to reach out to either me or u/EthicalGambler.\n***Track my sports betting picks on [POTD.LOL](https://www.potd.lol/handicapper/major-couch-potato-xJXnQW?utm_source=mdembed&utm_campaign=major-couch-potato) (since 09/01/25).***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6ihpi0/"
    },
    {
      "created_utc": 1771629521.0,
      "author": "Jarnzul",
      "text": "Record: 11-18-1 Units: -7.949 All bets 1 unit\n\nLast Pick: NHL - Stars -1 Asian Handicap @ Sharks -146 odds 4/8/25 ❌️ \n\nPOTD: Brentford Draw No Bet ML vs Brighton at -184 odds on FanDuel 10:00 AM EST\n\nBrentford #7 are at home with a 4-1-0 record in their last 5 EPL games played. The draw was against Arsenal. They scored at least once in each of those 5 games.\n\nThe other team is struggling Brighton #14 who are 1-2-2 in their last 5 games. They were scoreless in their previous 2.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6ifvxf/"
    },
    {
      "created_utc": 1771629059.0,
      "author": "222benz",
      "text": "Record: 10-16-1\n\nNet Units: -21.08u\n\nLast Pick: OG ML  ❌\n\nSport: eSports | Dota 2\n\nEvent: DreamLeague Season 28 |  XG vs. Liquid & Tundra vs. MOUZ\n\nTime: 5:30 AM EST & 8:30 AM EST\n\nPOTD: Liquid ML & Tundra ML @ 2.25 odds (5u)\n\nWrite Up:\n\nLiquid has been absolute kryptonite for XG lately they’ve won mostly their recent head-to-head meetings. While XG is a solid team, they often play a slower, traditional Chinese style that Liquid just dismantles with high-tempo pressure. Liquid's current form is way more stable, especially with Nisha playing at this level.\n\nI think Tundra vs. MOUZ is a mismatch. Tundra also leads against MOUZ in their last head-to-head meetings. MOUZ is a mid-tier team that consistently hits a ceiling when they face the top 3 teams. Tundra has better players in every single position, and MOUZ’s drafting has been incredibly predictable lately. While they aren't invincible anymore, they almost never drop games to teams outside the top 5.\n\nBOL.\n\nhttps://buymeacoffee.com/222benz",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6ieil1/"
    },
    {
      "created_utc": 1771628990.0,
      "author": "TcFir3",
      "text": "Record: 0-0\n\nNet Units: 0-0\n\nROI: 0\n\nLeague of Legends | LEC | 18:30 CET +1 \n\nPick: Fnatic v Team Vitality - **Team Vitality to win @1.72 2U**\n\nWrite Up: Fnatic has been rolling with legacy odds until now. They have been underpreforming this entire tournament barely making playoffs with a record of 5-6 sharing the spot with weaker teams like Los Ratones and Shifters, only passing on because of tie breaker rules. Meanwhile vitality landed comfortably at 7-4 and 3rd place. Fnatic also lost 2-0 against navi, a team that played 2nd tier league only 2 years ago. Overall Fnatic looks like a team still trying to find their feet and have yet to deliver with their rookie toplaner Empyros and a bot duo consisting of Upset and Lospa that seems to not synergize well. Team Vitality has the experience and calm that makes them more likely to deliver the win.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6ieb1m/"
    },
    {
      "created_utc": 1771626674.0,
      "author": "TheArbitrator07",
      "text": "**POTD Record: 0 - 1**\n\n**Today's Pick: Wellington Phoenix VS Auckland FC - BTTS @ 1.64**\n\n**3 pm aest / 11:00 pm est**\n\n**They've played twice already this season and the line has hit 2/2. (3-1) (1-2)**\n\nWellington are the catalyst to this selection, a team that all round scores while not knowing how to keep a lead for their life. Wellington have the highest BTTS rate in the league at 82% (14/17).\n\nAuckland rank 4th in the league for BTTS themselves and i see the trend following today.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6i75l4/"
    },
    {
      "created_utc": 1771626097.0,
      "author": "TReijnders",
      "text": "[Last Pick](https://www.reddit.com/r/sportsbook/comments/1r9czro/comment/o6gjgur/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) ✅\n\n* **Record**: 1W-0D-2L (-1.9und | -31.7% yield)\n* **Tournament**: Premier League\n* **Event**: West Ham vs. Bournemouth\n* **Pick**: Over 2.5 & BTTS\n* **Odd**: -133 (Bet365) | 3 und\n* *Pick written in Spanish. Translated with AI. Please understand.*\n\n**Lore:**\n\nWe are heading to the London Stadium for the match between West Ham and Bournemouth, corresponding to Matchday 27 of the Premier League. What we are looking for in this opportunity is both teams to score and at least 3 goals in total on the scoreboard.\n\nI like this pick because we have an attractive odd of -133 (1,75 decimal) for a scenario that the statistics strongly support. Nuno Espírito Santo's West Ham arrives in a compromised situation (18th in the table), which forces them to be proactive, but their defensive fragility is alarming: they have conceded goals in their last 18 home league matches. The \"Hammers\" average 1.23 goals scored and a worrying 1.88 conceded, which almost always guarantees action in both boxes. In fact, in 5 of their last 6 Premier League games, the \"BTTS\" has been hit.\n\nOn Bournemouth's side, Andoni Iraola's men are having a remarkable campaign (9th) and arrive with significant momentum after beating Everton. They are a vertical and brave team, with an average of **1.65 goals scored** and **1.73 conceded**. Their xG (expected goals) of 37.62 compared to the 43 goals actually scored shows they are clinical, especially with figures like Rayan and the young Kroupi on a scoring streak. Furthermore, the recent head-to-head record is telling: the last five direct matches between the two ended in score draws (1-1, 2-2).\n\nRegarding team news, West Ham recovers Jean-Clair Todibo in defense, which improves their buildup, but the absence of Freddie Potts due to suspension weakens the midfield balance. Bournemouth, although having doubts over Tavernier, keeps its offensive core intact. With the hosts' urgency to escape the relegation zone and the \"Cherries'\" offensive fluidity, a high-scoring exchange of blows seems inevitable.\n\n*Did you win some money? You can donate to a charitable cause (a coffee for me, haha)*\n\n* [Ko-Fi](https://ko-fi.com/jorgestradamus)\n* USDT-TRC20: THEEXkPWRScWzxqaiWZP6xaNGrnGBHi7B5",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6i5c0i/"
    },
    {
      "created_utc": 1771621773.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Saturday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1ra7lsi/pick_of_the_day_22126_saturday/o6hr0zv/"
    }
  ]
}