{
  "subreddit": "sportsbook",
  "title": "Pick of the Day - 12/20/25 (Saturday)",
  "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/",
  "target_date": "2025-12-20",
  "timezone": "America/Chicago",
  "collected_utc": "2025-12-20T14:30:40.112685+00:00",
  "comments": [
    {
      "created_utc": 1766240478.0,
      "author": "Savings-Dig8902",
      "text": "POTD RECORD: 3-2 \nBlowout winner last night with the spurs \n\nPOTD:  Miami Hurricanes ML +125 \n \nSorry no explanation today busy day at work.\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv19r6w/"
    },
    {
      "created_utc": 1766240042.0,
      "author": "Mental_Group_6314",
      "text": "Record: 5-3\n\nNet Units: +1.54\n\nROI: 19%\n\nFootball | NCAAF | 12:00 p.m. / ET\n\nLast Pick: Minnesota Timberwolves -7.5 (-110) - 1 Unit ❌\n\nPick: Texas A&M -2.5 (-132) - 1 Unit (Fanduel Alt spread)\n\nWrite Up: The biggest reason I’m backing Texas A&M to cover -2.5 against Miami is their killer home record at Kyle Field, where they’ve won all 7 games this season by an average of about 28 points each time, thanks to a really strong offense putting up 36.3 points a game (top 15 nationally) and a defense holding teams to just 21.9 points. Conner Weigman is completing passes at 63.9%, which should pick apart Miami’s secondary that’s not great at stopping the pass—they’re outside the top 50 in completion percentage allowed. Plus, A&M’s line up front is solid against the run, giving up only around 4.0 yards per carry, so they can shut down Miami’s ground game and maybe force a few mistakes since the Hurricanes only average about 1.6 turnovers forced per game compared to A&M’s positive margin. That sets up A&M to dictate the pace and grab an early lead.\nOn top of that, models from places like ESPN and CBS are calling for A&M to win by something like 31-27, which fits with the sharp bettors keeping the main line line at -3.5 and most experts agreeing Miami has been shaky on the road (3-1 away but against easier teams). It feels like good value at -132 in this playoff kickoff, especially with the home crowd and A&M’s big-game experience giving them the upper hand.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv18ley/"
    },
    {
      "created_utc": 1766238961.0,
      "author": "coltysports",
      "text": "__POTD Record:__ 6 - 3 __+2.5u__\n\n__Previous Pick:__ Seton Hall +2.5 ✅️ \n\n__Event:__ Ohio St vs UNC 3pm EST\n\n__POTD:__ North Carolina -3.5                          \n\n__Honerable Mention:__ Georgetown -4.5 because Xavier blows\n\n__Reasoning:__ I watched Ohio State play Illinois and other than their senior going 7/7 from three in the first half, I was not impressed and they lost by 10. UNC should be able to beat them by more than 3 in intense in-season tourney play. \n\n__Bets:__ 1u\n\nBOL",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv15s4c/"
    },
    {
      "created_utc": 1766238637.0,
      "author": "sigmabale",
      "text": "**POTD Record:** 5-8-3 *These pushes keep haunting us, somehow the game I bet on was postponed and the bet was void*\n\n**Event:** Egypt League Cup, ENPPI v Talaea El Geish, starts an hour and ten minutes from now\n\n**POTD:** Talaea El Geish DNB +120, 3.5 units\n\n**Write Up:** It’s safe to say El Geish has the **H2H upper hand** on ENPPI, being **undefeated in the last 10 matches against today’s opponents.** They’ve registered 5 draws and 5 wins, so taking the DNB at these amazing odds seems like the sensible choice. ENPPI also **struggle to score (11/12, so less than a goal per game)** so I just can’t see them threatening El Geish today. BOL and let’s get a hot streak going again ☘️",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv14ycy/"
    },
    {
      "created_utc": 1766237369.0,
      "author": "2thyKing",
      "text": "Record: 11-3 (W1)  \nL10: 8-2\n\n☘️☘️☘️☘️☘️☘️💩☘️💩☘️<- last pick\n\nNet Units: +11.23\nROI: 59.55%\n___\n￼￼￼￼￼￼￼￼￼￼￼￼Last pick:\n\nJaylen Brown OVER 36.5 Pts+Reb ☘️ \n___\n￼￼￼￼￼￼￼￼￼￼￼￼Today’s pick:\n\nNBA Basketball 🏀\n\nBoston Celtics ☘️@ Toronto Raptors 🦖7:00PM EST / GMT -5 (11 hours from time of comment)\n\n**Jordan Walsh OVER 7.5 pts** (-107 Novig) 2 units\n\nJordan has been a key role player (understatement) for the C’s this year. *Full disclosure, I’m a big Celtics fan and I watch them as much as I can.* He plays with a grit and fearlessness that is rare these days, so I can attest to the eye-test for this kid. But just because I’m a Celtics fan and I like this kid doesn’t mean I’m making a biased bet. I don’t bet against my team, but I also don’t make stupid bets. \n\nHere’s some hard data to supplement the eye-test:\n\nWalsh’s dominant play type: spot-up  \nToronto’s d-rank vs spot-up: 28th  \n\nWalsh’s dominant shooting zone: paint  \nToronto’s d-rank vs in the paint: 22nd  \n\nWalsh last game vs Toronto (12/7): 9 points  \n\nHe has surpassed 7.5 points in 7 of his last 8 games with the exception being yesterday’s game against the Heat. *What’s that you say? Back-to-back? Shouldn’t that bring his expected points total down?* pshhh…  Walsh is averaging a whopping 15.5 points per game on the second night of a back-to-back. I think he’ll get the minutes tonight. I think he’ll bring his A-game and be all up in them raptor guts \n___\n\n￼￼￼￼￼￼Tips, if you’re so inclined:\n\nhttps://buymeacoffee.com/2thy",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv11r4j/"
    },
    {
      "created_utc": 1766237204.0,
      "author": "DanFran81",
      "text": "To be winning by 3 goals in the first half? You’re on something if you see that as a good bet.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv11cao/"
    },
    {
      "created_utc": 1766236750.0,
      "author": "Hey52511",
      "text": "NBA POTD 16-11\n\nLast Pick: **Tyrese Maxey Over 26.5 Points,** So the line moved from 26.5 to 29.5 lmfao granted Embiid was injured regardless we hit\n\nToday's Pick: **Tyrese Maxey Over 25.5 Points.**\n\nI understand their on a back to back but I really like this match up against Ryan Nembhard if he does start. Cade could have had 35 but he really struggled in the first half, and still ended up on 29 points. I expect if they make Maxey shoot threes he will be fine due to home and being a great three point shooter. The only issue is Embiid is probably playing but still there should be plenty of chances.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv108c2/"
    },
    {
      "created_utc": 1766233375.0,
      "author": "wes2211",
      "text": ">**Record:** 123-102\n>**Net Units:** +26.93 units\n\n>**Curling** | **Canadian Open** | **5:00PM EST**\n\n>**Pick:** Team Gushue ML @ 2.02\n\n>Brad Gushue's retirement tour will include a playoff match today in his final slam against Team Shuster. Gushue is a 15-time slam champion and qualified for the playoffs with a win over world #2 Team Dunstone. Gushue's draw weight has been money all week. Walker and Nichols have been very effective with their sweeping as well. Coming into this event, Team Gushue were 5-0 against intermediate teams like Team Shuster, while Team Shuster were 2-5 against elite teams this season. Team Gushue also just beat Team Shuster Wednesday night, Team Gushue should be a strong favourite in this matchup. Gushue is 13-4 against Shuster in the career H2H. Wrong team is favoured here.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv0szza/"
    },
    {
      "created_utc": 1766232558.0,
      "author": "Ralphjinasseater",
      "text": "Record : 17-16-2  \n\nNet units:(-1.94 units)\n\nLast pick: Payton Pritchard over 8.5 Rebounds+Assists (-130 HR)❌🪝\n\nPick of the day : Brandon Miller under 3.5 Assists (-120 HR)\n\nReason • \n\nMiller draws a BRUTAL matchup versus the Pistons, with them allowing the LEAST total assists and the 3rd LEAST assists to SFs. The Pistons have also been even better at home, with them allowing the LEAST assists in the league at home. \n\nMiller has gone under this line in all 3/3 matchups this season against top 13 assist defenses.\n\nL5 Bettors are gonna hate this one but if you look at the data, Miller has seen very low potential assist volume recently but has been converting at an insane rate, over the last 4 games Miller has seen 23 assists on ONLY 28 potential assists. I expect Miller to see some regression here, especially against this Pistons defense that has been ELITE at preventing assists.\n\nMiller get’s 35% of his assists from the RA, where the Pistons rank FIRST best defensively.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv0rg51/"
    },
    {
      "created_utc": 1766231036.0,
      "author": "kissthis816",
      "text": "Take him for 60 alternate and just add another bet u feel good about with it",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv0onov/"
    },
    {
      "created_utc": 1766229309.0,
      "author": "donjavogosca",
      "text": "POTD Record: 25-15, +9.02u, (ROI +18.04%)\n\nPrevious Pick: Euroleague, Monaco - Bayern, total points over 169.5, 1.90, 1u ✅️, (last 5: ❌️❌️✅️✅️✅️)\n\nEvent:  NBA: Denver - Houston, 23:00h\n\nPOTD: Jamal Murray and Alperen Sengun both to score 20 or more points, 1.96, 1u\n\nBoth players are hot right now, and I like this combo for the blockbuster tonight.\n\nJokic can score 15 or 50, both options equally possible. He's probably going to score 30±3, but to get to similar odds as these to have it at 20, Jokic is at 25. For Durant, it is 23.\n\nSengun covered this in his last 6/8, and he had it in the last 6 games.\nMurray had it in 8/10. He had 2 games with 11 and 10 points, Sacramento was quickly solved, and he didn't push for it. The Dallas game is a mystery. He shot only 8 times. Spencer Jones went crazy that night and hit 28 points, so maybe they went with him as the first shooter that night. They lost the game by 10.\n\nThe duel tonight is an important one. Playoffs meet is also a possibility, in semis probably, still too early for that, but it's a bit more than just another regular season game, I expect both teams to bring their A game.\n\nAnd, of course, both played 4 days ago, 128-125, Murray 35, Sengun 33 points.\n\nEven if they underperform or the tempo slows down, 20 looks like a very probable outcome.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv0lpth/"
    },
    {
      "created_utc": 1766228762.0,
      "author": "Easy_Independence811",
      "text": "**POTD Record**: 6-28 (HIGH ODDS PLAYER HERE)\n\nFrom oldest to newest: ✅❌✅❌❌❌❌❌✅❌❌❌❌❌❌❌❌❌✅❌❌❌❌❌❌✅❌❌❌❌❌✅❌❌\n\n\\+8,25 units (translated all dollars to units).\n\nLast pick : **Alaves** to win vs Real Madrid at **6,4** odds ❌\n\n**CET 16:00 Football Championship**\n\nToday: A **-2,5 handicap in the first half** for Ipswich vs Sheffield Wednesday at **8,5** odds\n\nReason: I don't understand why this game is even allowed to be played. Sheffield Wednesday on -9 points currently and Ipswich on 34 points and hoping to climb in the Premier League. The morale is soo low on Sheffield Wednesday right now, that I see this as a free win basically. Ipswich has a tendency to play an attacking football style and Sheffield Wednesday will be relegated and finish in the bottom of the table. This game is almost impossible not to win for Ipswich, and I fancy them wrapping it up in the first half. Second half will be filled with substitutions, to pay some respects for the opponents and not humiliate them further. We are basically looking for a 3 goal difference lead in the first half.\n\nCan they do it? Not 100 % sure. Will they do it? They should be leading with at least 2-0 in the first half, but i'm more optimistic than that and hoping for something like 3-0 or 4-0. The worst case scenario is Sheffield Wednesday waking up out of nowhere and playing the best game of the season or Ipswich getting a red card, which will complicate it. Anything can happen in football and good luck everyone.\n\nBookie: **Coolbet** and a **5** unit bet. Gamble responsibly!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv0ksz6/"
    },
    {
      "created_utc": 1766227929.0,
      "author": "this_guy9",
      "text": "**POTD Record:** 19-16\n\n**Net Units:** \\+3.98\n\n**Previous Pick:**[ ✅ Darius Garland o2.5 Threes -120](https://www.reddit.com/r/sportsbook/comments/1pq66p0/comment/nuxfvkk/?context=3)\n\nDG absolutely balled out. Ended with 6 Threes. Let's go again.\n\n**🏀 Anthony Davis o20.5 Points -120** vs the Philadelphia 76ers\n\nAD is probable for this game, so hoping he'll actually play and not void for us.\n\nSince coming back, his FG attempts are as high as they've ever been. In his last 3 games, he's averaged 19 attempts. His minutes have been high as well, playing 37 minutes against the Pistons 2 days ago.\n\nHe has no problems going against Embiid and the 76ers. In his last 3 games (excluding a 10 minute showing), he's averaged 23.7 points, cashing 2/3.\n\nThe 76ers are on a B2B currently and they allow significantly more points on B2Bs, 118.8 points per game vs on a day's rest at 112.3.\n\nBesides a hot-and-cold Cooper Flagg, there aren't many weapons on this Mavs team. Expecting AD to get his attempts and get at least 21 points.\n\nFull stats if you'd like to do additional research:  [https://www.statpick.ai/17755566/anthony-davis-points](https://www.statpick.ai/17755566/anthony-davis-points)\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv0jfdp/"
    },
    {
      "created_utc": 1766227286.0,
      "author": "Money-Swimming2179",
      "text": "Record 2-0-0 \n\nLast POTD: **Man city o1.5 team goals + Erling Haaland 2 shots on target @2.20** 🏆\n\nTodays POTD: **Tottenham v Liverpool BTTS & o2.5 match goals @1.86**\n\nTottenham at home are rarely passive and that intent shows in their numbers. They score 2 goals per game in North London and do so with efficiency rather than volume, which matters against a Liverpool side that allows fewer chances but still gives up space in transition. Spurs’ defensive record is the weak link, with concessions slightly above league average at home and a clean sheet rate below the norm, and that imbalance is exactly what pushes their matches toward goal heavy outcomes rather than tight tactical battles.\n\nLiverpool away games add fuel to that fire. They average 2 goals per match on the road, create chances at an elite rate and tend to explode after the break, which makes sustained pressure almost inevitable. Even if Liverpool control large spells, Tottenham’s ability to score at home keeps BTTS firmly in play, while the combined attacking output and recent goal trends support over 2.5 goals. With the model pricing both markets around the mid 60 percent range, the data points clearly toward goals at both ends and a match that rarely slows down.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv0id6n/"
    },
    {
      "created_utc": 1766223076.0,
      "author": "Ghost_eggs",
      "text": "**POTD Record:** 6-2\n\n**✅✅✅**❌**✅✅**❌**✅**\n\n**Net Units:** \\+10.71\n\n**Previous Pick:** SA Spurs Moneyline \\[ML\\] (-135 on DK); 4 units **✅**\n\n**Previous Pick Reaction:** Nice easy win with Spurs in control the entire game. Confirming my pre-game thoughts, San Antonio's defense shined, holding ATL to 40.4% from the field. Stat of the night is the fastbreak point differential: 24 to 13 in favor of the Spurs. \n\n**Today's Event:** NBA 🏀 Phoenix Suns @ GS Warriors (5:30pm PST)\n\n**Today's Pick:** Steph Curry o 27.5 points (-111 on DK); 3 units\n\nOrdinarily I tend to stay away from the superstars' prop bets because I find them harder to predict relative to the lines for role players.\n\nWith that said, this is an excellent spot for Curry to meet or exceed his season average of around 28 ppg. \n\nCurry is a reliable bounce-back scorer immediately after a poor scoring performance, especially in a loss. I am defining a poor scoring performance as anything below 20 points on less than 40% FG%. There were three such instances this season, all in support of the bounce-back:\n\n* Nov 11: Curry scores 11 on 30.8% shooting against OKC, loss. Next game (Nov 12) scores 46 against Spurs, a good defensive team. \n* Nov 16: Curry scores 9 on 18.2% shooting against Pelicans, win. Next game (Nov 18) scores 34 against Orlando.\n* Nov 26: Curry scores 14 on 30.8% shooting against Houston, loss. Next game (Dec 12) scores 39 against Minnesota. Note on this one there was a large gap between these two games due to injury, but the trend is supported.\n\nToday we have an especially good spot to continue this trend as Curry just had a poor scoring game (15 pts on 23.1% shooting) in a loss against the Suns, and is now playing against the same opponent but at home. The dirty flagrant foul by Dillon Brooks against Curry toward the end of last game will likely fuel the bounce-back all the more, and I'd anticipate him playing with motivation, focus, and aggression on the offensive end.\n\nIn terms of matchup, the Suns are not especially good at defending the PG position, ranking 12th worst at points given to opposing PGs.  \n\nIt is extremely difficult to hold down a player of Curry's caliber twice in a row, especially for a defensively mediocre team like the Suns. Add to that the bounce-back motivation, homecourt advantage, ability to adjust to the same defenders, and a little plain old regression to the mean, and I see the over as considerably more likely than the under.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv0bm3n/"
    },
    {
      "created_utc": 1766222174.0,
      "author": "Impasta123",
      "text": "Record 2-1 \n\nPick: Perth Glory ML vs Adelaide (A-League) @ $2.60 on Bet365. \n\nSince starting the season off, a point was achieved across the first 4 games. Results and poor performance impacted the decision made to improve the team. The Glory now have a new coach, and something seem’s to have clicked with the team. They’ve achieved 9 points from 12 in their last 4 matches - Losing to second on the table, Sydney, by a single goal which was an arm wrestle to say the least. \n\nAdelaide on the other hand, although starting the season well with 9 points from a possible 15, have lost their last 3 matches. They’ve yet to win an away game this season, losing all 4 matches. In the last 10 away games, they’ve lost 8 and drawn 2. \n\nThe odds are quite high, I feel the bookies are still on the fence with this Glory team but I’ll be taking these odds as I feel it should be closer to $2.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv0a6zi/"
    },
    {
      "created_utc": 1766218386.0,
      "author": "Rest_Few",
      "text": "Record: ✅✅✅✅❌✅✅(recent on right) \n\nPrevious pick: Charleroi vs Genk BTTS ✅\n\n\nNet Units: 1U\n\nEvent: Wolves vs Brentford \n\nPick of the Day: BTTS (1.80 odds)\n\nWrite Up: we’re on a roll! BTTS came in first half! I love that \n\nToday we’re in England..again! \nI know you’re thinking of all games I’m picking wolves..who are basically  relegated but still I trust they’ll pop in a goal. Despite conceding goals virtually every game, they still score..even against Man Utd and Arsenal \n\nSo I’m expecting a GG/Btts \n\nBOL!!\n\n\nIf this helps you out, a small tip is always appreciated 😊\n\n[Tip Jar](https://www.paypal.com/paypalme/FaisalGidado)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv0414l/"
    },
    {
      "created_utc": 1766217075.0,
      "author": "HeBeThatBoy",
      "text": "POTD Record: 6-4\n\nNet Units: +13.76\n\nLast Pick Thoughts: I took a small hiatus after AC Milan blew up and let Torino score on them at will, and then turned their fortunes in the second half. After staring at the abyss for a couple hours, I’ve come out the other side wanting to take on Serie A again.\n\nSport: Italian Serie A - Juventus vs. Roma at 2:45pm EST\n\nPick: Roma or Tie + Under 4 Goals = +115 (5 units)\n\nWrite Up: Disclaimer, I do not like to do “-“ odds, it’s just a preference that I enjoy the thrill of winning more than I’ve bet vs the conservative chipping away gaining units with a chance of losing a bet for little in return. Because of that, I’m increasing my chances of losing more often, so keep that in mind if tailing!\n\nAnyway, Roma has a very stubborn defence and although this game is taking place in Torino, I believe they are one of the best managed teams in the league with a very strong understanding of their defensive identity. Furthermore, Juve is dealing with more injuries than Roma, including to Vlahovic. Juve has underwhelmed this year, they’re not the giants they used to be and have struggled to get results from strong opposition (aside from Bologna). Roma is ranked 2nd in Seria A for away form this season but to mitigate some risk I’ve picked Roma or Tie. Juve’s schedule is a little more hectic having already had 4 games in December via Serie A, Champions League and Coppa Italia, therefore I feel good about this bet and under 4 goals because, well, it’s Roma and Serie A.\n\nIf you find my insight useful, please feel free to donate to BuyMeACoffee:\n\nhttps://buymeacoffee.com/5c2y4cxvy5e",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv01tne/"
    },
    {
      "created_utc": 1766216776.0,
      "author": "Dramatic-Fox-4826",
      "text": "**POTD Stats:**\n\n**Record**: 48/39  \n**Profit in Units**: 40.25u  \n**Average Odds**: 2.09\n\n**The pick:**\n\n**Sport**: Soccer  \n**League**: Italy - Serie C: Girone C  \n**Time**: 15:30 ( GMT +2 )  \n**Event:** Sorrento v Picerno  \n**Pick**: BTTS Yes **@ 1.85**  \n**Stake**: 3 Units\n\n**Write up:**\n\n**The pick:**  \nThis matchup sits cleanly in a **Neutral profile**, with the odds structure showing no dominant side. Home and away prices are closely clustered, which usually points to shared momentum rather than control from either team.\n\nIn these setups, matches rarely stay one-sided. Instead, they tend to develop through response phases — one team scoring does not kill the game, but rather triggers a reaction. That dynamic is especially common in Serie C neutral games, where game management often breaks down once the opener arrives.\n\nFrom a goals perspective, **Over 1.5** is the base expectation in this profile. However, the market doesn’t offer enough edge on higher goal lines. The cleaner angle is both teams contributing rather than pushing total goals.\n\n**The BTTS price at 1.85 reflects uncertainty on the winner**, not on goal involvement. With neither side priced to dominate or protect a lead comfortably, **defensive protection is weak on both ends.**\n\n**My Model in general:**  \nMy model is built around the idea that matches follow **recurring patterns**, not randomness.  \nInstead of predicting games in isolation, it groups matches by **odds profiles** and studies what *actually* happens when similar games are played.\n\nBy clustering historical matches with the same **home–draw–away odds**, I track how games usually unfold — goals, BTTS, scorelines, and game flow. From there, the model identifies **motives**: situations where teams are more likely to attack, trade goals, or avoid clean sheets.\n\nEvery pick comes from **data-backed profiles, not opinions** — combining odds structure, score patterns, and streak behavior to find spots where the market regularly repeats itself.\n\n***Il post more picks on the soccer thread!***",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nv01bim/"
    },
    {
      "created_utc": 1766215140.0,
      "author": "kab1218",
      "text": "PoTD 8-8\n\nNet -2.5\n\nPrevious: NC State (-3.5) v Memphis @ 2U -105\n\nEasy hit, everyone saying Memphis had the better offense hasn’t watched NC State all year. Moving on. \n\nToday: Oregon v JMU - Jordon Davison ATTD 2U @ -162\n\nWrite up:\n13 rushing TD from the man. I see Oregon running this score up and JMU isn’t stopping them. He’s scored at least 1 in 9/12 games. BOL if tailing. ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzykrr/"
    },
    {
      "created_utc": 1766212386.0,
      "author": "PogRashy",
      "text": "Record 2-0(+1,31U)\n\n✅✅\n\nLast pick - Viimsi +3,5(1,71)✅\n\nToday's pick - Jeanmonnot TOP3(1,72)\n\nReasoning - With clean shooting, will go for the win easily at home track, just to be safe within POTD rules, taking top3\n\nhttps://preview.redd.it/4qposwz70b8g1.jpeg?width=995&format=pjpg&auto=webp&s=f76d5c47e06f41911a88200eb98f7d99529fa4f7",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuztp2n/"
    },
    {
      "created_utc": 1766212038.0,
      "author": "billycapezzi",
      "text": "POTD RECORD: 179-135\n\nSeason record: 16-12\n\nLast POTD: __Luka Doncic o8.5 Ast @1.83 1U__ ✅\n\nToday’s POTD: __Donovan Clingan O20.5 PR @1.86 (Bet365) 1U__\n\nNBA | Kings v Trail Blazers | 🏀  \n\nCash all the bumps and even got the triple double I mentioned, hope some took it cause I def did! \n\nBacking Clingan here in what’s a very soft matchup for big physical bigs like Clingan who does majority of their work in the paint. Had 19 points (27 PR) last game in this exact same matchup. Kings have allowed 2nd most points to centers this season aswell as 2nd most points in the paint overall where Clingan should dominate once again.\n\nSimilar players like Clingan has done great in this matchup lately: Edey (49), Valanciunas (21), Jokic (48), Sengun (38), Mark (37) PR etc\n\nOnly managed to grab 8 boards LG but did have 19 rebound chances, like the upside here and hoping he feasts on the glass a bit more this time around. Over in 7/11 games without Jrue this season who’s still out for this one.\n\nClingan vs bottom 4 paint defenses this season:\n\n27 PR vs Mavs\n\n38 PR vs Bulls\n\n27 PR vs Kings\n\nLike Clingan to continue the trend against once again a good matchup.\n\n(Individual split id go 10.5 points if you don’t got combos available)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzt1zd/"
    },
    {
      "created_utc": 1766211650.0,
      "author": "MadsR2021",
      "text": "Record: 0 - 0\n\nToday's Pick: Chloraka ML vs Paralimni (1.66) 1U \n\n  \nParalimni is in atrocious form having only gotten 1 point from 14 matches so far this season. On the other hand Chloraka is doing well, considering they only just got promoted this season. They have 8 points from their last 5 games, and only losing to league leaders PAFOS during these 5 games. They won their last game 3-1 so motivation should be high. The home advantage is not a case here. In their last home game only 200 fans were in attendance, even though the stadium has a capacity of 5,800. \n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzsbpz/"
    },
    {
      "created_utc": 1766210526.0,
      "author": "Nicknotch",
      "text": "ok we like it, talk to us about the 3 college fb games who do you like?",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzq7jh/"
    },
    {
      "created_utc": 1766209605.0,
      "author": "deerhilldr",
      "text": "Record: 2-2 \n\nPrevious: NCAAF Memphis ML +145 vs NC State @ 1130PM PST\n\nPOTD: NFL Eagles -9 (+120) vs Commanders 2PM PST\n\nWrite Up: Eagles have been missing the mark most of the season but I figure if anytime is now to start dialing in, it’s against lowly teams like Washington and they just beat the Raiders by 30 last week. Playing up the line to -9 because they should win by 10+",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzoeec/"
    },
    {
      "created_utc": 1766209550.0,
      "author": "ProperBettor",
      "text": "POTD RECORD : 5-5. ✅❌❌✅✅❌✅❌❌✅\nNET UNITS : +0.9U\n\nPrevious pick :  India vs South Africa 5th T20i\nIndia sixes in first innings over 9.5 @ 1.8 odds. 2U✅\n\nPOTD : Cricket :  ILT20 - MI Emirates vs Abu Dhabi Knight Riders. \n                          \nMatch sixes over 16.5 @ 1.95  : 1U\n\nWrite up: \n\nTwo teams at the bottom half of the table facing off in a must win match to keep qualifying hopes alive. It's been a disappointing season for both these teams considering the number of star international players they have.\n\nMI Emirates underperformed the whole season. They have Pooran, Pollard, Shepherd and  Bairstow. That list is a nightmare for any bowlers but somehow they didn't click together this year. The pitches played here in UAE played a part as well but Abu Dhabi is the better pitch for batsmen compared to Sharjah or Dubai. 170s and 180s are being scored in the last few games. With qualification on line, I expect MI EMIRATES to be aggressive and gain 2 points.\n\nAs for Knight Riders, they have an even more formidable batting line-up.Salt, Russell, Holder, Livingstone and Rutherford. Everyone of them can hit some big sixes with ease on their day. For them, it's all about performing well and gaining 2 points. \n\nIf this match was played in Sharjah or Dubai, I would've avoided this pick. But I believe Abu Dhabi is better for batsmen, at least in the last few games and I expect that trend to continue.\n\nGood luck if you're tailing! The match starts in about little over 4 hours from now.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzoad7/"
    },
    {
      "created_utc": 1766208803.0,
      "author": "T_bone323",
      "text": "POTD Record: 2-0-0 (+2.81u)\n\nPrevious pick: ✅ Alabama o19.5 (-132) 2u \n\nEvent: NFL: Packers @ Bears 8:15pm est\n\nPOTD: Monangai o46.5 yards (-114, FanDuel) 2.28u\n\nWrite up: monangai has looked good and has gone 5 straight weeks with 11+ carries. Swift is questionable with a groin injury - he’ll play but would be surprised if monangai doesn’t at least get his usual workload. Expect bears to try to control the game on the ground at home. Packers defense looked weak after Parsons went down. Monangai went 14 for 57 last time against the packers, and they were trailing for most of that game. Old school NFC north battle on the tundra in cold weather, going with the power back",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzmrc3/"
    },
    {
      "created_utc": 1766206966.0,
      "author": "Lyx97",
      "text": "Record: 17-7-3\n\nNet Units: +4.73\n\n*Prev Pick : Charleroi vs Genk : BTTS @ 1.73 (1u) --> Win*\n\nFootball | EPL | Man City vs West Ham | in \\~10hrs\n\nMateus Fernandes 1+ shot @ 2.0 (1u)\n\nWrite Up : Trying a player prop today after a long time. Fernandes has taken 10 shots across 13 Premier League starts & his goal against Villa highlights his threat + he is often the player arriving to finish cutbacks when West Ham attack on the break. Man City remain somewhat exposed in transition, especially against the pace and quality of Bowen and Summerville. This could create space for Fernandes to advance into shooting positions.\n\nAt even odds, feels little too good to miss.\n\nHope we continue the streak & BoL\n\n  \nEdit : Adding the image to show the odds, since people are DMing me about it being fake\n\nhttps://preview.redd.it/dmndzt14dd8g1.png?width=1084&format=png&auto=webp&s=78119f80c95f6d40a5922eb5c8f6b3848c75106b",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzinjw/"
    },
    {
      "created_utc": 1766205942.0,
      "author": "SharkChomps",
      "text": "POTD Record: 2-0 (+2u)\n\nLast Pick: Paul/Joshua O2.5 rounds -145 (1.45u to win 1U) ✅\n\nEvent: CFP - Oregon vs James Madison 6:30pm CST\n\nPOTD: Oregon over 4.5 team touchdowns +120 (1u to win 1.2u)\n\nWrite up: Oregon has the ability to win it all. They are excellent at creating big plays on both offense and defense. They are top 15 in offensive scoring. I expect Oregon to handle business here and get to at least 5 touchdowns.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzg5yx/"
    },
    {
      "created_utc": 1766205769.0,
      "author": "Ascending_Saiyan",
      "text": "Record: 15-8-1 \n\nStreak: 4W ✅\n\nNet units: +4.99u All bets are 1 unit.\n\nLast POTD 12/18/25: Kyren Williams rushing yards O55.5 (-115 Bet365) ✅\n\nToday's POTD 12/20/25: Jcory Croskey-Merritt rushing yards O24.5 (-110 Bet365)\n\nEvent: Eagles @ Commanders 3:00MST\n\nWrite Up: This evening I spent quite a bit of time looking for some good value lines for the two games scheduled for Saturday and wasn't having a lot of luck. That is until I looked at Bill's rushing props going against an Eagles defensive line without Jalen Carter in the lineup. Ever since losing Carter, Philly has struggled against the run and ranks as the 5th worst defense on rushing yards and have allowed 5.1 yards per carry in their last 3 matchups.\n\nBill has been the most consistent back for Washington's offense this year and has eclipsed this line in 12/14 games this year. He averages 10 carries and 46.14 yards per game. Washington runs the ball extremely well at home. So well in fact, they are the #1 ranked offense in rushing yards at home this season with 156.3ypg. The Commanders will be looking to attack the Eagles weakened defensive front and I predict they will be looking to find the most consistency in this game on the ground.\n\nTail or fade BOL to everyone and cheers! 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzfqvu/"
    },
    {
      "created_utc": 1766205711.0,
      "author": "PurpleDragonBets",
      "text": "Record: (117-77-11) \\[+13.92\\]\n\nPOTD⭐️:🏈Texas A&M -2.5 (-120) \\[Hardrock\\]\n\nStart Time & TV: 12:00pm EST (ABC)\n\nUnits: 3.5 Units\n\nReasoning: For this college football playoff Saturday well be going with the first game of the day as the 7 seed Texas A&M Aggies (11-1) takes on the 10 seed Miami Hurricanes (10-2) at home. This Aggies squad comes into this one battle tested playing a SEC schedule with a perfect home record with their sole loss coming to 14th ranked Texas on the road and they have 2 common opponents with the Hurricanes as both of these teams have defeated Notre Dame and Florida. Miami comes into this road test just scraping into the playoffs and their two losses are of concern to me as they lost to unranked Louisville at home and unranked SMU on the road and the similar theme in their two losses was poor quarterback play by Carson Beck as they threw 4 interceptions against Louisville and 2 interceptions against SMU failing to score over 20 points in that game. This Aggies defense is a very strong and impressive defense as they are very good at limiting explosive plays, an elite pass defense limiting teams to just 180 passing yards per contest and leading the nation in sacks with 41 sacks on the year and I think they can make this Miami offense one dimensional as they have struggled at times on the ground and they rank in the bottom half in college football in rushing yards per game. This Texas A&M offense is also very good as well as they have a very balanced attack as they average just about 200 rushing yards per game and over 260 passing yards per contest. They are good at lighting up the scoreboard as well as the Aggies average over 36 points per game on offense. The Aggies rank near the top in college football in pass play explosiveness and yards after the catch and pair that with the dual threat ability of quarterback Marcel Reed to use his legs it makes this Aggies defense hard to stop. One last thing I would like to mention is how big of a factor I think home field advantage will be in this one as the 12th man of Texas A&M boast the 4th highest stadium capacity and in a sell out game all 102,000+ fans will create and loud and raucous atmosphere making it hard for this Miami offense to operate and audible plays at the line of scrimmage. With all of this being said I like the Aggies to take this one by at least a field goal.\n\nPrediction: 31-24 Aggies\n\nLast pick: 🏈Western Michigan ML💰Definition of a no sweat! 27-0 first quarter and they kept on the gas pedal for a blowout!\n\nBest of luck to everyone tailing and remember to bet responsibly! Lets hope for a result just like todays! 🍀💜🐉\n\nhttps://preview.redd.it/633ljibdga8g1.jpeg?width=1046&format=pjpg&auto=webp&s=643ca2bf485ca2176f037f09cf63557e792a2401",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzfljv/"
    },
    {
      "created_utc": 1766204198.0,
      "author": "Ineedtherapy420",
      "text": "POTD Record: 30-16 (+17U)\n\nLast Pick: Oilers vs Bruins Over 6.5 (1U) 🙅‍♂️\n\nEvent: Houston vs Arkansas (NCAAB) (4:30pm central)\n\nPOTD: Arkansas +4.5 (-110) (1U) \n\nWrite up:\n\n4.5 is too many here. This Arkansas team is rolling right now and has finally hit its stride. They are shooting 38% from downtown and 45% from downtown their last 3 games. They have multiple guys who can put the ball in the hoop and have been far more battle tested than this Houston team. \n\nLet me just put it this way. Arkansas has the 22nd best offensive efficiency in cbb. They have the 69th ranked defensive efficiency and are holding opponents to the 59th best effective field goal percentage. Houston has the 64th best offensive efficiency and the 2nd ranked defensive efficiency in the nation. Ok so a worse offense and a far better defense. Right? Not so fast. Arkansas has played a gauntlet of a schedule so far, they have faced 3 teams all in the top 15 in Kenpom and they just beat Texas tech for is ranked 27th in Kenpom. They won two of those games, barely losing to Michigan state on the road! No shame there. Kenpom gives Arkansas the 33rd best defense in the nation and they have done it against a net rating of the 86th best offensive SOS. Houston on the other hand? Well they have the 205th ranked SOS, the average offensive rating they have faced is 215 compared to Arkansas 86 and the defensive rating is 195th. Arkansas defensive metrics do not lag THAT far behind and they have done it against far superior competition.\n\nHouston is ranked first in the nation in opponent points per game at 57. However they have faced only TWO TEAMS in the top 50 of kenpom. two teams. It was Auburn and they won by one point allowing 72 points! And the other was Tennessee, who they lost to and allowed 76 points! To take it even further the only two teams they played within the top 100 that I didn’t mention were notre dame and Syracuse. Notre dame they took care of, fine. But they barely beat Syracuse in OT and they allowed 74 points to them as well. \n\nThis game is gonna be tight. Every possession matters but Houston plays at a slow pace and ranks 316th in possessions per game. Arkansas and Houston also both take extremely good care of the ball both under 10 turnovers per game and the shooting splits favor Arkansas on offense. I’m also not very bullish on Houston’s defense (I know it’s good) but the competition hasn’t been great and when they’ve stepped up they haven’t dominated at all. \n\nHouston also shoots 15.3 (at 75%) free throws per game good for 316th nationally, Arkansas shoots 24.5 (at 77%) per game at 59th nationally. Houston also ranks 165th in fouls per game to Arkansas 49th best ranking. Arkansas opponents are also shooting 16 free throws per game good for 36th nationally and Houston’s opponents are shooting 20 at 138th nationally. \n\nLook, my power ratings make this roughly Houston -1 and honestly even lower than that. This is a neutral site game in New Jersey and I’m just not sure this line is right. Arkansas keeps it close and possibly pulls out a win tomorrow night. As always, cheers 🍻",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuzbx8r/"
    },
    {
      "created_utc": 1766202674.0,
      "author": "Dmyers9099",
      "text": "Record: 3-2 (+0.57)\n\nPrevious: Crewe Alexandra ML ❌\n\nEvent: ⚽️ Heracles v SC Heerenveen (10:30am EST) and NEC Nijmegen v Ajax (2:00pm EST) (Netherlands Eredivisie)\n\nPOTD: 2-leg parlay: BTTS in each match +101\n\nBTTS has hit in all of Heracles last 8 games. They’ve scored 13 in their last 5 and have had no clean sheets since September. Heerenveen have scored 10 in their last 5 while allowing 7. Each team is averaging 1.62 goals per game in league play and allow 2.56 (Heracles) and 1.62 (Heerenveen) goals per game.\n\nBTTS has hit in Nijmegen’s last 5 games. In that time, they’ve scored 15 goals while allowing 8. Ajax have scored 18 in their last 5 while allowing 5. Nijmegen averages 2.56 goals per match, and Ajax allows 1.25. Ajax scores 1.88 goals per match, and Nijmegen allows 1.69.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuz86fw/"
    },
    {
      "created_utc": 1766202371.0,
      "author": "Section1ne0h4our",
      "text": "5-0, +4.52u\n\nLast 5: ✅✅✅✅✅\n\n(Previous play review at end of post)\n\nToday’s play:\n\nEng Champ: QPR - Leicester\n\nTotal o2.5 (-110) 1u\n\nWe head to England’s 2nd tier for a clash we hope will bring goals galore as Leicester City visits QPR. When I perused through the plays for this weekend, this one jumped out at me as a simple math play.\n\nOn the QPR end, their recent matches have cleared this total 5/6 times, but more curiously as the home team they’ve cleared this total 6 in a row. From the Leicester end, they’ve cleared this total 7 straight matches, and as an away side they’ve cleared this 6/7. \n\nIn matches between these two sides, this total has cleared in the last 6, with the teams scoring 25 goals combined. I just can’t look past this one. A peak at the table shows two teams scrapping on the cusp of a playoff position halfway though the season - this is as close to a 6 pointer in December as they come.\n\nFun fact: Leicester City have conceded a goal in 15 straight matches, but have only lost 5 of them.\n\nLast play review:\n\nNCAAF - Alabama @ Oklahoma, John Mateer o16.5 Pass Comp (-125) 1u ✅\n\n(16 completions by the break, and if you count that god awful, game changing interception, we clear the line by halftime… Mateer & Oklahoma showed from the initial snap that they were going to stay traditional in the shotgun, and it worked perfectly for us - 5 in a row 🔥)\n\nBOL if you’re tailing, and if not BOL in general!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuz7fa3/"
    },
    {
      "created_utc": 1766195106.0,
      "author": "dreamchasing1",
      "text": "Record: 243-225 Net Units: -22.23 55-55 on 1.5u plays, 40-41 on 2u plays, 1-4 on 3u plays. All picks 1 unit, unless stated otherwise.\n\n\nLast event: Soccer/Football, [France Coupe de France] Canet Rouissillon vs Montpellier\nLast pick: total corners over 9.5 @ 1.72 - 1.5 Units Loss\n\n\nEvent: Soccer/Football, [England National League North] Buxton vs AFC Telford\n\n\nPick: BTTS + Over 2.5 goals @ 1.95\n\n\nBuxton have hit this line in 8/10 games at home, averaging 3.5 total goals per game. Great matchup for goals. Telford have covered in 6/10 away games this season, misses being vs lower scoring/allowing teams mostly. Just 3 clean sheets for Buxton at home this season in 13 games in all competitions and 1 for Telford in 13 away games.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuyofj2/"
    },
    {
      "created_utc": 1766194747.0,
      "author": "Certain-Challenge202",
      "text": "Record: 63-42 (+15.09)\n\nLast Pick: Joyce -1.5 ML vs Bates\n\nToday’s Pick: Van Duijvenbode -1.5 ML vs Hurrel \n\nSport: World Championship Darts\n\nReasoning: Van Duijvenbode’s scoring power and 180s volume give him a clear edge to pull away over sets rather than get dragged into a decider. At 4/6, VDB -1.5 sets is just about fair value for a likely 3–0 or 3–1 win.\n\nOdds: 4/6\n\nUnits: 1-2\n\nEdit: I’ve just seen the odds for Sakai over 2.5 180s. Some good value there",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuynguk/"
    },
    {
      "created_utc": 1766192339.0,
      "author": "Best_Accountant_5471",
      "text": "Record: 53-38 (+27.7 units)\n\nLast 10 (most recent on right):  ❌❌✅❌❌❌❌✅✅❌\n\nLast Pick: Astra Nowa Sol vs Kluczbork U178.5 points ❌\n\nEvent: Croatia HNL ⚽️\n\nPick of the Day: Dinamo Zagreb vs NK Lokomotiva BTTS 1 unit to win 1U @ 2.00 (Bet365)\n\nWrite-up: Not out of the woods yet with a pretty bad pick. The underdogs Astra won in four very competitive sets after dropping the first. Whilst the watch was pretty good that led to a lot more points being played than hoped for, ending on 186 total. Should’ve gone with my other pick that was stronger statistically (and ended up winning), lesson learned. Don’t think the pick was necessarily bad though just one of those ones where I take it on the chin and say fair enough. \n\nHooray, back to some actually normal sports with a pick I like a lot. I had 17 picks to choose from which is definitely my record but this one made the most sense overall. Zagreb are just barely top of the league, only a point ahead of rivals Hajduk Split. After shockingly losing the title to HNK Rijeka on H2H last year (which is absurd) they’ll surely be wanting to win the title this year. Anyways despite doing well in the league this season they’ve been conceding quite a bit. They have conceded a goal in their last 9/10 (90%) league matches this season including in six home games on the bounce (three of them being in the bottom part of the table). They should be scoring as well having scored in their last 16+ home matches. Lokomotiva are 8th (out of 10) but score a lot despite this. That’s now a goal in 19 of their last 20 league matches (95%) including 11/12 (92%) away from home. Obviously Lokomotiva doesn’t play against top of the league every week but combining both teams’ stats is very promising especially at plus odds. Looking at the H2H, Lokomotiva has scored in 13/15 matches (87%, BTTS landed 12 times) against their rivals. This includes the reverse fixture which they actually won 2-1. Away from home the travelling side have scored in 6/7 (86%) though that one game was in their most recent encounter at Stadion Maksimir last season. BOL !",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuyh0ix/"
    },
    {
      "created_utc": 1766191833.0,
      "author": "SoggyDatabase2348",
      "text": "**POTD Record: 23-15 (+6.59U)**\n\nROI: +12.92%\n\nLast POTD: NCAAF: Alabama ML vs Oklahoma -105 (1U to win 0.95U)✅\n\n**POTD: NFL: Jalen Hurts 20+ Rushing Yards + Saquon Barkley 60+ Rushing Yards Parlay -106 (1U TO WIN 0.94U)**\n\nWrite up: Model has this as the highest confident Edge % and EV % for the day.\n\n• ⁠Model has Hurts at 40+ rushing yards \n\n• Model has Barkley at 90+ rushing yards \n\n• The model has this as a high confidence play - there is about a 7-8% edge for both of these plays\n\n• EV better betting 100$ = 12-16$ for both of these plays combined \n\n• Model projects a blowout in the Eagles vs Commanders game, which aligns with both over’s for rushing \n\nPOTD History: [https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn](https://www.potd.lol/handicapper/SoggyDatabase2348-bvjHUn)\n\nBOL!\n\n**POTD: NFL: Jalen Hurts 20+ Rushing Yards + Saquon Barkley 60+ Rushing Yards Parlay -106 (1U TO WIN 0.94U)**\n\nTips are greatly appreciated. Proceeds will be going towards my student loans and my morning cold brews. For any tips 10$+ I will be sending a sports card to your mailbox.\n\n[http://buymeacoffee.com/claysmiith](http://buymeacoffee.com/claysmiith)\n\n[https://venmo.com/u/claysmiith](https://venmo.com/u/claysmiith))",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuyfnxm/"
    },
    {
      "created_utc": 1766190836.0,
      "author": "KneeExisting2384",
      "text": "Stats:\nRecord: 1-1 (L1)\nNet Units: -0.07u\nROI: -1.03%\n \nRecap: Crewe ML v Bristol Rovers – This is the sad part about betting, 3 POTD lined up. Rochdale ML, BTTS Bologna v Inter and then this. Thinking surely this is the best, oh wait striker wanted to get a red for violent conduct. Still was an even game despite them having a red 30 min in, but that’s the dark side of gambling. Start the investigation! \n\n\nPOTD:Leeds v Crystal Palace BTTS (YES) \nOdds: 1.80x / -125 (Bet365)\nUnits: 5U FUCKER ON THIS! (Remember always follow our units) \n \nWell well well, 5 unit plays aren’t for fun and if there is anything close to a lock (Nothing is never lock, we learned that the hard way) Then it is this!\n \nNow, Leeds are shit. However, one thing they do have is an absolutely scary home pitch, they make close games against even the best opponents such as Chelsea and Liverpool recently. Lets delve into some filthy stats. \n \nLeeds scoring at home is just a certain thing, in the H2H with Crystal Palace, they have never not scored vs Crystal Palace at home, results ending 2-0,1-0, 1-5. This is very good for this pick, because Crystal Palace wasn’t a great side in 2021, so them losing against them in the Bielsea era isn’t a shock. But this new crystal Palace side sits 5th right now in the premier league. \n \nLeeds last 5 has had BTTS in all 5 games including games like Manchester City, Liverpool, Aston Villa and Chelsea. Which is all insane, despite all three sides having solid defences, and all season it they have scored in all games at home except 1 and that was against a Newcastle side which ended 0-0. This makes the BTTS hit 8/9 times so far at Elland Road. \n\nCrystal Palace has conceded 15 goals this season in 16 games, they have been quite good so far defensively and this is why the odds are higher than expected. However, I do believe that if it a time to concede it is at Elland Road. They had a conference league game where they rested all players but some did get 20-30 minutes in a 2-2 draw v KUPS. They do have two starting injuries, Munoz who has been class this season in general and Doucoure a midfielder who has started all season. \n\nLooking at their last 5 games away, it has two clean sheets and that’s against the two worst premier league sides, Burnley and Wolves. Both are not even close to top championship sides, they’d both compete around playoffs in the championship right now. They conceded to Everton and fulham, two sides who have great home atmosphere and a 1-0 loss to an unfortunate fantastic defensive side Arsenal. \n \nWhy on earth, would you bet against a great defensive side? Because there is always goals at Elland Road, 3-3 against Liverpool, 3-1against Chelsea and 1-2 loss to Aston Villa. I see this game go 2-1 or even 2-2 late. Don’t expect this to cash in the first 16 but I do see this done and over with within 60-70 minute. \n\nLet’s bounce back after that shit show before, and win again on the BTTS!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuycyed/"
    },
    {
      "created_utc": 1766190329.0,
      "author": "lordestros",
      "text": "POTD Record 7-3\n\n4 wins in a row! \n\nSan Jose Sharks vs Seattle Kraken at 10:00pm EST (NHL/Hockey)\nSan Jose Sharks ML (-115)\n\nSharks are the up and coming team trying to stay into their wildcard spot and have won 3 out of their last 4 games(with their only loss being a close game vs the Dallas Stars who are 2nd in the NHL) while the Kraken are on the downfall with 4 losses in a row and are 1-9 in their last 10 games. Those two teams faced twice this season with the Sharks taking the first game 6-1 and then losing the other one 4-1 with both games being in Seattle. I expect the Sharks to be ready to avenge that last loss against them especially in their own arena which they are 10-6-3 while the Kraken's away record is 5-7-3. In Celebrini we trust!\n\nBOL!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuybl1f/"
    },
    {
      "created_utc": 1766189323.0,
      "author": "Fair-Asparagus-9264",
      "text": "**Record 5-3** (+3.21 Units)\n\nPrevious Pick: NFL Rams at Seahawks - **Puka + JSN over 175 receiving (-156) 3U** ✅\n\nEasy cash as Puka goes full dog catching 12 balls for **225** yards – clearing this line by a handsome 50 all by himself. JSN adds 96 for good measure bringing their total to 321. Bets aside, one of the best games to watch all year.\n\n**POTD:** NFL - Eagles at Commanders 5pm EST: **AJ Brown Over 62.5 yards receiving (-110) 3U**\n\nFor today we head to DC for the first of 2 divisional games that the Eagles and Commanders will play over the next two weeks. Commanders are eliminated, Eagles can clinch NFC East with a win.\n\nAJ Brown has had an up and down season but after sufficient whining, has stepped into form the past month. In the previous three games before last weeks 31-0 blowout win over the Raiders where he sat out the 4^(th) quarter, Brown brought in 24 catches on 35 targets for a total of 342 yards. That’s an avg of 8 catches for 114 yards/game.\n\nMy Commanders are sadly, if predictably, one of the worst passing defenses in the league, giving up the 4^(th) most passing yards (260), the most completions over 40 yards, and sit 28^(th) in pass defense DVOA. In short, we suck, have sucked, and will continue to suck at defending the pass. What’s worse for the Commies (but good for our bet) is that we play man coverage at an above avg rate which has only gone up since Quinn took over playcalling.\n\nBrown feasts on man-heavy schemes, ranking as the 4^(th) highest receiver vs man coverage according to PFF. He tore up Bears – also heavy man defense – for 132 yards a few weeks back and in the three games against the Commies last year - torched us for 65, 95, and 97 yards. Despite the divisional matchup, recent Eagles/Commanders games have been shootouts (with the Eagles usually outshooting the Commies). The scores of the their last six games have been (55:23) (36:33) (26:18) (38:31) (34:31) (32:21) with 5/6 totaling over 50 points and 4/6 going over 60 points. Its gonna be sunny and 40 degrees in DC tomorrow afternoon – little to no wind – perfect December football. All signs point to **AJ Brown over 62.5 yards**. BOL if tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuy8tow/"
    },
    {
      "created_utc": 1766188918.0,
      "author": "tennisfanatic101",
      "text": "💎POTD: Oregon-20.5\nOdds: -125 on FanDuel\nWager: 2 Units\n\nRecord: 6-6\nNet Units: -1.0 \n\nOregon can cover -20.5 against James Madison on Saturday because their profile matches what you typically need to win by 3+ scores: top-end scoring efficiency, explosive-play ability, and a home environment that creates mistakes and short fields. Statistically, Oregon’s offense has been strong all year (about 36.3 points per game, top-15 nationally, and 0.541 points per play, top-10), with elite overall efficiency and big-play gear that can turn a “normal” 10–14 point game into a runaway if JMU has even one bad quarter.  James Madison is legitimately good—especially defensively (allowing only 16.3 points per game, top-10, and just 4.0 yards per play, top-5), which is why the spread is “only” around the low-20s even with the talent gap.  But covering is still very realistic for Oregon because (1) Autzen can cause communication issues for an option-heavy / run-centric offense and lead to false starts, burned timeouts, and punts that flip field position,  (2) Oregon’s roster talent is simply higher across the two-deep, so if the Ducks get up two scores they can keep the pedal down with fresh bodies, and (3) the injury situation may actually improve for Oregon—national previews note multiple Oregon skill players who’ve been banged up as possible returns, which raises the ceiling for explosive scoring.  The market also reflects this “blowout path” pretty clearly: the AP’s betting coverage pegged JMU as about a 20.5-point underdog, implying oddsmakers see Oregon’s median outcome as a comfortable win even while respecting JMU’s defense.  Put it together and the cover script is simple: Oregon’s efficiency generates points early, crowd noise and speed force JMU into a couple empty drives, and once the Ducks create separation, their tempo/athleticism and depth turn a 17–7 type game into something like 38–14—exactly the kind of scoreline that gets you past a -20.5.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuy7qom/"
    },
    {
      "created_utc": 1766188472.0,
      "author": "nigerianPriince0",
      "text": "**Record: 94 W  - 82L**\n\n\\-----------------\n\n**Today's Pick: Robert Sanchez Over 2.5 Goalkeeper saves @ 1.72**\n\n**League - Premier League** \n\n**Game: Newcastle vs Chelsea**\n\n**Time: 7:30 AM EST**\n\n**-----------------**\n\nEarly kickoff at St James Park just means a tough time for this Chelsea side. Regardless of the injuries Newcastle have, I've watched this matchup over and over over the years to see how it goes. Chelsea haven't beaten Newcastle at St James Park since 2021, just a stadium that adds an extra player on the pitch.\n\n\n\nLots of adversity coming from Chelsea's end, and I do see them having better spells than expected, but Newcastle will play the crowds and apply the pressure. Expecting Sanchez to have a busy day on goal tomorrow.\n\n\\---\n\n**Sanchez has covered this line in 3 out of his last 5 games.**\n\n**Wissa return major.**\n\n**BOL**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuy6jop/"
    },
    {
      "created_utc": 1766188349.0,
      "author": "Diamondhf",
      "text": "**POTD Record: 16-11**\n\n\n\n**Net Lifetime Units: +14.62**\n\n\n\n**Last Pick: \\[Bama vs Oklahoma over 40.5\\]**\n\n  \n\n\n**POTD: Miami +3.5 -118 2.36u to win 2u**\n\n\n\n***Miami Hurricanes @ Texas A&M Aggies, Noon EST. Kyle Field, College Station, Texas.***\n\n\n\nBattle of the two teams who beat Notre Dame. Both of these teams were ranked as high as #2 in the country at various points in the season, and showed the ability to bleed a little bit. I think this is an excellent matchup and should be one of the best games of the season. Pretty excited for this one.\n\n\n\nTexas A&M doesn’t impress me much. They had one of the softer schedules in the SEC, and nearly lost to South Carolina. Required a 2nd half heroic performance from Marcel Reed, and an absolute collapse from Shane Beamer and his squad. They then lost to Texas by 10 points, in what seemed like their first actual test of the year. Miami has also shown some weakness, losing to a middling Louisville team, and being a litttlee bit too competitive with teams that they shouldn’t have had an issue with. Both teams have QB’s who can get into pretty severe cold stretches. \n\n\n\nI think Miami’s front 4 can get to Marcel Reed without requiring additional blitzers. They’re a top 5 d-line in the country with a sure fire top 5 pick playing on the edge in Reubin Bane. Guy is an absolute game wrecker. Marcel Reed’s stats actually IMPROVE when he gets pressured, and I think the reason why is he can’t read a defense well. He relies on playing recess ball, and when teams bring extra guys to rush him, he’s able to find 1on1’s due to lack of numbers in the secondary. If Miami can keep 7 guys in coverage and STILL get to Marcel Reed, they will make him have a longggg day. I believe they’ll have the ability to do so with this really high level front 4.\n\n\n\nCarson Beck gets a lot of hate. He’s a pretty ugly guy. He can get really turnover prone and play like a high schooler occasionally. He got his Lambo stolen when he moved to Miami and I think his girlfriend broke up with him in the off season and I’m pretty sure she had an Only Fans. Got his job taken by Stetson Bennett at Georgia after getting hurt in the SEC championship last year and bounced to take a few million in NIL at Miami. He’s also 30 years old or something\n\n\n\nGuy is 34-5 in his college career. Built like an NFL QB. Played in the SEC and won against juggernauts. Threw for 11,000 yards in his career. Extremely high completion %. He’s in a good flow, winning his last 4 games by 20+ points each game, throwing for an average completion % of 80%, 300+ yards per game, and has only thrown 1 pick in that stretch. When he’s playing well, he looks like a serious NFL prospect. He’s got plenty of big games under his belt and can BALL out against anybody. FRESHMAN SENSATION Malachi Toney will be a big component to this game, gadget guy who is an extension of the run game. Screens, deep balls, YAC, jet sweeps. Doesn’t matter how this dude gets the ball, every time he touches it he’s liable to score. He’ll be the difference maker in this matchup and I don’t think A&M’s defense can stop him.\n\n\n\nTexas A&M has a really poor turnover ratio, sitting at 120th in the country. They won’t be able to capitalize on Carson Beck’s turnover problem, and Marcel Reed might give Miami a couple. This will be a game of field position that comes down to one or two plays that will decide the outcome. I think Miami will be able to get the job done, and ultimately beat A&M, and worse case scenario we’re getting a couple of points our way in case this game ends in a field goal. I like Miami to cover the +3.5. Good luck, have fun  \n  \n  \n\n\n ",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuy67ma/"
    },
    {
      "created_utc": 1766187568.0,
      "author": "ptrckfrnndz",
      "text": "+29.67\n\n16 - 7\n\nFORM: ✅️❌️✅️✅️✅️ (LAST 5)\n\nSports: TENNIS\n\nPick: vandermeesch cyril 5 UNITS @1\n83 vs. KOUAME MOISE ✅️✅️\n\nPICK: ARYSTANBEKOVA/dyussebay ML 5UNITS @ 1.833 vs. Amiraghyan/kumru✅️✅️✅️\n\nEdit: ✅️fucking double winner for us!!! Lets.eat some nice food yall\n Shout out to piglet, ryan, jin lee and joe. What you sent my way is so so so big for me. I really appreciate it!!!! ✅️\n\nReasoning: i am writing a park sohyun ml potd and decided to recheck todays game and saw this. This kazakhstan pair played 21 games compared to 6 games of their opponent.. in double i am biased when the pair is the same nationality, for me i think that they can better understand each other and with 21 games played this year they have the dynamics and chemistry.. also, individually they have higher rankings. So ill gladly take it 1.83 when it comes to paper.. i hope they will just play well today..\n\n\nTime: about 9hrs from posting\n\nBol\n\n\nMaybe you can tip me if i made you some money. So i can buy food for my self.. thank you\n\nhttps://www.paypal.me/ptrckfrnndz06",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuy43gr/"
    },
    {
      "created_utc": 1766186725.0,
      "author": "SP7988",
      "text": "**Record:** 34-17-1 (+15.33u) \n\n**Last:** (CBB) Arizona ML (1u) - ✅\n\n**POTD:** (CBB) No. 12 North Carolina (-3.5) vs Ohio State\n\n**Start Time:** 3:00 PM ET (CBS)\n\n**Odds:** -115 (DraftKings)\n\n**Units:** 1.5U\n\n**Reasoning:** Typically, when a team races out to a hot start, there’s always fear of a letdown on the horizon. \n\nHowever, don’t expect that to be the case for North Carolina. Although his team sits at an impressive 10-1--with victories over two Top 25 opponents—head coach Hubert Davis actually wants more from his players. \n\n“We’ve gotten off to fast starts and then we’ve had a four- or six-minute lull on both ends of the floor,” said the fifth-year head coach. “The consistency, that’s one of the biggest things with this team, just playing at that high level. We’ve shown that we can be there, but it’s the consistency to be able to do that for a full 40 minutes.”\n\nA Tar Heels squad keeping it in high gear throughout an entire game? That’s a scary thought, for a team that has still managed to go 7-4 ATS on the season, including covering in each three of its last four. Not to mention, North Carolina has managed to accomplish this all without its veteran leader and top perimeter defender Seth Trimble (14.5 PPG, 5.0 RPG), who is set to return to the lineup for the first time since Nov. 7. \n\nHis presence will only bolster an already formidable defensive unit.\n\nThrough 11 games, the Tar Heels rank 6th in opponent field-goal percentage (37.0%), 14th in defensive efficiency (0.901), 14th in scoring defense (64.1 PPGA) and 63rd in opponent three-point percentage (30.3%). Those numbers have been even better as of late, dropping to 60.3 PPGA on 36.3-percent shooting (28.8% from three-point range) over the team’s last three games. The unit will once again be tested against an Ohio State offense that packs a punch, ranking 15th in field-goal percentage (51.2%), 29th in offensive efficiency (1.185), 30th in scoring (87.6 PPG) and 125th in three-point shooting (34.8%). The return of Trimble comes at just the right time for North Carolina, as the Buckeyes (8-2) are led by senior guard Bruce Thornton (21.8 PPG) who shoots 60.2-percent from the field, including a blistering 50.0% from beyond the arc.\n\nOn the other end of the floor, look for the Tar Heels to take advantage of a slumping Ohio State defense. \n\nThus far, the Buckeyes have fared respectively on defense across the board, ranking 61st in opponent three-point percentage (30.2%), 83rd in opponent field-goal percentage (41.8%), 85th in defensive efficiency (0.987) and 135th in scoring defense (72.9 PPGA). However, over their last three contests, those numbers have ballooned to 86.0 points per game on 43.8% shooting (40.3% from three-point range). That should be music to the ears of a North Carolina offense that comes in ranking 68th in offensive efficiency (1.134), 80th in field-goal percentage (47.2%), 85th in scoring (80.7 PPG) and 205th in three-point shooting (32.7%). \n\nFinally, look for rebounding to play an X factor on Saturday afternoon. \n\nPer KenPom, the Tar Heels rank 1st in average height (79.5) and 8th in effective height (+2.3). That advantage has become evident on the glass, as the team ranks 4th in defensive rebounding (29.0 per game), 12th in total rebounding (42.1) and 116th in offensive rebounding (10.0) while ranking 58th in opponent defensive rebounding (20.2), 77th in opponent total rebounding (32.6) and 80th in opponent offensive rebounding (8.2). Conversely, Ohio State ranks 33rd in defensive rebounding (26.3), 111th in total rebounding (37.0) and 290th in offensive rebounding (7.7) while ranking 21st in opponent defensive rebounding (19.1), 34th in opponent total rebounding (31.3) and 115th in opponent offensive rebounding (8.5). However, unfortunately for the Buckeyes, those opponent rebounding numbers have only gotten worse over their last three outings, jumping to 22.7, 37.7 and 10.0 respectively. \n\nLook for Trimble’s return to spark North Carolina to a complete-game effort and get the job done.\n\nBOL if tailing, and as always, please do so responsibly. One bet should not cause you to crash out.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuy1x42/"
    },
    {
      "created_utc": 1766186567.0,
      "author": "defiant_degen",
      "text": "\nOverall record 75W-47L\n\nUnits +56.4\n\nBack with a premier League pick. After missing the last few game weeks just been too busy to really have time to research the games properly.\n\n\nLast pick:\n\nManchester United Vs West Ham \n\nManchester United win & Bryan Mbuemo to have a shot on target.\n\n(1.80) 2.5 units ✖️\n\nSome time ago now but a really unfortunate loss, Mbuemo getting his shot on target in the first half and United much the better team and was winning the match until the last 10 minutes when west ham scored from nowhere, United created more than enough chances to go 2-0 but poor finishing cost them the win here.\n\nToday's pick:\n \nPremier League \n\nBrighton Vs Sunderland \n\nBrighton win and under 4.5 goals \n\n(1.95) 3 units.\n\nBrighton host Sunderland, the long away day for the side from the north of England traveling to the South coast.\n\nSunderland have done exceptionally well this season, nobody could have predicted they would have as many points this season, this is down to a very strong home support and they've picked up a lot of points in their home games, but they have struggled on the road, managing the odd draw here and there, but they have been outperformed in almost every away match this season.\n\n\nSunderland are also the team which faces the biggest loss of players in the league to AFCON, **Sunderland have 6 first team players and 4 regular starters gone on international duty** ,with another 2 players out with injuries and suspensions also.\n\nSunderland are expected to line up very defensively with a 5-4-1 formation and will look to frustrate Brighton for as long as possible. Brighton will have a lot of the ball and chances here as they do against most teams at home, they will miss just 1 player to AFCON in balleba in midfield but still have all their attacking players available.\n\nI think there are too many first team players for Sunderland to survive, when they have already really struggled on the road, and I think eventually Brighton will break them down and get the win in a game that shouldn't have too many goals.\n\n\n\n\n\n\n\n\n**BOL and only bet what you can afford to lose!**",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuy1j06/"
    },
    {
      "created_utc": 1766186290.0,
      "author": "Pefkov",
      "text": "**Record**: 17-11\n\n**Net Units**: +4.88\n\n**Last Pick**: Jason Myers 8+ Kicking Points (-111 on DK) 1u to win 0.9u ❌\n\n**Todays Event** 🏈 NFL Saturday Night Football Packers @ Bears 7:20 PM CST 🏈\n\n**Todays pick:** Kyle Monangai 50+Rushing Yards (+102 on DK) 1u to win 1.02u\n\n**Writeup:** Battle for the NFC North, a heavily injured Packers unit face the Bears in Chicago. Both teams need a win and a little help from Rodgers out in Detroit Sunday night to beat the Lions to clinch. It is sure to be a heated game\n\nD'Andre swift is looking questionable with a groin injury. While I would take his under for my bet, he's played prior weeks after injury, even gong for 90 yards against the Vikings week 11. Rome Odunze and Luther Burden are also out, while Cole Kmet is questionable, giving Caleb Williams less to work with.\n\nMonangai has been an up and coming star especially in the 2nd half of this season, averaging 48.6 yards per game over 10.4 rush attempts, averaging 4.7 Yards Per Carry. He's proven he's a good backup behind Swift. He's cleared this number the last time they played Green Bay in week 14.\n\nPackers defense is top 10, only allowing just over 100 rushing yards per game with 3.9 yards per carry, but they've been declining through the year. They've lost star rusher Mica Parsons last week, listed Collin Oliver as out this week, Listen Safety Evan Williams as questionable, and have been missing Devonte Wyatt since Thanksgiving. This defense will have lots of gaps for Monangai to exploit.\n\nFinally, Bears are favored this game. The spread is rather low at -1.5, No doubt since its an important Rivalry game at this point deciding who's the 2nd seed and who's the 7th seed (And possibly who gets home field advantage between them if they matchup in the wild card round). This suggests ample opportunity for rushing, highlighted by the lack of receivers like Odunze and Burden. If early rushes build up tempo and if Swift is limited, I can see Monangai getting plenty of touches and torching this line.\n\n  \nBOL everyone tailing!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuy0wgt/"
    },
    {
      "created_utc": 1766185750.0,
      "author": "Primeletter",
      "text": "**POTD Record:** 15-10-2 (Avg Odds +125)\n\n**Previous Pick:** Crystal Palace TT Goals Over 2.5  (+100)  ❌️\n\n**Today's Event:** English Premier League (Soccer) | Newcastle vs Chelsea (4:30 AM PST)\n\n**Pick:** Enzo Fernandez 1+ SOT (+125)  1 unit to win 1.25 units\n\n**Write Up:** It is time to return to our roots. With Palmer back in the lineup I took a bit of a break playing Enzo while he settled in. Now that we've seen 3 Palmer games and Enzo is back to his box crashing self, we're returning to our favorite play at some really nice plus money odds. Enzo 1+ Shot on Target has hit in 9 of his last 10 matches, the only miss being a 3 shot game vs Leeds with Caicedo serving his first of 3 game suspension. I like this play even more now that Caicedo should be back and next to him in the midfield, that will empower Enzo to play further forward and attack the net. \n\nYou all already know why I love me some Enzo, we're backing our guy again for an SOT to start the weekend. We've cashed this play 4 times so far, let's make it 5. BOL and have a great Saturday!",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuy0ctu/"
    },
    {
      "created_utc": 1766185447.0,
      "author": "JoeInglesOfficial",
      "text": "__POTD Record:__ 66-32-1 (+74.23u)\n\n__Previous Pick:__ [✅ Alabama ML (-105), 3.15u](https://www.reddit.com/r/sportsbook/s/6QvM4xthZ7)\n\n__Event:__ NFL: Eagles @ Commanders 5pm EST\n\n__POTD:__ Saquon Barkley o75.5 rushing yards (-110), 3.3u to win 3u\n\n__MyWrite Up:__ Despite 3 College Football Playoff games going down tomorrow, it pains me that I’ll be having to take this NFL prop instead but it’s money. __First let me breakdown the implications this game has on Saquon’s contract incentives.__ The Eagles signed the former Giants RB last March to a 3 year, $38 mil contract following his historic 2024 season where he rushed for 2,504 yards, breaking the single season record & leading his new team to the Super Bowl. The extension made him the highest paid RB in NFL history & included $36 mil guaranteed. Barkley is the first RB making $20+ mil/year & can make an additional $15 mil in incentives & escalators. Barkley gets $250k for 1,500 yards & it becomes $500k at 2k yards. If he rushes for 1k yards & Philly wins the NFC ship he gets $250k, that turns to $500k if they win it all. That’s up to $1.5 mil per year in incentives. Also, any incentives earned escalate each remaining year’s salary by the same amount. So say he earns the full incentive package in 2025, his base salaries in 2026-2028 increase by $1.5 mil each year. That leads to a max payout of $15 mil. So what does that mean for this week? __There are 3 games left in the regular season & Barkley sits at 1,213 yards. To earn his $250k incentive he needs 287 yards. He needs to avg 96 total yards per game to hit that mark, with another $250k waiting at 2k yards, plus escalators that bump future salaries by the same amount. As for rushing yards, he sits at 940, so he’s just 60 yards away from another 1k season setting up another potential 250k/500k bonus.__ It it all starts this week in a crucial game for playoff implications against a Commanders defense that continues to be one of the most attackable run defenses in football.\n\nThe Eagles (9-5) are traveling to Maryland to take on the Commanders (4-10) this Saturday. These teams have not met this season & their last meeting was on Jan 26 in the NFC ship with Philly crushing them 55-23. This NFC East rematch was supposed to have huge playoff implications for both teams when the NFL schedule makers set this game for a Saturday Week 16. But Washington limps into the game already eliminated from playoffs & without their Star QB Jayden Daniels who’s out for the season with dislocated elbow. Washington came into the season with high hopes riding the high of an NFC Championship & started the season off 3-2. They then went on to lose 8 in a row, but did earn a 29-21 win last week over the Giants. The Eagles upheld their expectations with a chance to lock in the division title this week & jump up in the NFC standings. The Eagles have had a roller coaster of a season. Starting off 4-0 with huge wins over the Chiefs, Rams, Cowboys, & Bucs. Then lost their next 2, won their next 4, lost their next 3, before destroying the Raiders 31-0 last week. They’ve dealt with injuries with starting LT Lane Johnson & DT Jalen Carter both having been out. But they have a chance to lock in the division this week against a Washington team that just so happens to be one of the most generous defenses in the league when it comes to feeding RB’s.\n\nWashington head coach Dan Quinn is in his 2nd season with the team. Philly has been a thorn in Quinn’s side for years, dating back to when he was the coach of my ATL Falcons. Quinn has been to the playoffs 3 times as a head coach. 2016 in ATL: 28-3 Super Bowl vs Pats 😔. 2017 in ATL: Eliminated by Philly. Last year in WSH: Eliminated by Philly. To make matters worse, Quinn is a defensive head coach, having spent 23 of his 31 year coaching career coaching defenses only. This defensive coach cannot stop Saquon. __In Barkley’s 3 games vs Washington last year:__\n\nWeek 11: 26 carries, 146 yards, 2 TDs\n\nWeek 17: 29 carries, 150 yards, 2 TDs\n\nNFC Ship: 15 carries, 118 yards, 3 TDs\n\n__That’s 414 rushing yards & 7 TD’s in just 3 games. 39% of his TD’s came against Washington last season.__ Saquon is the sole reason Quinn made stopping the run an offseason priority for Washington, it just hasn’t worked. In 2024 the Commanders allowed the 2nd most rushing yards per game (143.4), giving up 5.0 yards per carry (2nd most). They ranked 27th in EPA run defense (-0.019). __This year Washington ranks 27th in EPA run defense once again (-0.006). They allow 136.3 rushing yards per game (5th most), on 4.7 yards per carry (5th most).__ The biggest issue with this Commanders defense is they just can’t bring ball carriers to the ground. __Washington has the 5th most missed tackles this season with 103. That’s a huge issue when they are also giving up the 9th most yards before contact at the line of scrimmage (2.37). This has allowed opposing RB’s to run at the 4th highest success rate in the NFL (47.3%), breaking free at the 7th highest explosive run rate (5.3%).__\n\nThat’s going to be a huge issue vs Barkley who is the 5th fastest in the league this season clocked at 21.87 mph & has an explosive run rate at 7.08%. Scheme wise this is a great matchup for Saquon too. __Philly pounds the Gaps on 40.5% of their runs. Washington has been the worst gap run defense in the league, allowing a league high 60.7% success rate & 5.61 yards per carry (4th most) when defending gap runs. Even worse, Philly specifically targets the C gap (outside the Offensive Tackle) & D gap (outside the Tight End) on 53.7% of their runs (7th most), averaging the 6th most yards per carry (5.68). Washington allows the 3rd highest success rate (57.9%) & the 5th most YPC (5.71) on runs to those gaps. Philly doesn’t run inside much, just 43.6% of runs toward the A/B gaps (7th fewest), but when they do, Washington still allows the 4th highest success rate (60.3%) $ 4.64 YPC (5th most).__ Washington’s defense simply has nowhere to hide. Another strategy Quinn has used in the past has been to stack the box with 7+ defenders. __Washington stacks the box on 40% of runs, yet still allows the 10th most YPC when doing so (3.77). Philly has been successful vs stacked boxes this season averaging 3.83 YPC. Philly ranks top 10 in yards before contact (2.12), Washington allows 2.37, & that gap is exactly where Barkley does his damage.__ Saquon is the clear workhorse for this Eagles backfield too, with an 80% snap share (3rd most in NFL) & they are feeding him. He had 25 opportunities last week, his most since Week 11. He’s had 20+ touches in back to back weeks with zero competition & when Philly plays from ahead he consistently gets 20 carries. Philly already runs the ball on 48.13% of plays (4th most) & Washington faces a run rate of 46.73% (8th most). This is a perfect volume environment vs an extremely weak run defense that Saquon feasts on. \n\nSaquon gets his bag Saturday night.\n\n__Saquon Barkley o75.5 rushing yards__\n\nAppreciate the love! [Buy A 🍺](https://buymeacoffee.com/joeinglesofficial)  [PayPal](https://paypal.me/joeinglesofficial)  [Bitcoin](https://pastebin.com/raw/GEXAsA2S)  [Venmo](http://Venmo.com/mackenzie-botz-1)",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuy032v/"
    },
    {
      "created_utc": 1766184809.0,
      "author": "sbpotdbot",
      "text": "###### Only tip links are allowed in POTD thread (Buymeacoffee, Cashapp, PayPal, crypto). No other links or promotion is allowed.\n\nYou must have accurate tracking of your full POTD record with detailed stats including **ROI, Average Odds, Units Won** written into the comment. **No resetting records.**\n\nFor picks that do not fit the POTD rules, use the [Daily Discussion posts](https://www.reddit.com/r/sportsbook/search?q=title%3A%28Saturday%29&restrict_sr=on&sort=new).\n\n###### Example Pick Template\n\n> **Record:**\n>\n> **Net Units:**\n>\n> **ROI:**\n>\n> **Sport** | **League** | **Event Time** / **Time Zone**\n>\n> **Pick:** Include pick and specific market with odds and unit allocation here.\n>\n> **Write Up:** This pick is from my soccer model that I've been using for the past two years. It assigns ELO ratings to players and projects a win chance based on the combined ELO ratings of the players on each team. TeamReddit is projecting a 62% win chance here which creates value here on the ML.",
      "permalink": "https://reddit.com/r/sportsbook/comments/1pqyuq2/pick_of_the_day_122025_saturday/nuxyhok/"
    }
  ]
}